#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActorSpawner_Generic_Shop

#include "Basic.hpp"

#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function BP_ActorSpawner_Generic_Shop.BP_ActorSpawner_Generic_Shop_C.OnPostSpawnActor
// 0x0010 (0x0010 - 0x0000)
struct BP_ActorSpawner_Generic_Shop_C_OnPostSpawnActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bPreview;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActorSpawner_Generic_Shop_C_OnPostSpawnActor) == 0x000008, "Wrong alignment on BP_ActorSpawner_Generic_Shop_C_OnPostSpawnActor");
static_assert(sizeof(BP_ActorSpawner_Generic_Shop_C_OnPostSpawnActor) == 0x000010, "Wrong size on BP_ActorSpawner_Generic_Shop_C_OnPostSpawnActor");
static_assert(offsetof(BP_ActorSpawner_Generic_Shop_C_OnPostSpawnActor, Actor) == 0x000000, "Member 'BP_ActorSpawner_Generic_Shop_C_OnPostSpawnActor::Actor' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawner_Generic_Shop_C_OnPostSpawnActor, bPreview) == 0x000008, "Member 'BP_ActorSpawner_Generic_Shop_C_OnPostSpawnActor::bPreview' has a wrong offset!");

// Function BP_ActorSpawner_Generic_Shop.BP_ActorSpawner_Generic_Shop_C.GetMapIconGameplayConditions
// 0x0020 (0x0020 - 0x0000)
struct BP_ActorSpawner_Generic_Shop_C_GetMapIconGameplayConditions final
{
public:
	struct FGameplayConditionChecker              OutConditionChecker;                               // 0x0000(0x0018)(Parm, OutParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActorSpawner_Generic_Shop_C_GetMapIconGameplayConditions) == 0x000008, "Wrong alignment on BP_ActorSpawner_Generic_Shop_C_GetMapIconGameplayConditions");
static_assert(sizeof(BP_ActorSpawner_Generic_Shop_C_GetMapIconGameplayConditions) == 0x000020, "Wrong size on BP_ActorSpawner_Generic_Shop_C_GetMapIconGameplayConditions");
static_assert(offsetof(BP_ActorSpawner_Generic_Shop_C_GetMapIconGameplayConditions, OutConditionChecker) == 0x000000, "Member 'BP_ActorSpawner_Generic_Shop_C_GetMapIconGameplayConditions::OutConditionChecker' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawner_Generic_Shop_C_GetMapIconGameplayConditions, ReturnValue) == 0x000018, "Member 'BP_ActorSpawner_Generic_Shop_C_GetMapIconGameplayConditions::ReturnValue' has a wrong offset!");

// Function BP_ActorSpawner_Generic_Shop.BP_ActorSpawner_Generic_Shop_C.GetMapIconActorWithDependencies
// 0x0030 (0x0030 - 0x0000)
struct BP_ActorSpawner_Generic_Shop_C_GetMapIconActorWithDependencies final
{
public:
	struct FMapIconProviderData                   OutMapIconProviderData;                            // 0x0000(0x0018)(Parm, OutParm)
	struct FMapIconProviderData                   K2Node_MakeStruct_MapIconProviderData;             // 0x0018(0x0018)()
};
static_assert(alignof(BP_ActorSpawner_Generic_Shop_C_GetMapIconActorWithDependencies) == 0x000008, "Wrong alignment on BP_ActorSpawner_Generic_Shop_C_GetMapIconActorWithDependencies");
static_assert(sizeof(BP_ActorSpawner_Generic_Shop_C_GetMapIconActorWithDependencies) == 0x000030, "Wrong size on BP_ActorSpawner_Generic_Shop_C_GetMapIconActorWithDependencies");
static_assert(offsetof(BP_ActorSpawner_Generic_Shop_C_GetMapIconActorWithDependencies, OutMapIconProviderData) == 0x000000, "Member 'BP_ActorSpawner_Generic_Shop_C_GetMapIconActorWithDependencies::OutMapIconProviderData' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawner_Generic_Shop_C_GetMapIconActorWithDependencies, K2Node_MakeStruct_MapIconProviderData) == 0x000018, "Member 'BP_ActorSpawner_Generic_Shop_C_GetMapIconActorWithDependencies::K2Node_MakeStruct_MapIconProviderData' has a wrong offset!");

// Function BP_ActorSpawner_Generic_Shop.BP_ActorSpawner_Generic_Shop_C.ExecuteUbergraph_BP_ActorSpawner_Generic_Shop
// 0x0018 (0x0018 - 0x0000)
struct BP_ActorSpawner_Generic_Shop_C_ExecuteUbergraph_BP_ActorSpawner_Generic_Shop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPreview;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetVisible_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActorSpawner_Generic_Shop_C_ExecuteUbergraph_BP_ActorSpawner_Generic_Shop) == 0x000008, "Wrong alignment on BP_ActorSpawner_Generic_Shop_C_ExecuteUbergraph_BP_ActorSpawner_Generic_Shop");
static_assert(sizeof(BP_ActorSpawner_Generic_Shop_C_ExecuteUbergraph_BP_ActorSpawner_Generic_Shop) == 0x000018, "Wrong size on BP_ActorSpawner_Generic_Shop_C_ExecuteUbergraph_BP_ActorSpawner_Generic_Shop");
static_assert(offsetof(BP_ActorSpawner_Generic_Shop_C_ExecuteUbergraph_BP_ActorSpawner_Generic_Shop, EntryPoint) == 0x000000, "Member 'BP_ActorSpawner_Generic_Shop_C_ExecuteUbergraph_BP_ActorSpawner_Generic_Shop::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawner_Generic_Shop_C_ExecuteUbergraph_BP_ActorSpawner_Generic_Shop, K2Node_Event_Actor) == 0x000008, "Member 'BP_ActorSpawner_Generic_Shop_C_ExecuteUbergraph_BP_ActorSpawner_Generic_Shop::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawner_Generic_Shop_C_ExecuteUbergraph_BP_ActorSpawner_Generic_Shop, K2Node_Event_bPreview) == 0x000010, "Member 'BP_ActorSpawner_Generic_Shop_C_ExecuteUbergraph_BP_ActorSpawner_Generic_Shop::K2Node_Event_bPreview' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawner_Generic_Shop_C_ExecuteUbergraph_BP_ActorSpawner_Generic_Shop, CallFunc_SetVisible_ReturnValue) == 0x000011, "Member 'BP_ActorSpawner_Generic_Shop_C_ExecuteUbergraph_BP_ActorSpawner_Generic_Shop::CallFunc_SetVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActorSpawner_Generic_Shop_C_ExecuteUbergraph_BP_ActorSpawner_Generic_Shop, CallFunc_Not_PreBool_ReturnValue) == 0x000012, "Member 'BP_ActorSpawner_Generic_Shop_C_ExecuteUbergraph_BP_ActorSpawner_Generic_Shop::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

