#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BossSpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "EventSystem_structs.hpp"
#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function BP_BossSpawner.BP_BossSpawner_C.UnregisterFromCamera
// 0x0020 (0x0020 - 0x0000)
struct BP_BossSpawner_C_UnregisterFromCamera final
{
public:
	class APawn*                                  Enemy;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManagerZion*               CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameplayCamera*                        CallFunc_GetGameplayCamera_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BossSpawner_C_UnregisterFromCamera) == 0x000008, "Wrong alignment on BP_BossSpawner_C_UnregisterFromCamera");
static_assert(sizeof(BP_BossSpawner_C_UnregisterFromCamera) == 0x000020, "Wrong size on BP_BossSpawner_C_UnregisterFromCamera");
static_assert(offsetof(BP_BossSpawner_C_UnregisterFromCamera, Enemy) == 0x000000, "Member 'BP_BossSpawner_C_UnregisterFromCamera::Enemy' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_UnregisterFromCamera, CallFunc_Get_ReturnValue) == 0x000008, "Member 'BP_BossSpawner_C_UnregisterFromCamera::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_UnregisterFromCamera, CallFunc_GetGameplayCamera_ReturnValue) == 0x000010, "Member 'BP_BossSpawner_C_UnregisterFromCamera::CallFunc_GetGameplayCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_UnregisterFromCamera, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_BossSpawner_C_UnregisterFromCamera::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_UnregisterFromCamera, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'BP_BossSpawner_C_UnregisterFromCamera::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_BossSpawner.BP_BossSpawner_C.TryStopBGM
// 0x0008 (0x0008 - 0x0000)
struct BP_BossSpawner_C_TryStopBGM final
{
public:
	class USoundSubsystem*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BossSpawner_C_TryStopBGM) == 0x000008, "Wrong alignment on BP_BossSpawner_C_TryStopBGM");
static_assert(sizeof(BP_BossSpawner_C_TryStopBGM) == 0x000008, "Wrong size on BP_BossSpawner_C_TryStopBGM");
static_assert(offsetof(BP_BossSpawner_C_TryStopBGM, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'BP_BossSpawner_C_TryStopBGM::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function BP_BossSpawner.BP_BossSpawner_C.TryPlayBGM
// 0x0010 (0x0010 - 0x0000)
struct BP_BossSpawner_C_TryPlayBGM final
{
public:
	class USoundSubsystem*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BossSpawner_C_TryPlayBGM) == 0x000008, "Wrong alignment on BP_BossSpawner_C_TryPlayBGM");
static_assert(sizeof(BP_BossSpawner_C_TryPlayBGM) == 0x000010, "Wrong size on BP_BossSpawner_C_TryPlayBGM");
static_assert(offsetof(BP_BossSpawner_C_TryPlayBGM, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'BP_BossSpawner_C_TryPlayBGM::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_TryPlayBGM, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_BossSpawner_C_TryPlayBGM::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_BossSpawner.BP_BossSpawner_C.TryLoadEventBlocking
// 0x0040 (0x0040 - 0x0000)
struct BP_BossSpawner_C_TryLoadEventBlocking final
{
public:
	TSoftObjectPtr<class UObject>                 SoftEvent;                                         // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                Event;                                             // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BossSpawner_C_TryLoadEventBlocking) == 0x000008, "Wrong alignment on BP_BossSpawner_C_TryLoadEventBlocking");
static_assert(sizeof(BP_BossSpawner_C_TryLoadEventBlocking) == 0x000040, "Wrong size on BP_BossSpawner_C_TryLoadEventBlocking");
static_assert(offsetof(BP_BossSpawner_C_TryLoadEventBlocking, SoftEvent) == 0x000000, "Member 'BP_BossSpawner_C_TryLoadEventBlocking::SoftEvent' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_TryLoadEventBlocking, Event) == 0x000028, "Member 'BP_BossSpawner_C_TryLoadEventBlocking::Event' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_TryLoadEventBlocking, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000030, "Member 'BP_BossSpawner_C_TryLoadEventBlocking::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_TryLoadEventBlocking, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_BossSpawner_C_TryLoadEventBlocking::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_BossSpawner.BP_BossSpawner_C.RegisterToCamera
// 0x0020 (0x0020 - 0x0000)
struct BP_BossSpawner_C_RegisterToCamera final
{
public:
	class APawn*                                  Enemy;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManagerZion*               CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameplayCamera*                        CallFunc_GetGameplayCamera_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BossSpawner_C_RegisterToCamera) == 0x000008, "Wrong alignment on BP_BossSpawner_C_RegisterToCamera");
static_assert(sizeof(BP_BossSpawner_C_RegisterToCamera) == 0x000020, "Wrong size on BP_BossSpawner_C_RegisterToCamera");
static_assert(offsetof(BP_BossSpawner_C_RegisterToCamera, Enemy) == 0x000000, "Member 'BP_BossSpawner_C_RegisterToCamera::Enemy' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_RegisterToCamera, CallFunc_Get_ReturnValue) == 0x000008, "Member 'BP_BossSpawner_C_RegisterToCamera::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_RegisterToCamera, CallFunc_GetGameplayCamera_ReturnValue) == 0x000010, "Member 'BP_BossSpawner_C_RegisterToCamera::CallFunc_GetGameplayCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_RegisterToCamera, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_BossSpawner_C_RegisterToCamera::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_RegisterToCamera, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'BP_BossSpawner_C_RegisterToCamera::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_BossSpawner.BP_BossSpawner_C.PlayFieldTalk
// 0x0010 (0x0010 - 0x0000)
struct BP_BossSpawner_C_PlayFieldTalk final
{
public:
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartFieldTalk_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BossSpawner_C_PlayFieldTalk) == 0x000008, "Wrong alignment on BP_BossSpawner_C_PlayFieldTalk");
static_assert(sizeof(BP_BossSpawner_C_PlayFieldTalk) == 0x000010, "Wrong size on BP_BossSpawner_C_PlayFieldTalk");
static_assert(offsetof(BP_BossSpawner_C_PlayFieldTalk, CallFunc_Get_ReturnValue) == 0x000000, "Member 'BP_BossSpawner_C_PlayFieldTalk::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_PlayFieldTalk, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_BossSpawner_C_PlayFieldTalk::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_PlayFieldTalk, CallFunc_StartFieldTalk_ReturnValue) == 0x000009, "Member 'BP_BossSpawner_C_PlayFieldTalk::CallFunc_StartFieldTalk_ReturnValue' has a wrong offset!");

// Function BP_BossSpawner.BP_BossSpawner_C.PlayFieldMessage
// 0x0140 (0x0140 - 0x0000)
struct BP_BossSpawner_C_PlayFieldMessage final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterZion*                         CallFunc_GetEnemy_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LaunchFieldMessage_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0048(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_BossSpawner_C_PlayFieldMessage) == 0x000008, "Wrong alignment on BP_BossSpawner_C_PlayFieldMessage");
static_assert(sizeof(BP_BossSpawner_C_PlayFieldMessage) == 0x000140, "Wrong size on BP_BossSpawner_C_PlayFieldMessage");
static_assert(offsetof(BP_BossSpawner_C_PlayFieldMessage, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_BossSpawner_C_PlayFieldMessage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_PlayFieldMessage, CallFunc_GetEnemy_ReturnValue) == 0x000008, "Member 'BP_BossSpawner_C_PlayFieldMessage::CallFunc_GetEnemy_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_PlayFieldMessage, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_BossSpawner_C_PlayFieldMessage::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_PlayFieldMessage, CallFunc_LaunchFieldMessage_ReturnValue) == 0x000028, "Member 'BP_BossSpawner_C_PlayFieldMessage::CallFunc_LaunchFieldMessage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_PlayFieldMessage, CallFunc_Add_VectorVector_ReturnValue) == 0x000030, "Member 'BP_BossSpawner_C_PlayFieldMessage::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_PlayFieldMessage, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000048, "Member 'BP_BossSpawner_C_PlayFieldMessage::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

// Function BP_BossSpawner.BP_BossSpawner_C.PlayEvent
// 0x01D8 (0x01D8 - 0x0000)
struct BP_BossSpawner_C_PlayEvent final
{
public:
	class UEventAsset*                            EventAsset;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UEventPlayer* EventPlayer, bool bCompletedEvent, EEventPlayerResult EventResult)> InputPin; // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FEventBlackboardInit                   Temp_struct_Variable;                              // 0x0018(0x0140)(ConstParm)
	class ACharacterZion*                         CallFunc_GetEnemy_ReturnValue;                     // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class AActor*>              CallFunc_GenerateActorBindings_ReturnValue;        // 0x0168(0x0050)()
	class FName                                   Temp_name_Variable;                                // 0x01B8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x01C8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEventPlayer*                           CallFunc_CreateEventPlayer_ReturnValue;            // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BossSpawner_C_PlayEvent) == 0x000008, "Wrong alignment on BP_BossSpawner_C_PlayEvent");
static_assert(sizeof(BP_BossSpawner_C_PlayEvent) == 0x0001D8, "Wrong size on BP_BossSpawner_C_PlayEvent");
static_assert(offsetof(BP_BossSpawner_C_PlayEvent, EventAsset) == 0x000000, "Member 'BP_BossSpawner_C_PlayEvent::EventAsset' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_PlayEvent, InputPin) == 0x000008, "Member 'BP_BossSpawner_C_PlayEvent::InputPin' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_PlayEvent, Temp_struct_Variable) == 0x000018, "Member 'BP_BossSpawner_C_PlayEvent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_PlayEvent, CallFunc_GetEnemy_ReturnValue) == 0x000158, "Member 'BP_BossSpawner_C_PlayEvent::CallFunc_GetEnemy_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_PlayEvent, CallFunc_IsValid_ReturnValue) == 0x000160, "Member 'BP_BossSpawner_C_PlayEvent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_PlayEvent, CallFunc_GenerateActorBindings_ReturnValue) == 0x000168, "Member 'BP_BossSpawner_C_PlayEvent::CallFunc_GenerateActorBindings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_PlayEvent, Temp_name_Variable) == 0x0001B8, "Member 'BP_BossSpawner_C_PlayEvent::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_PlayEvent, CallFunc_GetPlayerController_ReturnValue) == 0x0001C0, "Member 'BP_BossSpawner_C_PlayEvent::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_PlayEvent, Temp_name_Variable_1) == 0x0001C8, "Member 'BP_BossSpawner_C_PlayEvent::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_PlayEvent, CallFunc_CreateEventPlayer_ReturnValue) == 0x0001D0, "Member 'BP_BossSpawner_C_PlayEvent::CallFunc_CreateEventPlayer_ReturnValue' has a wrong offset!");

// Function BP_BossSpawner.BP_BossSpawner_C.OnUnregisterEnemy
// 0x0008 (0x0008 - 0x0000)
struct BP_BossSpawner_C_OnUnregisterEnemy final
{
public:
	class ACharacterZion*                         Enemy;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BossSpawner_C_OnUnregisterEnemy) == 0x000008, "Wrong alignment on BP_BossSpawner_C_OnUnregisterEnemy");
static_assert(sizeof(BP_BossSpawner_C_OnUnregisterEnemy) == 0x000008, "Wrong size on BP_BossSpawner_C_OnUnregisterEnemy");
static_assert(offsetof(BP_BossSpawner_C_OnUnregisterEnemy, Enemy) == 0x000000, "Member 'BP_BossSpawner_C_OnUnregisterEnemy::Enemy' has a wrong offset!");

// Function BP_BossSpawner.BP_BossSpawner_C.OnLoaded_D8062329490817C94DFE51B89305F3D3
// 0x0008 (0x0008 - 0x0000)
struct BP_BossSpawner_C_OnLoaded_D8062329490817C94DFE51B89305F3D3 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BossSpawner_C_OnLoaded_D8062329490817C94DFE51B89305F3D3) == 0x000008, "Wrong alignment on BP_BossSpawner_C_OnLoaded_D8062329490817C94DFE51B89305F3D3");
static_assert(sizeof(BP_BossSpawner_C_OnLoaded_D8062329490817C94DFE51B89305F3D3) == 0x000008, "Wrong size on BP_BossSpawner_C_OnLoaded_D8062329490817C94DFE51B89305F3D3");
static_assert(offsetof(BP_BossSpawner_C_OnLoaded_D8062329490817C94DFE51B89305F3D3, Loaded) == 0x000000, "Member 'BP_BossSpawner_C_OnLoaded_D8062329490817C94DFE51B89305F3D3::Loaded' has a wrong offset!");

// Function BP_BossSpawner.BP_BossSpawner_C.OnLoaded_9F62A72947E92945F3886895F4675E77
// 0x0008 (0x0008 - 0x0000)
struct BP_BossSpawner_C_OnLoaded_9F62A72947E92945F3886895F4675E77 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BossSpawner_C_OnLoaded_9F62A72947E92945F3886895F4675E77) == 0x000008, "Wrong alignment on BP_BossSpawner_C_OnLoaded_9F62A72947E92945F3886895F4675E77");
static_assert(sizeof(BP_BossSpawner_C_OnLoaded_9F62A72947E92945F3886895F4675E77) == 0x000008, "Wrong size on BP_BossSpawner_C_OnLoaded_9F62A72947E92945F3886895F4675E77");
static_assert(offsetof(BP_BossSpawner_C_OnLoaded_9F62A72947E92945F3886895F4675E77, Loaded) == 0x000000, "Member 'BP_BossSpawner_C_OnLoaded_9F62A72947E92945F3886895F4675E77::Loaded' has a wrong offset!");

// Function BP_BossSpawner.BP_BossSpawner_C.OnLoaded_85231EA84F9FC27A62232D8209BDE433
// 0x0008 (0x0008 - 0x0000)
struct BP_BossSpawner_C_OnLoaded_85231EA84F9FC27A62232D8209BDE433 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BossSpawner_C_OnLoaded_85231EA84F9FC27A62232D8209BDE433) == 0x000008, "Wrong alignment on BP_BossSpawner_C_OnLoaded_85231EA84F9FC27A62232D8209BDE433");
static_assert(sizeof(BP_BossSpawner_C_OnLoaded_85231EA84F9FC27A62232D8209BDE433) == 0x000008, "Wrong size on BP_BossSpawner_C_OnLoaded_85231EA84F9FC27A62232D8209BDE433");
static_assert(offsetof(BP_BossSpawner_C_OnLoaded_85231EA84F9FC27A62232D8209BDE433, Loaded) == 0x000000, "Member 'BP_BossSpawner_C_OnLoaded_85231EA84F9FC27A62232D8209BDE433::Loaded' has a wrong offset!");

// Function BP_BossSpawner.BP_BossSpawner_C.OnLoaded_02E6166A4FA74DD3D4472B91AB659B95
// 0x0008 (0x0008 - 0x0000)
struct BP_BossSpawner_C_OnLoaded_02E6166A4FA74DD3D4472B91AB659B95 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BossSpawner_C_OnLoaded_02E6166A4FA74DD3D4472B91AB659B95) == 0x000008, "Wrong alignment on BP_BossSpawner_C_OnLoaded_02E6166A4FA74DD3D4472B91AB659B95");
static_assert(sizeof(BP_BossSpawner_C_OnLoaded_02E6166A4FA74DD3D4472B91AB659B95) == 0x000008, "Wrong size on BP_BossSpawner_C_OnLoaded_02E6166A4FA74DD3D4472B91AB659B95");
static_assert(offsetof(BP_BossSpawner_C_OnLoaded_02E6166A4FA74DD3D4472B91AB659B95, Loaded) == 0x000000, "Member 'BP_BossSpawner_C_OnLoaded_02E6166A4FA74DD3D4472B91AB659B95::Loaded' has a wrong offset!");

// Function BP_BossSpawner.BP_BossSpawner_C.OnIntroFinished
// 0x0010 (0x0010 - 0x0000)
struct BP_BossSpawner_C_OnIntroFinished final
{
public:
	class UEventPlayer*                           EventPlayer_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bCompletedEvent;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEventPlayerResult                            EventResult;                                       // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BossSpawner_C_OnIntroFinished) == 0x000008, "Wrong alignment on BP_BossSpawner_C_OnIntroFinished");
static_assert(sizeof(BP_BossSpawner_C_OnIntroFinished) == 0x000010, "Wrong size on BP_BossSpawner_C_OnIntroFinished");
static_assert(offsetof(BP_BossSpawner_C_OnIntroFinished, EventPlayer_0) == 0x000000, "Member 'BP_BossSpawner_C_OnIntroFinished::EventPlayer_0' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_OnIntroFinished, bCompletedEvent) == 0x000008, "Member 'BP_BossSpawner_C_OnIntroFinished::bCompletedEvent' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_OnIntroFinished, EventResult) == 0x000009, "Member 'BP_BossSpawner_C_OnIntroFinished::EventResult' has a wrong offset!");

// Function BP_BossSpawner.BP_BossSpawner_C.OnDefeatEventFinished
// 0x0010 (0x0010 - 0x0000)
struct BP_BossSpawner_C_OnDefeatEventFinished final
{
public:
	class UEventPlayer*                           EventPlayer_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bCompletedEvent;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEventPlayerResult                            EventResult;                                       // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BossSpawner_C_OnDefeatEventFinished) == 0x000008, "Wrong alignment on BP_BossSpawner_C_OnDefeatEventFinished");
static_assert(sizeof(BP_BossSpawner_C_OnDefeatEventFinished) == 0x000010, "Wrong size on BP_BossSpawner_C_OnDefeatEventFinished");
static_assert(offsetof(BP_BossSpawner_C_OnDefeatEventFinished, EventPlayer_0) == 0x000000, "Member 'BP_BossSpawner_C_OnDefeatEventFinished::EventPlayer_0' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_OnDefeatEventFinished, bCompletedEvent) == 0x000008, "Member 'BP_BossSpawner_C_OnDefeatEventFinished::bCompletedEvent' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_OnDefeatEventFinished, EventResult) == 0x000009, "Member 'BP_BossSpawner_C_OnDefeatEventFinished::EventResult' has a wrong offset!");

// Function BP_BossSpawner.BP_BossSpawner_C.FlushCamera
// 0x0020 (0x0020 - 0x0000)
struct BP_BossSpawner_C_FlushCamera final
{
public:
	bool                                          bInterruptOnGoingBlend;                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParams            K2Node_MakeStruct_ViewTargetTransitionParams;      // 0x0004(0x0010)(NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManagerZion*               CallFunc_Get_ReturnValue;                          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BossSpawner_C_FlushCamera) == 0x000008, "Wrong alignment on BP_BossSpawner_C_FlushCamera");
static_assert(sizeof(BP_BossSpawner_C_FlushCamera) == 0x000020, "Wrong size on BP_BossSpawner_C_FlushCamera");
static_assert(offsetof(BP_BossSpawner_C_FlushCamera, bInterruptOnGoingBlend) == 0x000000, "Member 'BP_BossSpawner_C_FlushCamera::bInterruptOnGoingBlend' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_FlushCamera, K2Node_MakeStruct_ViewTargetTransitionParams) == 0x000004, "Member 'BP_BossSpawner_C_FlushCamera::K2Node_MakeStruct_ViewTargetTransitionParams' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_FlushCamera, CallFunc_Get_ReturnValue) == 0x000018, "Member 'BP_BossSpawner_C_FlushCamera::CallFunc_Get_ReturnValue' has a wrong offset!");

// Function BP_BossSpawner.BP_BossSpawner_C.ExecuteUbergraph_BP_BossSpawner
// 0x02C8 (0x02C8 - 0x0000)
struct BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_3;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacterZion*                         K2Node_Event_Enemy;                                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacterZion*                         CallFunc_GetEnemy_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacterZion*                         CallFunc_GetEnemy_ReturnValue_1;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0048(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsPlayer_ReturnValue;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_142[0x2];                                      // 0x0142(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnemyActivated_ReturnValue;             // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x014E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14F[0x1];                                      // 0x014F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UEventPlayer* EventPlayer, bool bCompletedEvent, EEventPlayerResult EventResult)> K2Node_CreateDelegate_OutputDelegate; // 0x0150(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EClearStatus                                  K2Node_ComponentBoundEvent_ClearStatus;            // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_1; // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_163[0x1];                                      // 0x0163(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UEventPlayer* EventPlayer, bool bCompletedEvent, EEventPlayerResult EventResult)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0164(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_2; // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UEventPlayer*                           K2Node_CustomEvent_EventPlayer_1;                  // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bCompletedEvent_1;              // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEventPlayerResult                            K2Node_CustomEvent_EventResult_1;                  // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UEventPlayer*                           K2Node_CustomEvent_EventPlayer;                    // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bCompletedEvent;                // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEventPlayerResult                            K2Node_CustomEvent_EventResult;                    // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_193[0x1];                                      // 0x0193(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x0194(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_3; // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A6[0x2];                                      // 0x01A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B7[0x1];                                      // 0x01B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEventAsset*                            K2Node_DynamicCast_AsEvent_Asset;                  // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x01D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_1;                            // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFieldMessageAsset*                     K2Node_DynamicCast_AsField_Message_Asset;          // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_202[0x6];                                      // 0x0202(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_2;                            // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFieldTalkAsset*                        K2Node_DynamicCast_AsField_Talk_Asset;             // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_4; // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldSpawnEvenWhenCleared_ReturnValue;   // 0x0222(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_223[0x1];                                      // 0x0223(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x0224(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Door_C*                             CallFunc_Array_Get_Item;                           // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundSubsystem*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Door_C*                             CallFunc_Array_Get_Item_1;                         // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_5; // 0x026D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26E[0x2];                                      // 0x026E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterZion*                         CallFunc_GetEnemy_ReturnValue_2;                   // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_3;                            // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEventAsset*                            K2Node_DynamicCast_AsEvent_Asset_1;                // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29A[0x6];                                      // 0x029A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_5;            // 0x02AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner) == 0x000008, "Wrong alignment on BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner");
static_assert(sizeof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner) == 0x0002C8, "Wrong size on BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, EntryPoint) == 0x000000, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, K2Node_CustomEvent_Loaded_3) == 0x000008, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::K2Node_CustomEvent_Loaded_3' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, K2Node_Event_Enemy) == 0x000010, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::K2Node_Event_Enemy' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, CallFunc_GetEnemy_ReturnValue) == 0x000018, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::CallFunc_GetEnemy_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, CallFunc_GetEnemy_ReturnValue_1) == 0x000020, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::CallFunc_GetEnemy_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000028, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, K2Node_ComponentBoundEvent_OtherActor) == 0x000030, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, K2Node_ComponentBoundEvent_OtherComp) == 0x000038, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000040, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, K2Node_ComponentBoundEvent_bFromSweep) == 0x000044, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, K2Node_ComponentBoundEvent_SweepResult) == 0x000048, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, CallFunc_IsPlayer_ReturnValue) == 0x000140, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::CallFunc_IsPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, CallFunc_IsValid_ReturnValue) == 0x000141, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, Temp_int_Array_Index_Variable) == 0x000144, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, Temp_int_Array_Index_Variable_1) == 0x000148, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, CallFunc_IsEnemyActivated_ReturnValue) == 0x00014C, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::CallFunc_IsEnemyActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, CallFunc_Not_PreBool_ReturnValue) == 0x00014D, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x00014E, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, K2Node_CreateDelegate_OutputDelegate) == 0x000150, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, K2Node_ComponentBoundEvent_ClearStatus) == 0x000160, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::K2Node_ComponentBoundEvent_ClearStatus' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, K2Node_SwitchEnum_CmpSuccess) == 0x000161, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, CallFunc_IsValidSoftObjectReference_ReturnValue_1) == 0x000162, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::CallFunc_IsValidSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, K2Node_CreateDelegate_OutputDelegate_1) == 0x000164, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, CallFunc_IsValidSoftObjectReference_ReturnValue_2) == 0x000174, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::CallFunc_IsValidSoftObjectReference_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, K2Node_CustomEvent_EventPlayer_1) == 0x000178, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::K2Node_CustomEvent_EventPlayer_1' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, K2Node_CustomEvent_bCompletedEvent_1) == 0x000180, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::K2Node_CustomEvent_bCompletedEvent_1' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, K2Node_CustomEvent_EventResult_1) == 0x000181, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::K2Node_CustomEvent_EventResult_1' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, K2Node_CustomEvent_EventPlayer) == 0x000188, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::K2Node_CustomEvent_EventPlayer' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, K2Node_CustomEvent_bCompletedEvent) == 0x000190, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::K2Node_CustomEvent_bCompletedEvent' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, K2Node_CustomEvent_EventResult) == 0x000191, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::K2Node_CustomEvent_EventResult' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, K2Node_SwitchEnum_CmpSuccess_1) == 0x000192, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, K2Node_CreateDelegate_OutputDelegate_2) == 0x000194, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, CallFunc_IsValidSoftObjectReference_ReturnValue_3) == 0x0001A4, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::CallFunc_IsValidSoftObjectReference_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, CallFunc_IsValid_ReturnValue_1) == 0x0001A5, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, Temp_int_Loop_Counter_Variable) == 0x0001A8, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, CallFunc_Add_IntInt_ReturnValue) == 0x0001AC, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, Temp_int_Loop_Counter_Variable_1) == 0x0001B0, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, CallFunc_IsActive_ReturnValue) == 0x0001B4, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, CallFunc_IsValid_ReturnValue_2) == 0x0001B5, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001B6, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001B8, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, Temp_object_Variable) == 0x0001C0, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, K2Node_DynamicCast_AsEvent_Asset) == 0x0001C8, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::K2Node_DynamicCast_AsEvent_Asset' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, K2Node_DynamicCast_bSuccess) == 0x0001D0, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001D4, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, Temp_object_Variable_1) == 0x0001E8, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, CallFunc_Add_IntInt_ReturnValue_2) == 0x0001F0, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, K2Node_DynamicCast_AsField_Message_Asset) == 0x0001F8, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::K2Node_DynamicCast_AsField_Message_Asset' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, K2Node_DynamicCast_bSuccess_1) == 0x000200, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000201, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, K2Node_CustomEvent_Loaded) == 0x000208, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, Temp_object_Variable_2) == 0x000210, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, K2Node_DynamicCast_AsField_Talk_Asset) == 0x000218, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::K2Node_DynamicCast_AsField_Talk_Asset' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, K2Node_DynamicCast_bSuccess_2) == 0x000220, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, CallFunc_IsValidSoftObjectReference_ReturnValue_4) == 0x000221, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::CallFunc_IsValidSoftObjectReference_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, CallFunc_ShouldSpawnEvenWhenCleared_ReturnValue) == 0x000222, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::CallFunc_ShouldSpawnEvenWhenCleared_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, K2Node_CreateDelegate_OutputDelegate_4) == 0x000224, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, Temp_int_Variable) == 0x000234, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, CallFunc_Array_Get_Item) == 0x000238, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, CallFunc_Array_Length_ReturnValue) == 0x000240, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner, K2Node_CustomEvent_Loaded_1) == 0x000248, "Member 'BP_BossSpawner_C_ExecuteUbergraph_BP_BossSpawner::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
