#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Block

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Block.BP_Block_C
// 0x0018 (0x02A8 - 0x0290)
class ABP_Block_C : public AActor
{
public:
	class UStaticMeshComponent*                   DebugVisual;                                       // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Block_C">();
	}
	static class ABP_Block_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Block_C>();
	}
};
static_assert(alignof(ABP_Block_C) == 0x000008, "Wrong alignment on ABP_Block_C");
static_assert(sizeof(ABP_Block_C) == 0x0002A8, "Wrong size on ABP_Block_C");
static_assert(offsetof(ABP_Block_C, DebugVisual) == 0x000290, "Member 'ABP_Block_C::DebugVisual' has a wrong offset!");
static_assert(offsetof(ABP_Block_C, Root) == 0x000298, "Member 'ABP_Block_C::Root' has a wrong offset!");
static_assert(offsetof(ABP_Block_C, StaticMesh) == 0x0002A0, "Member 'ABP_Block_C::StaticMesh' has a wrong offset!");

}

