#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Breakable

#include "Basic.hpp"

#include "Zion_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Breakable.BP_Breakable_C.StopLoopFX
// 0x0001 (0x0001 - 0x0000)
struct BP_Breakable_C_StopLoopFX final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Breakable_C_StopLoopFX) == 0x000001, "Wrong alignment on BP_Breakable_C_StopLoopFX");
static_assert(sizeof(BP_Breakable_C_StopLoopFX) == 0x000001, "Wrong size on BP_Breakable_C_StopLoopFX");
static_assert(offsetof(BP_Breakable_C_StopLoopFX, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_Breakable_C_StopLoopFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Breakable.BP_Breakable_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_Breakable_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Breakable_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_Breakable_C_ReceiveEndPlay");
static_assert(sizeof(BP_Breakable_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_Breakable_C_ReceiveEndPlay");
static_assert(offsetof(BP_Breakable_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_Breakable_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_Breakable.BP_Breakable_C.PlayLoopFX
// 0x0010 (0x0010 - 0x0000)
struct BP_Breakable_C_PlayLoopFX final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnFX_ReturnValue;                      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Breakable_C_PlayLoopFX) == 0x000008, "Wrong alignment on BP_Breakable_C_PlayLoopFX");
static_assert(sizeof(BP_Breakable_C_PlayLoopFX) == 0x000010, "Wrong size on BP_Breakable_C_PlayLoopFX");
static_assert(offsetof(BP_Breakable_C_PlayLoopFX, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_Breakable_C_PlayLoopFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Breakable_C_PlayLoopFX, CallFunc_SpawnFX_ReturnValue) == 0x000008, "Member 'BP_Breakable_C_PlayLoopFX::CallFunc_SpawnFX_ReturnValue' has a wrong offset!");

// Function BP_Breakable.BP_Breakable_C.ExecuteUbergraph_BP_Breakable
// 0x0008 (0x0008 - 0x0000)
struct BP_Breakable_C_ExecuteUbergraph_BP_Breakable final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EClearStatus                                  K2Node_ComponentBoundEvent_ClearStatus;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Breakable_C_ExecuteUbergraph_BP_Breakable) == 0x000004, "Wrong alignment on BP_Breakable_C_ExecuteUbergraph_BP_Breakable");
static_assert(sizeof(BP_Breakable_C_ExecuteUbergraph_BP_Breakable) == 0x000008, "Wrong size on BP_Breakable_C_ExecuteUbergraph_BP_Breakable");
static_assert(offsetof(BP_Breakable_C_ExecuteUbergraph_BP_Breakable, EntryPoint) == 0x000000, "Member 'BP_Breakable_C_ExecuteUbergraph_BP_Breakable::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Breakable_C_ExecuteUbergraph_BP_Breakable, K2Node_ComponentBoundEvent_ClearStatus) == 0x000004, "Member 'BP_Breakable_C_ExecuteUbergraph_BP_Breakable::K2Node_ComponentBoundEvent_ClearStatus' has a wrong offset!");
static_assert(offsetof(BP_Breakable_C_ExecuteUbergraph_BP_Breakable, K2Node_Event_EndPlayReason) == 0x000005, "Member 'BP_Breakable_C_ExecuteUbergraph_BP_Breakable::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_Breakable_C_ExecuteUbergraph_BP_Breakable, K2Node_SwitchEnum_CmpSuccess) == 0x000006, "Member 'BP_Breakable_C_ExecuteUbergraph_BP_Breakable::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_Breakable.BP_Breakable_C.BndEvt__BP_Breakable_ClearComponent_K2Node_ComponentBoundEvent_2_ClearableDelegate__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_Breakable_C_BndEvt__BP_Breakable_ClearComponent_K2Node_ComponentBoundEvent_2_ClearableDelegate__DelegateSignature final
{
public:
	EClearStatus                                  ClearStatus;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Breakable_C_BndEvt__BP_Breakable_ClearComponent_K2Node_ComponentBoundEvent_2_ClearableDelegate__DelegateSignature) == 0x000001, "Wrong alignment on BP_Breakable_C_BndEvt__BP_Breakable_ClearComponent_K2Node_ComponentBoundEvent_2_ClearableDelegate__DelegateSignature");
static_assert(sizeof(BP_Breakable_C_BndEvt__BP_Breakable_ClearComponent_K2Node_ComponentBoundEvent_2_ClearableDelegate__DelegateSignature) == 0x000001, "Wrong size on BP_Breakable_C_BndEvt__BP_Breakable_ClearComponent_K2Node_ComponentBoundEvent_2_ClearableDelegate__DelegateSignature");
static_assert(offsetof(BP_Breakable_C_BndEvt__BP_Breakable_ClearComponent_K2Node_ComponentBoundEvent_2_ClearableDelegate__DelegateSignature, ClearStatus) == 0x000000, "Member 'BP_Breakable_C_BndEvt__BP_Breakable_ClearComponent_K2Node_ComponentBoundEvent_2_ClearableDelegate__DelegateSignature::ClearStatus' has a wrong offset!");

}

