#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Breakable_Block

#include "Basic.hpp"

#include "BP_Breakable_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Breakable_Block.BP_Breakable_Block_C
// 0x0020 (0x0550 - 0x0530)
class ABP_Breakable_Block_C : public ABP_Breakable_C
{
public:
	class URenderStateComponent*                  RenderState;                                       // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStatsComponent*                        Stats;                                             // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DebugVisual;                                       // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Hurtbox;                                           // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Breakable_Block_C">();
	}
	static class ABP_Breakable_Block_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Breakable_Block_C>();
	}
};
static_assert(alignof(ABP_Breakable_Block_C) == 0x000010, "Wrong alignment on ABP_Breakable_Block_C");
static_assert(sizeof(ABP_Breakable_Block_C) == 0x000550, "Wrong size on ABP_Breakable_Block_C");
static_assert(offsetof(ABP_Breakable_Block_C, RenderState) == 0x000528, "Member 'ABP_Breakable_Block_C::RenderState' has a wrong offset!");
static_assert(offsetof(ABP_Breakable_Block_C, Stats) == 0x000530, "Member 'ABP_Breakable_Block_C::Stats' has a wrong offset!");
static_assert(offsetof(ABP_Breakable_Block_C, DebugVisual) == 0x000538, "Member 'ABP_Breakable_Block_C::DebugVisual' has a wrong offset!");
static_assert(offsetof(ABP_Breakable_Block_C, Hurtbox) == 0x000540, "Member 'ABP_Breakable_Block_C::Hurtbox' has a wrong offset!");
static_assert(offsetof(ABP_Breakable_Block_C, Box) == 0x000548, "Member 'ABP_Breakable_Block_C::Box' has a wrong offset!");

}

