#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Command_Counter

#include "Basic.hpp"

#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function BP_Command_Counter.BP_Command_Counter_C.OnParried
// 0x0010 (0x0010 - 0x0000)
struct BP_Command_Counter_C_OnParried final
{
public:
	class AAbility*                               Ability;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Source;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Command_Counter_C_OnParried) == 0x000008, "Wrong alignment on BP_Command_Counter_C_OnParried");
static_assert(sizeof(BP_Command_Counter_C_OnParried) == 0x000010, "Wrong size on BP_Command_Counter_C_OnParried");
static_assert(offsetof(BP_Command_Counter_C_OnParried, Ability) == 0x000000, "Member 'BP_Command_Counter_C_OnParried::Ability' has a wrong offset!");
static_assert(offsetof(BP_Command_Counter_C_OnParried, Source) == 0x000008, "Member 'BP_Command_Counter_C_OnParried::Source' has a wrong offset!");

// Function BP_Command_Counter.BP_Command_Counter_C.OnFinish
// 0x0001 (0x0001 - 0x0000)
struct BP_Command_Counter_C_OnFinish final
{
public:
	ECommandFinishType                            FinishType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Command_Counter_C_OnFinish) == 0x000001, "Wrong alignment on BP_Command_Counter_C_OnFinish");
static_assert(sizeof(BP_Command_Counter_C_OnFinish) == 0x000001, "Wrong size on BP_Command_Counter_C_OnFinish");
static_assert(offsetof(BP_Command_Counter_C_OnFinish, FinishType) == 0x000000, "Member 'BP_Command_Counter_C_OnFinish::FinishType' has a wrong offset!");

// Function BP_Command_Counter.BP_Command_Counter_C.ExecuteUbergraph_BP_Command_Counter
// 0x00A0 (0x00A0 - 0x0000)
struct BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UCommandSet*                      CallFunc_GetSourceCommandSet_ReturnValue;          // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetCharacter_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommandFinishType                            K2Node_Event_FinishType;                           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacterZion*                         K2Node_DynamicCast_AsCharacter_Zion;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetCharacter_ReturnValue_1;               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AAbility* Ability, class AActor* Source)> K2Node_CreateDelegate_OutputDelegate; // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacterZion*                         K2Node_DynamicCast_AsCharacter_Zion_1;             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAbility*                               K2Node_CustomEvent_Ability;                        // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Source;                         // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AAbility* Ability, class AActor* Source)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetCharacter_ReturnValue_2;               // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommandComponent*                      CallFunc_GetComponentByClass_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UInputAction*                     CallFunc_GetInvokedInputAction_ReturnValue;        // 0x0090(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter) == 0x000008, "Wrong alignment on BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter");
static_assert(sizeof(BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter) == 0x0000A0, "Wrong size on BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter");
static_assert(offsetof(BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter, EntryPoint) == 0x000000, "Member 'BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter, CallFunc_GetSourceCommandSet_ReturnValue) == 0x000008, "Member 'BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter::CallFunc_GetSourceCommandSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter, CallFunc_GetCharacter_ReturnValue) == 0x000010, "Member 'BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter, K2Node_Event_FinishType) == 0x000018, "Member 'BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter::K2Node_Event_FinishType' has a wrong offset!");
static_assert(offsetof(BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter, K2Node_DynamicCast_AsCharacter_Zion) == 0x000020, "Member 'BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter::K2Node_DynamicCast_AsCharacter_Zion' has a wrong offset!");
static_assert(offsetof(BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter, CallFunc_GetCharacter_ReturnValue_1) == 0x000030, "Member 'BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter::CallFunc_GetCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter, K2Node_DynamicCast_AsCharacter_Zion_1) == 0x000048, "Member 'BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter::K2Node_DynamicCast_AsCharacter_Zion_1' has a wrong offset!");
static_assert(offsetof(BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter, K2Node_CustomEvent_Ability) == 0x000058, "Member 'BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter::K2Node_CustomEvent_Ability' has a wrong offset!");
static_assert(offsetof(BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter, K2Node_CustomEvent_Source) == 0x000060, "Member 'BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter::K2Node_CustomEvent_Source' has a wrong offset!");
static_assert(offsetof(BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter, K2Node_CreateDelegate_OutputDelegate_1) == 0x000068, "Member 'BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter, CallFunc_GetCharacter_ReturnValue_2) == 0x000078, "Member 'BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter::CallFunc_GetCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter, CallFunc_GetComponentByClass_ReturnValue) == 0x000080, "Member 'BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter, CallFunc_GetInvokedInputAction_ReturnValue) == 0x000090, "Member 'BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter::CallFunc_GetInvokedInputAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000098, "Member 'BP_Command_Counter_C_ExecuteUbergraph_BP_Command_Counter::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

}

