#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterZionSpirit_RestPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CharacterZionSpirit_RestPoint.BP_CharacterZionSpirit_RestPoint_C.ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint
// 0x0058 (0x0058 - 0x0000)
struct BP_CharacterZionSpirit_RestPoint_C_ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterZionSpirit_RestPoint_C_ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint) == 0x000008, "Wrong alignment on BP_CharacterZionSpirit_RestPoint_C_ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint");
static_assert(sizeof(BP_CharacterZionSpirit_RestPoint_C_ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint) == 0x000058, "Wrong size on BP_CharacterZionSpirit_RestPoint_C_ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint");
static_assert(offsetof(BP_CharacterZionSpirit_RestPoint_C_ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint, EntryPoint) == 0x000000, "Member 'BP_CharacterZionSpirit_RestPoint_C_ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CharacterZionSpirit_RestPoint_C_ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'BP_CharacterZionSpirit_RestPoint_C_ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterZionSpirit_RestPoint_C_ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BP_CharacterZionSpirit_RestPoint_C_ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterZionSpirit_RestPoint_C_ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_CharacterZionSpirit_RestPoint_C_ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CharacterZionSpirit_RestPoint_C_ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint, CallFunc_Greater_IntInt_ReturnValue) == 0x000024, "Member 'BP_CharacterZionSpirit_RestPoint_C_ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterZionSpirit_RestPoint_C_ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'BP_CharacterZionSpirit_RestPoint_C_ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterZionSpirit_RestPoint_C_ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'BP_CharacterZionSpirit_RestPoint_C_ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterZionSpirit_RestPoint_C_ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint, CallFunc_Array_Length_ReturnValue_1) == 0x000040, "Member 'BP_CharacterZionSpirit_RestPoint_C_ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterZionSpirit_RestPoint_C_ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint, CallFunc_RandomInteger_ReturnValue) == 0x000044, "Member 'BP_CharacterZionSpirit_RestPoint_C_ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterZionSpirit_RestPoint_C_ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint, CallFunc_Array_Length_ReturnValue_2) == 0x000048, "Member 'BP_CharacterZionSpirit_RestPoint_C_ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CharacterZionSpirit_RestPoint_C_ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00004C, "Member 'BP_CharacterZionSpirit_RestPoint_C_ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CharacterZionSpirit_RestPoint_C_ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x00004D, "Member 'BP_CharacterZionSpirit_RestPoint_C_ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterZionSpirit_RestPoint_C_ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000050, "Member 'BP_CharacterZionSpirit_RestPoint_C_ExecuteUbergraph_BP_CharacterZionSpirit_RestPoint::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

}

