#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterZion_Player

#include "Basic.hpp"

#include "BP_CharacterZion_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CharacterZion_Player.BP_CharacterZion_Player_C
// 0x0090 (0x0A30 - 0x09A0)
#pragma pack(push, 0x1)
class alignas(0x10) ABP_CharacterZion_Player_C : public ABP_CharacterZion_C
{
public:
	class UDashChargeComponent*                   DashCharge;                                        // 0x09A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USummonRestPointSpiritComponent*        SummonRestPointSpirit;                             // 0x09A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USummonIdleSpiritComponent*             SummonIdleSpirit;                                  // 0x09B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       WakeTrigger;                                       // 0x09B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USleepActivatorComponent*               SleepActivator;                                    // 0x09C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       RestoreHealItemsWidget;                            // 0x09C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       LevelUpWidget;                                     // 0x09D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFluidInteractionComponent*             FluidInteraction;                                  // 0x09D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStatSPComponent*                       StatSP;                                            // 0x09E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStatsPlayerComponent*                  StatsPlayer;                                       // 0x09E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFallThroughComponent*                  FallThrough;                                       // 0x09F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractComponent*                     Interact;                                          // 0x09F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHookComponent*                         Hook_Component;                                    // 0x0A00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWallGrabComponent*                     Wall_Grab_Component;                               // 0x0A08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URepulsionPlayerComponent*              Repulsion_Player_Component;                        // 0x0A10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAutoClimbComponent*                    Auto_Climb_Component;                              // 0x0A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USummonComponent*                       Summon;                                            // 0x0A20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void HealingItemsRestored(int32 RestoredCount);
	void LevelValueChanged(int32 Level);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CharacterZion_Player_C">();
	}
	static class ABP_CharacterZion_Player_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CharacterZion_Player_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(ABP_CharacterZion_Player_C) == 0x000010, "Wrong alignment on ABP_CharacterZion_Player_C");
static_assert(sizeof(ABP_CharacterZion_Player_C) == 0x000A30, "Wrong size on ABP_CharacterZion_Player_C");
static_assert(offsetof(ABP_CharacterZion_Player_C, DashCharge) == 0x0009A0, "Member 'ABP_CharacterZion_Player_C::DashCharge' has a wrong offset!");
static_assert(offsetof(ABP_CharacterZion_Player_C, SummonRestPointSpirit) == 0x0009A8, "Member 'ABP_CharacterZion_Player_C::SummonRestPointSpirit' has a wrong offset!");
static_assert(offsetof(ABP_CharacterZion_Player_C, SummonIdleSpirit) == 0x0009B0, "Member 'ABP_CharacterZion_Player_C::SummonIdleSpirit' has a wrong offset!");
static_assert(offsetof(ABP_CharacterZion_Player_C, WakeTrigger) == 0x0009B8, "Member 'ABP_CharacterZion_Player_C::WakeTrigger' has a wrong offset!");
static_assert(offsetof(ABP_CharacterZion_Player_C, SleepActivator) == 0x0009C0, "Member 'ABP_CharacterZion_Player_C::SleepActivator' has a wrong offset!");
static_assert(offsetof(ABP_CharacterZion_Player_C, RestoreHealItemsWidget) == 0x0009C8, "Member 'ABP_CharacterZion_Player_C::RestoreHealItemsWidget' has a wrong offset!");
static_assert(offsetof(ABP_CharacterZion_Player_C, LevelUpWidget) == 0x0009D0, "Member 'ABP_CharacterZion_Player_C::LevelUpWidget' has a wrong offset!");
static_assert(offsetof(ABP_CharacterZion_Player_C, FluidInteraction) == 0x0009D8, "Member 'ABP_CharacterZion_Player_C::FluidInteraction' has a wrong offset!");
static_assert(offsetof(ABP_CharacterZion_Player_C, StatSP) == 0x0009E0, "Member 'ABP_CharacterZion_Player_C::StatSP' has a wrong offset!");
static_assert(offsetof(ABP_CharacterZion_Player_C, StatsPlayer) == 0x0009E8, "Member 'ABP_CharacterZion_Player_C::StatsPlayer' has a wrong offset!");
static_assert(offsetof(ABP_CharacterZion_Player_C, FallThrough) == 0x0009F0, "Member 'ABP_CharacterZion_Player_C::FallThrough' has a wrong offset!");
static_assert(offsetof(ABP_CharacterZion_Player_C, Interact) == 0x0009F8, "Member 'ABP_CharacterZion_Player_C::Interact' has a wrong offset!");
static_assert(offsetof(ABP_CharacterZion_Player_C, Hook_Component) == 0x000A00, "Member 'ABP_CharacterZion_Player_C::Hook_Component' has a wrong offset!");
static_assert(offsetof(ABP_CharacterZion_Player_C, Wall_Grab_Component) == 0x000A08, "Member 'ABP_CharacterZion_Player_C::Wall_Grab_Component' has a wrong offset!");
static_assert(offsetof(ABP_CharacterZion_Player_C, Repulsion_Player_Component) == 0x000A10, "Member 'ABP_CharacterZion_Player_C::Repulsion_Player_Component' has a wrong offset!");
static_assert(offsetof(ABP_CharacterZion_Player_C, Auto_Climb_Component) == 0x000A18, "Member 'ABP_CharacterZion_Player_C::Auto_Climb_Component' has a wrong offset!");
static_assert(offsetof(ABP_CharacterZion_Player_C, Summon) == 0x000A20, "Member 'ABP_CharacterZion_Player_C::Summon' has a wrong offset!");

}

