#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterZionSpirit_Auto

#include "Basic.hpp"

#include "BP_CharacterZionSpirit_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CharacterZionSpirit_Auto.BP_CharacterZionSpirit_Auto_C
// 0x0010 (0x0C30 - 0x0C20)
class ABP_CharacterZionSpirit_Auto_C : public ABP_CharacterZionSpirit_C
{
public:
	class UBoxComponent*                          PhysicsVolumeDetector;                             // 0x0C18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFollowTargetComponent*                 FollowTarget;                                      // 0x0C20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpiritAutoComponent*                   SpiritAuto;                                        // 0x0C28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CharacterZionSpirit_Auto_C">();
	}
	static class ABP_CharacterZionSpirit_Auto_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CharacterZionSpirit_Auto_C>();
	}
};
static_assert(alignof(ABP_CharacterZionSpirit_Auto_C) == 0x000010, "Wrong alignment on ABP_CharacterZionSpirit_Auto_C");
static_assert(sizeof(ABP_CharacterZionSpirit_Auto_C) == 0x000C30, "Wrong size on ABP_CharacterZionSpirit_Auto_C");
static_assert(offsetof(ABP_CharacterZionSpirit_Auto_C, PhysicsVolumeDetector) == 0x000C18, "Member 'ABP_CharacterZionSpirit_Auto_C::PhysicsVolumeDetector' has a wrong offset!");
static_assert(offsetof(ABP_CharacterZionSpirit_Auto_C, FollowTarget) == 0x000C20, "Member 'ABP_CharacterZionSpirit_Auto_C::FollowTarget' has a wrong offset!");
static_assert(offsetof(ABP_CharacterZionSpirit_Auto_C, SpiritAuto) == 0x000C28, "Member 'ABP_CharacterZionSpirit_Auto_C::SpiritAuto' has a wrong offset!");

}

