#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Command_FallThrough

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Command_FallThrough.BP_Command_FallThrough_C.ExecuteUbergraph_BP_Command_FallThrough
// 0x0110 (0x0110 - 0x0000)
struct BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_PawnOwner;                            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFallThroughComponent*                  CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOneWayPlatform*                        K2Node_DynamicCast_AsOne_Way_Platform;             // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFallThrough_ReturnValue;                // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough) == 0x000008, "Wrong alignment on BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough");
static_assert(sizeof(BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough) == 0x000110, "Wrong size on BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough");
static_assert(offsetof(BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough, EntryPoint) == 0x000000, "Member 'BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough, K2Node_Event_PawnOwner) == 0x000008, "Member 'BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough::K2Node_Event_PawnOwner' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough, K2Node_DynamicCast_AsCharacter) == 0x000010, "Member 'BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough, CallFunc_BreakHitResult_bBlockingHit) == 0x000029, "Member 'BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough, CallFunc_BreakHitResult_bInitialOverlap) == 0x00002A, "Member 'BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough, CallFunc_BreakHitResult_Time) == 0x00002C, "Member 'BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough, CallFunc_BreakHitResult_Distance) == 0x000030, "Member 'BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough, CallFunc_BreakHitResult_Location) == 0x000038, "Member 'BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough, CallFunc_BreakHitResult_ImpactPoint) == 0x000050, "Member 'BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough, CallFunc_BreakHitResult_Normal) == 0x000068, "Member 'BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough, CallFunc_BreakHitResult_ImpactNormal) == 0x000080, "Member 'BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough, CallFunc_BreakHitResult_PhysMat) == 0x000098, "Member 'BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough, CallFunc_BreakHitResult_HitActor) == 0x0000A0, "Member 'BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough, CallFunc_BreakHitResult_HitComponent) == 0x0000A8, "Member 'BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough, CallFunc_BreakHitResult_HitBoneName) == 0x0000B0, "Member 'BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough, CallFunc_BreakHitResult_BoneName) == 0x0000B8, "Member 'BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough, CallFunc_BreakHitResult_HitItem) == 0x0000C0, "Member 'BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough, CallFunc_BreakHitResult_ElementIndex) == 0x0000C4, "Member 'BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough, CallFunc_BreakHitResult_FaceIndex) == 0x0000C8, "Member 'BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough, CallFunc_BreakHitResult_TraceStart) == 0x0000D0, "Member 'BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough, CallFunc_BreakHitResult_TraceEnd) == 0x0000E8, "Member 'BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough, K2Node_DynamicCast_AsOne_Way_Platform) == 0x000100, "Member 'BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough::K2Node_DynamicCast_AsOne_Way_Platform' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough, K2Node_DynamicCast_bSuccess_1) == 0x000108, "Member 'BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough, CallFunc_IsFallThrough_ReturnValue) == 0x000109, "Member 'BP_Command_FallThrough_C_ExecuteUbergraph_BP_Command_FallThrough::CallFunc_IsFallThrough_ReturnValue' has a wrong offset!");

// Function BP_Command_FallThrough.BP_Command_FallThrough_C.OnCanBeStarted
// 0x0250 (0x0250 - 0x0000)
struct BP_Command_FallThrough_C_OnCanBeStarted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScaledCapsuleRadius_ReturnValue;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnCanBeStarted_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOneWayPlatform*                        K2Node_DynamicCast_AsOne_Way_Platform;             // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0120(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsFallThrough_ReturnValue;                // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_BoxTraceSingle_OutHit;                    // 0x0138(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BoxTraceSingle_ReturnValue;               // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_233[0x5];                                      // 0x0233(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeVector_X_ImplicitCast;                // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Y_ImplicitCast;                // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Z_ImplicitCast;                // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Command_FallThrough_C_OnCanBeStarted) == 0x000008, "Wrong alignment on BP_Command_FallThrough_C_OnCanBeStarted");
static_assert(sizeof(BP_Command_FallThrough_C_OnCanBeStarted) == 0x000250, "Wrong size on BP_Command_FallThrough_C_OnCanBeStarted");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, ReturnValue) == 0x000000, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, CallFunc_GetScaledCapsuleRadius_ReturnValue) == 0x000004, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::CallFunc_GetScaledCapsuleRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, CallFunc_MakeVector_ReturnValue) == 0x000008, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, CallFunc_OnCanBeStarted_ReturnValue) == 0x000020, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::CallFunc_OnCanBeStarted_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, CallFunc_BreakHitResult_bBlockingHit) == 0x000021, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, CallFunc_BreakHitResult_bInitialOverlap) == 0x000022, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, CallFunc_BreakHitResult_Time) == 0x000024, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, CallFunc_BreakHitResult_Distance) == 0x000028, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, CallFunc_BreakHitResult_Location) == 0x000030, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, CallFunc_BreakHitResult_ImpactPoint) == 0x000048, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, CallFunc_BreakHitResult_Normal) == 0x000060, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, CallFunc_BreakHitResult_ImpactNormal) == 0x000078, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, CallFunc_BreakHitResult_PhysMat) == 0x000090, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, CallFunc_BreakHitResult_HitActor) == 0x000098, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, CallFunc_BreakHitResult_HitComponent) == 0x0000A0, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, CallFunc_BreakHitResult_HitBoneName) == 0x0000A8, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, CallFunc_BreakHitResult_BoneName) == 0x0000B0, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, CallFunc_BreakHitResult_HitItem) == 0x0000B8, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, CallFunc_BreakHitResult_ElementIndex) == 0x0000BC, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, CallFunc_BreakHitResult_FaceIndex) == 0x0000C0, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, CallFunc_BreakHitResult_TraceStart) == 0x0000C8, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, CallFunc_BreakHitResult_TraceEnd) == 0x0000E0, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, K2Node_DynamicCast_AsOne_Way_Platform) == 0x0000F8, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::K2Node_DynamicCast_AsOne_Way_Platform' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, CallFunc_Add_VectorVector_ReturnValue) == 0x000108, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, K2Node_MakeArray_Array) == 0x000120, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, CallFunc_IsFallThrough_ReturnValue) == 0x000130, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::CallFunc_IsFallThrough_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, CallFunc_BoxTraceSingle_OutHit) == 0x000138, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::CallFunc_BoxTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, CallFunc_BoxTraceSingle_ReturnValue) == 0x000230, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::CallFunc_BoxTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, CallFunc_BooleanAND_ReturnValue) == 0x000231, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, CallFunc_Not_PreBool_ReturnValue) == 0x000232, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, CallFunc_MakeVector_X_ImplicitCast) == 0x000238, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::CallFunc_MakeVector_X_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, CallFunc_MakeVector_Y_ImplicitCast) == 0x000240, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::CallFunc_MakeVector_Y_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Command_FallThrough_C_OnCanBeStarted, CallFunc_MakeVector_Z_ImplicitCast) == 0x000248, "Member 'BP_Command_FallThrough_C_OnCanBeStarted::CallFunc_MakeVector_Z_ImplicitCast' has a wrong offset!");

// Function BP_Command_FallThrough.BP_Command_FallThrough_C.OnInitialize
// 0x0008 (0x0008 - 0x0000)
struct BP_Command_FallThrough_C_OnInitialize final
{
public:
	class APawn*                                  PawnOwner;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Command_FallThrough_C_OnInitialize) == 0x000008, "Wrong alignment on BP_Command_FallThrough_C_OnInitialize");
static_assert(sizeof(BP_Command_FallThrough_C_OnInitialize) == 0x000008, "Wrong size on BP_Command_FallThrough_C_OnInitialize");
static_assert(offsetof(BP_Command_FallThrough_C_OnInitialize, PawnOwner) == 0x000000, "Member 'BP_Command_FallThrough_C_OnInitialize::PawnOwner' has a wrong offset!");

}

