#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Command_Jump_Swimming

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Command_Jump_Swimming.BP_Command_Jump_Swimming_C.OnCanBeStarted
// 0x0050 (0x0050 - 0x0000)
struct BP_Command_Jump_Swimming_C_OnCanBeStarted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetCharacter_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnCanBeStarted_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Command_Jump_Swimming_C_OnCanBeStarted) == 0x000008, "Wrong alignment on BP_Command_Jump_Swimming_C_OnCanBeStarted");
static_assert(sizeof(BP_Command_Jump_Swimming_C_OnCanBeStarted) == 0x000050, "Wrong size on BP_Command_Jump_Swimming_C_OnCanBeStarted");
static_assert(offsetof(BP_Command_Jump_Swimming_C_OnCanBeStarted, ReturnValue) == 0x000000, "Member 'BP_Command_Jump_Swimming_C_OnCanBeStarted::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Command_Jump_Swimming_C_OnCanBeStarted, CallFunc_GetCharacter_ReturnValue) == 0x000008, "Member 'BP_Command_Jump_Swimming_C_OnCanBeStarted::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Command_Jump_Swimming_C_OnCanBeStarted, CallFunc_OnCanBeStarted_ReturnValue) == 0x000010, "Member 'BP_Command_Jump_Swimming_C_OnCanBeStarted::CallFunc_OnCanBeStarted_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Command_Jump_Swimming_C_OnCanBeStarted, CallFunc_GetVelocity_ReturnValue) == 0x000018, "Member 'BP_Command_Jump_Swimming_C_OnCanBeStarted::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Command_Jump_Swimming_C_OnCanBeStarted, CallFunc_BreakVector_X) == 0x000030, "Member 'BP_Command_Jump_Swimming_C_OnCanBeStarted::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Command_Jump_Swimming_C_OnCanBeStarted, CallFunc_BreakVector_Y) == 0x000038, "Member 'BP_Command_Jump_Swimming_C_OnCanBeStarted::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Command_Jump_Swimming_C_OnCanBeStarted, CallFunc_BreakVector_Z) == 0x000040, "Member 'BP_Command_Jump_Swimming_C_OnCanBeStarted::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Command_Jump_Swimming_C_OnCanBeStarted, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000048, "Member 'BP_Command_Jump_Swimming_C_OnCanBeStarted::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Command_Jump_Swimming_C_OnCanBeStarted, CallFunc_BooleanAND_ReturnValue) == 0x000049, "Member 'BP_Command_Jump_Swimming_C_OnCanBeStarted::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

