#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Command_HighJump_Charge

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Command_HighJump_Charge.BP_Command_HighJump_Charge_C
// 0x0060 (0x0140 - 0x00E0)
class UBP_Command_HighJump_Charge_C final : public UCommandChargeReleaseInput
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSubclassOf<class ACharacterZionSpirit>       SpiritClass;                                       // 0x00E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<TSubclassOf<class UCommand>>           CommandClasses;                                    // 0x00F0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FSpiritSummonParameters                SummonParameters;                                  // 0x0100(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor)
	class ACharacterZionSpirit*                   Spirit;                                            // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Command_HighJump_Charge(int32 EntryPoint);
	void OnChargeLevelUp(int32 NewChargeLevel);
	void OnFinish(ECommandFinishType FinishType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Command_HighJump_Charge_C">();
	}
	static class UBP_Command_HighJump_Charge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Command_HighJump_Charge_C>();
	}
};
static_assert(alignof(UBP_Command_HighJump_Charge_C) == 0x000008, "Wrong alignment on UBP_Command_HighJump_Charge_C");
static_assert(sizeof(UBP_Command_HighJump_Charge_C) == 0x000140, "Wrong size on UBP_Command_HighJump_Charge_C");
static_assert(offsetof(UBP_Command_HighJump_Charge_C, UberGraphFrame) == 0x0000E0, "Member 'UBP_Command_HighJump_Charge_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Command_HighJump_Charge_C, SpiritClass) == 0x0000E8, "Member 'UBP_Command_HighJump_Charge_C::SpiritClass' has a wrong offset!");
static_assert(offsetof(UBP_Command_HighJump_Charge_C, CommandClasses) == 0x0000F0, "Member 'UBP_Command_HighJump_Charge_C::CommandClasses' has a wrong offset!");
static_assert(offsetof(UBP_Command_HighJump_Charge_C, SummonParameters) == 0x000100, "Member 'UBP_Command_HighJump_Charge_C::SummonParameters' has a wrong offset!");
static_assert(offsetof(UBP_Command_HighJump_Charge_C, Spirit) == 0x000138, "Member 'UBP_Command_HighJump_Charge_C::Spirit' has a wrong offset!");

}

