#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Command_Summon_SP_Auto

#include "Basic.hpp"

#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function BP_Command_Summon_SP_Auto.BP_Command_Summon_SP_Auto_C.ExecuteUbergraph_BP_Command_Summon_SP_Auto
// 0x0040 (0x0040 - 0x0000)
struct BP_Command_Summon_SP_Auto_C_ExecuteUbergraph_BP_Command_Summon_SP_Auto final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommandFinishType                            K2Node_Event_FinishType;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetCharacter_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USummonComponent*                       CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSpiritSummoned_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetCharacter_ReturnValue_1;               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USummonComponent*                       CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommandComponent*                      CallFunc_GetComponentByClass_ReturnValue_2;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Command_Summon_SP_Auto_C_ExecuteUbergraph_BP_Command_Summon_SP_Auto) == 0x000008, "Wrong alignment on BP_Command_Summon_SP_Auto_C_ExecuteUbergraph_BP_Command_Summon_SP_Auto");
static_assert(sizeof(BP_Command_Summon_SP_Auto_C_ExecuteUbergraph_BP_Command_Summon_SP_Auto) == 0x000040, "Wrong size on BP_Command_Summon_SP_Auto_C_ExecuteUbergraph_BP_Command_Summon_SP_Auto");
static_assert(offsetof(BP_Command_Summon_SP_Auto_C_ExecuteUbergraph_BP_Command_Summon_SP_Auto, EntryPoint) == 0x000000, "Member 'BP_Command_Summon_SP_Auto_C_ExecuteUbergraph_BP_Command_Summon_SP_Auto::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Command_Summon_SP_Auto_C_ExecuteUbergraph_BP_Command_Summon_SP_Auto, K2Node_Event_FinishType) == 0x000004, "Member 'BP_Command_Summon_SP_Auto_C_ExecuteUbergraph_BP_Command_Summon_SP_Auto::K2Node_Event_FinishType' has a wrong offset!");
static_assert(offsetof(BP_Command_Summon_SP_Auto_C_ExecuteUbergraph_BP_Command_Summon_SP_Auto, CallFunc_GetCharacter_ReturnValue) == 0x000008, "Member 'BP_Command_Summon_SP_Auto_C_ExecuteUbergraph_BP_Command_Summon_SP_Auto::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Command_Summon_SP_Auto_C_ExecuteUbergraph_BP_Command_Summon_SP_Auto, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'BP_Command_Summon_SP_Auto_C_ExecuteUbergraph_BP_Command_Summon_SP_Auto::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Command_Summon_SP_Auto_C_ExecuteUbergraph_BP_Command_Summon_SP_Auto, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'BP_Command_Summon_SP_Auto_C_ExecuteUbergraph_BP_Command_Summon_SP_Auto::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Command_Summon_SP_Auto_C_ExecuteUbergraph_BP_Command_Summon_SP_Auto, CallFunc_IsSpiritSummoned_ReturnValue) == 0x000020, "Member 'BP_Command_Summon_SP_Auto_C_ExecuteUbergraph_BP_Command_Summon_SP_Auto::CallFunc_IsSpiritSummoned_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Command_Summon_SP_Auto_C_ExecuteUbergraph_BP_Command_Summon_SP_Auto, CallFunc_BooleanAND_ReturnValue) == 0x000021, "Member 'BP_Command_Summon_SP_Auto_C_ExecuteUbergraph_BP_Command_Summon_SP_Auto::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Command_Summon_SP_Auto_C_ExecuteUbergraph_BP_Command_Summon_SP_Auto, CallFunc_GetCharacter_ReturnValue_1) == 0x000028, "Member 'BP_Command_Summon_SP_Auto_C_ExecuteUbergraph_BP_Command_Summon_SP_Auto::CallFunc_GetCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Command_Summon_SP_Auto_C_ExecuteUbergraph_BP_Command_Summon_SP_Auto, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000030, "Member 'BP_Command_Summon_SP_Auto_C_ExecuteUbergraph_BP_Command_Summon_SP_Auto::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Command_Summon_SP_Auto_C_ExecuteUbergraph_BP_Command_Summon_SP_Auto, CallFunc_GetComponentByClass_ReturnValue_2) == 0x000038, "Member 'BP_Command_Summon_SP_Auto_C_ExecuteUbergraph_BP_Command_Summon_SP_Auto::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");

// Function BP_Command_Summon_SP_Auto.BP_Command_Summon_SP_Auto_C.OnFinish
// 0x0001 (0x0001 - 0x0000)
struct BP_Command_Summon_SP_Auto_C_OnFinish final
{
public:
	ECommandFinishType                            FinishType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Command_Summon_SP_Auto_C_OnFinish) == 0x000001, "Wrong alignment on BP_Command_Summon_SP_Auto_C_OnFinish");
static_assert(sizeof(BP_Command_Summon_SP_Auto_C_OnFinish) == 0x000001, "Wrong size on BP_Command_Summon_SP_Auto_C_OnFinish");
static_assert(offsetof(BP_Command_Summon_SP_Auto_C_OnFinish, FinishType) == 0x000000, "Member 'BP_Command_Summon_SP_Auto_C_OnFinish::FinishType' has a wrong offset!");

}

