#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterZion_Player

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CharacterZion_Player.BP_CharacterZion_Player_C.HealingItemsRestored
// 0x0028 (0x0028 - 0x0000)
struct BP_CharacterZion_Player_C_HealingItemsRestored final
{
public:
	int32                                         RestoredCount;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_WorldSpace_RestoreHealingItems_C*  K2Node_DynamicCast_AsWBP_World_Space_Restore_Healing_Items; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterZion_Player_C_HealingItemsRestored) == 0x000008, "Wrong alignment on BP_CharacterZion_Player_C_HealingItemsRestored");
static_assert(sizeof(BP_CharacterZion_Player_C_HealingItemsRestored) == 0x000028, "Wrong size on BP_CharacterZion_Player_C_HealingItemsRestored");
static_assert(offsetof(BP_CharacterZion_Player_C_HealingItemsRestored, RestoredCount) == 0x000000, "Member 'BP_CharacterZion_Player_C_HealingItemsRestored::RestoredCount' has a wrong offset!");
static_assert(offsetof(BP_CharacterZion_Player_C_HealingItemsRestored, CallFunc_GetWidget_ReturnValue) == 0x000008, "Member 'BP_CharacterZion_Player_C_HealingItemsRestored::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterZion_Player_C_HealingItemsRestored, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_CharacterZion_Player_C_HealingItemsRestored::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterZion_Player_C_HealingItemsRestored, K2Node_DynamicCast_AsWBP_World_Space_Restore_Healing_Items) == 0x000018, "Member 'BP_CharacterZion_Player_C_HealingItemsRestored::K2Node_DynamicCast_AsWBP_World_Space_Restore_Healing_Items' has a wrong offset!");
static_assert(offsetof(BP_CharacterZion_Player_C_HealingItemsRestored, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_CharacterZion_Player_C_HealingItemsRestored::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_CharacterZion_Player.BP_CharacterZion_Player_C.LevelValueChanged
// 0x0028 (0x0028 - 0x0000)
struct BP_CharacterZion_Player_C_LevelValueChanged final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_WorldSpace_LevelUp_C*              K2Node_DynamicCast_AsWBP_World_Space_Level_Up;     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterZion_Player_C_LevelValueChanged) == 0x000008, "Wrong alignment on BP_CharacterZion_Player_C_LevelValueChanged");
static_assert(sizeof(BP_CharacterZion_Player_C_LevelValueChanged) == 0x000028, "Wrong size on BP_CharacterZion_Player_C_LevelValueChanged");
static_assert(offsetof(BP_CharacterZion_Player_C_LevelValueChanged, Level) == 0x000000, "Member 'BP_CharacterZion_Player_C_LevelValueChanged::Level' has a wrong offset!");
static_assert(offsetof(BP_CharacterZion_Player_C_LevelValueChanged, CallFunc_GetWidget_ReturnValue) == 0x000008, "Member 'BP_CharacterZion_Player_C_LevelValueChanged::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterZion_Player_C_LevelValueChanged, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_CharacterZion_Player_C_LevelValueChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CharacterZion_Player_C_LevelValueChanged, K2Node_DynamicCast_AsWBP_World_Space_Level_Up) == 0x000018, "Member 'BP_CharacterZion_Player_C_LevelValueChanged::K2Node_DynamicCast_AsWBP_World_Space_Level_Up' has a wrong offset!");
static_assert(offsetof(BP_CharacterZion_Player_C_LevelValueChanged, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_CharacterZion_Player_C_LevelValueChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

