#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Command_WallDash_Charge

#include "Basic.hpp"

#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function BP_Command_WallDash_Charge.BP_Command_WallDash_Charge_C.ExecuteUbergraph_BP_Command_WallDash_Charge
// 0x0030 (0x0030 - 0x0000)
struct BP_Command_WallDash_Charge_C_ExecuteUbergraph_BP_Command_WallDash_Charge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommandFinishType                            K2Node_Event_FinishType;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChargeLevel_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetCharacter_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWallGrabComponent*                     CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Command_WallDash_Charge_C_ExecuteUbergraph_BP_Command_WallDash_Charge) == 0x000008, "Wrong alignment on BP_Command_WallDash_Charge_C_ExecuteUbergraph_BP_Command_WallDash_Charge");
static_assert(sizeof(BP_Command_WallDash_Charge_C_ExecuteUbergraph_BP_Command_WallDash_Charge) == 0x000030, "Wrong size on BP_Command_WallDash_Charge_C_ExecuteUbergraph_BP_Command_WallDash_Charge");
static_assert(offsetof(BP_Command_WallDash_Charge_C_ExecuteUbergraph_BP_Command_WallDash_Charge, EntryPoint) == 0x000000, "Member 'BP_Command_WallDash_Charge_C_ExecuteUbergraph_BP_Command_WallDash_Charge::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Command_WallDash_Charge_C_ExecuteUbergraph_BP_Command_WallDash_Charge, K2Node_Event_FinishType) == 0x000004, "Member 'BP_Command_WallDash_Charge_C_ExecuteUbergraph_BP_Command_WallDash_Charge::K2Node_Event_FinishType' has a wrong offset!");
static_assert(offsetof(BP_Command_WallDash_Charge_C_ExecuteUbergraph_BP_Command_WallDash_Charge, CallFunc_GetChargeLevel_ReturnValue) == 0x000008, "Member 'BP_Command_WallDash_Charge_C_ExecuteUbergraph_BP_Command_WallDash_Charge::CallFunc_GetChargeLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Command_WallDash_Charge_C_ExecuteUbergraph_BP_Command_WallDash_Charge, CallFunc_GetCharacter_ReturnValue) == 0x000010, "Member 'BP_Command_WallDash_Charge_C_ExecuteUbergraph_BP_Command_WallDash_Charge::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Command_WallDash_Charge_C_ExecuteUbergraph_BP_Command_WallDash_Charge, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000018, "Member 'BP_Command_WallDash_Charge_C_ExecuteUbergraph_BP_Command_WallDash_Charge::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Command_WallDash_Charge_C_ExecuteUbergraph_BP_Command_WallDash_Charge, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'BP_Command_WallDash_Charge_C_ExecuteUbergraph_BP_Command_WallDash_Charge::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Command_WallDash_Charge_C_ExecuteUbergraph_BP_Command_WallDash_Charge, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'BP_Command_WallDash_Charge_C_ExecuteUbergraph_BP_Command_WallDash_Charge::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_Command_WallDash_Charge.BP_Command_WallDash_Charge_C.OnFinish
// 0x0001 (0x0001 - 0x0000)
struct BP_Command_WallDash_Charge_C_OnFinish final
{
public:
	ECommandFinishType                            FinishType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Command_WallDash_Charge_C_OnFinish) == 0x000001, "Wrong alignment on BP_Command_WallDash_Charge_C_OnFinish");
static_assert(sizeof(BP_Command_WallDash_Charge_C_OnFinish) == 0x000001, "Wrong size on BP_Command_WallDash_Charge_C_OnFinish");
static_assert(offsetof(BP_Command_WallDash_Charge_C_OnFinish, FinishType) == 0x000000, "Member 'BP_Command_WallDash_Charge_C_OnFinish::FinishType' has a wrong offset!");

}

