#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Command_FallThrough

#include "Basic.hpp"

#include "BP_Command_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Command_FallThrough.BP_Command_FallThrough_C
// 0x0018 (0x00C0 - 0x00A8)
class UBP_Command_FallThrough_C final : public UBP_Command_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFallThroughComponent*                  CachedFallThroughComponent;                        // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class ACharacter*                             Character;                                         // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Command_FallThrough(int32 EntryPoint);
	bool OnCanBeStarted();
	void OnInitialize(class APawn* PawnOwner);
	void OnStart();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Command_FallThrough_C">();
	}
	static class UBP_Command_FallThrough_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Command_FallThrough_C>();
	}
};
static_assert(alignof(UBP_Command_FallThrough_C) == 0x000008, "Wrong alignment on UBP_Command_FallThrough_C");
static_assert(sizeof(UBP_Command_FallThrough_C) == 0x0000C0, "Wrong size on UBP_Command_FallThrough_C");
static_assert(offsetof(UBP_Command_FallThrough_C, UberGraphFrame) == 0x0000A8, "Member 'UBP_Command_FallThrough_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Command_FallThrough_C, CachedFallThroughComponent) == 0x0000B0, "Member 'UBP_Command_FallThrough_C::CachedFallThroughComponent' has a wrong offset!");
static_assert(offsetof(UBP_Command_FallThrough_C, Character) == 0x0000B8, "Member 'UBP_Command_FallThrough_C::Character' has a wrong offset!");

}

