#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Door

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Door.BP_Door_C
// 0x0038 (0x02C8 - 0x0290)
class ABP_Door_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URenderStateComponent*                  RenderState;                                       // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DoorContainer;                                     // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          StartOpen;                                         // 0x02B8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOpen;                                            // 0x02B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          Initialized;                                       // 0x02BA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_2BB[0x5];                                      // 0x02BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DelayBeforeColliderDisable;                        // 0x02C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Close(bool RequestInstant, bool Force);
	void ExecuteUbergraph_BP_Door(int32 EntryPoint);
	void IsMoving(bool* bMoving);
	void OnClose(bool RequestInstant);
	void OnOpen(bool RequestInstant);
	void Open(bool RequestInstant, bool Force);
	void ReceiveBeginPlay();
	void SetColliderState(bool bEnable);
	void Toggle();

	void GetIsOpen(bool* IsOpen_0) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Door_C">();
	}
	static class ABP_Door_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Door_C>();
	}
};
static_assert(alignof(ABP_Door_C) == 0x000008, "Wrong alignment on ABP_Door_C");
static_assert(sizeof(ABP_Door_C) == 0x0002C8, "Wrong size on ABP_Door_C");
static_assert(offsetof(ABP_Door_C, UberGraphFrame) == 0x000290, "Member 'ABP_Door_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Door_C, RenderState) == 0x000298, "Member 'ABP_Door_C::RenderState' has a wrong offset!");
static_assert(offsetof(ABP_Door_C, Scene) == 0x0002A0, "Member 'ABP_Door_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_Door_C, Box) == 0x0002A8, "Member 'ABP_Door_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_Door_C, DoorContainer) == 0x0002B0, "Member 'ABP_Door_C::DoorContainer' has a wrong offset!");
static_assert(offsetof(ABP_Door_C, StartOpen) == 0x0002B8, "Member 'ABP_Door_C::StartOpen' has a wrong offset!");
static_assert(offsetof(ABP_Door_C, IsOpen) == 0x0002B9, "Member 'ABP_Door_C::IsOpen' has a wrong offset!");
static_assert(offsetof(ABP_Door_C, Initialized) == 0x0002BA, "Member 'ABP_Door_C::Initialized' has a wrong offset!");
static_assert(offsetof(ABP_Door_C, DelayBeforeColliderDisable) == 0x0002C0, "Member 'ABP_Door_C::DelayBeforeColliderDisable' has a wrong offset!");

}

