#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Door_Spine_Magic

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Door_Spine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Door_Spine_Magic.BP_Door_Spine_Magic_C
// 0x0018 (0x0350 - 0x0338)
class ABP_Door_Spine_Magic_C final : public ABP_Door_Spine_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Door_Spine_Magic_C;              // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFMODAudioComponent*                    FMODAudio;                                         // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Door_MagicCircle_Loop;                          // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void OnOpen(bool RequestInstant);
	void OnClose(bool RequestInstant);
	void ExecuteUbergraph_BP_Door_Spine_Magic(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Door_Spine_Magic_C">();
	}
	static class ABP_Door_Spine_Magic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Door_Spine_Magic_C>();
	}
};
static_assert(alignof(ABP_Door_Spine_Magic_C) == 0x000008, "Wrong alignment on ABP_Door_Spine_Magic_C");
static_assert(sizeof(ABP_Door_Spine_Magic_C) == 0x000350, "Wrong size on ABP_Door_Spine_Magic_C");
static_assert(offsetof(ABP_Door_Spine_Magic_C, UberGraphFrame_BP_Door_Spine_Magic_C) == 0x000338, "Member 'ABP_Door_Spine_Magic_C::UberGraphFrame_BP_Door_Spine_Magic_C' has a wrong offset!");
static_assert(offsetof(ABP_Door_Spine_Magic_C, FMODAudio) == 0x000340, "Member 'ABP_Door_Spine_Magic_C::FMODAudio' has a wrong offset!");
static_assert(offsetof(ABP_Door_Spine_Magic_C, NS_Door_MagicCircle_Loop) == 0x000348, "Member 'ABP_Door_Spine_Magic_C::NS_Door_MagicCircle_Loop' has a wrong offset!");

}

