#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Elevator_StreetMain

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MovieScene_structs.hpp"
#include "BP_Elevator_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Elevator_StreetMain.BP_Elevator_StreetMain_C
// 0x00C8 (0x04F8 - 0x0430)
class ABP_Elevator_StreetMain_C final : public ABP_Elevator_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Elevator_StreetMain_C;           // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_110_Elevator_51;                                 // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_110_Elevator_54;                                 // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_110_Elevator_53;                                 // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFMODAudioComponent*                    FMODAudio_DoorLeft;                                // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFMODAudioComponent*                    FMODAudio_DoorRight;                               // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URenderLayerComponent*                  RenderLayer;                                       // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActorSequenceComponent*                Sequence_DoorsClose;                               // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPaperSpriteComponent*                  DoorRight;                                         // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPaperSpriteComponent*                  DoorLeft;                                          // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WallRight;                                         // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WallLeft;                                          // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RoofBlocker;                                       // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rope;                                              // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    RopeAttachPointBillboard;                          // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Visuals;                                           // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULevelSequence*                         LevelSequence;                                     // 0x04B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMovieSceneSequencePlaybackSettings    LevelSequenceSettings;                             // 0x04C0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor)
	class AStaticVolume_CameraModifier*           CameraModifierVolume;                              // 0x04E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   LevelSequencePlayer;                               // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void SetWallCollisionEnable(bool bEnable);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_Elevator_StreetMain(int32 EntryPoint);
	void BndEvt__BP_Elevator_StreetMain_ElevatorMovementComponent_K2Node_ComponentBoundEvent_1_ElevatorMovementEvent__DelegateSignature(bool bInstant, bool bWasMoving);
	void BndEvt__BP_Elevator_StreetMain_ElevatorMovementComponent_K2Node_ComponentBoundEvent_0_ElevatorMovementEvent__DelegateSignature(bool bInstant, bool bWasMoving);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Elevator_StreetMain_C">();
	}
	static class ABP_Elevator_StreetMain_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Elevator_StreetMain_C>();
	}
};
static_assert(alignof(ABP_Elevator_StreetMain_C) == 0x000008, "Wrong alignment on ABP_Elevator_StreetMain_C");
static_assert(sizeof(ABP_Elevator_StreetMain_C) == 0x0004F8, "Wrong size on ABP_Elevator_StreetMain_C");
static_assert(offsetof(ABP_Elevator_StreetMain_C, UberGraphFrame_BP_Elevator_StreetMain_C) == 0x000430, "Member 'ABP_Elevator_StreetMain_C::UberGraphFrame_BP_Elevator_StreetMain_C' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_StreetMain_C, StaticMesh) == 0x000438, "Member 'ABP_Elevator_StreetMain_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_StreetMain_C, S_110_Elevator_51) == 0x000440, "Member 'ABP_Elevator_StreetMain_C::S_110_Elevator_51' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_StreetMain_C, S_110_Elevator_54) == 0x000448, "Member 'ABP_Elevator_StreetMain_C::S_110_Elevator_54' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_StreetMain_C, S_110_Elevator_53) == 0x000450, "Member 'ABP_Elevator_StreetMain_C::S_110_Elevator_53' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_StreetMain_C, FMODAudio_DoorLeft) == 0x000458, "Member 'ABP_Elevator_StreetMain_C::FMODAudio_DoorLeft' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_StreetMain_C, FMODAudio_DoorRight) == 0x000460, "Member 'ABP_Elevator_StreetMain_C::FMODAudio_DoorRight' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_StreetMain_C, RenderLayer) == 0x000468, "Member 'ABP_Elevator_StreetMain_C::RenderLayer' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_StreetMain_C, Sequence_DoorsClose) == 0x000470, "Member 'ABP_Elevator_StreetMain_C::Sequence_DoorsClose' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_StreetMain_C, DoorRight) == 0x000478, "Member 'ABP_Elevator_StreetMain_C::DoorRight' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_StreetMain_C, DoorLeft) == 0x000480, "Member 'ABP_Elevator_StreetMain_C::DoorLeft' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_StreetMain_C, WallRight) == 0x000488, "Member 'ABP_Elevator_StreetMain_C::WallRight' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_StreetMain_C, WallLeft) == 0x000490, "Member 'ABP_Elevator_StreetMain_C::WallLeft' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_StreetMain_C, RoofBlocker) == 0x000498, "Member 'ABP_Elevator_StreetMain_C::RoofBlocker' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_StreetMain_C, Rope) == 0x0004A0, "Member 'ABP_Elevator_StreetMain_C::Rope' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_StreetMain_C, RopeAttachPointBillboard) == 0x0004A8, "Member 'ABP_Elevator_StreetMain_C::RopeAttachPointBillboard' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_StreetMain_C, Visuals) == 0x0004B0, "Member 'ABP_Elevator_StreetMain_C::Visuals' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_StreetMain_C, LevelSequence) == 0x0004B8, "Member 'ABP_Elevator_StreetMain_C::LevelSequence' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_StreetMain_C, LevelSequenceSettings) == 0x0004C0, "Member 'ABP_Elevator_StreetMain_C::LevelSequenceSettings' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_StreetMain_C, CameraModifierVolume) == 0x0004E8, "Member 'ABP_Elevator_StreetMain_C::CameraModifierVolume' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_StreetMain_C, LevelSequencePlayer) == 0x0004F0, "Member 'ABP_Elevator_StreetMain_C::LevelSequencePlayer' has a wrong offset!");

}

