#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_e0072_Pod

#include "Basic.hpp"

#include "BP_CharacterZion_Enemy_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_e0072_Pod.BP_e0072_Pod_C
// 0x0030 (0x0A50 - 0x0A20)
class ABP_e0072_Pod_C  : public ABP_CharacterZion_Enemy_C
{
public:
	uint8                                         Pad_A11[0x7];                                      // 0x0A11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBoxComponent*                          Hurtbox;                                           // 0x0A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Hurtbox_Arm;                                       // 0x0A20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpineBoneFollowerComponent*            SpineBoneFollower_Arm;                             // 0x0A28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpineSkinFromFacing*                   SpineSkinFromFacing;                               // 0x0A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpineBoneDriverComponent*              BoneDriver_AttackTarget;                           // 0x0A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UIKBonesComponent*                      IKBones;                                           // 0x0A40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_e0072_Pod_C">();
	}
	static class ABP_e0072_Pod_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_e0072_Pod_C>();
	}
};
static_assert(alignof(ABP_e0072_Pod_C) == 0x000010, "Wrong alignment on ABP_e0072_Pod_C");
static_assert(sizeof(ABP_e0072_Pod_C) == 0x000A50, "Wrong size on ABP_e0072_Pod_C");
static_assert(offsetof(ABP_e0072_Pod_C, Hurtbox) == 0x000A18, "Member 'ABP_e0072_Pod_C::Hurtbox' has a wrong offset!");
static_assert(offsetof(ABP_e0072_Pod_C, Hurtbox_Arm) == 0x000A20, "Member 'ABP_e0072_Pod_C::Hurtbox_Arm' has a wrong offset!");
static_assert(offsetof(ABP_e0072_Pod_C, SpineBoneFollower_Arm) == 0x000A28, "Member 'ABP_e0072_Pod_C::SpineBoneFollower_Arm' has a wrong offset!");
static_assert(offsetof(ABP_e0072_Pod_C, SpineSkinFromFacing) == 0x000A30, "Member 'ABP_e0072_Pod_C::SpineSkinFromFacing' has a wrong offset!");
static_assert(offsetof(ABP_e0072_Pod_C, BoneDriver_AttackTarget) == 0x000A38, "Member 'ABP_e0072_Pod_C::BoneDriver_AttackTarget' has a wrong offset!");
static_assert(offsetof(ABP_e0072_Pod_C, IKBones) == 0x000A40, "Member 'ABP_e0072_Pod_C::IKBones' has a wrong offset!");

}

