#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Elevator_Garden

#include "Basic.hpp"

#include "BP_Elevator_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Elevator_Garden.BP_Elevator_Garden_C
// 0x0080 (0x04B0 - 0x0430)
class ABP_Elevator_Garden_C  : public ABP_Elevator_C
{
public:
	class UStaticMeshComponent*                   S_1004_Elevator_01;                                // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_1004_Elevator_011;                               // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_1004_Elevator_010;                               // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_1004_Elevator_09;                                // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_1004_Elevator_03;                                // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_1004_Elevator_05;                                // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_1004_Elevator_04;                                // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_1004_Elevator_07;                                // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_1004_Elevator_08;                                // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_1004_Elevator_06;                                // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_1004_Elevator_02;                                // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rope;                                              // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    RopeAttachPointBillboard;                          // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Visuals;                                           // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Elevator_Garden_C">();
	}
	static class ABP_Elevator_Garden_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Elevator_Garden_C>();
	}
};
static_assert(alignof(ABP_Elevator_Garden_C) == 0x000008, "Wrong alignment on ABP_Elevator_Garden_C");
static_assert(sizeof(ABP_Elevator_Garden_C) == 0x0004B0, "Wrong size on ABP_Elevator_Garden_C");
static_assert(offsetof(ABP_Elevator_Garden_C, S_1004_Elevator_01) == 0x000430, "Member 'ABP_Elevator_Garden_C::S_1004_Elevator_01' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_Garden_C, S_1004_Elevator_011) == 0x000438, "Member 'ABP_Elevator_Garden_C::S_1004_Elevator_011' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_Garden_C, S_1004_Elevator_010) == 0x000440, "Member 'ABP_Elevator_Garden_C::S_1004_Elevator_010' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_Garden_C, S_1004_Elevator_09) == 0x000448, "Member 'ABP_Elevator_Garden_C::S_1004_Elevator_09' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_Garden_C, S_1004_Elevator_03) == 0x000450, "Member 'ABP_Elevator_Garden_C::S_1004_Elevator_03' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_Garden_C, StaticMesh1) == 0x000458, "Member 'ABP_Elevator_Garden_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_Garden_C, S_1004_Elevator_05) == 0x000460, "Member 'ABP_Elevator_Garden_C::S_1004_Elevator_05' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_Garden_C, StaticMesh) == 0x000468, "Member 'ABP_Elevator_Garden_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_Garden_C, S_1004_Elevator_04) == 0x000470, "Member 'ABP_Elevator_Garden_C::S_1004_Elevator_04' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_Garden_C, S_1004_Elevator_07) == 0x000478, "Member 'ABP_Elevator_Garden_C::S_1004_Elevator_07' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_Garden_C, S_1004_Elevator_08) == 0x000480, "Member 'ABP_Elevator_Garden_C::S_1004_Elevator_08' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_Garden_C, S_1004_Elevator_06) == 0x000488, "Member 'ABP_Elevator_Garden_C::S_1004_Elevator_06' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_Garden_C, S_1004_Elevator_02) == 0x000490, "Member 'ABP_Elevator_Garden_C::S_1004_Elevator_02' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_Garden_C, Rope) == 0x000498, "Member 'ABP_Elevator_Garden_C::Rope' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_Garden_C, RopeAttachPointBillboard) == 0x0004A0, "Member 'ABP_Elevator_Garden_C::RopeAttachPointBillboard' has a wrong offset!");
static_assert(offsetof(ABP_Elevator_Garden_C, Visuals) == 0x0004A8, "Member 'ABP_Elevator_Garden_C::Visuals' has a wrong offset!");

}

