#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Elevator

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Elevator.BP_Elevator_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct BP_Elevator_C_UserConstructionScript final
{
public:
	float                                         CallFunc_GetPlayerDetectionRange_ReturnValue;      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Interactable_ElevatorTrigger_C*     K2Node_DynamicCast_AsBP_Interactable_Elevator_Trigger; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Elevator_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Elevator_C_UserConstructionScript");
static_assert(sizeof(BP_Elevator_C_UserConstructionScript) == 0x000018, "Wrong size on BP_Elevator_C_UserConstructionScript");
static_assert(offsetof(BP_Elevator_C_UserConstructionScript, CallFunc_GetPlayerDetectionRange_ReturnValue) == 0x000000, "Member 'BP_Elevator_C_UserConstructionScript::CallFunc_GetPlayerDetectionRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Elevator_C_UserConstructionScript, K2Node_DynamicCast_AsBP_Interactable_Elevator_Trigger) == 0x000008, "Member 'BP_Elevator_C_UserConstructionScript::K2Node_DynamicCast_AsBP_Interactable_Elevator_Trigger' has a wrong offset!");
static_assert(offsetof(BP_Elevator_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_Elevator_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_Elevator.BP_Elevator_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_Elevator_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Elevator_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_Elevator_C_ReceiveEndPlay");
static_assert(sizeof(BP_Elevator_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_Elevator_C_ReceiveEndPlay");
static_assert(offsetof(BP_Elevator_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_Elevator_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_Elevator.BP_Elevator_C.ExecuteUbergraph_BP_Elevator
// 0x0078 (0x0078 - 0x0000)
struct BP_Elevator_C_ExecuteUbergraph_BP_Elevator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Interactable_ElevatorTrigger_C*     K2Node_DynamicCast_AsBP_Interactable_Elevator_Trigger; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Interactable_ElevatorTrigger_C*     K2Node_DynamicCast_AsBP_Interactable_Elevator_Trigger_1; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Interactable_ElevatorTrigger_C*     K2Node_DynamicCast_AsBP_Interactable_Elevator_Trigger_2; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bInstant;               // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bWasMoving;             // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bInstant_1;             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bWasMoving_1;           // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundSubsystem*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundSubsystem*                        CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODAudioComponent*                    CallFunc_PlaySoundEventAttached_ReturnValue;       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFMODAudioComponent*                    CallFunc_PlaySoundEventAttached_ReturnValue_1;     // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundSubsystem*                        CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODAudioComponent*                    CallFunc_PlaySoundEventAttached_ReturnValue_2;     // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Elevator_C_ExecuteUbergraph_BP_Elevator) == 0x000008, "Wrong alignment on BP_Elevator_C_ExecuteUbergraph_BP_Elevator");
static_assert(sizeof(BP_Elevator_C_ExecuteUbergraph_BP_Elevator) == 0x000078, "Wrong size on BP_Elevator_C_ExecuteUbergraph_BP_Elevator");
static_assert(offsetof(BP_Elevator_C_ExecuteUbergraph_BP_Elevator, EntryPoint) == 0x000000, "Member 'BP_Elevator_C_ExecuteUbergraph_BP_Elevator::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Elevator_C_ExecuteUbergraph_BP_Elevator, K2Node_DynamicCast_AsBP_Interactable_Elevator_Trigger) == 0x000008, "Member 'BP_Elevator_C_ExecuteUbergraph_BP_Elevator::K2Node_DynamicCast_AsBP_Interactable_Elevator_Trigger' has a wrong offset!");
static_assert(offsetof(BP_Elevator_C_ExecuteUbergraph_BP_Elevator, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_Elevator_C_ExecuteUbergraph_BP_Elevator::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Elevator_C_ExecuteUbergraph_BP_Elevator, K2Node_DynamicCast_AsBP_Interactable_Elevator_Trigger_1) == 0x000018, "Member 'BP_Elevator_C_ExecuteUbergraph_BP_Elevator::K2Node_DynamicCast_AsBP_Interactable_Elevator_Trigger_1' has a wrong offset!");
static_assert(offsetof(BP_Elevator_C_ExecuteUbergraph_BP_Elevator, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'BP_Elevator_C_ExecuteUbergraph_BP_Elevator::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Elevator_C_ExecuteUbergraph_BP_Elevator, K2Node_DynamicCast_AsBP_Interactable_Elevator_Trigger_2) == 0x000028, "Member 'BP_Elevator_C_ExecuteUbergraph_BP_Elevator::K2Node_DynamicCast_AsBP_Interactable_Elevator_Trigger_2' has a wrong offset!");
static_assert(offsetof(BP_Elevator_C_ExecuteUbergraph_BP_Elevator, K2Node_DynamicCast_bSuccess_2) == 0x000030, "Member 'BP_Elevator_C_ExecuteUbergraph_BP_Elevator::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Elevator_C_ExecuteUbergraph_BP_Elevator, K2Node_Event_EndPlayReason) == 0x000031, "Member 'BP_Elevator_C_ExecuteUbergraph_BP_Elevator::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_Elevator_C_ExecuteUbergraph_BP_Elevator, K2Node_ComponentBoundEvent_bInstant) == 0x000032, "Member 'BP_Elevator_C_ExecuteUbergraph_BP_Elevator::K2Node_ComponentBoundEvent_bInstant' has a wrong offset!");
static_assert(offsetof(BP_Elevator_C_ExecuteUbergraph_BP_Elevator, K2Node_ComponentBoundEvent_bWasMoving) == 0x000033, "Member 'BP_Elevator_C_ExecuteUbergraph_BP_Elevator::K2Node_ComponentBoundEvent_bWasMoving' has a wrong offset!");
static_assert(offsetof(BP_Elevator_C_ExecuteUbergraph_BP_Elevator, K2Node_ComponentBoundEvent_bInstant_1) == 0x000034, "Member 'BP_Elevator_C_ExecuteUbergraph_BP_Elevator::K2Node_ComponentBoundEvent_bInstant_1' has a wrong offset!");
static_assert(offsetof(BP_Elevator_C_ExecuteUbergraph_BP_Elevator, K2Node_ComponentBoundEvent_bWasMoving_1) == 0x000035, "Member 'BP_Elevator_C_ExecuteUbergraph_BP_Elevator::K2Node_ComponentBoundEvent_bWasMoving_1' has a wrong offset!");
static_assert(offsetof(BP_Elevator_C_ExecuteUbergraph_BP_Elevator, CallFunc_Not_PreBool_ReturnValue) == 0x000036, "Member 'BP_Elevator_C_ExecuteUbergraph_BP_Elevator::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Elevator_C_ExecuteUbergraph_BP_Elevator, CallFunc_Not_PreBool_ReturnValue_1) == 0x000037, "Member 'BP_Elevator_C_ExecuteUbergraph_BP_Elevator::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Elevator_C_ExecuteUbergraph_BP_Elevator, CallFunc_BooleanAND_ReturnValue) == 0x000038, "Member 'BP_Elevator_C_ExecuteUbergraph_BP_Elevator::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Elevator_C_ExecuteUbergraph_BP_Elevator, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000040, "Member 'BP_Elevator_C_ExecuteUbergraph_BP_Elevator::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Elevator_C_ExecuteUbergraph_BP_Elevator, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000048, "Member 'BP_Elevator_C_ExecuteUbergraph_BP_Elevator::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Elevator_C_ExecuteUbergraph_BP_Elevator, CallFunc_PlaySoundEventAttached_ReturnValue) == 0x000050, "Member 'BP_Elevator_C_ExecuteUbergraph_BP_Elevator::CallFunc_PlaySoundEventAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Elevator_C_ExecuteUbergraph_BP_Elevator, CallFunc_PlaySoundEventAttached_ReturnValue_1) == 0x000058, "Member 'BP_Elevator_C_ExecuteUbergraph_BP_Elevator::CallFunc_PlaySoundEventAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Elevator_C_ExecuteUbergraph_BP_Elevator, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000060, "Member 'BP_Elevator_C_ExecuteUbergraph_BP_Elevator::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Elevator_C_ExecuteUbergraph_BP_Elevator, CallFunc_PlaySoundEventAttached_ReturnValue_2) == 0x000068, "Member 'BP_Elevator_C_ExecuteUbergraph_BP_Elevator::CallFunc_PlaySoundEventAttached_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Elevator_C_ExecuteUbergraph_BP_Elevator, CallFunc_IsPlaying_ReturnValue) == 0x000070, "Member 'BP_Elevator_C_ExecuteUbergraph_BP_Elevator::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Elevator_C_ExecuteUbergraph_BP_Elevator, CallFunc_IsValid_ReturnValue) == 0x000071, "Member 'BP_Elevator_C_ExecuteUbergraph_BP_Elevator::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Elevator.BP_Elevator_C.BndEvt__BP_Elevator_ElevatorMovementComponent_K2Node_ComponentBoundEvent_1_ElevatorMovementEvent__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct BP_Elevator_C_BndEvt__BP_Elevator_ElevatorMovementComponent_K2Node_ComponentBoundEvent_1_ElevatorMovementEvent__DelegateSignature final
{
public:
	bool                                          bInstant;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bWasMoving;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Elevator_C_BndEvt__BP_Elevator_ElevatorMovementComponent_K2Node_ComponentBoundEvent_1_ElevatorMovementEvent__DelegateSignature) == 0x000001, "Wrong alignment on BP_Elevator_C_BndEvt__BP_Elevator_ElevatorMovementComponent_K2Node_ComponentBoundEvent_1_ElevatorMovementEvent__DelegateSignature");
static_assert(sizeof(BP_Elevator_C_BndEvt__BP_Elevator_ElevatorMovementComponent_K2Node_ComponentBoundEvent_1_ElevatorMovementEvent__DelegateSignature) == 0x000002, "Wrong size on BP_Elevator_C_BndEvt__BP_Elevator_ElevatorMovementComponent_K2Node_ComponentBoundEvent_1_ElevatorMovementEvent__DelegateSignature");
static_assert(offsetof(BP_Elevator_C_BndEvt__BP_Elevator_ElevatorMovementComponent_K2Node_ComponentBoundEvent_1_ElevatorMovementEvent__DelegateSignature, bInstant) == 0x000000, "Member 'BP_Elevator_C_BndEvt__BP_Elevator_ElevatorMovementComponent_K2Node_ComponentBoundEvent_1_ElevatorMovementEvent__DelegateSignature::bInstant' has a wrong offset!");
static_assert(offsetof(BP_Elevator_C_BndEvt__BP_Elevator_ElevatorMovementComponent_K2Node_ComponentBoundEvent_1_ElevatorMovementEvent__DelegateSignature, bWasMoving) == 0x000001, "Member 'BP_Elevator_C_BndEvt__BP_Elevator_ElevatorMovementComponent_K2Node_ComponentBoundEvent_1_ElevatorMovementEvent__DelegateSignature::bWasMoving' has a wrong offset!");

// Function BP_Elevator.BP_Elevator_C.BndEvt__BP_Elevator_ElevatorMovementComponent_K2Node_ComponentBoundEvent_0_ElevatorMovementEvent__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct BP_Elevator_C_BndEvt__BP_Elevator_ElevatorMovementComponent_K2Node_ComponentBoundEvent_0_ElevatorMovementEvent__DelegateSignature final
{
public:
	bool                                          bInstant;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bWasMoving;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Elevator_C_BndEvt__BP_Elevator_ElevatorMovementComponent_K2Node_ComponentBoundEvent_0_ElevatorMovementEvent__DelegateSignature) == 0x000001, "Wrong alignment on BP_Elevator_C_BndEvt__BP_Elevator_ElevatorMovementComponent_K2Node_ComponentBoundEvent_0_ElevatorMovementEvent__DelegateSignature");
static_assert(sizeof(BP_Elevator_C_BndEvt__BP_Elevator_ElevatorMovementComponent_K2Node_ComponentBoundEvent_0_ElevatorMovementEvent__DelegateSignature) == 0x000002, "Wrong size on BP_Elevator_C_BndEvt__BP_Elevator_ElevatorMovementComponent_K2Node_ComponentBoundEvent_0_ElevatorMovementEvent__DelegateSignature");
static_assert(offsetof(BP_Elevator_C_BndEvt__BP_Elevator_ElevatorMovementComponent_K2Node_ComponentBoundEvent_0_ElevatorMovementEvent__DelegateSignature, bInstant) == 0x000000, "Member 'BP_Elevator_C_BndEvt__BP_Elevator_ElevatorMovementComponent_K2Node_ComponentBoundEvent_0_ElevatorMovementEvent__DelegateSignature::bInstant' has a wrong offset!");
static_assert(offsetof(BP_Elevator_C_BndEvt__BP_Elevator_ElevatorMovementComponent_K2Node_ComponentBoundEvent_0_ElevatorMovementEvent__DelegateSignature, bWasMoving) == 0x000001, "Member 'BP_Elevator_C_BndEvt__BP_Elevator_ElevatorMovementComponent_K2Node_ComponentBoundEvent_0_ElevatorMovementEvent__DelegateSignature::bWasMoving' has a wrong offset!");

}

