#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FallThroughPlatform_Toggle_Mesh

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_FallThroughPlatform_Toggle_Mesh.BP_FallThroughPlatform_Toggle_Mesh_C.ExecuteUbergraph_BP_FallThroughPlatform_Toggle_Mesh
// 0x0040 (0x0040 - 0x0000)
struct BP_FallThroughPlatform_Toggle_Mesh_C_ExecuteUbergraph_BP_FallThroughPlatform_Toggle_Mesh final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_Alpha_1;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Alpha_2;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_Alpha;                                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast; // 0x0030(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast_1; // 0x0034(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast_2; // 0x0038(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast_3; // 0x003C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FallThroughPlatform_Toggle_Mesh_C_ExecuteUbergraph_BP_FallThroughPlatform_Toggle_Mesh) == 0x000008, "Wrong alignment on BP_FallThroughPlatform_Toggle_Mesh_C_ExecuteUbergraph_BP_FallThroughPlatform_Toggle_Mesh");
static_assert(sizeof(BP_FallThroughPlatform_Toggle_Mesh_C_ExecuteUbergraph_BP_FallThroughPlatform_Toggle_Mesh) == 0x000040, "Wrong size on BP_FallThroughPlatform_Toggle_Mesh_C_ExecuteUbergraph_BP_FallThroughPlatform_Toggle_Mesh");
static_assert(offsetof(BP_FallThroughPlatform_Toggle_Mesh_C_ExecuteUbergraph_BP_FallThroughPlatform_Toggle_Mesh, EntryPoint) == 0x000000, "Member 'BP_FallThroughPlatform_Toggle_Mesh_C_ExecuteUbergraph_BP_FallThroughPlatform_Toggle_Mesh::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FallThroughPlatform_Toggle_Mesh_C_ExecuteUbergraph_BP_FallThroughPlatform_Toggle_Mesh, K2Node_Event_Alpha_1) == 0x000008, "Member 'BP_FallThroughPlatform_Toggle_Mesh_C_ExecuteUbergraph_BP_FallThroughPlatform_Toggle_Mesh::K2Node_Event_Alpha_1' has a wrong offset!");
static_assert(offsetof(BP_FallThroughPlatform_Toggle_Mesh_C_ExecuteUbergraph_BP_FallThroughPlatform_Toggle_Mesh, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_FallThroughPlatform_Toggle_Mesh_C_ExecuteUbergraph_BP_FallThroughPlatform_Toggle_Mesh::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FallThroughPlatform_Toggle_Mesh_C_ExecuteUbergraph_BP_FallThroughPlatform_Toggle_Mesh, K2Node_Event_Alpha_2) == 0x000018, "Member 'BP_FallThroughPlatform_Toggle_Mesh_C_ExecuteUbergraph_BP_FallThroughPlatform_Toggle_Mesh::K2Node_Event_Alpha_2' has a wrong offset!");
static_assert(offsetof(BP_FallThroughPlatform_Toggle_Mesh_C_ExecuteUbergraph_BP_FallThroughPlatform_Toggle_Mesh, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000020, "Member 'BP_FallThroughPlatform_Toggle_Mesh_C_ExecuteUbergraph_BP_FallThroughPlatform_Toggle_Mesh::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FallThroughPlatform_Toggle_Mesh_C_ExecuteUbergraph_BP_FallThroughPlatform_Toggle_Mesh, K2Node_Event_Alpha) == 0x000028, "Member 'BP_FallThroughPlatform_Toggle_Mesh_C_ExecuteUbergraph_BP_FallThroughPlatform_Toggle_Mesh::K2Node_Event_Alpha' has a wrong offset!");
static_assert(offsetof(BP_FallThroughPlatform_Toggle_Mesh_C_ExecuteUbergraph_BP_FallThroughPlatform_Toggle_Mesh, CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast) == 0x000030, "Member 'BP_FallThroughPlatform_Toggle_Mesh_C_ExecuteUbergraph_BP_FallThroughPlatform_Toggle_Mesh::CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_FallThroughPlatform_Toggle_Mesh_C_ExecuteUbergraph_BP_FallThroughPlatform_Toggle_Mesh, CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast_1) == 0x000034, "Member 'BP_FallThroughPlatform_Toggle_Mesh_C_ExecuteUbergraph_BP_FallThroughPlatform_Toggle_Mesh::CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_FallThroughPlatform_Toggle_Mesh_C_ExecuteUbergraph_BP_FallThroughPlatform_Toggle_Mesh, CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast_2) == 0x000038, "Member 'BP_FallThroughPlatform_Toggle_Mesh_C_ExecuteUbergraph_BP_FallThroughPlatform_Toggle_Mesh::CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_FallThroughPlatform_Toggle_Mesh_C_ExecuteUbergraph_BP_FallThroughPlatform_Toggle_Mesh, CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast_3) == 0x00003C, "Member 'BP_FallThroughPlatform_Toggle_Mesh_C_ExecuteUbergraph_BP_FallThroughPlatform_Toggle_Mesh::CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast_3' has a wrong offset!");

// Function BP_FallThroughPlatform_Toggle_Mesh.BP_FallThroughPlatform_Toggle_Mesh_C.OnDisappearProcessUpdate
// 0x0008 (0x0008 - 0x0000)
struct BP_FallThroughPlatform_Toggle_Mesh_C_OnDisappearProcessUpdate final
{
public:
	double                                        Alpha;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FallThroughPlatform_Toggle_Mesh_C_OnDisappearProcessUpdate) == 0x000008, "Wrong alignment on BP_FallThroughPlatform_Toggle_Mesh_C_OnDisappearProcessUpdate");
static_assert(sizeof(BP_FallThroughPlatform_Toggle_Mesh_C_OnDisappearProcessUpdate) == 0x000008, "Wrong size on BP_FallThroughPlatform_Toggle_Mesh_C_OnDisappearProcessUpdate");
static_assert(offsetof(BP_FallThroughPlatform_Toggle_Mesh_C_OnDisappearProcessUpdate, Alpha) == 0x000000, "Member 'BP_FallThroughPlatform_Toggle_Mesh_C_OnDisappearProcessUpdate::Alpha' has a wrong offset!");

// Function BP_FallThroughPlatform_Toggle_Mesh.BP_FallThroughPlatform_Toggle_Mesh_C.OnPostDisappearProcessUpdate
// 0x0008 (0x0008 - 0x0000)
struct BP_FallThroughPlatform_Toggle_Mesh_C_OnPostDisappearProcessUpdate final
{
public:
	double                                        Alpha;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FallThroughPlatform_Toggle_Mesh_C_OnPostDisappearProcessUpdate) == 0x000008, "Wrong alignment on BP_FallThroughPlatform_Toggle_Mesh_C_OnPostDisappearProcessUpdate");
static_assert(sizeof(BP_FallThroughPlatform_Toggle_Mesh_C_OnPostDisappearProcessUpdate) == 0x000008, "Wrong size on BP_FallThroughPlatform_Toggle_Mesh_C_OnPostDisappearProcessUpdate");
static_assert(offsetof(BP_FallThroughPlatform_Toggle_Mesh_C_OnPostDisappearProcessUpdate, Alpha) == 0x000000, "Member 'BP_FallThroughPlatform_Toggle_Mesh_C_OnPostDisappearProcessUpdate::Alpha' has a wrong offset!");

// Function BP_FallThroughPlatform_Toggle_Mesh.BP_FallThroughPlatform_Toggle_Mesh_C.OnRespawnProcessUpdate
// 0x0008 (0x0008 - 0x0000)
struct BP_FallThroughPlatform_Toggle_Mesh_C_OnRespawnProcessUpdate final
{
public:
	double                                        Alpha;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FallThroughPlatform_Toggle_Mesh_C_OnRespawnProcessUpdate) == 0x000008, "Wrong alignment on BP_FallThroughPlatform_Toggle_Mesh_C_OnRespawnProcessUpdate");
static_assert(sizeof(BP_FallThroughPlatform_Toggle_Mesh_C_OnRespawnProcessUpdate) == 0x000008, "Wrong size on BP_FallThroughPlatform_Toggle_Mesh_C_OnRespawnProcessUpdate");
static_assert(offsetof(BP_FallThroughPlatform_Toggle_Mesh_C_OnRespawnProcessUpdate, Alpha) == 0x000000, "Member 'BP_FallThroughPlatform_Toggle_Mesh_C_OnRespawnProcessUpdate::Alpha' has a wrong offset!");

}

