#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FakeWall

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FakeWall.BP_FakeWall_C
// 0x0048 (0x0330 - 0x02E8)
class ABP_FakeWall_C final : public AFakeWall
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Visual;                                            // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DisplayBoxEditorVisual;                            // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          FogOfWarBlocker;                                   // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FadeOut_Alpha_C49A39DC4022FF57520A7FBE4C515532;    // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FadeOut__Direction_C49A39DC4022FF57520A7FBE4C515532; // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_315[0x3];                                      // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FadeOut;                                           // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             HideSoundEvent;                                    // 0x0320(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseAutoScale;                                     // 0x0328(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void Hide(bool bInstant);
	void FadeOut__UpdateFunc();
	void FadeOut__FinishedFunc();
	void ExecuteUbergraph_BP_FakeWall(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FakeWall_C">();
	}
	static class ABP_FakeWall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FakeWall_C>();
	}
};
static_assert(alignof(ABP_FakeWall_C) == 0x000008, "Wrong alignment on ABP_FakeWall_C");
static_assert(sizeof(ABP_FakeWall_C) == 0x000330, "Wrong size on ABP_FakeWall_C");
static_assert(offsetof(ABP_FakeWall_C, UberGraphFrame) == 0x0002E8, "Member 'ABP_FakeWall_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FakeWall_C, Visual) == 0x0002F0, "Member 'ABP_FakeWall_C::Visual' has a wrong offset!");
static_assert(offsetof(ABP_FakeWall_C, DisplayBoxEditorVisual) == 0x0002F8, "Member 'ABP_FakeWall_C::DisplayBoxEditorVisual' has a wrong offset!");
static_assert(offsetof(ABP_FakeWall_C, FogOfWarBlocker) == 0x000300, "Member 'ABP_FakeWall_C::FogOfWarBlocker' has a wrong offset!");
static_assert(offsetof(ABP_FakeWall_C, Billboard) == 0x000308, "Member 'ABP_FakeWall_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_FakeWall_C, FadeOut_Alpha_C49A39DC4022FF57520A7FBE4C515532) == 0x000310, "Member 'ABP_FakeWall_C::FadeOut_Alpha_C49A39DC4022FF57520A7FBE4C515532' has a wrong offset!");
static_assert(offsetof(ABP_FakeWall_C, FadeOut__Direction_C49A39DC4022FF57520A7FBE4C515532) == 0x000314, "Member 'ABP_FakeWall_C::FadeOut__Direction_C49A39DC4022FF57520A7FBE4C515532' has a wrong offset!");
static_assert(offsetof(ABP_FakeWall_C, FadeOut) == 0x000318, "Member 'ABP_FakeWall_C::FadeOut' has a wrong offset!");
static_assert(offsetof(ABP_FakeWall_C, HideSoundEvent) == 0x000320, "Member 'ABP_FakeWall_C::HideSoundEvent' has a wrong offset!");
static_assert(offsetof(ABP_FakeWall_C, bUseAutoScale) == 0x000328, "Member 'ABP_FakeWall_C::bUseAutoScale' has a wrong offset!");

}

