#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameplayCondition_Recollection_BossRush

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GameplayCondition_Recollection_BossRush.BP_GameplayCondition_Recollection_BossRush_C.OnCheckCondition
// 0x0020 (0x0020 - 0x0000)
struct BP_GameplayCondition_Recollection_BossRush_C_OnCheckCondition final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBossRecollectionEnabled_ReturnValue;    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeZion*                          CallFunc_Get_ReturnValue;                          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldDisplayRecollectionBossRush_ReturnValue; // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GameplayCondition_Recollection_BossRush_C_OnCheckCondition) == 0x000008, "Wrong alignment on BP_GameplayCondition_Recollection_BossRush_C_OnCheckCondition");
static_assert(sizeof(BP_GameplayCondition_Recollection_BossRush_C_OnCheckCondition) == 0x000020, "Wrong size on BP_GameplayCondition_Recollection_BossRush_C_OnCheckCondition");
static_assert(offsetof(BP_GameplayCondition_Recollection_BossRush_C_OnCheckCondition, PlayerController) == 0x000000, "Member 'BP_GameplayCondition_Recollection_BossRush_C_OnCheckCondition::PlayerController' has a wrong offset!");
static_assert(offsetof(BP_GameplayCondition_Recollection_BossRush_C_OnCheckCondition, ReturnValue) == 0x000008, "Member 'BP_GameplayCondition_Recollection_BossRush_C_OnCheckCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameplayCondition_Recollection_BossRush_C_OnCheckCondition, CallFunc_IsBossRecollectionEnabled_ReturnValue) == 0x000009, "Member 'BP_GameplayCondition_Recollection_BossRush_C_OnCheckCondition::CallFunc_IsBossRecollectionEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameplayCondition_Recollection_BossRush_C_OnCheckCondition, CallFunc_Get_ReturnValue) == 0x000010, "Member 'BP_GameplayCondition_Recollection_BossRush_C_OnCheckCondition::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameplayCondition_Recollection_BossRush_C_OnCheckCondition, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_GameplayCondition_Recollection_BossRush_C_OnCheckCondition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameplayCondition_Recollection_BossRush_C_OnCheckCondition, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'BP_GameplayCondition_Recollection_BossRush_C_OnCheckCondition::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GameplayCondition_Recollection_BossRush_C_OnCheckCondition, CallFunc_ShouldDisplayRecollectionBossRush_ReturnValue) == 0x00001A, "Member 'BP_GameplayCondition_Recollection_BossRush_C_OnCheckCondition::CallFunc_ShouldDisplayRecollectionBossRush_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameplayCondition_Recollection_BossRush_C_OnCheckCondition, CallFunc_BooleanAND_ReturnValue) == 0x00001B, "Member 'BP_GameplayCondition_Recollection_BossRush_C_OnCheckCondition::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

