#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Interactable_AddTutorial

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EventSystem_structs.hpp"
#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function BP_Interactable_AddTutorial.BP_Interactable_AddTutorial_C.SetupAdditionalBlackboardValues
// 0x0160 (0x0160 - 0x0000)
struct BP_Interactable_AddTutorial_C_SetupAdditionalBlackboardValues final
{
public:
	struct FEventBlackboardInit                   EventBlackboardInit;                               // 0x0000(0x0140)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FDataTableRowHandle                    CallFunc_GetItem_Item;                             // 0x0140(0x0010)(NoDestructor)
	int32                                         CallFunc_GetCount_Count;                           // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0154(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_AddTutorial_C_SetupAdditionalBlackboardValues) == 0x000008, "Wrong alignment on BP_Interactable_AddTutorial_C_SetupAdditionalBlackboardValues");
static_assert(sizeof(BP_Interactable_AddTutorial_C_SetupAdditionalBlackboardValues) == 0x000160, "Wrong size on BP_Interactable_AddTutorial_C_SetupAdditionalBlackboardValues");
static_assert(offsetof(BP_Interactable_AddTutorial_C_SetupAdditionalBlackboardValues, EventBlackboardInit) == 0x000000, "Member 'BP_Interactable_AddTutorial_C_SetupAdditionalBlackboardValues::EventBlackboardInit' has a wrong offset!");
static_assert(offsetof(BP_Interactable_AddTutorial_C_SetupAdditionalBlackboardValues, CallFunc_GetItem_Item) == 0x000140, "Member 'BP_Interactable_AddTutorial_C_SetupAdditionalBlackboardValues::CallFunc_GetItem_Item' has a wrong offset!");
static_assert(offsetof(BP_Interactable_AddTutorial_C_SetupAdditionalBlackboardValues, CallFunc_GetCount_Count) == 0x000150, "Member 'BP_Interactable_AddTutorial_C_SetupAdditionalBlackboardValues::CallFunc_GetCount_Count' has a wrong offset!");
static_assert(offsetof(BP_Interactable_AddTutorial_C_SetupAdditionalBlackboardValues, CallFunc_MakeLiteralName_ReturnValue) == 0x000154, "Member 'BP_Interactable_AddTutorial_C_SetupAdditionalBlackboardValues::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");

// Function BP_Interactable_AddTutorial.BP_Interactable_AddTutorial_C.OnInteract
// 0x0008 (0x0008 - 0x0000)
struct BP_Interactable_AddTutorial_C_OnInteract final
{
public:
	class APlayerController*                      Controller;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_AddTutorial_C_OnInteract) == 0x000008, "Wrong alignment on BP_Interactable_AddTutorial_C_OnInteract");
static_assert(sizeof(BP_Interactable_AddTutorial_C_OnInteract) == 0x000008, "Wrong size on BP_Interactable_AddTutorial_C_OnInteract");
static_assert(offsetof(BP_Interactable_AddTutorial_C_OnInteract, Controller) == 0x000000, "Member 'BP_Interactable_AddTutorial_C_OnInteract::Controller' has a wrong offset!");

// Function BP_Interactable_AddTutorial.BP_Interactable_AddTutorial_C.ExecuteUbergraph_BP_Interactable_AddTutorial
// 0x0010 (0x0010 - 0x0000)
struct BP_Interactable_AddTutorial_C_ExecuteUbergraph_BP_Interactable_AddTutorial final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_Event_Controller;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_AddTutorial_C_ExecuteUbergraph_BP_Interactable_AddTutorial) == 0x000008, "Wrong alignment on BP_Interactable_AddTutorial_C_ExecuteUbergraph_BP_Interactable_AddTutorial");
static_assert(sizeof(BP_Interactable_AddTutorial_C_ExecuteUbergraph_BP_Interactable_AddTutorial) == 0x000010, "Wrong size on BP_Interactable_AddTutorial_C_ExecuteUbergraph_BP_Interactable_AddTutorial");
static_assert(offsetof(BP_Interactable_AddTutorial_C_ExecuteUbergraph_BP_Interactable_AddTutorial, EntryPoint) == 0x000000, "Member 'BP_Interactable_AddTutorial_C_ExecuteUbergraph_BP_Interactable_AddTutorial::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Interactable_AddTutorial_C_ExecuteUbergraph_BP_Interactable_AddTutorial, K2Node_Event_Controller) == 0x000008, "Member 'BP_Interactable_AddTutorial_C_ExecuteUbergraph_BP_Interactable_AddTutorial::K2Node_Event_Controller' has a wrong offset!");

// Function BP_Interactable_AddTutorial.BP_Interactable_AddTutorial_C.ShouldUseNGPlusVariant
// 0x0007 (0x0007 - 0x0000)
struct BP_Interactable_AddTutorial_C_ShouldUseNGPlusVariant final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsProgressionItem_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasClearedOnPreviousRuns_ReturnValue;     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_AddTutorial_C_ShouldUseNGPlusVariant) == 0x000001, "Wrong alignment on BP_Interactable_AddTutorial_C_ShouldUseNGPlusVariant");
static_assert(sizeof(BP_Interactable_AddTutorial_C_ShouldUseNGPlusVariant) == 0x000007, "Wrong size on BP_Interactable_AddTutorial_C_ShouldUseNGPlusVariant");
static_assert(offsetof(BP_Interactable_AddTutorial_C_ShouldUseNGPlusVariant, ReturnValue) == 0x000000, "Member 'BP_Interactable_AddTutorial_C_ShouldUseNGPlusVariant::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_AddTutorial_C_ShouldUseNGPlusVariant, CallFunc_IsProgressionItem_ReturnValue) == 0x000001, "Member 'BP_Interactable_AddTutorial_C_ShouldUseNGPlusVariant::CallFunc_IsProgressionItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_AddTutorial_C_ShouldUseNGPlusVariant, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'BP_Interactable_AddTutorial_C_ShouldUseNGPlusVariant::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_AddTutorial_C_ShouldUseNGPlusVariant, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'BP_Interactable_AddTutorial_C_ShouldUseNGPlusVariant::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_AddTutorial_C_ShouldUseNGPlusVariant, CallFunc_WasClearedOnPreviousRuns_ReturnValue) == 0x000004, "Member 'BP_Interactable_AddTutorial_C_ShouldUseNGPlusVariant::CallFunc_WasClearedOnPreviousRuns_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_AddTutorial_C_ShouldUseNGPlusVariant, CallFunc_BooleanAND_ReturnValue) == 0x000005, "Member 'BP_Interactable_AddTutorial_C_ShouldUseNGPlusVariant::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_AddTutorial_C_ShouldUseNGPlusVariant, CallFunc_BooleanAND_ReturnValue_1) == 0x000006, "Member 'BP_Interactable_AddTutorial_C_ShouldUseNGPlusVariant::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BP_Interactable_AddTutorial.BP_Interactable_AddTutorial_C.GetItem
// 0x0028 (0x0028 - 0x0000)
struct BP_Interactable_AddTutorial_C_GetItem final
{
public:
	struct FDataTableRowHandle                    Item_0;                                            // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldUseNGPlusVariant_ReturnValue;       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_Select_Default;                             // 0x0018(0x0010)(NoDestructor)
};
static_assert(alignof(BP_Interactable_AddTutorial_C_GetItem) == 0x000008, "Wrong alignment on BP_Interactable_AddTutorial_C_GetItem");
static_assert(sizeof(BP_Interactable_AddTutorial_C_GetItem) == 0x000028, "Wrong size on BP_Interactable_AddTutorial_C_GetItem");
static_assert(offsetof(BP_Interactable_AddTutorial_C_GetItem, Item_0) == 0x000000, "Member 'BP_Interactable_AddTutorial_C_GetItem::Item_0' has a wrong offset!");
static_assert(offsetof(BP_Interactable_AddTutorial_C_GetItem, Temp_bool_Variable) == 0x000010, "Member 'BP_Interactable_AddTutorial_C_GetItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Interactable_AddTutorial_C_GetItem, CallFunc_ShouldUseNGPlusVariant_ReturnValue) == 0x000011, "Member 'BP_Interactable_AddTutorial_C_GetItem::CallFunc_ShouldUseNGPlusVariant_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_AddTutorial_C_GetItem, K2Node_Select_Default) == 0x000018, "Member 'BP_Interactable_AddTutorial_C_GetItem::K2Node_Select_Default' has a wrong offset!");

// Function BP_Interactable_AddTutorial.BP_Interactable_AddTutorial_C.GetInteractionText
// 0x0290 (0x0290 - 0x0000)
struct BP_Interactable_AddTutorial_C_GetInteractionText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetInteractionText_ReturnValue;           // 0x0020(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0048)(HasGetValueTypeHash)
	struct FInventoryItemData                     CallFunc_GetInventoryItemData_out_ItemData;        // 0x0088(0x0168)()
	bool                                          CallFunc_GetInventoryItemData_ReturnValue;         // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01F8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0208(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0218(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetInteractionText_ReturnValue_1;         // 0x0260(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0270(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0280(0x0010)()
};
static_assert(alignof(BP_Interactable_AddTutorial_C_GetInteractionText) == 0x000008, "Wrong alignment on BP_Interactable_AddTutorial_C_GetInteractionText");
static_assert(sizeof(BP_Interactable_AddTutorial_C_GetInteractionText) == 0x000290, "Wrong size on BP_Interactable_AddTutorial_C_GetInteractionText");
static_assert(offsetof(BP_Interactable_AddTutorial_C_GetInteractionText, ReturnValue) == 0x000000, "Member 'BP_Interactable_AddTutorial_C_GetInteractionText::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_AddTutorial_C_GetInteractionText, CallFunc_MakeLiteralString_ReturnValue) == 0x000010, "Member 'BP_Interactable_AddTutorial_C_GetInteractionText::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_AddTutorial_C_GetInteractionText, CallFunc_GetInteractionText_ReturnValue) == 0x000020, "Member 'BP_Interactable_AddTutorial_C_GetInteractionText::CallFunc_GetInteractionText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_AddTutorial_C_GetInteractionText, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'BP_Interactable_AddTutorial_C_GetInteractionText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_AddTutorial_C_GetInteractionText, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'BP_Interactable_AddTutorial_C_GetInteractionText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_Interactable_AddTutorial_C_GetInteractionText, CallFunc_GetInventoryItemData_out_ItemData) == 0x000088, "Member 'BP_Interactable_AddTutorial_C_GetInteractionText::CallFunc_GetInventoryItemData_out_ItemData' has a wrong offset!");
static_assert(offsetof(BP_Interactable_AddTutorial_C_GetInteractionText, CallFunc_GetInventoryItemData_ReturnValue) == 0x0001F0, "Member 'BP_Interactable_AddTutorial_C_GetInteractionText::CallFunc_GetInventoryItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_AddTutorial_C_GetInteractionText, K2Node_MakeArray_Array) == 0x0001F8, "Member 'BP_Interactable_AddTutorial_C_GetInteractionText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Interactable_AddTutorial_C_GetInteractionText, CallFunc_Format_ReturnValue) == 0x000208, "Member 'BP_Interactable_AddTutorial_C_GetInteractionText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_AddTutorial_C_GetInteractionText, K2Node_MakeStruct_FormatArgumentData_1) == 0x000218, "Member 'BP_Interactable_AddTutorial_C_GetInteractionText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_Interactable_AddTutorial_C_GetInteractionText, CallFunc_GetInteractionText_ReturnValue_1) == 0x000260, "Member 'BP_Interactable_AddTutorial_C_GetInteractionText::CallFunc_GetInteractionText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Interactable_AddTutorial_C_GetInteractionText, K2Node_MakeArray_Array_1) == 0x000270, "Member 'BP_Interactable_AddTutorial_C_GetInteractionText::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_Interactable_AddTutorial_C_GetInteractionText, CallFunc_Format_ReturnValue_1) == 0x000280, "Member 'BP_Interactable_AddTutorial_C_GetInteractionText::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function BP_Interactable_AddTutorial.BP_Interactable_AddTutorial_C.GetCount
// 0x000C (0x000C - 0x0000)
struct BP_Interactable_AddTutorial_C_GetCount final
{
public:
	int32                                         Count_0;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldUseNGPlusVariant_ReturnValue;       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_AddTutorial_C_GetCount) == 0x000004, "Wrong alignment on BP_Interactable_AddTutorial_C_GetCount");
static_assert(sizeof(BP_Interactable_AddTutorial_C_GetCount) == 0x00000C, "Wrong size on BP_Interactable_AddTutorial_C_GetCount");
static_assert(offsetof(BP_Interactable_AddTutorial_C_GetCount, Count_0) == 0x000000, "Member 'BP_Interactable_AddTutorial_C_GetCount::Count_0' has a wrong offset!");
static_assert(offsetof(BP_Interactable_AddTutorial_C_GetCount, Temp_bool_Variable) == 0x000004, "Member 'BP_Interactable_AddTutorial_C_GetCount::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Interactable_AddTutorial_C_GetCount, CallFunc_ShouldUseNGPlusVariant_ReturnValue) == 0x000005, "Member 'BP_Interactable_AddTutorial_C_GetCount::CallFunc_ShouldUseNGPlusVariant_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_AddTutorial_C_GetCount, K2Node_Select_Default) == 0x000008, "Member 'BP_Interactable_AddTutorial_C_GetCount::K2Node_Select_Default' has a wrong offset!");

}

