#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Interactable_Door

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_Interactable_Event_classes.hpp"
#include "Zion_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Interactable_Door.BP_Interactable_Door_C
// 0x0050 (0x0620 - 0x05D0)
class ABP_Interactable_Door_C : public ABP_Interactable_Event_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDebugDisplayComponent*                 DebugDisplay;                                      // 0x05D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URenderStateComponent*                  RenderState;                                       // 0x05E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Door_C*>                     Doors;                                             // 0x05E8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate)
	bool                                          CanOpen;                                           // 0x05F8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanClose;                                          // 0x05F9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FA[0x6];                                      // 0x05FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UUserWidgetWorldSpace>      InteractFailedWorldSpaceClass;                     // 0x0600(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FVector                                InteractFailedWidgetLocationOffset;                // 0x0608(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_Interactable_Door_ClearComponent_K2Node_ComponentBoundEvent_1_ClearableDelegate__DelegateSignature(EClearStatus ClearStatus);
	void ExecuteUbergraph_BP_Interactable_Door(int32 EntryPoint);
	void FlipDoor(class ABP_Door_C* Door, bool RequestInstant);
	void FlipDoors(bool RequestInstant);
	void GetMapIconActorWithDependencies(struct FMapIconProviderData* OutMapIconProviderData);
	void OnInteract(class APlayerController* Controller);
	void OnInteract_ConditionCheckFailed(class APlayerController* Controller);
	void PlayAnimation(bool bOpen, bool bRequestInstant);

	bool CanAnyDoorBeFlipped() const;
	bool CanBeInteracted() const;
	bool CanDoorBeFlipped(class ABP_Door_C* Door) const;
	void IsAnyDoorMoving(bool* IsMoving) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Interactable_Door_C">();
	}
	static class ABP_Interactable_Door_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Interactable_Door_C>();
	}
};
static_assert(alignof(ABP_Interactable_Door_C) == 0x000008, "Wrong alignment on ABP_Interactable_Door_C");
static_assert(sizeof(ABP_Interactable_Door_C) == 0x000620, "Wrong size on ABP_Interactable_Door_C");
static_assert(offsetof(ABP_Interactable_Door_C, UberGraphFrame) == 0x0005D0, "Member 'ABP_Interactable_Door_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_Door_C, DebugDisplay) == 0x0005D8, "Member 'ABP_Interactable_Door_C::DebugDisplay' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_Door_C, RenderState) == 0x0005E0, "Member 'ABP_Interactable_Door_C::RenderState' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_Door_C, Doors) == 0x0005E8, "Member 'ABP_Interactable_Door_C::Doors' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_Door_C, CanOpen) == 0x0005F8, "Member 'ABP_Interactable_Door_C::CanOpen' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_Door_C, CanClose) == 0x0005F9, "Member 'ABP_Interactable_Door_C::CanClose' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_Door_C, InteractFailedWorldSpaceClass) == 0x000600, "Member 'ABP_Interactable_Door_C::InteractFailedWorldSpaceClass' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_Door_C, InteractFailedWidgetLocationOffset) == 0x000608, "Member 'ABP_Interactable_Door_C::InteractFailedWidgetLocationOffset' has a wrong offset!");

}

