#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Interactable_ElevatorTrigger_StreetMainElevator

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Interactable_ElevatorTrigger_StreetMainElevator.BP_Interactable_ElevatorTrigger_StreetMainElevator_C.ExecuteUbergraph_BP_Interactable_ElevatorTrigger_StreetMainElevator
// 0x0004 (0x0004 - 0x0000)
struct BP_Interactable_ElevatorTrigger_StreetMainElevator_C_ExecuteUbergraph_BP_Interactable_ElevatorTrigger_StreetMainElevator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_ElevatorTrigger_StreetMainElevator_C_ExecuteUbergraph_BP_Interactable_ElevatorTrigger_StreetMainElevator) == 0x000004, "Wrong alignment on BP_Interactable_ElevatorTrigger_StreetMainElevator_C_ExecuteUbergraph_BP_Interactable_ElevatorTrigger_StreetMainElevator");
static_assert(sizeof(BP_Interactable_ElevatorTrigger_StreetMainElevator_C_ExecuteUbergraph_BP_Interactable_ElevatorTrigger_StreetMainElevator) == 0x000004, "Wrong size on BP_Interactable_ElevatorTrigger_StreetMainElevator_C_ExecuteUbergraph_BP_Interactable_ElevatorTrigger_StreetMainElevator");
static_assert(offsetof(BP_Interactable_ElevatorTrigger_StreetMainElevator_C_ExecuteUbergraph_BP_Interactable_ElevatorTrigger_StreetMainElevator, EntryPoint) == 0x000000, "Member 'BP_Interactable_ElevatorTrigger_StreetMainElevator_C_ExecuteUbergraph_BP_Interactable_ElevatorTrigger_StreetMainElevator::EntryPoint' has a wrong offset!");

// Function BP_Interactable_ElevatorTrigger_StreetMainElevator.BP_Interactable_ElevatorTrigger_StreetMainElevator_C.CanBeInteracted
// 0x0004 (0x0004 - 0x0000)
struct BP_Interactable_ElevatorTrigger_StreetMainElevator_C_CanBeInteracted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ConditionsChecked_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanBeInteracted_ReturnValue;              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_ElevatorTrigger_StreetMainElevator_C_CanBeInteracted) == 0x000001, "Wrong alignment on BP_Interactable_ElevatorTrigger_StreetMainElevator_C_CanBeInteracted");
static_assert(sizeof(BP_Interactable_ElevatorTrigger_StreetMainElevator_C_CanBeInteracted) == 0x000004, "Wrong size on BP_Interactable_ElevatorTrigger_StreetMainElevator_C_CanBeInteracted");
static_assert(offsetof(BP_Interactable_ElevatorTrigger_StreetMainElevator_C_CanBeInteracted, ReturnValue) == 0x000000, "Member 'BP_Interactable_ElevatorTrigger_StreetMainElevator_C_CanBeInteracted::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_ElevatorTrigger_StreetMainElevator_C_CanBeInteracted, CallFunc_ConditionsChecked_ReturnValue) == 0x000001, "Member 'BP_Interactable_ElevatorTrigger_StreetMainElevator_C_CanBeInteracted::CallFunc_ConditionsChecked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_ElevatorTrigger_StreetMainElevator_C_CanBeInteracted, CallFunc_CanBeInteracted_ReturnValue) == 0x000002, "Member 'BP_Interactable_ElevatorTrigger_StreetMainElevator_C_CanBeInteracted::CallFunc_CanBeInteracted_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_ElevatorTrigger_StreetMainElevator_C_CanBeInteracted, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'BP_Interactable_ElevatorTrigger_StreetMainElevator_C_CanBeInteracted::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

