#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Interactable_Door_Default

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Interactable_Door_Default.BP_Interactable_Door_Default_C.PlayAnimation
// 0x0030 (0x0030 - 0x0000)
struct BP_Interactable_Door_Default_C_PlayAnimation final
{
public:
	bool                                          bOpen;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRequestInstant;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTrackEntry*                            CallFunc_AddAnimation_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTrackEntry*                            CallFunc_SetAnimation_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTrackEntry*                            CallFunc_SetAnimation_ReturnValue_1;               // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTrackEntry*                            CallFunc_SetAnimation_ReturnValue_2;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTrackEntry*                            CallFunc_SetAnimation_ReturnValue_3;               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_Door_Default_C_PlayAnimation) == 0x000008, "Wrong alignment on BP_Interactable_Door_Default_C_PlayAnimation");
static_assert(sizeof(BP_Interactable_Door_Default_C_PlayAnimation) == 0x000030, "Wrong size on BP_Interactable_Door_Default_C_PlayAnimation");
static_assert(offsetof(BP_Interactable_Door_Default_C_PlayAnimation, bOpen) == 0x000000, "Member 'BP_Interactable_Door_Default_C_PlayAnimation::bOpen' has a wrong offset!");
static_assert(offsetof(BP_Interactable_Door_Default_C_PlayAnimation, bRequestInstant) == 0x000001, "Member 'BP_Interactable_Door_Default_C_PlayAnimation::bRequestInstant' has a wrong offset!");
static_assert(offsetof(BP_Interactable_Door_Default_C_PlayAnimation, CallFunc_AddAnimation_ReturnValue) == 0x000008, "Member 'BP_Interactable_Door_Default_C_PlayAnimation::CallFunc_AddAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_Door_Default_C_PlayAnimation, CallFunc_SetAnimation_ReturnValue) == 0x000010, "Member 'BP_Interactable_Door_Default_C_PlayAnimation::CallFunc_SetAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_Door_Default_C_PlayAnimation, CallFunc_SetAnimation_ReturnValue_1) == 0x000018, "Member 'BP_Interactable_Door_Default_C_PlayAnimation::CallFunc_SetAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Interactable_Door_Default_C_PlayAnimation, CallFunc_SetAnimation_ReturnValue_2) == 0x000020, "Member 'BP_Interactable_Door_Default_C_PlayAnimation::CallFunc_SetAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Interactable_Door_Default_C_PlayAnimation, CallFunc_SetAnimation_ReturnValue_3) == 0x000028, "Member 'BP_Interactable_Door_Default_C_PlayAnimation::CallFunc_SetAnimation_ReturnValue_3' has a wrong offset!");

}

