#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Interactable_GameMapChange_Selector

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Interactable_GameMapChange_Selector.BP_Interactable_GameMapChange_Selector_C.ExecuteUbergraph_BP_Interactable_GameMapChange_Selector
// 0x0004 (0x0004 - 0x0000)
struct BP_Interactable_GameMapChange_Selector_C_ExecuteUbergraph_BP_Interactable_GameMapChange_Selector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_GameMapChange_Selector_C_ExecuteUbergraph_BP_Interactable_GameMapChange_Selector) == 0x000004, "Wrong alignment on BP_Interactable_GameMapChange_Selector_C_ExecuteUbergraph_BP_Interactable_GameMapChange_Selector");
static_assert(sizeof(BP_Interactable_GameMapChange_Selector_C_ExecuteUbergraph_BP_Interactable_GameMapChange_Selector) == 0x000004, "Wrong size on BP_Interactable_GameMapChange_Selector_C_ExecuteUbergraph_BP_Interactable_GameMapChange_Selector");
static_assert(offsetof(BP_Interactable_GameMapChange_Selector_C_ExecuteUbergraph_BP_Interactable_GameMapChange_Selector, EntryPoint) == 0x000000, "Member 'BP_Interactable_GameMapChange_Selector_C_ExecuteUbergraph_BP_Interactable_GameMapChange_Selector::EntryPoint' has a wrong offset!");

// Function BP_Interactable_GameMapChange_Selector.BP_Interactable_GameMapChange_Selector_C.GetTargetMapData
// 0x0040 (0x0040 - 0x0000)
struct BP_Interactable_GameMapChange_Selector_C_GetTargetMapData final
{
public:
	struct FDataTableRowHandle                    GameMapHandle_0;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
	class FName                                   PlayerStartTag_0;                                  // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    CallFunc_GetTargetMapData_GameMapHandle;           // 0x0020(0x0010)(NoDestructor)
	class FName                                   CallFunc_GetTargetMapData_PlayerStartTag;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckGameplayConditions_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_GameMapChange_Selector_C_GetTargetMapData) == 0x000008, "Wrong alignment on BP_Interactable_GameMapChange_Selector_C_GetTargetMapData");
static_assert(sizeof(BP_Interactable_GameMapChange_Selector_C_GetTargetMapData) == 0x000040, "Wrong size on BP_Interactable_GameMapChange_Selector_C_GetTargetMapData");
static_assert(offsetof(BP_Interactable_GameMapChange_Selector_C_GetTargetMapData, GameMapHandle_0) == 0x000000, "Member 'BP_Interactable_GameMapChange_Selector_C_GetTargetMapData::GameMapHandle_0' has a wrong offset!");
static_assert(offsetof(BP_Interactable_GameMapChange_Selector_C_GetTargetMapData, PlayerStartTag_0) == 0x000010, "Member 'BP_Interactable_GameMapChange_Selector_C_GetTargetMapData::PlayerStartTag_0' has a wrong offset!");
static_assert(offsetof(BP_Interactable_GameMapChange_Selector_C_GetTargetMapData, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'BP_Interactable_GameMapChange_Selector_C_GetTargetMapData::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_GameMapChange_Selector_C_GetTargetMapData, CallFunc_GetTargetMapData_GameMapHandle) == 0x000020, "Member 'BP_Interactable_GameMapChange_Selector_C_GetTargetMapData::CallFunc_GetTargetMapData_GameMapHandle' has a wrong offset!");
static_assert(offsetof(BP_Interactable_GameMapChange_Selector_C_GetTargetMapData, CallFunc_GetTargetMapData_PlayerStartTag) == 0x000030, "Member 'BP_Interactable_GameMapChange_Selector_C_GetTargetMapData::CallFunc_GetTargetMapData_PlayerStartTag' has a wrong offset!");
static_assert(offsetof(BP_Interactable_GameMapChange_Selector_C_GetTargetMapData, CallFunc_CheckGameplayConditions_ReturnValue) == 0x000038, "Member 'BP_Interactable_GameMapChange_Selector_C_GetTargetMapData::CallFunc_CheckGameplayConditions_ReturnValue' has a wrong offset!");

}

