#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Interactable_ElevatorTrigger_Spine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Interactable_ElevatorTrigger_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Interactable_ElevatorTrigger_Spine.BP_Interactable_ElevatorTrigger_Spine_C
// 0x0018 (0x0348 - 0x0330)
class ABP_Interactable_ElevatorTrigger_Spine_C : public ABP_Interactable_ElevatorTrigger_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Interactable_ElevatorTrigger_Spine_C; // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpineSkeletonAnimationComponent*       SpineSkeletonAnimation;                            // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpineSkeletonRendererComponent*        SpineSkeletonRenderer;                             // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Interactable_ElevatorTrigger_Spine(int32 EntryPoint);
	void OnCanBeInteractedChanged();
	void ReceiveBeginPlay();
	void RefreshAnimations();
	void SetElevator(class AMovingPlatform_Elevator* Elevator_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Interactable_ElevatorTrigger_Spine_C">();
	}
	static class ABP_Interactable_ElevatorTrigger_Spine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Interactable_ElevatorTrigger_Spine_C>();
	}
};
static_assert(alignof(ABP_Interactable_ElevatorTrigger_Spine_C) == 0x000008, "Wrong alignment on ABP_Interactable_ElevatorTrigger_Spine_C");
static_assert(sizeof(ABP_Interactable_ElevatorTrigger_Spine_C) == 0x000348, "Wrong size on ABP_Interactable_ElevatorTrigger_Spine_C");
static_assert(offsetof(ABP_Interactable_ElevatorTrigger_Spine_C, UberGraphFrame_BP_Interactable_ElevatorTrigger_Spine_C) == 0x000330, "Member 'ABP_Interactable_ElevatorTrigger_Spine_C::UberGraphFrame_BP_Interactable_ElevatorTrigger_Spine_C' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_ElevatorTrigger_Spine_C, SpineSkeletonAnimation) == 0x000338, "Member 'ABP_Interactable_ElevatorTrigger_Spine_C::SpineSkeletonAnimation' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_ElevatorTrigger_Spine_C, SpineSkeletonRenderer) == 0x000340, "Member 'ABP_Interactable_ElevatorTrigger_Spine_C::SpineSkeletonRenderer' has a wrong offset!");

}

