#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Interactable_RestPoint

#include "Basic.hpp"

#include "Zion_structs.hpp"
#include "Engine_structs.hpp"
#include "EventSystem_structs.hpp"


namespace SDK::Params
{

// Function BP_Interactable_RestPoint.BP_Interactable_RestPoint_C.ExecuteUbergraph_BP_Interactable_RestPoint
// 0x0150 (0x0150 - 0x0000)
struct BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_Event_Controller;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerZion*                  K2Node_DynamicCast_AsPlayer_Controller_Zion;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UEventPlayer*                           K2Node_CustomEvent_EventPlayer_1;                  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bCompletedEvent_1;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEventPlayerResult                            K2Node_CustomEvent_EventResult_1;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UEventPlayer* EventPlayer, bool bCompletedEvent, EEventPlayerResult EventResult)> K2Node_CreateDelegate_OutputDelegate; // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEventPlayer*                           CallFunc_CreateEventPlayer_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEventPlayer*                           K2Node_CustomEvent_EventPlayer;                    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bCompletedEvent;                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEventPlayerResult                            K2Node_CustomEvent_EventResult;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    CallFunc_GetNextEventDataHandle_ReturnValue;       // 0x0058(0x0010)(ConstParm, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    CallFunc_GetNextEventDataHandle_ReturnValue_1;     // 0x0070(0x0010)(ConstParm, NoDestructor)
	class APlayerController*                      K2Node_CustomEvent_Controller;                     // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERestEventSkipTarget                          K2Node_CustomEvent_SkipTarget;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  K2Node_DynamicCast_AsPlayer_Controller_Zion_1;     // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRestPointEventData                    CallFunc_GetRestPointEventData_out_RestPointEventData; // 0x00A0(0x0090)()
	bool                                          CallFunc_GetRestPointEventData_ReturnValue;        // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEventAsset*                            K2Node_DynamicCast_AsEvent_Asset;                  // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint) == 0x000008, "Wrong alignment on BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint");
static_assert(sizeof(BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint) == 0x000150, "Wrong size on BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint");
static_assert(offsetof(BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint, EntryPoint) == 0x000000, "Member 'BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint, K2Node_Event_Controller) == 0x000008, "Member 'BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint::K2Node_Event_Controller' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint, K2Node_DynamicCast_AsPlayer_Controller_Zion) == 0x000010, "Member 'BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint::K2Node_DynamicCast_AsPlayer_Controller_Zion' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint, K2Node_CustomEvent_EventPlayer_1) == 0x000020, "Member 'BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint::K2Node_CustomEvent_EventPlayer_1' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint, K2Node_CustomEvent_bCompletedEvent_1) == 0x000028, "Member 'BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint::K2Node_CustomEvent_bCompletedEvent_1' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint, K2Node_CustomEvent_EventResult_1) == 0x000029, "Member 'BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint::K2Node_CustomEvent_EventResult_1' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint, CallFunc_CreateEventPlayer_ReturnValue) == 0x000040, "Member 'BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint::CallFunc_CreateEventPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint, K2Node_CustomEvent_EventPlayer) == 0x000048, "Member 'BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint::K2Node_CustomEvent_EventPlayer' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint, K2Node_CustomEvent_bCompletedEvent) == 0x000050, "Member 'BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint::K2Node_CustomEvent_bCompletedEvent' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint, K2Node_CustomEvent_EventResult) == 0x000051, "Member 'BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint::K2Node_CustomEvent_EventResult' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint, CallFunc_IsValid_ReturnValue_2) == 0x000052, "Member 'BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint, CallFunc_GetNextEventDataHandle_ReturnValue) == 0x000058, "Member 'BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint::CallFunc_GetNextEventDataHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint, CallFunc_IsValid_ReturnValue_3) == 0x000068, "Member 'BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint, CallFunc_IsValid_ReturnValue_4) == 0x000069, "Member 'BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint, CallFunc_GetNextEventDataHandle_ReturnValue_1) == 0x000070, "Member 'BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint::CallFunc_GetNextEventDataHandle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint, K2Node_CustomEvent_Controller) == 0x000080, "Member 'BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint::K2Node_CustomEvent_Controller' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint, K2Node_CustomEvent_SkipTarget) == 0x000088, "Member 'BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint::K2Node_CustomEvent_SkipTarget' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint, K2Node_DynamicCast_AsPlayer_Controller_Zion_1) == 0x000090, "Member 'BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint::K2Node_DynamicCast_AsPlayer_Controller_Zion_1' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint, CallFunc_GetRestPointEventData_out_RestPointEventData) == 0x0000A0, "Member 'BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint::CallFunc_GetRestPointEventData_out_RestPointEventData' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint, CallFunc_GetRestPointEventData_ReturnValue) == 0x000130, "Member 'BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint::CallFunc_GetRestPointEventData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000138, "Member 'BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint, K2Node_DynamicCast_AsEvent_Asset) == 0x000140, "Member 'BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint::K2Node_DynamicCast_AsEvent_Asset' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint, K2Node_DynamicCast_bSuccess_2) == 0x000148, "Member 'BP_Interactable_RestPoint_C_ExecuteUbergraph_BP_Interactable_RestPoint::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BP_Interactable_RestPoint.BP_Interactable_RestPoint_C.InstantRest
// 0x0010 (0x0010 - 0x0000)
struct BP_Interactable_RestPoint_C_InstantRest final
{
public:
	class APlayerController*                      Controller;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERestEventSkipTarget                          SkipTarget;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_RestPoint_C_InstantRest) == 0x000008, "Wrong alignment on BP_Interactable_RestPoint_C_InstantRest");
static_assert(sizeof(BP_Interactable_RestPoint_C_InstantRest) == 0x000010, "Wrong size on BP_Interactable_RestPoint_C_InstantRest");
static_assert(offsetof(BP_Interactable_RestPoint_C_InstantRest, Controller) == 0x000000, "Member 'BP_Interactable_RestPoint_C_InstantRest::Controller' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_InstantRest, SkipTarget) == 0x000008, "Member 'BP_Interactable_RestPoint_C_InstantRest::SkipTarget' has a wrong offset!");

// Function BP_Interactable_RestPoint.BP_Interactable_RestPoint_C.OnInteract
// 0x0008 (0x0008 - 0x0000)
struct BP_Interactable_RestPoint_C_OnInteract final
{
public:
	class APlayerController*                      Controller;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_RestPoint_C_OnInteract) == 0x000008, "Wrong alignment on BP_Interactable_RestPoint_C_OnInteract");
static_assert(sizeof(BP_Interactable_RestPoint_C_OnInteract) == 0x000008, "Wrong size on BP_Interactable_RestPoint_C_OnInteract");
static_assert(offsetof(BP_Interactable_RestPoint_C_OnInteract, Controller) == 0x000000, "Member 'BP_Interactable_RestPoint_C_OnInteract::Controller' has a wrong offset!");

// Function BP_Interactable_RestPoint.BP_Interactable_RestPoint_C.OnRestEventFinished
// 0x0010 (0x0010 - 0x0000)
struct BP_Interactable_RestPoint_C_OnRestEventFinished final
{
public:
	class UEventPlayer*                           EventPlayer;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bCompletedEvent;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEventPlayerResult                            EventResult;                                       // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_RestPoint_C_OnRestEventFinished) == 0x000008, "Wrong alignment on BP_Interactable_RestPoint_C_OnRestEventFinished");
static_assert(sizeof(BP_Interactable_RestPoint_C_OnRestEventFinished) == 0x000010, "Wrong size on BP_Interactable_RestPoint_C_OnRestEventFinished");
static_assert(offsetof(BP_Interactable_RestPoint_C_OnRestEventFinished, EventPlayer) == 0x000000, "Member 'BP_Interactable_RestPoint_C_OnRestEventFinished::EventPlayer' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_OnRestEventFinished, bCompletedEvent) == 0x000008, "Member 'BP_Interactable_RestPoint_C_OnRestEventFinished::bCompletedEvent' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_OnRestEventFinished, EventResult) == 0x000009, "Member 'BP_Interactable_RestPoint_C_OnRestEventFinished::EventResult' has a wrong offset!");

// Function BP_Interactable_RestPoint.BP_Interactable_RestPoint_C.OnRestMenuEventFinished
// 0x0010 (0x0010 - 0x0000)
struct BP_Interactable_RestPoint_C_OnRestMenuEventFinished final
{
public:
	class UEventPlayer*                           EventPlayer;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bCompletedEvent;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEventPlayerResult                            EventResult;                                       // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_RestPoint_C_OnRestMenuEventFinished) == 0x000008, "Wrong alignment on BP_Interactable_RestPoint_C_OnRestMenuEventFinished");
static_assert(sizeof(BP_Interactable_RestPoint_C_OnRestMenuEventFinished) == 0x000010, "Wrong size on BP_Interactable_RestPoint_C_OnRestMenuEventFinished");
static_assert(offsetof(BP_Interactable_RestPoint_C_OnRestMenuEventFinished, EventPlayer) == 0x000000, "Member 'BP_Interactable_RestPoint_C_OnRestMenuEventFinished::EventPlayer' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_OnRestMenuEventFinished, bCompletedEvent) == 0x000008, "Member 'BP_Interactable_RestPoint_C_OnRestMenuEventFinished::bCompletedEvent' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_OnRestMenuEventFinished, EventResult) == 0x000009, "Member 'BP_Interactable_RestPoint_C_OnRestMenuEventFinished::EventResult' has a wrong offset!");

// Function BP_Interactable_RestPoint.BP_Interactable_RestPoint_C.PlayEvent
// 0x0280 (0x0280 - 0x0000)
struct BP_Interactable_RestPoint_C_PlayEvent final
{
public:
	class UEventPlayer*                           EventPlayer;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEventAsset*                            EventAsset;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERestEventSkipTarget                          SkipTarget;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERestEventSkipTarget                          Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    CallFunc_GetRestPointDataHandle_ReturnValue;       // 0x0038(0x0010)(ConstParm, NoDestructor)
	TMap<class FName, struct FDataTableRowHandle> K2Node_MakeMap_Map;                                // 0x0048(0x0050)()
	class FName                                   K2Node_Select_Default;                             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class FName>                K2Node_MakeMap_Map_1;                              // 0x00A0(0x0050)()
	struct FEventBlackboardInit                   K2Node_MakeStruct_EventBlackboardInit;             // 0x00F0(0x0140)()
	TMap<class FName, class AActor*>              K2Node_MakeMap_Map_2;                              // 0x0230(0x0050)(ConstParm)
};
static_assert(alignof(BP_Interactable_RestPoint_C_PlayEvent) == 0x000008, "Wrong alignment on BP_Interactable_RestPoint_C_PlayEvent");
static_assert(sizeof(BP_Interactable_RestPoint_C_PlayEvent) == 0x000280, "Wrong size on BP_Interactable_RestPoint_C_PlayEvent");
static_assert(offsetof(BP_Interactable_RestPoint_C_PlayEvent, EventPlayer) == 0x000000, "Member 'BP_Interactable_RestPoint_C_PlayEvent::EventPlayer' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_PlayEvent, EventAsset) == 0x000008, "Member 'BP_Interactable_RestPoint_C_PlayEvent::EventAsset' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_PlayEvent, SkipTarget) == 0x000010, "Member 'BP_Interactable_RestPoint_C_PlayEvent::SkipTarget' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_PlayEvent, Temp_byte_Variable) == 0x000011, "Member 'BP_Interactable_RestPoint_C_PlayEvent::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_PlayEvent, Temp_name_Variable) == 0x000014, "Member 'BP_Interactable_RestPoint_C_PlayEvent::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_PlayEvent, Temp_name_Variable_1) == 0x00001C, "Member 'BP_Interactable_RestPoint_C_PlayEvent::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_PlayEvent, Temp_name_Variable_2) == 0x000024, "Member 'BP_Interactable_RestPoint_C_PlayEvent::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_PlayEvent, Temp_name_Variable_3) == 0x00002C, "Member 'BP_Interactable_RestPoint_C_PlayEvent::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_PlayEvent, CallFunc_GetRestPointDataHandle_ReturnValue) == 0x000038, "Member 'BP_Interactable_RestPoint_C_PlayEvent::CallFunc_GetRestPointDataHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_PlayEvent, K2Node_MakeMap_Map) == 0x000048, "Member 'BP_Interactable_RestPoint_C_PlayEvent::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_PlayEvent, K2Node_Select_Default) == 0x000098, "Member 'BP_Interactable_RestPoint_C_PlayEvent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_PlayEvent, K2Node_MakeMap_Map_1) == 0x0000A0, "Member 'BP_Interactable_RestPoint_C_PlayEvent::K2Node_MakeMap_Map_1' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_PlayEvent, K2Node_MakeStruct_EventBlackboardInit) == 0x0000F0, "Member 'BP_Interactable_RestPoint_C_PlayEvent::K2Node_MakeStruct_EventBlackboardInit' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_PlayEvent, K2Node_MakeMap_Map_2) == 0x000230, "Member 'BP_Interactable_RestPoint_C_PlayEvent::K2Node_MakeMap_Map_2' has a wrong offset!");

// Function BP_Interactable_RestPoint.BP_Interactable_RestPoint_C.PlayRestMenuEvent
// 0x0002 (0x0002 - 0x0000)
struct BP_Interactable_RestPoint_C_PlayRestMenuEvent final
{
public:
	ERestEventSkipTarget                          SkipTarget;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_RestPoint_C_PlayRestMenuEvent) == 0x000001, "Wrong alignment on BP_Interactable_RestPoint_C_PlayRestMenuEvent");
static_assert(sizeof(BP_Interactable_RestPoint_C_PlayRestMenuEvent) == 0x000002, "Wrong size on BP_Interactable_RestPoint_C_PlayRestMenuEvent");
static_assert(offsetof(BP_Interactable_RestPoint_C_PlayRestMenuEvent, SkipTarget) == 0x000000, "Member 'BP_Interactable_RestPoint_C_PlayRestMenuEvent::SkipTarget' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_PlayRestMenuEvent, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_Interactable_RestPoint_C_PlayRestMenuEvent::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Interactable_RestPoint.BP_Interactable_RestPoint_C.SetupEventPlayer
// 0x0048 (0x0048 - 0x0000)
struct BP_Interactable_RestPoint_C_SetupEventPlayer final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEventContext*                          CallFunc_GetEventContext_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    CallFunc_GetRestPointDataHandle_ReturnValue;       // 0x0010(0x0010)(ConstParm, NoDestructor)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UEventPlayer* EventPlayer, bool bCompletedEvent, EEventPlayerResult EventResult)> K2Node_CreateDelegate_OutputDelegate; // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEventPlayer*                           CallFunc_CreateEventPlayer_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_RestPoint_C_SetupEventPlayer) == 0x000008, "Wrong alignment on BP_Interactable_RestPoint_C_SetupEventPlayer");
static_assert(sizeof(BP_Interactable_RestPoint_C_SetupEventPlayer) == 0x000048, "Wrong size on BP_Interactable_RestPoint_C_SetupEventPlayer");
static_assert(offsetof(BP_Interactable_RestPoint_C_SetupEventPlayer, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_Interactable_RestPoint_C_SetupEventPlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_RestPoint_C_SetupEventPlayer, CallFunc_GetEventContext_ReturnValue) == 0x000008, "Member 'BP_Interactable_RestPoint_C_SetupEventPlayer::CallFunc_GetEventContext_ReturnValue' has a wrong offset!");
