#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Interactable_RestPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"
#include "EventSystem_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Interactable_RestPoint.BP_Interactable_RestPoint_C
// 0x0058 (0x03A8 - 0x0350)
class ABP_Interactable_RestPoint_C final : public AInteractable_RestPoint
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFMODAudioComponent*                    FMODAudio;                                         // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URenderStateComponent*                  RenderState;                                       // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere;                                            // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       SphereCollider;                                    // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UEventPlayer*                           RestMenuEventPlayer;                               // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class APlayerControllerZion*                  PlayerControllerZion;                              // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FDataTableRowHandle                    RestEventDataHandle;                               // 0x0390(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor, AdvancedDisplay)
	class UEventPlayer*                           RestEventPlayer;                                   // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Interactable_RestPoint(int32 EntryPoint);
	void InstantRest(class APlayerController* Controller, ERestEventSkipTarget SkipTarget);
	void LeaveRestPoint();
	void OnInteract(class APlayerController* Controller);
	void OnRestEventFinished(class UEventPlayer* EventPlayer, bool bCompletedEvent, EEventPlayerResult EventResult);
	void OnRestMenuEventFinished(class UEventPlayer* EventPlayer, bool bCompletedEvent, EEventPlayerResult EventResult);
	void PlayEvent(class UEventPlayer* EventPlayer, class UEventAsset* EventAsset, ERestEventSkipTarget SkipTarget);
	void PlayRestMenuEvent(ERestEventSkipTarget SkipTarget);
	void SetupEventPlayer();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Interactable_RestPoint_C">();
	}
	static class ABP_Interactable_RestPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Interactable_RestPoint_C>();
	}
};
static_assert(alignof(ABP_Interactable_RestPoint_C) == 0x000008, "Wrong alignment on ABP_Interactable_RestPoint_C");
static_assert(sizeof(ABP_Interactable_RestPoint_C) == 0x0003A8, "Wrong size on ABP_Interactable_RestPoint_C");
static_assert(offsetof(ABP_Interactable_RestPoint_C, UberGraphFrame) == 0x000350, "Member 'ABP_Interactable_RestPoint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_RestPoint_C, FMODAudio) == 0x000358, "Member 'ABP_Interactable_RestPoint_C::FMODAudio' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_RestPoint_C, RenderState) == 0x000360, "Member 'ABP_Interactable_RestPoint_C::RenderState' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_RestPoint_C, Niagara) == 0x000368, "Member 'ABP_Interactable_RestPoint_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_RestPoint_C, Sphere) == 0x000370, "Member 'ABP_Interactable_RestPoint_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_RestPoint_C, SphereCollider) == 0x000378, "Member 'ABP_Interactable_RestPoint_C::SphereCollider' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_RestPoint_C, RestMenuEventPlayer) == 0x000380, "Member 'ABP_Interactable_RestPoint_C::RestMenuEventPlayer' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_RestPoint_C, PlayerControllerZion) == 0x000388, "Member 'ABP_Interactable_RestPoint_C::PlayerControllerZion' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_RestPoint_C, RestEventDataHandle) == 0x000390, "Member 'ABP_Interactable_RestPoint_C::RestEventDataHandle' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_RestPoint_C, RestEventPlayer) == 0x0003A0, "Member 'ABP_Interactable_RestPoint_C::RestEventPlayer' has a wrong offset!");

}

