#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Interactable_Door_Magic

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Interactable_Door_classes.hpp"
#include "Zion_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Interactable_Door_Magic.BP_Interactable_Door_Magic_C
// 0x0028 (0x0648 - 0x0620)
class ABP_Interactable_Door_Magic_C final : public ABP_Interactable_Door_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Interactable_Door_Magic_C;       // 0x0620(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        LightFXLocation;                                   // 0x0628(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPaperSpriteComponent*                  PaperSprite;                                       // 0x0630(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      LightFXInstance;                                   // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          IsMarkedOpen;                                      // 0x0640(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void UnbindPlayerEvent();
	void StopLightFX();
	void RefreshLightFX(bool ConditionsChecked_0, bool Open);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void PlayAnimation(bool bOpen, bool bRequestInstant);
	void OnItemAdded_Event(const class UInventory* Inventory, const class FName& ItemId, int32 AddedCount);
	void OnInteract(class APlayerController* Controller);
	void ExecuteUbergraph_BP_Interactable_Door_Magic(int32 EntryPoint);
	void BndEvt__BP_Interactable_Door_Magic_ClearComponent_K2Node_ComponentBoundEvent_1_ClearableDelegate__DelegateSignature(EClearStatus ClearStatus);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Interactable_Door_Magic_C">();
	}
	static class ABP_Interactable_Door_Magic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Interactable_Door_Magic_C>();
	}
};
static_assert(alignof(ABP_Interactable_Door_Magic_C) == 0x000008, "Wrong alignment on ABP_Interactable_Door_Magic_C");
static_assert(sizeof(ABP_Interactable_Door_Magic_C) == 0x000648, "Wrong size on ABP_Interactable_Door_Magic_C");
static_assert(offsetof(ABP_Interactable_Door_Magic_C, UberGraphFrame_BP_Interactable_Door_Magic_C) == 0x000620, "Member 'ABP_Interactable_Door_Magic_C::UberGraphFrame_BP_Interactable_Door_Magic_C' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_Door_Magic_C, LightFXLocation) == 0x000628, "Member 'ABP_Interactable_Door_Magic_C::LightFXLocation' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_Door_Magic_C, PaperSprite) == 0x000630, "Member 'ABP_Interactable_Door_Magic_C::PaperSprite' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_Door_Magic_C, LightFXInstance) == 0x000638, "Member 'ABP_Interactable_Door_Magic_C::LightFXInstance' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_Door_Magic_C, IsMarkedOpen) == 0x000640, "Member 'ABP_Interactable_Door_Magic_C::IsMarkedOpen' has a wrong offset!");

}

