#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Interactable_GameMapChange_Condition

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Interactable_GameMapChange_Condition.BP_Interactable_GameMapChange_Condition_C.CanBeInteracted
// 0x0018 (0x0018 - 0x0000)
struct BP_Interactable_GameMapChange_Condition_C_CanBeInteracted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanBeInteracted_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckGameplayConditions_ReturnValue;      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Interactable_GameMapChange_Condition_C_CanBeInteracted) == 0x000008, "Wrong alignment on BP_Interactable_GameMapChange_Condition_C_CanBeInteracted");
static_assert(sizeof(BP_Interactable_GameMapChange_Condition_C_CanBeInteracted) == 0x000018, "Wrong size on BP_Interactable_GameMapChange_Condition_C_CanBeInteracted");
static_assert(offsetof(BP_Interactable_GameMapChange_Condition_C_CanBeInteracted, ReturnValue) == 0x000000, "Member 'BP_Interactable_GameMapChange_Condition_C_CanBeInteracted::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_GameMapChange_Condition_C_CanBeInteracted, CallFunc_Get_ReturnValue) == 0x000008, "Member 'BP_Interactable_GameMapChange_Condition_C_CanBeInteracted::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_GameMapChange_Condition_C_CanBeInteracted, CallFunc_CanBeInteracted_ReturnValue) == 0x000010, "Member 'BP_Interactable_GameMapChange_Condition_C_CanBeInteracted::CallFunc_CanBeInteracted_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_GameMapChange_Condition_C_CanBeInteracted, CallFunc_CheckGameplayConditions_ReturnValue) == 0x000011, "Member 'BP_Interactable_GameMapChange_Condition_C_CanBeInteracted::CallFunc_CheckGameplayConditions_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Interactable_GameMapChange_Condition_C_CanBeInteracted, CallFunc_BooleanAND_ReturnValue) == 0x000012, "Member 'BP_Interactable_GameMapChange_Condition_C_CanBeInteracted::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

