#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_p0000_Lilac

#include "Basic.hpp"

#include "BP_CharacterZion_Player_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_p0000_Lilac.BP_p0000_Lilac_C
// 0x0080 (0x0AB0 - 0x0A30)
class ABP_p0000_Lilac_C final : public ABP_CharacterZion_Player_C
{
public:
	class USpineBoneFollowerComponent*            SpineBoneFollower_Head;                            // 0x0A28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpineBoneFollowerComponent*            SpineBoneFollower_Hip;                             // 0x0A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CustomHurtbox_Counter;                             // 0x0A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CustomHurtbox_Parry;                               // 0x0A40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CustomHurtbox_Counter_Air;                         // 0x0A48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpineBoneDriverComponent*              BoneDriver_HookTarget;                             // 0x0A50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpineBoneDriverComponent*              BoneDriver_FootRight;                              // 0x0A58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpineBoneDriverComponent*              BoneDriver_FootLeft;                               // 0x0A60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpineAdditiveAccessoryComponent*       SpineAdditiveAccessory;                            // 0x0A68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Hurtbox_Hip;                                       // 0x0A70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Hurtbox_Head;                                      // 0x0A78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow2;                                            // 0x0A80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow1;                                            // 0x0A88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   EDITOR_FootLeft_Visual;                            // 0x0A90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   EDITOR_FootRight_Visual;                           // 0x0A98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UIKBonesComponent*                      IKBones;                                           // 0x0AA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFootIKComponent*                       FootIK;                                            // 0x0AA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_p0000_Lilac_C">();
	}
	static class ABP_p0000_Lilac_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_p0000_Lilac_C>();
	}
};
static_assert(alignof(ABP_p0000_Lilac_C) == 0x000010, "Wrong alignment on ABP_p0000_Lilac_C");
static_assert(sizeof(ABP_p0000_Lilac_C) == 0x000AB0, "Wrong size on ABP_p0000_Lilac_C");
static_assert(offsetof(ABP_p0000_Lilac_C, SpineBoneFollower_Head) == 0x000A28, "Member 'ABP_p0000_Lilac_C::SpineBoneFollower_Head' has a wrong offset!");
static_assert(offsetof(ABP_p0000_Lilac_C, SpineBoneFollower_Hip) == 0x000A30, "Member 'ABP_p0000_Lilac_C::SpineBoneFollower_Hip' has a wrong offset!");
static_assert(offsetof(ABP_p0000_Lilac_C, CustomHurtbox_Counter) == 0x000A38, "Member 'ABP_p0000_Lilac_C::CustomHurtbox_Counter' has a wrong offset!");
static_assert(offsetof(ABP_p0000_Lilac_C, CustomHurtbox_Parry) == 0x000A40, "Member 'ABP_p0000_Lilac_C::CustomHurtbox_Parry' has a wrong offset!");
static_assert(offsetof(ABP_p0000_Lilac_C, CustomHurtbox_Counter_Air) == 0x000A48, "Member 'ABP_p0000_Lilac_C::CustomHurtbox_Counter_Air' has a wrong offset!");
static_assert(offsetof(ABP_p0000_Lilac_C, BoneDriver_HookTarget) == 0x000A50, "Member 'ABP_p0000_Lilac_C::BoneDriver_HookTarget' has a wrong offset!");
static_assert(offsetof(ABP_p0000_Lilac_C, BoneDriver_FootRight) == 0x000A58, "Member 'ABP_p0000_Lilac_C::BoneDriver_FootRight' has a wrong offset!");
static_assert(offsetof(ABP_p0000_Lilac_C, BoneDriver_FootLeft) == 0x000A60, "Member 'ABP_p0000_Lilac_C::BoneDriver_FootLeft' has a wrong offset!");
static_assert(offsetof(ABP_p0000_Lilac_C, SpineAdditiveAccessory) == 0x000A68, "Member 'ABP_p0000_Lilac_C::SpineAdditiveAccessory' has a wrong offset!");
static_assert(offsetof(ABP_p0000_Lilac_C, Hurtbox_Hip) == 0x000A70, "Member 'ABP_p0000_Lilac_C::Hurtbox_Hip' has a wrong offset!");
static_assert(offsetof(ABP_p0000_Lilac_C, Hurtbox_Head) == 0x000A78, "Member 'ABP_p0000_Lilac_C::Hurtbox_Head' has a wrong offset!");
static_assert(offsetof(ABP_p0000_Lilac_C, Arrow2) == 0x000A80, "Member 'ABP_p0000_Lilac_C::Arrow2' has a wrong offset!");
static_assert(offsetof(ABP_p0000_Lilac_C, Arrow1) == 0x000A88, "Member 'ABP_p0000_Lilac_C::Arrow1' has a wrong offset!");
static_assert(offsetof(ABP_p0000_Lilac_C, EDITOR_FootLeft_Visual) == 0x000A90, "Member 'ABP_p0000_Lilac_C::EDITOR_FootLeft_Visual' has a wrong offset!");
static_assert(offsetof(ABP_p0000_Lilac_C, EDITOR_FootRight_Visual) == 0x000A98, "Member 'ABP_p0000_Lilac_C::EDITOR_FootRight_Visual' has a wrong offset!");
static_assert(offsetof(ABP_p0000_Lilac_C, IKBones) == 0x000AA0, "Member 'ABP_p0000_Lilac_C::IKBones' has a wrong offset!");
static_assert(offsetof(ABP_p0000_Lilac_C, FootIK) == 0x000AA8, "Member 'ABP_p0000_Lilac_C::FootIK' has a wrong offset!");

}

