#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerControllerZion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "Zion_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerControllerZion.BP_PlayerControllerZion_C.AddCommand
// 0x0038 (0x0038 - 0x0000)
struct BP_PlayerControllerZion_C_AddCommand final
{
public:
	class UClass*                                 Command;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<TSubclassOf<class UCommand>>           K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommandComponent*                      CallFunc_GetComponentByClass_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerControllerZion_C_AddCommand) == 0x000008, "Wrong alignment on BP_PlayerControllerZion_C_AddCommand");
static_assert(sizeof(BP_PlayerControllerZion_C_AddCommand) == 0x000038, "Wrong size on BP_PlayerControllerZion_C_AddCommand");
static_assert(offsetof(BP_PlayerControllerZion_C_AddCommand, Command) == 0x000000, "Member 'BP_PlayerControllerZion_C_AddCommand::Command' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_AddCommand, CallFunc_K2_GetPawn_ReturnValue) == 0x000008, "Member 'BP_PlayerControllerZion_C_AddCommand::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_AddCommand, K2Node_MakeArray_Array) == 0x000010, "Member 'BP_PlayerControllerZion_C_AddCommand::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_AddCommand, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_PlayerControllerZion_C_AddCommand::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_AddCommand, CallFunc_GetComponentByClass_ReturnValue) == 0x000028, "Member 'BP_PlayerControllerZion_C_AddCommand::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_AddCommand, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'BP_PlayerControllerZion_C_AddCommand::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_PlayerControllerZion.BP_PlayerControllerZion_C.AddFastTravelCommand
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerControllerZion_C_AddFastTravelCommand final
{
public:
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAptitude_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerControllerZion_C_AddFastTravelCommand) == 0x000008, "Wrong alignment on BP_PlayerControllerZion_C_AddFastTravelCommand");
static_assert(sizeof(BP_PlayerControllerZion_C_AddFastTravelCommand) == 0x000010, "Wrong size on BP_PlayerControllerZion_C_AddFastTravelCommand");
static_assert(offsetof(BP_PlayerControllerZion_C_AddFastTravelCommand, CallFunc_MakeLiteralByte_ReturnValue) == 0x000000, "Member 'BP_PlayerControllerZion_C_AddFastTravelCommand::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_AddFastTravelCommand, Temp_bool_Variable) == 0x000001, "Member 'BP_PlayerControllerZion_C_AddFastTravelCommand::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_AddFastTravelCommand, CallFunc_HasAptitude_ReturnValue) == 0x000002, "Member 'BP_PlayerControllerZion_C_AddFastTravelCommand::CallFunc_HasAptitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_AddFastTravelCommand, K2Node_Select_Default) == 0x000008, "Member 'BP_PlayerControllerZion_C_AddFastTravelCommand::K2Node_Select_Default' has a wrong offset!");

// Function BP_PlayerControllerZion.BP_PlayerControllerZion_C.BndEvt__BP_PlayerControllerZion_HealComponent_K2Node_ComponentBoundEvent_1_RestoreHealsEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_PlayerControllerZion_C_BndEvt__BP_PlayerControllerZion_HealComponent_K2Node_ComponentBoundEvent_1_RestoreHealsEvent__DelegateSignature final
{
public:
	int32                                         RestoredHealCount;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerControllerZion_C_BndEvt__BP_PlayerControllerZion_HealComponent_K2Node_ComponentBoundEvent_1_RestoreHealsEvent__DelegateSignature) == 0x000004, "Wrong alignment on BP_PlayerControllerZion_C_BndEvt__BP_PlayerControllerZion_HealComponent_K2Node_ComponentBoundEvent_1_RestoreHealsEvent__DelegateSignature");
static_assert(sizeof(BP_PlayerControllerZion_C_BndEvt__BP_PlayerControllerZion_HealComponent_K2Node_ComponentBoundEvent_1_RestoreHealsEvent__DelegateSignature) == 0x000004, "Wrong size on BP_PlayerControllerZion_C_BndEvt__BP_PlayerControllerZion_HealComponent_K2Node_ComponentBoundEvent_1_RestoreHealsEvent__DelegateSignature");
static_assert(offsetof(BP_PlayerControllerZion_C_BndEvt__BP_PlayerControllerZion_HealComponent_K2Node_ComponentBoundEvent_1_RestoreHealsEvent__DelegateSignature, RestoredHealCount) == 0x000000, "Member 'BP_PlayerControllerZion_C_BndEvt__BP_PlayerControllerZion_HealComponent_K2Node_ComponentBoundEvent_1_RestoreHealsEvent__DelegateSignature::RestoredHealCount' has a wrong offset!");

// Function BP_PlayerControllerZion.BP_PlayerControllerZion_C.CanOpenMenu
// 0x0020 (0x0020 - 0x0000)
struct BP_PlayerControllerZion_C_CanOpenMenu final
{
public:
	bool                                          bResult;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFadeSubsystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyFadeVisible_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerControllerZion_C_CanOpenMenu) == 0x000008, "Wrong alignment on BP_PlayerControllerZion_C_CanOpenMenu");
static_assert(sizeof(BP_PlayerControllerZion_C_CanOpenMenu) == 0x000020, "Wrong size on BP_PlayerControllerZion_C_CanOpenMenu");
static_assert(offsetof(BP_PlayerControllerZion_C_CanOpenMenu, bResult) == 0x000000, "Member 'BP_PlayerControllerZion_C_CanOpenMenu::bResult' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_CanOpenMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'BP_PlayerControllerZion_C_CanOpenMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_CanOpenMenu, CallFunc_IsAnyFadeVisible_ReturnValue) == 0x000010, "Member 'BP_PlayerControllerZion_C_CanOpenMenu::CallFunc_IsAnyFadeVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_CanOpenMenu, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_PlayerControllerZion_C_CanOpenMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_CanOpenMenu, CallFunc_Not_PreBool_ReturnValue) == 0x000012, "Member 'BP_PlayerControllerZion_C_CanOpenMenu::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_CanOpenMenu, CallFunc_Not_PreBool_ReturnValue_1) == 0x000013, "Member 'BP_PlayerControllerZion_C_CanOpenMenu::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_CanOpenMenu, CallFunc_IsValid_ReturnValue_1) == 0x000014, "Member 'BP_PlayerControllerZion_C_CanOpenMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_CanOpenMenu, CallFunc_IsValid_ReturnValue_2) == 0x000015, "Member 'BP_PlayerControllerZion_C_CanOpenMenu::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_CanOpenMenu, CallFunc_Not_PreBool_ReturnValue_2) == 0x000016, "Member 'BP_PlayerControllerZion_C_CanOpenMenu::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_CanOpenMenu, CallFunc_Not_PreBool_ReturnValue_3) == 0x000017, "Member 'BP_PlayerControllerZion_C_CanOpenMenu::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_CanOpenMenu, CallFunc_BooleanAND_ReturnValue) == 0x000018, "Member 'BP_PlayerControllerZion_C_CanOpenMenu::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_CanOpenMenu, CallFunc_BooleanAND_ReturnValue_1) == 0x000019, "Member 'BP_PlayerControllerZion_C_CanOpenMenu::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_CanOpenMenu, CallFunc_BooleanAND_ReturnValue_2) == 0x00001A, "Member 'BP_PlayerControllerZion_C_CanOpenMenu::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function BP_PlayerControllerZion.BP_PlayerControllerZion_C.CloseAllMenus
// 0x0003 (0x0003 - 0x0000)
struct BP_PlayerControllerZion_C_CloseAllMenus final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerControllerZion_C_CloseAllMenus) == 0x000001, "Wrong alignment on BP_PlayerControllerZion_C_CloseAllMenus");
static_assert(sizeof(BP_PlayerControllerZion_C_CloseAllMenus) == 0x000003, "Wrong size on BP_PlayerControllerZion_C_CloseAllMenus");
static_assert(offsetof(BP_PlayerControllerZion_C_CloseAllMenus, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_PlayerControllerZion_C_CloseAllMenus::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_CloseAllMenus, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'BP_PlayerControllerZion_C_CloseAllMenus::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_CloseAllMenus, CallFunc_IsValid_ReturnValue_2) == 0x000002, "Member 'BP_PlayerControllerZion_C_CloseAllMenus::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function BP_PlayerControllerZion.BP_PlayerControllerZion_C.ExecuteUbergraph_BP_PlayerControllerZion
// 0x07A0 (0x07A0 - 0x0000)
struct BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_DisplayAreaName_C*                 CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FStoryLevelData                        CallFunc_GetStoryLevelData_ReturnValue;            // 0x0010(0x0050)(ConstParm)
	class UWorldLoaderSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCurrentGameMapID_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDelayUndilatedAsyncAction*             CallFunc_DelayUndilated_ReturnValue;               // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x00B8(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x00E0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Location_Small_C*                  CallFunc_Create_ReturnValue_1;                     // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_InputActionValueToAxis2D_ReturnValue; // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0118(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Pause_C*                           CallFunc_Create_ReturnValue_2;                     // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_PageIndex;                      // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_DisplayStoryLevelProgression_C*    CallFunc_Create_ReturnValue_3;                     // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanOpenMenu_bResult;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanOpenMenu_bResult_1;                    // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14B[0x5];                                      // 0x014B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_2;                              // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeZion*                          CallFunc_Get_ReturnValue;                          // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameReady_ReturnValue;                  // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLevel_ReturnValue;                     // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_RestoredHealCount;      // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CharacterZion_Player_C*             K2Node_DynamicCast_AsBP_Character_Zion_Player;     // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeZion*                          CallFunc_Get_ReturnValue_1;                        // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameReady_ReturnValue_1;                // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CharacterZion_Player_C*             K2Node_DynamicCast_AsBP_Character_Zion_Player_1;   // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERespawnReason                                K2Node_Event_RespawnReason;                        // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AB[0x5];                                      // 0x01AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_Event_TutorialIDs;                          // 0x01B0(0x0010)(ConstParm, ReferenceParm)
	class FName                                   K2Node_CustomEvent_TutorialID;                     // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeZion*                          CallFunc_Get_ReturnValue_2;                        // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             CallFunc_GetDataTableItemTutorials_ReturnValue;    // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x01D8(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x01F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetRespawnRestPointID_ReturnValue;        // 0x0208(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeZion*                          CallFunc_Get_ReturnValue_3;                        // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_1;                            // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             CallFunc_GetDataTableRestPoints_ReturnValue;       // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRestPointData                         CallFunc_GetDataTableRowFromName_OutRow;           // 0x0228(0x0088)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidgetTutorial*                    CallFunc_TryLaunchTutorialWidget_ReturnValue;      // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_2;     // 0x02C8(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_2;     // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_2;   // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_2;    // 0x02F0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_GameMapID;                            // 0x02F8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAreaNameDisplayed_ReturnValue;          // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3_0;                            // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2_0;                            // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeZion*                          CallFunc_Get_ReturnValue_4;                        // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             CallFunc_GetDataTableGameMaps_ReturnValue;         // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameMapData                           CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0330(0x0140)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_471[0x3];                                      // 0x0471(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47A[0x2];                                      // 0x047A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_AreaName;                             // 0x047C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_484[0x4];                                      // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeZion*                          CallFunc_Get_ReturnValue_5;                        // 0x0488(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_491[0x3];                                      // 0x0491(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 PageIndex)>              K2Node_CreateDelegate_OutputDelegate_4;            // 0x0494(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A4[0x4];                                      // 0x04A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             CallFunc_GetDataTableGameMaps_ReturnValue_1;       // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_GameMenu_C*                        CallFunc_Create_ReturnValue_4;                     // 0x04B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameMapData                           CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x04B8(0x0140)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x05F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x05FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x05FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x05FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FD[0x3];                                      // 0x05FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_4;                              // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_2;                            // 0x0610(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0618(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0638(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x063C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0640(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_649[0x7];                                      // 0x0649(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_5_0;                            // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4_0;                            // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_661[0x3];                                      // 0x0661(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0664(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0674(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0678(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x067C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Interactable_RestPoint_C*           CallFunc_FindInteractableRestPoint_Array_Element;  // 0x0680(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_689[0x7];                                      // 0x0689(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Interactable_RestPoint_C*           CallFunc_FindInteractableRestPoint_Array_Element_1; // 0x0690(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_699[0x3];                                      // 0x0699(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_AchievementID;                        // 0x069C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A4[0x4];                                      // 0x06A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeZion*                          CallFunc_Get_ReturnValue_6;                        // 0x06A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x06B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UDataTable*                             CallFunc_GetDataTableAchievements_ReturnValue;     // 0x06C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x06C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FAchievementData                       CallFunc_GetDataTableRowFromName_OutRow_3;         // 0x06D8(0x0088)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_3;    // 0x0760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_761[0x7];                                      // 0x0761(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_DebugMenu_C*                       CallFunc_Create_ReturnValue_5;                     // 0x0768(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0770(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0780(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable;                              // 0x0790(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion) == 0x000008, "Wrong alignment on BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion");
static_assert(sizeof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion) == 0x0007A0, "Wrong size on BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, EntryPoint) == 0x000000, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_Create_ReturnValue) == 0x000008, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_GetStoryLevelData_ReturnValue) == 0x000010, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_GetStoryLevelData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000060, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_GetCurrentGameMapID_ReturnValue) == 0x000078, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_GetCurrentGameMapID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, K2Node_CreateDelegate_OutputDelegate_1) == 0x000080, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_DelayUndilated_ReturnValue) == 0x000090, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_DelayUndilated_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, Temp_real_Variable) == 0x000098, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_IsValid_ReturnValue) == 0x0000A0, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, Temp_real_Variable_1) == 0x0000A8, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, Temp_object_Variable) == 0x0000B0, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x0000B8, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x0000D8, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x0000DC, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x0000E0, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_Create_ReturnValue_1) == 0x0000E8, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, Temp_real_Variable_1_0) == 0x0000F0, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, Temp_real_Variable_0) == 0x0000F8, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_Conv_InputActionValueToAxis2D_ReturnValue) == 0x000100, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_Conv_InputActionValueToAxis2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, Temp_int_Variable) == 0x000110, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_IsValid_ReturnValue_1) == 0x000114, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, K2Node_CreateDelegate_OutputDelegate_2) == 0x000118, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_IsValid_ReturnValue_2) == 0x000128, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_Create_ReturnValue_2) == 0x000130, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, Temp_bool_Variable) == 0x000138, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, K2Node_CustomEvent_PageIndex) == 0x00013C, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::K2Node_CustomEvent_PageIndex' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_Create_ReturnValue_3) == 0x000140, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_CanOpenMenu_bResult) == 0x000148, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_CanOpenMenu_bResult' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_IsValid_ReturnValue_3) == 0x000149, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_CanOpenMenu_bResult_1) == 0x00014A, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_CanOpenMenu_bResult_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, Temp_real_Variable_2) == 0x000150, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_Get_ReturnValue) == 0x000158, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_IsGameReady_ReturnValue) == 0x000160, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_IsGameReady_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_GetLevel_ReturnValue) == 0x000164, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_GetLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_K2_GetPawn_ReturnValue) == 0x000168, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, K2Node_ComponentBoundEvent_RestoredHealCount) == 0x000170, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::K2Node_ComponentBoundEvent_RestoredHealCount' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, K2Node_DynamicCast_AsBP_Character_Zion_Player) == 0x000178, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::K2Node_DynamicCast_AsBP_Character_Zion_Player' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, K2Node_DynamicCast_bSuccess) == 0x000180, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_Greater_IntInt_ReturnValue) == 0x000181, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_Get_ReturnValue_1) == 0x000188, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_K2_GetPawn_ReturnValue_1) == 0x000190, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_K2_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_IsGameReady_ReturnValue_1) == 0x000198, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_IsGameReady_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, K2Node_DynamicCast_AsBP_Character_Zion_Player_1) == 0x0001A0, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::K2Node_DynamicCast_AsBP_Character_Zion_Player_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, K2Node_DynamicCast_bSuccess_1) == 0x0001A8, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, K2Node_Event_RespawnReason) == 0x0001A9, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::K2Node_Event_RespawnReason' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, K2Node_SwitchEnum_CmpSuccess) == 0x0001AA, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, K2Node_Event_TutorialIDs) == 0x0001B0, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::K2Node_Event_TutorialIDs' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, K2Node_CustomEvent_TutorialID) == 0x0001C0, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::K2Node_CustomEvent_TutorialID' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_Get_ReturnValue_2) == 0x0001C8, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_Get_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_GetDataTableItemTutorials_ReturnValue) == 0x0001D0, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_GetDataTableItemTutorials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, K2Node_MakeStruct_DataTableRowHandle) == 0x0001D8, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_Array_Length_ReturnValue) == 0x0001E8, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0001EC, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001F0, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, Temp_real_Variable_3) == 0x000200, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_GetRespawnRestPointID_ReturnValue) == 0x000208, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_GetRespawnRestPointID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_Get_ReturnValue_3) == 0x000210, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_Get_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, Temp_object_Variable_1) == 0x000218, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_GetDataTableRestPoints_ReturnValue) == 0x000220, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_GetDataTableRestPoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_GetDataTableRowFromName_OutRow) == 0x000228, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0002B0, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_TryLaunchTutorialWidget_ReturnValue) == 0x0002B8, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_TryLaunchTutorialWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, CallFunc_IsValid_ReturnValue_4) == 0x0002C0, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, K2Node_EnhancedInputActionEvent_ActionValue_2) == 0x0002C8, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::K2Node_EnhancedInputActionEvent_ActionValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, K2Node_EnhancedInputActionEvent_ElapsedTime_2) == 0x0002E8, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::K2Node_EnhancedInputActionEvent_ElapsedTime_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, K2Node_EnhancedInputActionEvent_TriggeredTime_2) == 0x0002EC, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::K2Node_EnhancedInputActionEvent_TriggeredTime_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, K2Node_EnhancedInputActionEvent_SourceAction_2) == 0x0002F0, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::K2Node_EnhancedInputActionEvent_SourceAction_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion, K2Node_Event_GameMapID) == 0x0002F8, "Member 'BP_PlayerControllerZion_C_ExecuteUbergraph_BP_PlayerControllerZion::K2Node_Event_GameMapID' has a wrong offset!");
