#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerControllerZion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayerControllerZion.BP_PlayerControllerZion_C
// 0x0068 (0x0DE8 - 0x0D80)
class ABP_PlayerControllerZion_C final : public APlayerControllerZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_DebugMenu_C*                       DebugMenu;                                         // 0x0D88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UWBP_Pause_C*                           PauseMenu;                                         // 0x0D90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UWBP_GameMenu_C*                        gamemenu;                                          // 0x0D98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UClass*                                 CommandFastTravel_Lv1;                             // 0x0DA0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CommandFastTravel_Lv2;                             // 0x0DA8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CommandWakeUp;                                     // 0x0DB0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           RequestedTutorialIDs;                              // 0x0DB8(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, AdvancedDisplay)
	int32                                         GameMenuPageIndex;                                 // 0x0DC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_DCC[0x4];                                      // 0x0DCC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_DisplayAreaName_C*                 DisplayAreaNameWidget;                             // 0x0DD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         DisplayingAreaNameCount;                           // 0x0DD8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class FName                                   OnMapChangePreviousMapID;                          // 0x0DDC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void AddCommand(class UClass* Command);
	void AddFastTravelCommand();
	void AddWakeUpCommand();
	void BndEvt__BP_PlayerControllerZion_HealComponent_K2Node_ComponentBoundEvent_1_RestoreHealsEvent__DelegateSignature(int32 RestoredHealCount);
	void BndEvt__BP_PlayerControllerZion_StatsControllerPlayerComponent_K2Node_ComponentBoundEvent_0_StatsPlayerDelegate__DelegateSignature();
	void CanOpenMenu(bool* bResult);
	void CloseAllMenus();
	void ExecuteUbergraph_BP_PlayerControllerZion(int32 EntryPoint);
	void FindInteractableRestPoint(class ABP_Interactable_RestPoint_C** Array_Element);
	void InpActEvt_IA_Debug_Menu_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_Menu_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_Pause_K2Node_EnhancedInputActionEvent_2(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void LaunchTutorial(class FName TutorialID);
	void OnAchievementUnlocked(const class FName& AchievementID);
	void OnCloseDebugMenu();
	void OnClosedGameMenu(int32 PageIndex);
	void OnClosedPauseMenu();
	void OnDisplayAreaName(const class FName& AreaName);
	void OnDisplayAreaNameWidgetDestroyed();
	void OnFinish_532910D747F253B9D57DB093F3A34C09();
	void OnGameMapChangeFinished(const class FName& GameMapID);
	void OnGameMapChangeStart();
	void OnRequestTutorials(const TArray<class FName>& TutorialIDs);
	void OnRespawnCompleted(ERespawnReason RespawnReason);
	void OnStoryLevelChanged();
	void OnTutorialClosed();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PlayerControllerZion_C">();
	}
	static class ABP_PlayerControllerZion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PlayerControllerZion_C>();
	}
};
static_assert(alignof(ABP_PlayerControllerZion_C) == 0x000008, "Wrong alignment on ABP_PlayerControllerZion_C");
static_assert(sizeof(ABP_PlayerControllerZion_C) == 0x000DE8, "Wrong size on ABP_PlayerControllerZion_C");
static_assert(offsetof(ABP_PlayerControllerZion_C, UberGraphFrame) == 0x000D80, "Member 'ABP_PlayerControllerZion_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PlayerControllerZion_C, DebugMenu) == 0x000D88, "Member 'ABP_PlayerControllerZion_C::DebugMenu' has a wrong offset!");
static_assert(offsetof(ABP_PlayerControllerZion_C, PauseMenu) == 0x000D90, "Member 'ABP_PlayerControllerZion_C::PauseMenu' has a wrong offset!");
static_assert(offsetof(ABP_PlayerControllerZion_C, gamemenu) == 0x000D98, "Member 'ABP_PlayerControllerZion_C::gamemenu' has a wrong offset!");
static_assert(offsetof(ABP_PlayerControllerZion_C, CommandFastTravel_Lv1) == 0x000DA0, "Member 'ABP_PlayerControllerZion_C::CommandFastTravel_Lv1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerControllerZion_C, CommandFastTravel_Lv2) == 0x000DA8, "Member 'ABP_PlayerControllerZion_C::CommandFastTravel_Lv2' has a wrong offset!");
static_assert(offsetof(ABP_PlayerControllerZion_C, CommandWakeUp) == 0x000DB0, "Member 'ABP_PlayerControllerZion_C::CommandWakeUp' has a wrong offset!");
static_assert(offsetof(ABP_PlayerControllerZion_C, RequestedTutorialIDs) == 0x000DB8, "Member 'ABP_PlayerControllerZion_C::RequestedTutorialIDs' has a wrong offset!");
static_assert(offsetof(ABP_PlayerControllerZion_C, GameMenuPageIndex) == 0x000DC8, "Member 'ABP_PlayerControllerZion_C::GameMenuPageIndex' has a wrong offset!");
static_assert(offsetof(ABP_PlayerControllerZion_C, DisplayAreaNameWidget) == 0x000DD0, "Member 'ABP_PlayerControllerZion_C::DisplayAreaNameWidget' has a wrong offset!");
static_assert(offsetof(ABP_PlayerControllerZion_C, DisplayingAreaNameCount) == 0x000DD8, "Member 'ABP_PlayerControllerZion_C::DisplayingAreaNameCount' has a wrong offset!");
static_assert(offsetof(ABP_PlayerControllerZion_C, OnMapChangePreviousMapID) == 0x000DDC, "Member 'ABP_PlayerControllerZion_C::OnMapChangePreviousMapID' has a wrong offset!");

}

