#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StaticVolume_FX

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "RenderLayer_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_StaticVolume_FX.BP_StaticVolume_FX_C
// 0x0060 (0x0300 - 0x02A0)
class ABP_StaticVolume_FX_C : public AStaticVolume
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   EditorVisual;                                      // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         FX;                                                // 0x02B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NiagaraFX;                                         // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x02C8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Scale;                                             // 0x02E0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERenderLayerTypes                             Render_Layer;                                      // 0x02F8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_StaticVolume_FX(int32 EntryPoint);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void ReceiveDestroyed();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_StaticVolume_FX_C">();
	}
	static class ABP_StaticVolume_FX_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_StaticVolume_FX_C>();
	}
};
static_assert(alignof(ABP_StaticVolume_FX_C) == 0x000008, "Wrong alignment on ABP_StaticVolume_FX_C");
static_assert(sizeof(ABP_StaticVolume_FX_C) == 0x000300, "Wrong size on ABP_StaticVolume_FX_C");
static_assert(offsetof(ABP_StaticVolume_FX_C, UberGraphFrame) == 0x0002A0, "Member 'ABP_StaticVolume_FX_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_StaticVolume_FX_C, EditorVisual) == 0x0002A8, "Member 'ABP_StaticVolume_FX_C::EditorVisual' has a wrong offset!");
static_assert(offsetof(ABP_StaticVolume_FX_C, Box) == 0x0002B0, "Member 'ABP_StaticVolume_FX_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_StaticVolume_FX_C, FX) == 0x0002B8, "Member 'ABP_StaticVolume_FX_C::FX' has a wrong offset!");
static_assert(offsetof(ABP_StaticVolume_FX_C, NiagaraFX) == 0x0002C0, "Member 'ABP_StaticVolume_FX_C::NiagaraFX' has a wrong offset!");
static_assert(offsetof(ABP_StaticVolume_FX_C, Rotation) == 0x0002C8, "Member 'ABP_StaticVolume_FX_C::Rotation' has a wrong offset!");
static_assert(offsetof(ABP_StaticVolume_FX_C, Scale) == 0x0002E0, "Member 'ABP_StaticVolume_FX_C::Scale' has a wrong offset!");
static_assert(offsetof(ABP_StaticVolume_FX_C, Render_Layer) == 0x0002F8, "Member 'ABP_StaticVolume_FX_C::Render_Layer' has a wrong offset!");

}

