#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_s5200_Pounder

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_s5200_Pounder.BP_s5200_Pounder_C.ExecuteUbergraph_BP_s5200_Pounder
// 0x0004 (0x0004 - 0x0000)
struct BP_s5200_Pounder_C_ExecuteUbergraph_BP_s5200_Pounder final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_s5200_Pounder_C_ExecuteUbergraph_BP_s5200_Pounder) == 0x000004, "Wrong alignment on BP_s5200_Pounder_C_ExecuteUbergraph_BP_s5200_Pounder");
static_assert(sizeof(BP_s5200_Pounder_C_ExecuteUbergraph_BP_s5200_Pounder) == 0x000004, "Wrong size on BP_s5200_Pounder_C_ExecuteUbergraph_BP_s5200_Pounder");
static_assert(offsetof(BP_s5200_Pounder_C_ExecuteUbergraph_BP_s5200_Pounder, EntryPoint) == 0x000000, "Member 'BP_s5200_Pounder_C_ExecuteUbergraph_BP_s5200_Pounder::EntryPoint' has a wrong offset!");

// Function BP_s5200_Pounder.BP_s5200_Pounder_C.SetMovementEnable
// 0x0003 (0x0003 - 0x0000)
struct BP_s5200_Pounder_C_SetMovementEnable final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 MovementMode;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_s5200_Pounder_C_SetMovementEnable) == 0x000001, "Wrong alignment on BP_s5200_Pounder_C_SetMovementEnable");
static_assert(sizeof(BP_s5200_Pounder_C_SetMovementEnable) == 0x000003, "Wrong size on BP_s5200_Pounder_C_SetMovementEnable");
static_assert(offsetof(BP_s5200_Pounder_C_SetMovementEnable, bEnable) == 0x000000, "Member 'BP_s5200_Pounder_C_SetMovementEnable::bEnable' has a wrong offset!");
static_assert(offsetof(BP_s5200_Pounder_C_SetMovementEnable, MovementMode) == 0x000001, "Member 'BP_s5200_Pounder_C_SetMovementEnable::MovementMode' has a wrong offset!");
static_assert(offsetof(BP_s5200_Pounder_C_SetMovementEnable, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000002, "Member 'BP_s5200_Pounder_C_SetMovementEnable::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

}

