#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_s5200_Pounder

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_CharacterZionSpirit_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_s5200_Pounder.BP_s5200_Pounder_C
// 0x0050 (0x0C70 - 0x0C20)
class ABP_s5200_Pounder_C final : public ABP_CharacterZionSpirit_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C18(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpiritSkinUpdaterComponent*            SpiritSkinUpdater;                                 // 0x0C20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFootIKComponent*                       FootIK;                                            // 0x0C28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UIKBonesComponent*                      IKBones;                                           // 0x0C30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        IKBoneDrivers;                                     // 0x0C38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow1;                                            // 0x0C40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   EDITOR_FootLeft_Visual;                            // 0x0C48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpineBoneDriverComponent*              BoneDriver_FootLeft;                               // 0x0C50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow2;                                            // 0x0C58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   EDITOR_FootRight_Visual;                           // 0x0C60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpineBoneDriverComponent*              BoneDriver_FootRight;                              // 0x0C68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_s5200_Pounder(int32 EntryPoint);
	void OnDeactivate();
	void OnPreSummon();
	void SetMovementEnable(bool bEnable, EMovementMode MovementMode);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_s5200_Pounder_C">();
	}
	static class ABP_s5200_Pounder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_s5200_Pounder_C>();
	}
};
static_assert(alignof(ABP_s5200_Pounder_C) == 0x000010, "Wrong alignment on ABP_s5200_Pounder_C");
static_assert(sizeof(ABP_s5200_Pounder_C) == 0x000C70, "Wrong size on ABP_s5200_Pounder_C");
static_assert(offsetof(ABP_s5200_Pounder_C, UberGraphFrame) == 0x000C18, "Member 'ABP_s5200_Pounder_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_s5200_Pounder_C, SpiritSkinUpdater) == 0x000C20, "Member 'ABP_s5200_Pounder_C::SpiritSkinUpdater' has a wrong offset!");
static_assert(offsetof(ABP_s5200_Pounder_C, FootIK) == 0x000C28, "Member 'ABP_s5200_Pounder_C::FootIK' has a wrong offset!");
static_assert(offsetof(ABP_s5200_Pounder_C, IKBones) == 0x000C30, "Member 'ABP_s5200_Pounder_C::IKBones' has a wrong offset!");
static_assert(offsetof(ABP_s5200_Pounder_C, IKBoneDrivers) == 0x000C38, "Member 'ABP_s5200_Pounder_C::IKBoneDrivers' has a wrong offset!");
static_assert(offsetof(ABP_s5200_Pounder_C, Arrow1) == 0x000C40, "Member 'ABP_s5200_Pounder_C::Arrow1' has a wrong offset!");
static_assert(offsetof(ABP_s5200_Pounder_C, EDITOR_FootLeft_Visual) == 0x000C48, "Member 'ABP_s5200_Pounder_C::EDITOR_FootLeft_Visual' has a wrong offset!");
static_assert(offsetof(ABP_s5200_Pounder_C, BoneDriver_FootLeft) == 0x000C50, "Member 'ABP_s5200_Pounder_C::BoneDriver_FootLeft' has a wrong offset!");
static_assert(offsetof(ABP_s5200_Pounder_C, Arrow2) == 0x000C58, "Member 'ABP_s5200_Pounder_C::Arrow2' has a wrong offset!");
static_assert(offsetof(ABP_s5200_Pounder_C, EDITOR_FootRight_Visual) == 0x000C60, "Member 'ABP_s5200_Pounder_C::EDITOR_FootRight_Visual' has a wrong offset!");
static_assert(offsetof(ABP_s5200_Pounder_C, BoneDriver_FootRight) == 0x000C68, "Member 'ABP_s5200_Pounder_C::BoneDriver_FootRight' has a wrong offset!");

}

