#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StaticVolume_Physics_Fluid

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_StaticVolume_Physics_Fluid.BP_StaticVolume_Physics_Fluid_C
// 0x0068 (0x0320 - 0x02B8)
class ABP_StaticVolume_Physics_Fluid_C final : public AStaticVolume_Physics_Fluid
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          AudioSnapshotTrigger;                              // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  PostProcess;                                       // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   EditorVisual;                                      // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_PostProcessWeight_B7938837434E4114439C3DB516ACED73; // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_B7938837434E4114439C3DB516ACED73; // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OverlappingPlayerActor;                            // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          bUsePostProcess;                                   // 0x0300(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AudioSnapshotDepthFromSurface;                     // 0x0308(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             AudioSnapshot;                                     // 0x0310(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   GeneratedAudioSnapshotTag;                         // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BlendInPostProcess();
	void BlendOutPostProcess();
	void BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void ExecuteUbergraph_BP_StaticVolume_Physics_Fluid(int32 EntryPoint);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void SetupAudioSnapshotTrigger();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	void UserConstructionScript();

	class FName GetAudioSnapshotTag() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_StaticVolume_Physics_Fluid_C">();
	}
	static class ABP_StaticVolume_Physics_Fluid_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_StaticVolume_Physics_Fluid_C>();
	}
};
static_assert(alignof(ABP_StaticVolume_Physics_Fluid_C) == 0x000008, "Wrong alignment on ABP_StaticVolume_Physics_Fluid_C");
static_assert(sizeof(ABP_StaticVolume_Physics_Fluid_C) == 0x000320, "Wrong size on ABP_StaticVolume_Physics_Fluid_C");
static_assert(offsetof(ABP_StaticVolume_Physics_Fluid_C, UberGraphFrame) == 0x0002B8, "Member 'ABP_StaticVolume_Physics_Fluid_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_StaticVolume_Physics_Fluid_C, AudioSnapshotTrigger) == 0x0002C0, "Member 'ABP_StaticVolume_Physics_Fluid_C::AudioSnapshotTrigger' has a wrong offset!");
static_assert(offsetof(ABP_StaticVolume_Physics_Fluid_C, PostProcess) == 0x0002C8, "Member 'ABP_StaticVolume_Physics_Fluid_C::PostProcess' has a wrong offset!");
static_assert(offsetof(ABP_StaticVolume_Physics_Fluid_C, Box) == 0x0002D0, "Member 'ABP_StaticVolume_Physics_Fluid_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_StaticVolume_Physics_Fluid_C, Scene) == 0x0002D8, "Member 'ABP_StaticVolume_Physics_Fluid_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_StaticVolume_Physics_Fluid_C, EditorVisual) == 0x0002E0, "Member 'ABP_StaticVolume_Physics_Fluid_C::EditorVisual' has a wrong offset!");
static_assert(offsetof(ABP_StaticVolume_Physics_Fluid_C, Timeline_PostProcessWeight_B7938837434E4114439C3DB516ACED73) == 0x0002E8, "Member 'ABP_StaticVolume_Physics_Fluid_C::Timeline_PostProcessWeight_B7938837434E4114439C3DB516ACED73' has a wrong offset!");
static_assert(offsetof(ABP_StaticVolume_Physics_Fluid_C, Timeline__Direction_B7938837434E4114439C3DB516ACED73) == 0x0002EC, "Member 'ABP_StaticVolume_Physics_Fluid_C::Timeline__Direction_B7938837434E4114439C3DB516ACED73' has a wrong offset!");
static_assert(offsetof(ABP_StaticVolume_Physics_Fluid_C, Timeline) == 0x0002F0, "Member 'ABP_StaticVolume_Physics_Fluid_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABP_StaticVolume_Physics_Fluid_C, OverlappingPlayerActor) == 0x0002F8, "Member 'ABP_StaticVolume_Physics_Fluid_C::OverlappingPlayerActor' has a wrong offset!");
static_assert(offsetof(ABP_StaticVolume_Physics_Fluid_C, bUsePostProcess) == 0x000300, "Member 'ABP_StaticVolume_Physics_Fluid_C::bUsePostProcess' has a wrong offset!");
static_assert(offsetof(ABP_StaticVolume_Physics_Fluid_C, AudioSnapshotDepthFromSurface) == 0x000308, "Member 'ABP_StaticVolume_Physics_Fluid_C::AudioSnapshotDepthFromSurface' has a wrong offset!");
static_assert(offsetof(ABP_StaticVolume_Physics_Fluid_C, AudioSnapshot) == 0x000310, "Member 'ABP_StaticVolume_Physics_Fluid_C::AudioSnapshot' has a wrong offset!");
static_assert(offsetof(ABP_StaticVolume_Physics_Fluid_C, GeneratedAudioSnapshotTag) == 0x000318, "Member 'ABP_StaticVolume_Physics_Fluid_C::GeneratedAudioSnapshotTag' has a wrong offset!");

}

