#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StaticVolume_Physics_Fluid

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_StaticVolume_Physics_Fluid.BP_StaticVolume_Physics_Fluid_C.BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_StaticVolume_Physics_Fluid_C_BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_StaticVolume_Physics_Fluid_C_BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_StaticVolume_Physics_Fluid_C_BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_StaticVolume_Physics_Fluid_C_BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000118, "Wrong size on BP_StaticVolume_Physics_Fluid_C_BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_StaticVolume_Physics_Fluid_C_BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_StaticVolume_Physics_Fluid_C_BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_StaticVolume_Physics_Fluid_C_BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_StaticVolume_Physics_Fluid_C_BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_StaticVolume_Physics_Fluid_C_BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_StaticVolume_Physics_Fluid_C_BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_StaticVolume_Physics_Fluid.BP_StaticVolume_Physics_Fluid_C.BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_StaticVolume_Physics_Fluid_C_BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StaticVolume_Physics_Fluid_C_BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_StaticVolume_Physics_Fluid_C_BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_StaticVolume_Physics_Fluid_C_BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_StaticVolume_Physics_Fluid_C_BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_StaticVolume_Physics_Fluid_C_BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_StaticVolume_Physics_Fluid_C_BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_StaticVolume_Physics_Fluid_C_BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_StaticVolume_Physics_Fluid_C_BndEvt__BP_StaticVolume_Physics_Fluid_AudioCollider_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_StaticVolume_Physics_Fluid.BP_StaticVolume_Physics_Fluid_C.ExecuteUbergraph_BP_StaticVolume_Physics_Fluid
// 0x0180 (0x0180 - 0x0000)
struct BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundSubsystem*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundSubsystem*                        CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor_1;                         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayer_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0058(0x00F8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FName                                   CallFunc_GetAudioSnapshotTag_ReturnValue;          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetAudioSnapshotTag_ReturnValue_1;        // 0x0174(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid) == 0x000008, "Wrong alignment on BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid");
static_assert(sizeof(BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid) == 0x000180, "Wrong size on BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid, EntryPoint) == 0x000000, "Member 'BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000010, "Member 'BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid, K2Node_Event_OtherActor_1) == 0x000018, "Member 'BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid::K2Node_Event_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid, CallFunc_IsPlayer_ReturnValue) == 0x000020, "Member 'BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid::CallFunc_IsPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid, K2Node_Event_OtherActor) == 0x000028, "Member 'BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000030, "Member 'BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000031, "Member 'BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000038, "Member 'BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000040, "Member 'BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000048, "Member 'BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000050, "Member 'BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid, K2Node_ComponentBoundEvent_bFromSweep) == 0x000054, "Member 'BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid, K2Node_ComponentBoundEvent_SweepResult) == 0x000058, "Member 'BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid, CallFunc_GetAudioSnapshotTag_ReturnValue) == 0x000150, "Member 'BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid::CallFunc_GetAudioSnapshotTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000158, "Member 'BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid, K2Node_ComponentBoundEvent_OtherActor) == 0x000160, "Member 'BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid, K2Node_ComponentBoundEvent_OtherComp) == 0x000168, "Member 'BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000170, "Member 'BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid, CallFunc_GetAudioSnapshotTag_ReturnValue_1) == 0x000174, "Member 'BP_StaticVolume_Physics_Fluid_C_ExecuteUbergraph_BP_StaticVolume_Physics_Fluid::CallFunc_GetAudioSnapshotTag_ReturnValue_1' has a wrong offset!");

// Function BP_StaticVolume_Physics_Fluid.BP_StaticVolume_Physics_Fluid_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_StaticVolume_Physics_Fluid_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StaticVolume_Physics_Fluid_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_StaticVolume_Physics_Fluid_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_StaticVolume_Physics_Fluid_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_StaticVolume_Physics_Fluid_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_StaticVolume_Physics_Fluid_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function BP_StaticVolume_Physics_Fluid.BP_StaticVolume_Physics_Fluid_C.ReceiveActorEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_StaticVolume_Physics_Fluid_C_ReceiveActorEndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StaticVolume_Physics_Fluid_C_ReceiveActorEndOverlap) == 0x000008, "Wrong alignment on BP_StaticVolume_Physics_Fluid_C_ReceiveActorEndOverlap");
static_assert(sizeof(BP_StaticVolume_Physics_Fluid_C_ReceiveActorEndOverlap) == 0x000008, "Wrong size on BP_StaticVolume_Physics_Fluid_C_ReceiveActorEndOverlap");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_ReceiveActorEndOverlap, OtherActor) == 0x000000, "Member 'BP_StaticVolume_Physics_Fluid_C_ReceiveActorEndOverlap::OtherActor' has a wrong offset!");

// Function BP_StaticVolume_Physics_Fluid.BP_StaticVolume_Physics_Fluid_C.SetupAudioSnapshotTrigger
// 0x0190 (0x0190 - 0x0000)
struct BP_StaticVolume_Physics_Fluid_C_SetupAudioSnapshotTrigger final
{
public:
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUnscaledBoxExtent_ReturnValue;         // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0098(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_StaticVolume_Physics_Fluid_C_SetupAudioSnapshotTrigger) == 0x000008, "Wrong alignment on BP_StaticVolume_Physics_Fluid_C_SetupAudioSnapshotTrigger");
static_assert(sizeof(BP_StaticVolume_Physics_Fluid_C_SetupAudioSnapshotTrigger) == 0x000190, "Wrong size on BP_StaticVolume_Physics_Fluid_C_SetupAudioSnapshotTrigger");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_SetupAudioSnapshotTrigger, CallFunc_GetActorScale3D_ReturnValue) == 0x000000, "Member 'BP_StaticVolume_Physics_Fluid_C_SetupAudioSnapshotTrigger::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_SetupAudioSnapshotTrigger, CallFunc_GetUnscaledBoxExtent_ReturnValue) == 0x000018, "Member 'BP_StaticVolume_Physics_Fluid_C_SetupAudioSnapshotTrigger::CallFunc_GetUnscaledBoxExtent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_SetupAudioSnapshotTrigger, CallFunc_BreakVector_X) == 0x000030, "Member 'BP_StaticVolume_Physics_Fluid_C_SetupAudioSnapshotTrigger::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_SetupAudioSnapshotTrigger, CallFunc_BreakVector_Y) == 0x000038, "Member 'BP_StaticVolume_Physics_Fluid_C_SetupAudioSnapshotTrigger::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_SetupAudioSnapshotTrigger, CallFunc_BreakVector_Z) == 0x000040, "Member 'BP_StaticVolume_Physics_Fluid_C_SetupAudioSnapshotTrigger::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_SetupAudioSnapshotTrigger, CallFunc_SafeDivide_ReturnValue) == 0x000048, "Member 'BP_StaticVolume_Physics_Fluid_C_SetupAudioSnapshotTrigger::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_SetupAudioSnapshotTrigger, CallFunc_MakeVector_ReturnValue) == 0x000050, "Member 'BP_StaticVolume_Physics_Fluid_C_SetupAudioSnapshotTrigger::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_SetupAudioSnapshotTrigger, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000068, "Member 'BP_StaticVolume_Physics_Fluid_C_SetupAudioSnapshotTrigger::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_SetupAudioSnapshotTrigger, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000080, "Member 'BP_StaticVolume_Physics_Fluid_C_SetupAudioSnapshotTrigger::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_SetupAudioSnapshotTrigger, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000098, "Member 'BP_StaticVolume_Physics_Fluid_C_SetupAudioSnapshotTrigger::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

// Function BP_StaticVolume_Physics_Fluid.BP_StaticVolume_Physics_Fluid_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct BP_StaticVolume_Physics_Fluid_C_UserConstructionScript final
{
public:
	class FName                                   CallFunc_GenerateClearIDForActor_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StaticVolume_Physics_Fluid_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_StaticVolume_Physics_Fluid_C_UserConstructionScript");
static_assert(sizeof(BP_StaticVolume_Physics_Fluid_C_UserConstructionScript) == 0x000008, "Wrong size on BP_StaticVolume_Physics_Fluid_C_UserConstructionScript");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_UserConstructionScript, CallFunc_GenerateClearIDForActor_ReturnValue) == 0x000000, "Member 'BP_StaticVolume_Physics_Fluid_C_UserConstructionScript::CallFunc_GenerateClearIDForActor_ReturnValue' has a wrong offset!");

// Function BP_StaticVolume_Physics_Fluid.BP_StaticVolume_Physics_Fluid_C.GetAudioSnapshotTag
// 0x0008 (0x0008 - 0x0000)
struct BP_StaticVolume_Physics_Fluid_C_GetAudioSnapshotTag final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StaticVolume_Physics_Fluid_C_GetAudioSnapshotTag) == 0x000004, "Wrong alignment on BP_StaticVolume_Physics_Fluid_C_GetAudioSnapshotTag");
static_assert(sizeof(BP_StaticVolume_Physics_Fluid_C_GetAudioSnapshotTag) == 0x000008, "Wrong size on BP_StaticVolume_Physics_Fluid_C_GetAudioSnapshotTag");
static_assert(offsetof(BP_StaticVolume_Physics_Fluid_C_GetAudioSnapshotTag, ReturnValue) == 0x000000, "Member 'BP_StaticVolume_Physics_Fluid_C_GetAudioSnapshotTag::ReturnValue' has a wrong offset!");

}

