#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Trigger_HideFakeWalls

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Trigger_HideFakeWalls.BP_Trigger_HideFakeWalls_C
// 0x0020 (0x02C0 - 0x02A0)
class ABP_Trigger_HideFakeWalls_C final : public ATrigger
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_FakeWall_C*>                 FakeWalls;                                         // 0x02B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate)

public:
	void ClearFakeWalls();
	void ExecuteUbergraph_BP_Trigger_HideFakeWalls(int32 EntryPoint);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Trigger_HideFakeWalls_C">();
	}
	static class ABP_Trigger_HideFakeWalls_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Trigger_HideFakeWalls_C>();
	}
};
static_assert(alignof(ABP_Trigger_HideFakeWalls_C) == 0x000008, "Wrong alignment on ABP_Trigger_HideFakeWalls_C");
static_assert(sizeof(ABP_Trigger_HideFakeWalls_C) == 0x0002C0, "Wrong size on ABP_Trigger_HideFakeWalls_C");
static_assert(offsetof(ABP_Trigger_HideFakeWalls_C, UberGraphFrame) == 0x0002A0, "Member 'ABP_Trigger_HideFakeWalls_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Trigger_HideFakeWalls_C, Box) == 0x0002A8, "Member 'ABP_Trigger_HideFakeWalls_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_Trigger_HideFakeWalls_C, FakeWalls) == 0x0002B0, "Member 'ABP_Trigger_HideFakeWalls_C::FakeWalls' has a wrong offset!");

}

