#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Trigger_TeleportPlayer

#include "Basic.hpp"

#include "Zion_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function BP_Trigger_TeleportPlayer.BP_Trigger_TeleportPlayer_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_Trigger_TeleportPlayer_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Trigger_TeleportPlayer_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_Trigger_TeleportPlayer_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_Trigger_TeleportPlayer_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_Trigger_TeleportPlayer_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_Trigger_TeleportPlayer_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function BP_Trigger_TeleportPlayer.BP_Trigger_TeleportPlayer_C.GetMapIconGameplayConditions
// 0x0020 (0x0020 - 0x0000)
struct BP_Trigger_TeleportPlayer_C_GetMapIconGameplayConditions final
{
public:
	struct FGameplayConditionChecker              OutConditionChecker;                               // 0x0000(0x0018)(Parm, OutParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Trigger_TeleportPlayer_C_GetMapIconGameplayConditions) == 0x000008, "Wrong alignment on BP_Trigger_TeleportPlayer_C_GetMapIconGameplayConditions");
static_assert(sizeof(BP_Trigger_TeleportPlayer_C_GetMapIconGameplayConditions) == 0x000020, "Wrong size on BP_Trigger_TeleportPlayer_C_GetMapIconGameplayConditions");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_GetMapIconGameplayConditions, OutConditionChecker) == 0x000000, "Member 'BP_Trigger_TeleportPlayer_C_GetMapIconGameplayConditions::OutConditionChecker' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_GetMapIconGameplayConditions, ReturnValue) == 0x000018, "Member 'BP_Trigger_TeleportPlayer_C_GetMapIconGameplayConditions::ReturnValue' has a wrong offset!");

// Function BP_Trigger_TeleportPlayer.BP_Trigger_TeleportPlayer_C.GetMapIconActorWithDependencies
// 0x0030 (0x0030 - 0x0000)
struct BP_Trigger_TeleportPlayer_C_GetMapIconActorWithDependencies final
{
public:
	struct FMapIconProviderData                   OutMapIconProviderData;                            // 0x0000(0x0018)(Parm, OutParm)
	struct FMapIconProviderData                   K2Node_MakeStruct_MapIconProviderData;             // 0x0018(0x0018)()
};
static_assert(alignof(BP_Trigger_TeleportPlayer_C_GetMapIconActorWithDependencies) == 0x000008, "Wrong alignment on BP_Trigger_TeleportPlayer_C_GetMapIconActorWithDependencies");
static_assert(sizeof(BP_Trigger_TeleportPlayer_C_GetMapIconActorWithDependencies) == 0x000030, "Wrong size on BP_Trigger_TeleportPlayer_C_GetMapIconActorWithDependencies");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_GetMapIconActorWithDependencies, OutMapIconProviderData) == 0x000000, "Member 'BP_Trigger_TeleportPlayer_C_GetMapIconActorWithDependencies::OutMapIconProviderData' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_GetMapIconActorWithDependencies, K2Node_MakeStruct_MapIconProviderData) == 0x000018, "Member 'BP_Trigger_TeleportPlayer_C_GetMapIconActorWithDependencies::K2Node_MakeStruct_MapIconProviderData' has a wrong offset!");

// Function BP_Trigger_TeleportPlayer.BP_Trigger_TeleportPlayer_C.ExecuteUbergraph_BP_Trigger_TeleportPlayer
// 0x0150 (0x0150 - 0x0000)
struct BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacterZion*                         K2Node_DynamicCast_AsCharacter_Zion;               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommandComponent*                      CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0xF];                                       // 0x0041(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0050(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_TeleportTo_ReturnValue;                // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEventAtLocation_ReturnValue;          // 0x00E8(0x0008)(NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetTimeSeconds_ReturnValue_1;             // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer) == 0x000010, "Wrong alignment on BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer");
static_assert(sizeof(BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer) == 0x000150, "Wrong size on BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer, EntryPoint) == 0x000000, "Member 'BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer, K2Node_Event_OtherActor) == 0x000008, "Member 'BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer, K2Node_DynamicCast_AsCharacter_Zion) == 0x000010, "Member 'BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer::K2Node_DynamicCast_AsCharacter_Zion' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000028, "Member 'BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer, CallFunc_GetTransform_ReturnValue) == 0x000050, "Member 'BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000B0, "Member 'BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000C8, "Member 'BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer, CallFunc_IsValid_ReturnValue_1) == 0x0000E0, "Member 'BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer, CallFunc_K2_TeleportTo_ReturnValue) == 0x0000E1, "Member 'BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer::CallFunc_K2_TeleportTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer, CallFunc_PlayEventAtLocation_ReturnValue) == 0x0000E8, "Member 'BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer::CallFunc_PlayEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0000F0, "Member 'BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer, CallFunc_IsValid_ReturnValue_2) == 0x000108, "Member 'BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000110, "Member 'BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer, CallFunc_GetTimeSeconds_ReturnValue) == 0x000118, "Member 'BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000120, "Member 'BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer, CallFunc_IsValid_ReturnValue_3) == 0x000128, "Member 'BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x000130, "Member 'BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000138, "Member 'BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000139, "Member 'BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer, CallFunc_GetTimeSeconds_ReturnValue_1) == 0x000140, "Member 'BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer::CallFunc_GetTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer, CallFunc_BooleanOR_ReturnValue) == 0x000148, "Member 'BP_Trigger_TeleportPlayer_C_ExecuteUbergraph_BP_Trigger_TeleportPlayer::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_Trigger_TeleportPlayer.BP_Trigger_TeleportPlayer_C.AlignDirectionFX
// 0x01A0 (0x01A0 - 0x0000)
struct BP_Trigger_TeleportPlayer_C_AlignDirectionFX final
{
public:
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZX_ReturnValue;                // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x00A8(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Trigger_TeleportPlayer_C_AlignDirectionFX) == 0x000008, "Wrong alignment on BP_Trigger_TeleportPlayer_C_AlignDirectionFX");
static_assert(sizeof(BP_Trigger_TeleportPlayer_C_AlignDirectionFX) == 0x0001A0, "Wrong size on BP_Trigger_TeleportPlayer_C_AlignDirectionFX");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_AlignDirectionFX, CallFunc_MakeVector_ReturnValue) == 0x000000, "Member 'BP_Trigger_TeleportPlayer_C_AlignDirectionFX::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_AlignDirectionFX, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_Trigger_TeleportPlayer_C_AlignDirectionFX::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_AlignDirectionFX, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000030, "Member 'BP_Trigger_TeleportPlayer_C_AlignDirectionFX::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_AlignDirectionFX, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000048, "Member 'BP_Trigger_TeleportPlayer_C_AlignDirectionFX::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_AlignDirectionFX, CallFunc_Normal_ReturnValue) == 0x000060, "Member 'BP_Trigger_TeleportPlayer_C_AlignDirectionFX::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_AlignDirectionFX, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000078, "Member 'BP_Trigger_TeleportPlayer_C_AlignDirectionFX::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_AlignDirectionFX, CallFunc_MakeRotFromZX_ReturnValue) == 0x000090, "Member 'BP_Trigger_TeleportPlayer_C_AlignDirectionFX::CallFunc_MakeRotFromZX_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_TeleportPlayer_C_AlignDirectionFX, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0000A8, "Member 'BP_Trigger_TeleportPlayer_C_AlignDirectionFX::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

}

