#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Trigger_DisplayAreaName

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Trigger_DisplayAreaName.BP_Trigger_DisplayAreaName_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_Trigger_DisplayAreaName_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Trigger_DisplayAreaName_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_Trigger_DisplayAreaName_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_Trigger_DisplayAreaName_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_Trigger_DisplayAreaName_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_Trigger_DisplayAreaName_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_Trigger_DisplayAreaName_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function BP_Trigger_DisplayAreaName.BP_Trigger_DisplayAreaName_C.ExecuteUbergraph_BP_Trigger_DisplayAreaName
// 0x0020 (0x0020 - 0x0000)
struct BP_Trigger_DisplayAreaName_C_ExecuteUbergraph_BP_Trigger_DisplayAreaName final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayer_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Trigger_DisplayAreaName_C_ExecuteUbergraph_BP_Trigger_DisplayAreaName) == 0x000008, "Wrong alignment on BP_Trigger_DisplayAreaName_C_ExecuteUbergraph_BP_Trigger_DisplayAreaName");
static_assert(sizeof(BP_Trigger_DisplayAreaName_C_ExecuteUbergraph_BP_Trigger_DisplayAreaName) == 0x000020, "Wrong size on BP_Trigger_DisplayAreaName_C_ExecuteUbergraph_BP_Trigger_DisplayAreaName");
static_assert(offsetof(BP_Trigger_DisplayAreaName_C_ExecuteUbergraph_BP_Trigger_DisplayAreaName, EntryPoint) == 0x000000, "Member 'BP_Trigger_DisplayAreaName_C_ExecuteUbergraph_BP_Trigger_DisplayAreaName::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Trigger_DisplayAreaName_C_ExecuteUbergraph_BP_Trigger_DisplayAreaName, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_Trigger_DisplayAreaName_C_ExecuteUbergraph_BP_Trigger_DisplayAreaName::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_DisplayAreaName_C_ExecuteUbergraph_BP_Trigger_DisplayAreaName, K2Node_Event_OtherActor) == 0x000008, "Member 'BP_Trigger_DisplayAreaName_C_ExecuteUbergraph_BP_Trigger_DisplayAreaName::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Trigger_DisplayAreaName_C_ExecuteUbergraph_BP_Trigger_DisplayAreaName, CallFunc_Get_ReturnValue) == 0x000010, "Member 'BP_Trigger_DisplayAreaName_C_ExecuteUbergraph_BP_Trigger_DisplayAreaName::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_DisplayAreaName_C_ExecuteUbergraph_BP_Trigger_DisplayAreaName, CallFunc_IsPlayer_ReturnValue) == 0x000018, "Member 'BP_Trigger_DisplayAreaName_C_ExecuteUbergraph_BP_Trigger_DisplayAreaName::CallFunc_IsPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_DisplayAreaName_C_ExecuteUbergraph_BP_Trigger_DisplayAreaName, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'BP_Trigger_DisplayAreaName_C_ExecuteUbergraph_BP_Trigger_DisplayAreaName::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

