#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Trigger_FieldTalk

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Trigger_FieldTalk.BP_Trigger_FieldTalk_C
// 0x0030 (0x02D0 - 0x02A0)
class ABP_Trigger_FieldTalk_C final : public ATrigger
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClearComponent*                        Clear;                                             // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFieldTalkAsset*                        FieldTalkAsset;                                    // 0x02B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Skip_Active_Conversation;                          // 0x02C0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFieldTalkComponent*                    Conversation_Component;                            // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash)

public:
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void OnFinish_62BBCC6740C58FF9B7E3C4B5493C0D45();
	void LaunchConversation();
	void ExecuteUbergraph_BP_Trigger_FieldTalk(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Trigger_FieldTalk_C">();
	}
	static class ABP_Trigger_FieldTalk_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Trigger_FieldTalk_C>();
	}
};
static_assert(alignof(ABP_Trigger_FieldTalk_C) == 0x000008, "Wrong alignment on ABP_Trigger_FieldTalk_C");
static_assert(sizeof(ABP_Trigger_FieldTalk_C) == 0x0002D0, "Wrong size on ABP_Trigger_FieldTalk_C");
static_assert(offsetof(ABP_Trigger_FieldTalk_C, UberGraphFrame) == 0x0002A0, "Member 'ABP_Trigger_FieldTalk_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Trigger_FieldTalk_C, Clear) == 0x0002A8, "Member 'ABP_Trigger_FieldTalk_C::Clear' has a wrong offset!");
static_assert(offsetof(ABP_Trigger_FieldTalk_C, Box) == 0x0002B0, "Member 'ABP_Trigger_FieldTalk_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_Trigger_FieldTalk_C, FieldTalkAsset) == 0x0002B8, "Member 'ABP_Trigger_FieldTalk_C::FieldTalkAsset' has a wrong offset!");
static_assert(offsetof(ABP_Trigger_FieldTalk_C, Skip_Active_Conversation) == 0x0002C0, "Member 'ABP_Trigger_FieldTalk_C::Skip_Active_Conversation' has a wrong offset!");
static_assert(offsetof(ABP_Trigger_FieldTalk_C, Conversation_Component) == 0x0002C8, "Member 'ABP_Trigger_FieldTalk_C::Conversation_Component' has a wrong offset!");

}

