#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Trigger_RevealZone

#include "Basic.hpp"

#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function BP_Trigger_RevealZone.BP_Trigger_RevealZone_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_Trigger_RevealZone_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Trigger_RevealZone_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_Trigger_RevealZone_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_Trigger_RevealZone_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_Trigger_RevealZone_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_Trigger_RevealZone_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_Trigger_RevealZone_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function BP_Trigger_RevealZone.BP_Trigger_RevealZone_C.MarkAsClear
// 0x0002 (0x0002 - 0x0000)
struct BP_Trigger_RevealZone_C_MarkAsClear final
{
public:
	EClearStatus                                  CallFunc_GetClearStatus_ReturnValue;               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Trigger_RevealZone_C_MarkAsClear) == 0x000001, "Wrong alignment on BP_Trigger_RevealZone_C_MarkAsClear");
static_assert(sizeof(BP_Trigger_RevealZone_C_MarkAsClear) == 0x000002, "Wrong size on BP_Trigger_RevealZone_C_MarkAsClear");
static_assert(offsetof(BP_Trigger_RevealZone_C_MarkAsClear, CallFunc_GetClearStatus_ReturnValue) == 0x000000, "Member 'BP_Trigger_RevealZone_C_MarkAsClear::CallFunc_GetClearStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_RevealZone_C_MarkAsClear, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'BP_Trigger_RevealZone_C_MarkAsClear::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_Trigger_RevealZone.BP_Trigger_RevealZone_C.ExecuteUbergraph_BP_Trigger_RevealZone
// 0x0028 (0x0028 - 0x0000)
struct BP_Trigger_RevealZone_C_ExecuteUbergraph_BP_Trigger_RevealZone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EClearStatus                                  K2Node_ComponentBoundEvent_ClearStatus;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Trigger_RevealZone_C_ExecuteUbergraph_BP_Trigger_RevealZone) == 0x000008, "Wrong alignment on BP_Trigger_RevealZone_C_ExecuteUbergraph_BP_Trigger_RevealZone");
static_assert(sizeof(BP_Trigger_RevealZone_C_ExecuteUbergraph_BP_Trigger_RevealZone) == 0x000028, "Wrong size on BP_Trigger_RevealZone_C_ExecuteUbergraph_BP_Trigger_RevealZone");
static_assert(offsetof(BP_Trigger_RevealZone_C_ExecuteUbergraph_BP_Trigger_RevealZone, EntryPoint) == 0x000000, "Member 'BP_Trigger_RevealZone_C_ExecuteUbergraph_BP_Trigger_RevealZone::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Trigger_RevealZone_C_ExecuteUbergraph_BP_Trigger_RevealZone, K2Node_ComponentBoundEvent_ClearStatus) == 0x000004, "Member 'BP_Trigger_RevealZone_C_ExecuteUbergraph_BP_Trigger_RevealZone::K2Node_ComponentBoundEvent_ClearStatus' has a wrong offset!");
static_assert(offsetof(BP_Trigger_RevealZone_C_ExecuteUbergraph_BP_Trigger_RevealZone, K2Node_SwitchEnum_CmpSuccess) == 0x000005, "Member 'BP_Trigger_RevealZone_C_ExecuteUbergraph_BP_Trigger_RevealZone::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Trigger_RevealZone_C_ExecuteUbergraph_BP_Trigger_RevealZone, K2Node_Event_OtherActor) == 0x000008, "Member 'BP_Trigger_RevealZone_C_ExecuteUbergraph_BP_Trigger_RevealZone::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Trigger_RevealZone_C_ExecuteUbergraph_BP_Trigger_RevealZone, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000010, "Member 'BP_Trigger_RevealZone_C_ExecuteUbergraph_BP_Trigger_RevealZone::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BP_Trigger_RevealZone_C_ExecuteUbergraph_BP_Trigger_RevealZone, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_Trigger_RevealZone_C_ExecuteUbergraph_BP_Trigger_RevealZone::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_RevealZone_C_ExecuteUbergraph_BP_Trigger_RevealZone, CallFunc_Greater_IntInt_ReturnValue) == 0x000024, "Member 'BP_Trigger_RevealZone_C_ExecuteUbergraph_BP_Trigger_RevealZone::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Trigger_RevealZone.BP_Trigger_RevealZone_C.BndEvt__BP_Trigger_RevealZone_Clear_K2Node_ComponentBoundEvent_0_ClearableDelegate__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_Trigger_RevealZone_C_BndEvt__BP_Trigger_RevealZone_Clear_K2Node_ComponentBoundEvent_0_ClearableDelegate__DelegateSignature final
{
public:
	EClearStatus                                  ClearStatus;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Trigger_RevealZone_C_BndEvt__BP_Trigger_RevealZone_Clear_K2Node_ComponentBoundEvent_0_ClearableDelegate__DelegateSignature) == 0x000001, "Wrong alignment on BP_Trigger_RevealZone_C_BndEvt__BP_Trigger_RevealZone_Clear_K2Node_ComponentBoundEvent_0_ClearableDelegate__DelegateSignature");
static_assert(sizeof(BP_Trigger_RevealZone_C_BndEvt__BP_Trigger_RevealZone_Clear_K2Node_ComponentBoundEvent_0_ClearableDelegate__DelegateSignature) == 0x000001, "Wrong size on BP_Trigger_RevealZone_C_BndEvt__BP_Trigger_RevealZone_Clear_K2Node_ComponentBoundEvent_0_ClearableDelegate__DelegateSignature");
static_assert(offsetof(BP_Trigger_RevealZone_C_BndEvt__BP_Trigger_RevealZone_Clear_K2Node_ComponentBoundEvent_0_ClearableDelegate__DelegateSignature, ClearStatus) == 0x000000, "Member 'BP_Trigger_RevealZone_C_BndEvt__BP_Trigger_RevealZone_Clear_K2Node_ComponentBoundEvent_0_ClearableDelegate__DelegateSignature::ClearStatus' has a wrong offset!");

}

