#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Trigger_RegisterRuntimeCheckpoint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Trigger_RegisterRuntimeCheckpoint.BP_Trigger_RegisterRuntimeCheckpoint_C.ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint
// 0x02B0 (0x02B0 - 0x0000)
struct BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_PlayerActor;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x0030(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0150(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x01B0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint) == 0x000010, "Wrong alignment on BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint");
static_assert(sizeof(BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint) == 0x0002B0, "Wrong size on BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint");
static_assert(offsetof(BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint, EntryPoint) == 0x000000, "Member 'BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint, K2Node_Event_PlayerActor) == 0x000008, "Member 'BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint::K2Node_Event_PlayerActor' has a wrong offset!");
static_assert(offsetof(BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint, CallFunc_GetRelativeTransform_ReturnValue) == 0x000030, "Member 'BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000090, "Member 'BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint, CallFunc_BreakTransform_Location) == 0x0000A8, "Member 'BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint, CallFunc_BreakTransform_Rotation) == 0x0000C0, "Member 'BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint, CallFunc_BreakTransform_Scale) == 0x0000D8, "Member 'BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000F0, "Member 'BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint, CallFunc_BreakVector_X) == 0x000108, "Member 'BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint, CallFunc_BreakVector_Y) == 0x000110, "Member 'BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint, CallFunc_BreakVector_Z) == 0x000118, "Member 'BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000120, "Member 'BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint, CallFunc_SelectFloat_ReturnValue) == 0x000128, "Member 'BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint, CallFunc_MakeRotator_ReturnValue) == 0x000130, "Member 'BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint, CallFunc_MakeTransform_ReturnValue) == 0x000150, "Member 'BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x0001B0, "Member 'BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x0002A8, "Member 'BP_Trigger_RegisterRuntimeCheckpoint_C_ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

// Function BP_Trigger_RegisterRuntimeCheckpoint.BP_Trigger_RegisterRuntimeCheckpoint_C.OnPlayerEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_Trigger_RegisterRuntimeCheckpoint_C_OnPlayerEndOverlap final
{
public:
	class AActor*                                 PlayerActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Trigger_RegisterRuntimeCheckpoint_C_OnPlayerEndOverlap) == 0x000008, "Wrong alignment on BP_Trigger_RegisterRuntimeCheckpoint_C_OnPlayerEndOverlap");
static_assert(sizeof(BP_Trigger_RegisterRuntimeCheckpoint_C_OnPlayerEndOverlap) == 0x000008, "Wrong size on BP_Trigger_RegisterRuntimeCheckpoint_C_OnPlayerEndOverlap");
static_assert(offsetof(BP_Trigger_RegisterRuntimeCheckpoint_C_OnPlayerEndOverlap, PlayerActor) == 0x000000, "Member 'BP_Trigger_RegisterRuntimeCheckpoint_C_OnPlayerEndOverlap::PlayerActor' has a wrong offset!");

}

