#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Trigger_RegisterRuntimeCheckpoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Trigger_RegisterRuntimeCheckpoint.BP_Trigger_RegisterRuntimeCheckpoint_C
// 0x0018 (0x02E0 - 0x02C8)
class ABP_Trigger_RegisterRuntimeCheckpoint_C final : public ATrigger_RegisterRuntimeCheckpoint
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   EditorVisuals;                                     // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Trigger_RegisterRuntimeCheckpoint(int32 EntryPoint);
	void OnPlayerEndOverlap(class AActor* PlayerActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Trigger_RegisterRuntimeCheckpoint_C">();
	}
	static class ABP_Trigger_RegisterRuntimeCheckpoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Trigger_RegisterRuntimeCheckpoint_C>();
	}
};
static_assert(alignof(ABP_Trigger_RegisterRuntimeCheckpoint_C) == 0x000008, "Wrong alignment on ABP_Trigger_RegisterRuntimeCheckpoint_C");
static_assert(sizeof(ABP_Trigger_RegisterRuntimeCheckpoint_C) == 0x0002E0, "Wrong size on ABP_Trigger_RegisterRuntimeCheckpoint_C");
static_assert(offsetof(ABP_Trigger_RegisterRuntimeCheckpoint_C, UberGraphFrame) == 0x0002C8, "Member 'ABP_Trigger_RegisterRuntimeCheckpoint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Trigger_RegisterRuntimeCheckpoint_C, EditorVisuals) == 0x0002D0, "Member 'ABP_Trigger_RegisterRuntimeCheckpoint_C::EditorVisuals' has a wrong offset!");
static_assert(offsetof(ABP_Trigger_RegisterRuntimeCheckpoint_C, Box) == 0x0002D8, "Member 'ABP_Trigger_RegisterRuntimeCheckpoint_C::Box' has a wrong offset!");

}

