#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Trigger_FieldTalk

#include "Basic.hpp"

#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function BP_Trigger_FieldTalk.BP_Trigger_FieldTalk_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_Trigger_FieldTalk_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Trigger_FieldTalk_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_Trigger_FieldTalk_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_Trigger_FieldTalk_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_Trigger_FieldTalk_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_Trigger_FieldTalk_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_Trigger_FieldTalk_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function BP_Trigger_FieldTalk.BP_Trigger_FieldTalk_C.ExecuteUbergraph_BP_Trigger_FieldTalk
// 0x0048 (0x0048 - 0x0000)
struct BP_Trigger_FieldTalk_C_ExecuteUbergraph_BP_Trigger_FieldTalk final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWaitGameReadyAsyncAction*              CallFunc_WaitGameReady_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EClearStatus                                  CallFunc_GetClearStatus_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanStartFieldTalk_ReturnValue;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartFieldTalk_ReturnValue;               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Trigger_FieldTalk_C_ExecuteUbergraph_BP_Trigger_FieldTalk) == 0x000008, "Wrong alignment on BP_Trigger_FieldTalk_C_ExecuteUbergraph_BP_Trigger_FieldTalk");
static_assert(sizeof(BP_Trigger_FieldTalk_C_ExecuteUbergraph_BP_Trigger_FieldTalk) == 0x000048, "Wrong size on BP_Trigger_FieldTalk_C_ExecuteUbergraph_BP_Trigger_FieldTalk");
static_assert(offsetof(BP_Trigger_FieldTalk_C_ExecuteUbergraph_BP_Trigger_FieldTalk, EntryPoint) == 0x000000, "Member 'BP_Trigger_FieldTalk_C_ExecuteUbergraph_BP_Trigger_FieldTalk::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Trigger_FieldTalk_C_ExecuteUbergraph_BP_Trigger_FieldTalk, CallFunc_WaitGameReady_ReturnValue) == 0x000008, "Member 'BP_Trigger_FieldTalk_C_ExecuteUbergraph_BP_Trigger_FieldTalk::CallFunc_WaitGameReady_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_FieldTalk_C_ExecuteUbergraph_BP_Trigger_FieldTalk, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_Trigger_FieldTalk_C_ExecuteUbergraph_BP_Trigger_FieldTalk::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_FieldTalk_C_ExecuteUbergraph_BP_Trigger_FieldTalk, K2Node_Event_OtherActor) == 0x000018, "Member 'BP_Trigger_FieldTalk_C_ExecuteUbergraph_BP_Trigger_FieldTalk::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Trigger_FieldTalk_C_ExecuteUbergraph_BP_Trigger_FieldTalk, CallFunc_GetClearStatus_ReturnValue) == 0x000020, "Member 'BP_Trigger_FieldTalk_C_ExecuteUbergraph_BP_Trigger_FieldTalk::CallFunc_GetClearStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_FieldTalk_C_ExecuteUbergraph_BP_Trigger_FieldTalk, CallFunc_Get_ReturnValue) == 0x000028, "Member 'BP_Trigger_FieldTalk_C_ExecuteUbergraph_BP_Trigger_FieldTalk::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_FieldTalk_C_ExecuteUbergraph_BP_Trigger_FieldTalk, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000030, "Member 'BP_Trigger_FieldTalk_C_ExecuteUbergraph_BP_Trigger_FieldTalk::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_FieldTalk_C_ExecuteUbergraph_BP_Trigger_FieldTalk, CallFunc_CanStartFieldTalk_ReturnValue) == 0x000031, "Member 'BP_Trigger_FieldTalk_C_ExecuteUbergraph_BP_Trigger_FieldTalk::CallFunc_CanStartFieldTalk_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_FieldTalk_C_ExecuteUbergraph_BP_Trigger_FieldTalk, CallFunc_IsValid_ReturnValue_1) == 0x000032, "Member 'BP_Trigger_FieldTalk_C_ExecuteUbergraph_BP_Trigger_FieldTalk::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Trigger_FieldTalk_C_ExecuteUbergraph_BP_Trigger_FieldTalk, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'BP_Trigger_FieldTalk_C_ExecuteUbergraph_BP_Trigger_FieldTalk::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Trigger_FieldTalk_C_ExecuteUbergraph_BP_Trigger_FieldTalk, CallFunc_StartFieldTalk_ReturnValue) == 0x000044, "Member 'BP_Trigger_FieldTalk_C_ExecuteUbergraph_BP_Trigger_FieldTalk::CallFunc_StartFieldTalk_ReturnValue' has a wrong offset!");

}

