#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Trigger_HideFakeWalls

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Trigger_HideFakeWalls.BP_Trigger_HideFakeWalls_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_Trigger_HideFakeWalls_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Trigger_HideFakeWalls_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_Trigger_HideFakeWalls_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_Trigger_HideFakeWalls_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_Trigger_HideFakeWalls_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_Trigger_HideFakeWalls_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_Trigger_HideFakeWalls_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function BP_Trigger_HideFakeWalls.BP_Trigger_HideFakeWalls_C.ExecuteUbergraph_BP_Trigger_HideFakeWalls
// 0x0018 (0x0018 - 0x0000)
struct BP_Trigger_HideFakeWalls_C_ExecuteUbergraph_BP_Trigger_HideFakeWalls final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayer_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Trigger_HideFakeWalls_C_ExecuteUbergraph_BP_Trigger_HideFakeWalls) == 0x000008, "Wrong alignment on BP_Trigger_HideFakeWalls_C_ExecuteUbergraph_BP_Trigger_HideFakeWalls");
static_assert(sizeof(BP_Trigger_HideFakeWalls_C_ExecuteUbergraph_BP_Trigger_HideFakeWalls) == 0x000018, "Wrong size on BP_Trigger_HideFakeWalls_C_ExecuteUbergraph_BP_Trigger_HideFakeWalls");
static_assert(offsetof(BP_Trigger_HideFakeWalls_C_ExecuteUbergraph_BP_Trigger_HideFakeWalls, EntryPoint) == 0x000000, "Member 'BP_Trigger_HideFakeWalls_C_ExecuteUbergraph_BP_Trigger_HideFakeWalls::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Trigger_HideFakeWalls_C_ExecuteUbergraph_BP_Trigger_HideFakeWalls, K2Node_Event_OtherActor) == 0x000008, "Member 'BP_Trigger_HideFakeWalls_C_ExecuteUbergraph_BP_Trigger_HideFakeWalls::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Trigger_HideFakeWalls_C_ExecuteUbergraph_BP_Trigger_HideFakeWalls, CallFunc_IsPlayer_ReturnValue) == 0x000010, "Member 'BP_Trigger_HideFakeWalls_C_ExecuteUbergraph_BP_Trigger_HideFakeWalls::CallFunc_IsPlayer_ReturnValue' has a wrong offset!");

// Function BP_Trigger_HideFakeWalls.BP_Trigger_HideFakeWalls_C.ClearFakeWalls
// 0x0020 (0x0020 - 0x0000)
struct BP_Trigger_HideFakeWalls_C_ClearFakeWalls final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_FakeWall_C*                         CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Trigger_HideFakeWalls_C_ClearFakeWalls) == 0x000008, "Wrong alignment on BP_Trigger_HideFakeWalls_C_ClearFakeWalls");
static_assert(sizeof(BP_Trigger_HideFakeWalls_C_ClearFakeWalls) == 0x000020, "Wrong size on BP_Trigger_HideFakeWalls_C_ClearFakeWalls");
static_assert(offsetof(BP_Trigger_HideFakeWalls_C_ClearFakeWalls, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_Trigger_HideFakeWalls_C_ClearFakeWalls::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Trigger_HideFakeWalls_C_ClearFakeWalls, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_Trigger_HideFakeWalls_C_ClearFakeWalls::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Trigger_HideFakeWalls_C_ClearFakeWalls, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_Trigger_HideFakeWalls_C_ClearFakeWalls::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_HideFakeWalls_C_ClearFakeWalls, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'BP_Trigger_HideFakeWalls_C_ClearFakeWalls::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_HideFakeWalls_C_ClearFakeWalls, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_Trigger_HideFakeWalls_C_ClearFakeWalls::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Trigger_HideFakeWalls_C_ClearFakeWalls, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'BP_Trigger_HideFakeWalls_C_ClearFakeWalls::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trigger_HideFakeWalls_C_ClearFakeWalls, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BP_Trigger_HideFakeWalls_C_ClearFakeWalls::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

