#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Visual_Sprite

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Visual_Sprite.BP_Visual_Sprite_C
// 0x0018 (0x02A8 - 0x0290)
class ABP_Visual_Sprite_C : public AActor
{
public:
	class USceneComponent*                        Scene;                                             // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPaperSpriteComponent*                  PaperSprite;                                       // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           Sprite;                                            // 0x02A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Visual_Sprite_C">();
	}
	static class ABP_Visual_Sprite_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Visual_Sprite_C>();
	}
};
static_assert(alignof(ABP_Visual_Sprite_C) == 0x000008, "Wrong alignment on ABP_Visual_Sprite_C");
static_assert(sizeof(ABP_Visual_Sprite_C) == 0x0002A8, "Wrong size on ABP_Visual_Sprite_C");
static_assert(offsetof(ABP_Visual_Sprite_C, Scene) == 0x000290, "Member 'ABP_Visual_Sprite_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_Visual_Sprite_C, PaperSprite) == 0x000298, "Member 'ABP_Visual_Sprite_C::PaperSprite' has a wrong offset!");
static_assert(offsetof(ABP_Visual_Sprite_C, Sprite) == 0x0002A0, "Member 'ABP_Visual_Sprite_C::Sprite' has a wrong offset!");

}

