#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_ComputePatrolLocation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTTask_ComputePatrolLocation.BTTask_ComputePatrolLocation_C
// 0x0080 (0x0128 - 0x00A8)
class UBTTask_ComputePatrolLocation_C  : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 PatrolOriginKey;                                   // 0x00B0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FBlackboardKeySelector                 PatrolRange;                                       // 0x00D8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FBlackboardKeySelector                 Result;                                            // 0x0100(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)

public:
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ExecuteUbergraph_BTTask_ComputePatrolLocation(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTTask_ComputePatrolLocation_C">();
	}
	static class UBTTask_ComputePatrolLocation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_ComputePatrolLocation_C>();
	}
};
static_assert(alignof(UBTTask_ComputePatrolLocation_C) == 0x000008, "Wrong alignment on UBTTask_ComputePatrolLocation_C");
static_assert(sizeof(UBTTask_ComputePatrolLocation_C) == 0x000128, "Wrong size on UBTTask_ComputePatrolLocation_C");
static_assert(offsetof(UBTTask_ComputePatrolLocation_C, UberGraphFrame) == 0x0000A8, "Member 'UBTTask_ComputePatrolLocation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTTask_ComputePatrolLocation_C, PatrolOriginKey) == 0x0000B0, "Member 'UBTTask_ComputePatrolLocation_C::PatrolOriginKey' has a wrong offset!");
static_assert(offsetof(UBTTask_ComputePatrolLocation_C, PatrolRange) == 0x0000D8, "Member 'UBTTask_ComputePatrolLocation_C::PatrolRange' has a wrong offset!");
static_assert(offsetof(UBTTask_ComputePatrolLocation_C, Result) == 0x000100, "Member 'UBTTask_ComputePatrolLocation_C::Result' has a wrong offset!");

}

