#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CMD_s5200_PileAttack_Landing

#include "Basic.hpp"

#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function CMD_s5200_PileAttack_Landing.CMD_s5200_PileAttack_Landing_C.ExecuteUbergraph_CMD_s5200_PileAttack_Landing
// 0x0028 (0x0028 - 0x0000)
struct CMD_s5200_PileAttack_Landing_C_ExecuteUbergraph_CMD_s5200_PileAttack_Landing final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetCharacter_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommandFinishType                            K2Node_Event_FinishType;                           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_s5200_Pounder_C*                    K2Node_DynamicCast_AsBP_S_5200_Pounder;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CMD_s5200_PileAttack_Landing_C_ExecuteUbergraph_CMD_s5200_PileAttack_Landing) == 0x000008, "Wrong alignment on CMD_s5200_PileAttack_Landing_C_ExecuteUbergraph_CMD_s5200_PileAttack_Landing");
static_assert(sizeof(CMD_s5200_PileAttack_Landing_C_ExecuteUbergraph_CMD_s5200_PileAttack_Landing) == 0x000028, "Wrong size on CMD_s5200_PileAttack_Landing_C_ExecuteUbergraph_CMD_s5200_PileAttack_Landing");
static_assert(offsetof(CMD_s5200_PileAttack_Landing_C_ExecuteUbergraph_CMD_s5200_PileAttack_Landing, EntryPoint) == 0x000000, "Member 'CMD_s5200_PileAttack_Landing_C_ExecuteUbergraph_CMD_s5200_PileAttack_Landing::EntryPoint' has a wrong offset!");
static_assert(offsetof(CMD_s5200_PileAttack_Landing_C_ExecuteUbergraph_CMD_s5200_PileAttack_Landing, CallFunc_GetCharacter_ReturnValue) == 0x000008, "Member 'CMD_s5200_PileAttack_Landing_C_ExecuteUbergraph_CMD_s5200_PileAttack_Landing::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(CMD_s5200_PileAttack_Landing_C_ExecuteUbergraph_CMD_s5200_PileAttack_Landing, K2Node_Event_FinishType) == 0x000010, "Member 'CMD_s5200_PileAttack_Landing_C_ExecuteUbergraph_CMD_s5200_PileAttack_Landing::K2Node_Event_FinishType' has a wrong offset!");
static_assert(offsetof(CMD_s5200_PileAttack_Landing_C_ExecuteUbergraph_CMD_s5200_PileAttack_Landing, K2Node_DynamicCast_AsBP_S_5200_Pounder) == 0x000018, "Member 'CMD_s5200_PileAttack_Landing_C_ExecuteUbergraph_CMD_s5200_PileAttack_Landing::K2Node_DynamicCast_AsBP_S_5200_Pounder' has a wrong offset!");
static_assert(offsetof(CMD_s5200_PileAttack_Landing_C_ExecuteUbergraph_CMD_s5200_PileAttack_Landing, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'CMD_s5200_PileAttack_Landing_C_ExecuteUbergraph_CMD_s5200_PileAttack_Landing::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function CMD_s5200_PileAttack_Landing.CMD_s5200_PileAttack_Landing_C.OnFinish
// 0x0001 (0x0001 - 0x0000)
struct CMD_s5200_PileAttack_Landing_C_OnFinish final
{
public:
	ECommandFinishType                            FinishType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CMD_s5200_PileAttack_Landing_C_OnFinish) == 0x000001, "Wrong alignment on CMD_s5200_PileAttack_Landing_C_OnFinish");
static_assert(sizeof(CMD_s5200_PileAttack_Landing_C_OnFinish) == 0x000001, "Wrong size on CMD_s5200_PileAttack_Landing_C_OnFinish");
static_assert(offsetof(CMD_s5200_PileAttack_Landing_C_OnFinish, FinishType) == 0x000000, "Member 'CMD_s5200_PileAttack_Landing_C_OnFinish::FinishType' has a wrong offset!");

}

