#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DM_DebugMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function DM_DebugMenu.DM_DebugMenu_C.ExecuteUbergraph_DM_DebugMenu
// 0x0018 (0x0018 - 0x0000)
struct DM_DebugMenu_C_ExecuteUbergraph_DM_DebugMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_DebugMenu_C*                       CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChildAt_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChildAt_ReturnValue_1;              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChildAt_ReturnValue_2;              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DM_DebugMenu_C_ExecuteUbergraph_DM_DebugMenu) == 0x000008, "Wrong alignment on DM_DebugMenu_C_ExecuteUbergraph_DM_DebugMenu");
static_assert(sizeof(DM_DebugMenu_C_ExecuteUbergraph_DM_DebugMenu) == 0x000018, "Wrong size on DM_DebugMenu_C_ExecuteUbergraph_DM_DebugMenu");
static_assert(offsetof(DM_DebugMenu_C_ExecuteUbergraph_DM_DebugMenu, EntryPoint) == 0x000000, "Member 'DM_DebugMenu_C_ExecuteUbergraph_DM_DebugMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(DM_DebugMenu_C_ExecuteUbergraph_DM_DebugMenu, Temp_int_Variable) == 0x000004, "Member 'DM_DebugMenu_C_ExecuteUbergraph_DM_DebugMenu::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(DM_DebugMenu_C_ExecuteUbergraph_DM_DebugMenu, CallFunc_Create_ReturnValue) == 0x000008, "Member 'DM_DebugMenu_C_ExecuteUbergraph_DM_DebugMenu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(DM_DebugMenu_C_ExecuteUbergraph_DM_DebugMenu, CallFunc_RemoveChildAt_ReturnValue) == 0x000010, "Member 'DM_DebugMenu_C_ExecuteUbergraph_DM_DebugMenu::CallFunc_RemoveChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DM_DebugMenu_C_ExecuteUbergraph_DM_DebugMenu, CallFunc_RemoveChildAt_ReturnValue_1) == 0x000011, "Member 'DM_DebugMenu_C_ExecuteUbergraph_DM_DebugMenu::CallFunc_RemoveChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DM_DebugMenu_C_ExecuteUbergraph_DM_DebugMenu, CallFunc_RemoveChildAt_ReturnValue_2) == 0x000012, "Member 'DM_DebugMenu_C_ExecuteUbergraph_DM_DebugMenu::CallFunc_RemoveChildAt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DM_DebugMenu_C_ExecuteUbergraph_DM_DebugMenu, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000013, "Member 'DM_DebugMenu_C_ExecuteUbergraph_DM_DebugMenu::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DM_DebugMenu_C_ExecuteUbergraph_DM_DebugMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'DM_DebugMenu_C_ExecuteUbergraph_DM_DebugMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function DM_DebugMenu.DM_DebugMenu_C.ToggleModule
// 0x0010 (0x0010 - 0x0000)
struct DM_DebugMenu_C_ToggleModule final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DM_DebugMenu_C_ToggleModule) == 0x000008, "Wrong alignment on DM_DebugMenu_C_ToggleModule");
static_assert(sizeof(DM_DebugMenu_C_ToggleModule) == 0x000010, "Wrong size on DM_DebugMenu_C_ToggleModule");
static_assert(offsetof(DM_DebugMenu_C_ToggleModule, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'DM_DebugMenu_C_ToggleModule::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(DM_DebugMenu_C_ToggleModule, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'DM_DebugMenu_C_ToggleModule::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DM_DebugMenu_C_ToggleModule, CallFunc_IsInViewport_ReturnValue) == 0x000009, "Member 'DM_DebugMenu_C_ToggleModule::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");

}

