#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DM_Jump

#include "Basic.hpp"


namespace SDK::Params
{

// Function DM_Jump.DM_Jump_C.ServiceTick
// 0x0018 (0x0018 - 0x0000)
struct DM_Jump_C_ServiceTick final
{
public:
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_CharacterZion_C*                    K2Node_DynamicCast_AsBP_Character_Zion;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DM_Jump_C_ServiceTick) == 0x000008, "Wrong alignment on DM_Jump_C_ServiceTick");
static_assert(sizeof(DM_Jump_C_ServiceTick) == 0x000018, "Wrong size on DM_Jump_C_ServiceTick");
static_assert(offsetof(DM_Jump_C_ServiceTick, CallFunc_GetPlayerPawn_ReturnValue) == 0x000000, "Member 'DM_Jump_C_ServiceTick::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(DM_Jump_C_ServiceTick, K2Node_DynamicCast_AsBP_Character_Zion) == 0x000008, "Member 'DM_Jump_C_ServiceTick::K2Node_DynamicCast_AsBP_Character_Zion' has a wrong offset!");
static_assert(offsetof(DM_Jump_C_ServiceTick, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'DM_Jump_C_ServiceTick::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

