#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DM_OneHitKO

#include "Basic.hpp"

#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function DM_OneHitKO.DM_OneHitKO_C.ToggleModule
// 0x00A0 (0x00A0 - 0x0000)
struct DM_OneHitKO_C_ToggleModule final
{
public:
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStatsLevelData                        K2Node_MakeStruct_StatsLevelData;                  // 0x0010(0x0040)()
	struct FExtendedStatsData                     K2Node_MakeStruct_ExtendedStatsData;               // 0x0050(0x0050)()
};
static_assert(alignof(DM_OneHitKO_C_ToggleModule) == 0x000008, "Wrong alignment on DM_OneHitKO_C_ToggleModule");
static_assert(sizeof(DM_OneHitKO_C_ToggleModule) == 0x0000A0, "Wrong size on DM_OneHitKO_C_ToggleModule");
static_assert(offsetof(DM_OneHitKO_C_ToggleModule, CallFunc_Get_ReturnValue) == 0x000000, "Member 'DM_OneHitKO_C_ToggleModule::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(DM_OneHitKO_C_ToggleModule, CallFunc_SelectInt_ReturnValue) == 0x000008, "Member 'DM_OneHitKO_C_ToggleModule::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DM_OneHitKO_C_ToggleModule, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'DM_OneHitKO_C_ToggleModule::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DM_OneHitKO_C_ToggleModule, K2Node_MakeStruct_StatsLevelData) == 0x000010, "Member 'DM_OneHitKO_C_ToggleModule::K2Node_MakeStruct_StatsLevelData' has a wrong offset!");
static_assert(offsetof(DM_OneHitKO_C_ToggleModule, K2Node_MakeStruct_ExtendedStatsData) == 0x000050, "Member 'DM_OneHitKO_C_ToggleModule::K2Node_MakeStruct_ExtendedStatsData' has a wrong offset!");

}

