#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DM_Physics

#include "Basic.hpp"

#include "DM_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DM_Physics.DM_Physics_C
// 0x0018 (0x0378 - 0x0360)
class UDM_Physics_C final : public UDM_Base_C
{
public:
	bool                                          bAllEnabled;                                       // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHelpTextEntry_C*                       help;                                              // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         cycle;                                             // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PlayerInitialize(class ABP_CharacterZion_C* Player);
	void ServiceTick();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DM_Physics_C">();
	}
	static class UDM_Physics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDM_Physics_C>();
	}
};
static_assert(alignof(UDM_Physics_C) == 0x000008, "Wrong alignment on UDM_Physics_C");
static_assert(sizeof(UDM_Physics_C) == 0x000378, "Wrong size on UDM_Physics_C");
static_assert(offsetof(UDM_Physics_C, bAllEnabled) == 0x000360, "Member 'UDM_Physics_C::bAllEnabled' has a wrong offset!");
static_assert(offsetof(UDM_Physics_C, help) == 0x000368, "Member 'UDM_Physics_C::help' has a wrong offset!");
static_assert(offsetof(UDM_Physics_C, cycle) == 0x000370, "Member 'UDM_Physics_C::cycle' has a wrong offset!");

}

