#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DM_ShowHitbox

#include "Basic.hpp"


namespace SDK::Params
{

// Function DM_ShowHitbox.DM_ShowHitbox_C.ServiceTick
// 0x0060 (0x0060 - 0x0000)
struct DM_ShowHitbox_C_ServiceTick final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AAbilityHitbox*>                 CallFunc_GetAllActorsOfClass_OutActors;            // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAbilityHitbox*                         CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UShapeComponent*>                CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UShapeComponent*                        CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DM_ShowHitbox_C_ServiceTick) == 0x000008, "Wrong alignment on DM_ShowHitbox_C_ServiceTick");
static_assert(sizeof(DM_ShowHitbox_C_ServiceTick) == 0x000060, "Wrong size on DM_ShowHitbox_C_ServiceTick");
static_assert(offsetof(DM_ShowHitbox_C_ServiceTick, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'DM_ShowHitbox_C_ServiceTick::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(DM_ShowHitbox_C_ServiceTick, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'DM_ShowHitbox_C_ServiceTick::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DM_ShowHitbox_C_ServiceTick, Temp_int_Array_Index_Variable) == 0x000008, "Member 'DM_ShowHitbox_C_ServiceTick::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(DM_ShowHitbox_C_ServiceTick, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'DM_ShowHitbox_C_ServiceTick::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(DM_ShowHitbox_C_ServiceTick, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'DM_ShowHitbox_C_ServiceTick::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(DM_ShowHitbox_C_ServiceTick, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'DM_ShowHitbox_C_ServiceTick::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DM_ShowHitbox_C_ServiceTick, CallFunc_GetAllActorsOfClass_OutActors) == 0x000018, "Member 'DM_ShowHitbox_C_ServiceTick::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(DM_ShowHitbox_C_ServiceTick, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'DM_ShowHitbox_C_ServiceTick::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(DM_ShowHitbox_C_ServiceTick, CallFunc_Array_Get_Item) == 0x000030, "Member 'DM_ShowHitbox_C_ServiceTick::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DM_ShowHitbox_C_ServiceTick, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'DM_ShowHitbox_C_ServiceTick::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DM_ShowHitbox_C_ServiceTick, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000040, "Member 'DM_ShowHitbox_C_ServiceTick::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(DM_ShowHitbox_C_ServiceTick, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'DM_ShowHitbox_C_ServiceTick::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(DM_ShowHitbox_C_ServiceTick, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'DM_ShowHitbox_C_ServiceTick::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DM_ShowHitbox_C_ServiceTick, CallFunc_Less_IntInt_ReturnValue_1) == 0x00005C, "Member 'DM_ShowHitbox_C_ServiceTick::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function DM_ShowHitbox.DM_ShowHitbox_C.ToggleModule
// 0x0060 (0x0060 - 0x0000)
struct DM_ShowHitbox_C_ToggleModule final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AAbilityHitbox*>                 CallFunc_GetAllActorsOfClass_OutActors;            // 0x0018(0x0010)(ReferenceParm)
	class AAbilityHitbox*                         CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UShapeComponent*>                CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UShapeComponent*                        CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DM_ShowHitbox_C_ToggleModule) == 0x000008, "Wrong alignment on DM_ShowHitbox_C_ToggleModule");
static_assert(sizeof(DM_ShowHitbox_C_ToggleModule) == 0x000060, "Wrong size on DM_ShowHitbox_C_ToggleModule");
static_assert(offsetof(DM_ShowHitbox_C_ToggleModule, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'DM_ShowHitbox_C_ToggleModule::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(DM_ShowHitbox_C_ToggleModule, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'DM_ShowHitbox_C_ToggleModule::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DM_ShowHitbox_C_ToggleModule, Temp_int_Array_Index_Variable) == 0x000008, "Member 'DM_ShowHitbox_C_ToggleModule::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(DM_ShowHitbox_C_ToggleModule, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'DM_ShowHitbox_C_ToggleModule::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(DM_ShowHitbox_C_ToggleModule, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'DM_ShowHitbox_C_ToggleModule::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(DM_ShowHitbox_C_ToggleModule, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'DM_ShowHitbox_C_ToggleModule::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DM_ShowHitbox_C_ToggleModule, CallFunc_GetAllActorsOfClass_OutActors) == 0x000018, "Member 'DM_ShowHitbox_C_ToggleModule::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(DM_ShowHitbox_C_ToggleModule, CallFunc_Array_Get_Item) == 0x000028, "Member 'DM_ShowHitbox_C_ToggleModule::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DM_ShowHitbox_C_ToggleModule, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'DM_ShowHitbox_C_ToggleModule::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(DM_ShowHitbox_C_ToggleModule, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000038, "Member 'DM_ShowHitbox_C_ToggleModule::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(DM_ShowHitbox_C_ToggleModule, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'DM_ShowHitbox_C_ToggleModule::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DM_ShowHitbox_C_ToggleModule, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'DM_ShowHitbox_C_ToggleModule::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(DM_ShowHitbox_C_ToggleModule, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'DM_ShowHitbox_C_ToggleModule::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DM_ShowHitbox_C_ToggleModule, CallFunc_Less_IntInt_ReturnValue_1) == 0x00005C, "Member 'DM_ShowHitbox_C_ToggleModule::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

}

