#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DM_Skill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DM_Base_classes.hpp"
#include "Zion_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DM_Skill.DM_Skill_C
// 0x0028 (0x0388 - 0x0360)
class UDM_Skill_C final : public UDM_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_DM_Skill_C;                         // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USaveSkills_C*                          Skills;                                            // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FString                                 Slot_Name;                                         // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         Target_Version;                                    // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_DM_Skill(int32 EntryPoint);
	void PlayerInitialize(class ABP_CharacterZion_C* Player);
	void ServiceTick();
	void ToggleModule();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DM_Skill_C">();
	}
	static class UDM_Skill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDM_Skill_C>();
	}
};
static_assert(alignof(UDM_Skill_C) == 0x000008, "Wrong alignment on UDM_Skill_C");
static_assert(sizeof(UDM_Skill_C) == 0x000388, "Wrong size on UDM_Skill_C");
static_assert(offsetof(UDM_Skill_C, UberGraphFrame_DM_Skill_C) == 0x000360, "Member 'UDM_Skill_C::UberGraphFrame_DM_Skill_C' has a wrong offset!");
static_assert(offsetof(UDM_Skill_C, Skills) == 0x000368, "Member 'UDM_Skill_C::Skills' has a wrong offset!");
static_assert(offsetof(UDM_Skill_C, Slot_Name) == 0x000370, "Member 'UDM_Skill_C::Slot_Name' has a wrong offset!");
static_assert(offsetof(UDM_Skill_C, Target_Version) == 0x000380, "Member 'UDM_Skill_C::Target_Version' has a wrong offset!");

}

