#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DM_Time

#include "Basic.hpp"

#include "DM_Base_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DM_Time.DM_Time_C
// 0x0020 (0x0380 - 0x0360)
class UDM_Time_C final : public UDM_Base_C
{
public:
	double                                        time_scale;                                        // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        player_time_scale;                                 // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        product;                                           // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHelpTextEntry_C*                       help;                                              // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ServiceTick();
	void ToggleModule();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DM_Time_C">();
	}
	static class UDM_Time_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDM_Time_C>();
	}
};
static_assert(alignof(UDM_Time_C) == 0x000008, "Wrong alignment on UDM_Time_C");
static_assert(sizeof(UDM_Time_C) == 0x000380, "Wrong size on UDM_Time_C");
static_assert(offsetof(UDM_Time_C, time_scale) == 0x000360, "Member 'UDM_Time_C::time_scale' has a wrong offset!");
static_assert(offsetof(UDM_Time_C, player_time_scale) == 0x000368, "Member 'UDM_Time_C::player_time_scale' has a wrong offset!");
static_assert(offsetof(UDM_Time_C, product) == 0x000370, "Member 'UDM_Time_C::product' has a wrong offset!");
static_assert(offsetof(UDM_Time_C, help) == 0x000378, "Member 'UDM_Time_C::help' has a wrong offset!");

}

