#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EVT_Skip_Boss_Intro_Ground

#include "Basic.hpp"


namespace SDK::Params
{

// Function EVT_Skip_Boss_Intro_Ground.EVT_Skip_Boss_Intro_Ground_C.ExecuteUbergraph_EVT_Skip_Boss_Intro_Ground
// 0x0028 (0x0028 - 0x0000)
struct EVT_Skip_Boss_Intro_Ground_C_ExecuteUbergraph_EVT_Skip_Boss_Intro_Ground final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEventContext*                          CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetActorForBinding_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacterZion*                         K2Node_DynamicCast_AsCharacter_Zion;               // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EVT_Skip_Boss_Intro_Ground_C_ExecuteUbergraph_EVT_Skip_Boss_Intro_Ground) == 0x000008, "Wrong alignment on EVT_Skip_Boss_Intro_Ground_C_ExecuteUbergraph_EVT_Skip_Boss_Intro_Ground");
static_assert(sizeof(EVT_Skip_Boss_Intro_Ground_C_ExecuteUbergraph_EVT_Skip_Boss_Intro_Ground) == 0x000028, "Wrong size on EVT_Skip_Boss_Intro_Ground_C_ExecuteUbergraph_EVT_Skip_Boss_Intro_Ground");
static_assert(offsetof(EVT_Skip_Boss_Intro_Ground_C_ExecuteUbergraph_EVT_Skip_Boss_Intro_Ground, EntryPoint) == 0x000000, "Member 'EVT_Skip_Boss_Intro_Ground_C_ExecuteUbergraph_EVT_Skip_Boss_Intro_Ground::EntryPoint' has a wrong offset!");
static_assert(offsetof(EVT_Skip_Boss_Intro_Ground_C_ExecuteUbergraph_EVT_Skip_Boss_Intro_Ground, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'EVT_Skip_Boss_Intro_Ground_C_ExecuteUbergraph_EVT_Skip_Boss_Intro_Ground::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(EVT_Skip_Boss_Intro_Ground_C_ExecuteUbergraph_EVT_Skip_Boss_Intro_Ground, CallFunc_GetActorForBinding_ReturnValue) == 0x000010, "Member 'EVT_Skip_Boss_Intro_Ground_C_ExecuteUbergraph_EVT_Skip_Boss_Intro_Ground::CallFunc_GetActorForBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(EVT_Skip_Boss_Intro_Ground_C_ExecuteUbergraph_EVT_Skip_Boss_Intro_Ground, K2Node_DynamicCast_AsCharacter_Zion) == 0x000018, "Member 'EVT_Skip_Boss_Intro_Ground_C_ExecuteUbergraph_EVT_Skip_Boss_Intro_Ground::K2Node_DynamicCast_AsCharacter_Zion' has a wrong offset!");
static_assert(offsetof(EVT_Skip_Boss_Intro_Ground_C_ExecuteUbergraph_EVT_Skip_Boss_Intro_Ground, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'EVT_Skip_Boss_Intro_Ground_C_ExecuteUbergraph_EVT_Skip_Boss_Intro_Ground::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

