#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HelpTextEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function HelpTextEntry.HelpTextEntry_C.ExecuteUbergraph_HelpTextEntry
// 0x0398 (0x0398 - 0x0000)
struct HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0010)()
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0030(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0048)(HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Text;                           // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x00E0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00F0(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0138(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0148(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x0190(0x0010)()
	int32                                         CallFunc_Len_ReturnValue;                          // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x01A8(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01F8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0208(0x0010)()
	bool                                          K2Node_CustomEvent_enabled;                        // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0220(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0230(0x0048)(HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0280(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0290(0x0010)()
	int32                                         CallFunc_Len_ReturnValue_1;                        // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A5[0x3];                                      // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x02A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue_1;               // 0x02B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_5;          // 0x02C8(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_6;          // 0x02D8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x02E8(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x0330(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0378(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0388(0x0010)()
};
static_assert(alignof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry) == 0x000008, "Wrong alignment on HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry");
static_assert(sizeof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry) == 0x000398, "Wrong size on HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, EntryPoint) == 0x000000, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, Temp_bool_Variable) == 0x000004, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, Temp_text_Variable) == 0x000008, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, Temp_bool_Variable_1) == 0x000018, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, Temp_byte_Variable) == 0x000019, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, Temp_byte_Variable_1) == 0x00001A, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, K2Node_Event_IsDesignTime) == 0x00001B, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000030, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, K2Node_MakeStruct_FormatArgumentData_1) == 0x000088, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, K2Node_CustomEvent_Text) == 0x0000D0, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::K2Node_CustomEvent_Text' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0000E0, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000F0, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000138, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, K2Node_MakeStruct_FormatArgumentData_3) == 0x000148, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, CallFunc_Conv_StringToText_ReturnValue_4) == 0x000190, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::CallFunc_Conv_StringToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, CallFunc_Len_ReturnValue) == 0x0001A0, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, K2Node_MakeStruct_FormatArgumentData_4) == 0x0001A8, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, CallFunc_Greater_IntInt_ReturnValue) == 0x0001F0, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, K2Node_MakeArray_Array) == 0x0001F8, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, CallFunc_Format_ReturnValue) == 0x000208, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, K2Node_CustomEvent_enabled) == 0x000218, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::K2Node_CustomEvent_enabled' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, K2Node_Select_Default) == 0x000220, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, K2Node_MakeStruct_FormatArgumentData_5) == 0x000230, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, K2Node_Select_Default_1) == 0x000278, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, K2Node_MakeArray_Array_1) == 0x000280, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, CallFunc_Format_ReturnValue_1) == 0x000290, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, CallFunc_Len_ReturnValue_1) == 0x0002A0, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::CallFunc_Len_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0002A4, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, CallFunc_SelectString_ReturnValue) == 0x0002A8, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, CallFunc_SelectString_ReturnValue_1) == 0x0002B8, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::CallFunc_SelectString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, CallFunc_Conv_StringToText_ReturnValue_5) == 0x0002C8, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::CallFunc_Conv_StringToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, CallFunc_Conv_StringToText_ReturnValue_6) == 0x0002D8, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::CallFunc_Conv_StringToText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, K2Node_MakeStruct_FormatArgumentData_6) == 0x0002E8, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::K2Node_MakeStruct_FormatArgumentData_6' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, K2Node_MakeStruct_FormatArgumentData_7) == 0x000330, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::K2Node_MakeStruct_FormatArgumentData_7' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, K2Node_MakeArray_Array_2) == 0x000378, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry, CallFunc_Format_ReturnValue_2) == 0x000388, "Member 'HelpTextEntry_C_ExecuteUbergraph_HelpTextEntry::CallFunc_Format_ReturnValue_2' has a wrong offset!");

// Function HelpTextEntry.HelpTextEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct HelpTextEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HelpTextEntry_C_PreConstruct) == 0x000001, "Wrong alignment on HelpTextEntry_C_PreConstruct");
static_assert(sizeof(HelpTextEntry_C_PreConstruct) == 0x000001, "Wrong size on HelpTextEntry_C_PreConstruct");
static_assert(offsetof(HelpTextEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'HelpTextEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function HelpTextEntry.HelpTextEntry_C.SetText
// 0x0010 (0x0010 - 0x0000)
struct HelpTextEntry_C_SetText final
{
public:
	class FString                                 Text_0;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(HelpTextEntry_C_SetText) == 0x000008, "Wrong alignment on HelpTextEntry_C_SetText");
static_assert(sizeof(HelpTextEntry_C_SetText) == 0x000010, "Wrong size on HelpTextEntry_C_SetText");
static_assert(offsetof(HelpTextEntry_C_SetText, Text_0) == 0x000000, "Member 'HelpTextEntry_C_SetText::Text_0' has a wrong offset!");

// Function HelpTextEntry.HelpTextEntry_C.Toggle
// 0x0001 (0x0001 - 0x0000)
struct HelpTextEntry_C_Toggle final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HelpTextEntry_C_Toggle) == 0x000001, "Wrong alignment on HelpTextEntry_C_Toggle");
static_assert(sizeof(HelpTextEntry_C_Toggle) == 0x000001, "Wrong size on HelpTextEntry_C_Toggle");
static_assert(offsetof(HelpTextEntry_C_Toggle, Enabled) == 0x000000, "Member 'HelpTextEntry_C_Toggle::Enabled' has a wrong offset!");

}

