#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HelpTextEntry

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HelpTextEntry.HelpTextEntry_C
// 0x0078 (0x0358 - 0x02E0)
class UHelpTextEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_0;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 Key;                                               // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 Text;                                              // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ModifierKey;                                       // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FKey                                   KeyStruct;                                         // 0x0328(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FKey                                   ModifierStruct;                                    // 0x0340(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HelpTextEntry(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetText(const class FString& Text_0);
	void Toggle(bool Enabled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HelpTextEntry_C">();
	}
	static class UHelpTextEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHelpTextEntry_C>();
	}
};
static_assert(alignof(UHelpTextEntry_C) == 0x000008, "Wrong alignment on UHelpTextEntry_C");
static_assert(sizeof(UHelpTextEntry_C) == 0x000358, "Wrong size on UHelpTextEntry_C");
static_assert(offsetof(UHelpTextEntry_C, UberGraphFrame) == 0x0002E0, "Member 'UHelpTextEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHelpTextEntry_C, Background) == 0x0002E8, "Member 'UHelpTextEntry_C::Background' has a wrong offset!");
static_assert(offsetof(UHelpTextEntry_C, RichTextBlock_0) == 0x0002F0, "Member 'UHelpTextEntry_C::RichTextBlock_0' has a wrong offset!");
static_assert(offsetof(UHelpTextEntry_C, Key) == 0x0002F8, "Member 'UHelpTextEntry_C::Key' has a wrong offset!");
static_assert(offsetof(UHelpTextEntry_C, Text) == 0x000308, "Member 'UHelpTextEntry_C::Text' has a wrong offset!");
static_assert(offsetof(UHelpTextEntry_C, ModifierKey) == 0x000318, "Member 'UHelpTextEntry_C::ModifierKey' has a wrong offset!");
static_assert(offsetof(UHelpTextEntry_C, KeyStruct) == 0x000328, "Member 'UHelpTextEntry_C::KeyStruct' has a wrong offset!");
static_assert(offsetof(UHelpTextEntry_C, ModifierStruct) == 0x000340, "Member 'UHelpTextEntry_C::ModifierStruct' has a wrong offset!");

}

