#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SaveSkills

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "Zion_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass SaveSkills.SaveSkills_C
// 0x0028 (0x0050 - 0x0028)
class USaveSkills_C final : public USaveGame
{
public:
	TArray<class FName>                           Main;                                              // 0x0028(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           Alt;                                               // 0x0038(0x0010)(Edit, BlueprintVisible)
	int32                                         Version;                                           // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Swap();
	void TrySwap(class USkillComponent* SkillComponent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SaveSkills_C">();
	}
	static class USaveSkills_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USaveSkills_C>();
	}
};
static_assert(alignof(USaveSkills_C) == 0x000008, "Wrong alignment on USaveSkills_C");
static_assert(sizeof(USaveSkills_C) == 0x000050, "Wrong size on USaveSkills_C");
static_assert(offsetof(USaveSkills_C, Main) == 0x000028, "Member 'USaveSkills_C::Main' has a wrong offset!");
static_assert(offsetof(USaveSkills_C, Alt) == 0x000038, "Member 'USaveSkills_C::Alt' has a wrong offset!");
static_assert(offsetof(USaveSkills_C, Version) == 0x000048, "Member 'USaveSkills_C::Version' has a wrong offset!");

}

