#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SaveSkills

#include "Basic.hpp"

#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function SaveSkills.SaveSkills_C.Swap
// 0x0010 (0x0010 - 0x0000)
struct SaveSkills_C_Swap final
{
public:
	TArray<class FName>                           LocalVar;                                          // 0x0000(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(SaveSkills_C_Swap) == 0x000008, "Wrong alignment on SaveSkills_C_Swap");
static_assert(sizeof(SaveSkills_C_Swap) == 0x000010, "Wrong size on SaveSkills_C_Swap");
static_assert(offsetof(SaveSkills_C_Swap, LocalVar) == 0x000000, "Member 'SaveSkills_C_Swap::LocalVar' has a wrong offset!");

// Function SaveSkills.SaveSkills_C.TrySwap
// 0x0040 (0x0040 - 0x0000)
struct SaveSkills_C_TrySwap final
{
public:
	class USkillComponent*                        SkillComponent;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          same;                                              // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESkillSlot                                    Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESkillSlot                                    Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESkillSlot                                    Temp_byte_Variable_2;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESkillSlot                                    Temp_byte_Variable_3;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESkillSlot                                    K2Node_Select_Default;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEquippedSkillID_ReturnValue;           // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SaveSkills_C_TrySwap) == 0x000008, "Wrong alignment on SaveSkills_C_TrySwap");
static_assert(sizeof(SaveSkills_C_TrySwap) == 0x000040, "Wrong size on SaveSkills_C_TrySwap");
static_assert(offsetof(SaveSkills_C_TrySwap, SkillComponent) == 0x000000, "Member 'SaveSkills_C_TrySwap::SkillComponent' has a wrong offset!");
static_assert(offsetof(SaveSkills_C_TrySwap, same) == 0x000008, "Member 'SaveSkills_C_TrySwap::same' has a wrong offset!");
static_assert(offsetof(SaveSkills_C_TrySwap, Temp_int_Variable) == 0x00000C, "Member 'SaveSkills_C_TrySwap::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SaveSkills_C_TrySwap, Temp_byte_Variable) == 0x000010, "Member 'SaveSkills_C_TrySwap::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SaveSkills_C_TrySwap, Temp_byte_Variable_1) == 0x000011, "Member 'SaveSkills_C_TrySwap::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SaveSkills_C_TrySwap, Temp_byte_Variable_2) == 0x000012, "Member 'SaveSkills_C_TrySwap::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(SaveSkills_C_TrySwap, Temp_byte_Variable_3) == 0x000013, "Member 'SaveSkills_C_TrySwap::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(SaveSkills_C_TrySwap, Temp_int_Array_Index_Variable) == 0x000014, "Member 'SaveSkills_C_TrySwap::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SaveSkills_C_TrySwap, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'SaveSkills_C_TrySwap::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SaveSkills_C_TrySwap, K2Node_Select_Default) == 0x00001C, "Member 'SaveSkills_C_TrySwap::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SaveSkills_C_TrySwap, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'SaveSkills_C_TrySwap::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SaveSkills_C_TrySwap, CallFunc_GetEquippedSkillID_ReturnValue) == 0x000024, "Member 'SaveSkills_C_TrySwap::CallFunc_GetEquippedSkillID_ReturnValue' has a wrong offset!");
static_assert(offsetof(SaveSkills_C_TrySwap, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'SaveSkills_C_TrySwap::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SaveSkills_C_TrySwap, CallFunc_Array_Get_Item) == 0x000030, "Member 'SaveSkills_C_TrySwap::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SaveSkills_C_TrySwap, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'SaveSkills_C_TrySwap::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SaveSkills_C_TrySwap, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000039, "Member 'SaveSkills_C_TrySwap::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

}

