#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Title

#include "Basic.hpp"

#include "Zion_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Title.Title_C.CanUseGammaSetting
// 0x0002 (0x0002 - 0x0000)
struct Title_C_CanUseGammaSetting final
{
public:
	bool                                          bCanUseGamma;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPCBuild_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Title_C_CanUseGammaSetting) == 0x000001, "Wrong alignment on Title_C_CanUseGammaSetting");
static_assert(sizeof(Title_C_CanUseGammaSetting) == 0x000002, "Wrong size on Title_C_CanUseGammaSetting");
static_assert(offsetof(Title_C_CanUseGammaSetting, bCanUseGamma) == 0x000000, "Member 'Title_C_CanUseGammaSetting::bCanUseGamma' has a wrong offset!");
static_assert(offsetof(Title_C_CanUseGammaSetting, CallFunc_IsPCBuild_ReturnValue) == 0x000001, "Member 'Title_C_CanUseGammaSetting::CallFunc_IsPCBuild_ReturnValue' has a wrong offset!");

// Function Title.Title_C.ExecuteUbergraph_Title
// 0x0110 (0x0110 - 0x0000)
struct Title_C_ExecuteUbergraph_Title final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundSubsystem*                        CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAchievementsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URichPresenceSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Dialog_YesNo_C*                    CallFunc_Create_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bConfirmed)>              K2Node_CreateDelegate_OutputDelegate_2;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UProfileSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingProfileSystem_ReturnValue;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Settings_Gamma_C*                  CallFunc_Create_ReturnValue_1;                     // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Title_C*                           CallFunc_Create_ReturnValue_2;                     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USaveSubsystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_6;   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_7;   // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USaveSubsystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_8;   // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveSettings_ReturnValue;                 // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSubsystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_9;   // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x00B0(0x0010)(ConstParm)
	bool                                          K2Node_CustomEvent_bConfirmed;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanUseGammaSetting_bCanUseGamma;          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_LanguageSelection_C*               CallFunc_Create_ReturnValue_3;                     // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundSubsystem*                        CallFunc_GetGameInstanceSubsystem_ReturnValue_10;  // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundSubsystem*                        CallFunc_GetGameInstanceSubsystem_ReturnValue_11;  // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCrashReportAllowedBuild_ReturnValue;    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ProfileConfirmation_C*             CallFunc_Create_ReturnValue_4;                     // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Title_C_ExecuteUbergraph_Title) == 0x000008, "Wrong alignment on Title_C_ExecuteUbergraph_Title");
static_assert(sizeof(Title_C_ExecuteUbergraph_Title) == 0x000110, "Wrong size on Title_C_ExecuteUbergraph_Title");
static_assert(offsetof(Title_C_ExecuteUbergraph_Title, EntryPoint) == 0x000000, "Member 'Title_C_ExecuteUbergraph_Title::EntryPoint' has a wrong offset!");
static_assert(offsetof(Title_C_ExecuteUbergraph_Title, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Title_C_ExecuteUbergraph_Title::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Title_C_ExecuteUbergraph_Title, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'Title_C_ExecuteUbergraph_Title::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Title_C_ExecuteUbergraph_Title, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000028, "Member 'Title_C_ExecuteUbergraph_Title::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Title_C_ExecuteUbergraph_Title, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000030, "Member 'Title_C_ExecuteUbergraph_Title::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Title_C_ExecuteUbergraph_Title, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000038, "Member 'Title_C_ExecuteUbergraph_Title::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Title_C_ExecuteUbergraph_Title, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000040, "Member 'Title_C_ExecuteUbergraph_Title::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Title_C_ExecuteUbergraph_Title, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x000048, "Member 'Title_C_ExecuteUbergraph_Title::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Title_C_ExecuteUbergraph_Title, CallFunc_Create_ReturnValue) == 0x000050, "Member 'Title_C_ExecuteUbergraph_Title::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Title_C_ExecuteUbergraph_Title, K2Node_CreateDelegate_OutputDelegate_2) == 0x000058, "Member 'Title_C_ExecuteUbergraph_Title::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Title_C_ExecuteUbergraph_Title, CallFunc_GetGameInstanceSubsystem_ReturnValue_5) == 0x000068, "Member 'Title_C_ExecuteUbergraph_Title::CallFunc_GetGameInstanceSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Title_C_ExecuteUbergraph_Title, CallFunc_IsUsingProfileSystem_ReturnValue) == 0x000070, "Member 'Title_C_ExecuteUbergraph_Title::CallFunc_IsUsingProfileSystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Title_C_ExecuteUbergraph_Title, K2Node_Event_EndPlayReason) == 0x000071, "Member 'Title_C_ExecuteUbergraph_Title::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(Title_C_ExecuteUbergraph_Title, CallFunc_Create_ReturnValue_1) == 0x000078, "Member 'Title_C_ExecuteUbergraph_Title::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Title_C_ExecuteUbergraph_Title, CallFunc_Create_ReturnValue_2) == 0x000080, "Member 'Title_C_ExecuteUbergraph_Title::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Title_C_ExecuteUbergraph_Title, CallFunc_GetGameInstanceSubsystem_ReturnValue_6) == 0x000088, "Member 'Title_C_ExecuteUbergraph_Title::CallFunc_GetGameInstanceSubsystem_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Title_C_ExecuteUbergraph_Title, CallFunc_GetGameInstanceSubsystem_ReturnValue_7) == 0x000090, "Member 'Title_C_ExecuteUbergraph_Title::CallFunc_GetGameInstanceSubsystem_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Title_C_ExecuteUbergraph_Title, CallFunc_GetGameInstanceSubsystem_ReturnValue_8) == 0x000098, "Member 'Title_C_ExecuteUbergraph_Title::CallFunc_GetGameInstanceSubsystem_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Title_C_ExecuteUbergraph_Title, CallFunc_SaveSettings_ReturnValue) == 0x0000A0, "Member 'Title_C_ExecuteUbergraph_Title::CallFunc_SaveSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(Title_C_ExecuteUbergraph_Title, CallFunc_GetGameInstanceSubsystem_ReturnValue_9) == 0x0000A8, "Member 'Title_C_ExecuteUbergraph_Title::CallFunc_GetGameInstanceSubsystem_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Title_C_ExecuteUbergraph_Title, Temp_text_Variable) == 0x0000B0, "Member 'Title_C_ExecuteUbergraph_Title::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(Title_C_ExecuteUbergraph_Title, K2Node_CustomEvent_bConfirmed) == 0x0000C0, "Member 'Title_C_ExecuteUbergraph_Title::K2Node_CustomEvent_bConfirmed' has a wrong offset!");
static_assert(offsetof(Title_C_ExecuteUbergraph_Title, CallFunc_CanUseGammaSetting_bCanUseGamma) == 0x0000C1, "Member 'Title_C_ExecuteUbergraph_Title::CallFunc_CanUseGammaSetting_bCanUseGamma' has a wrong offset!");
static_assert(offsetof(Title_C_ExecuteUbergraph_Title, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000C4, "Member 'Title_C_ExecuteUbergraph_Title::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Title_C_ExecuteUbergraph_Title, CallFunc_Create_ReturnValue_3) == 0x0000D8, "Member 'Title_C_ExecuteUbergraph_Title::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Title_C_ExecuteUbergraph_Title, CallFunc_GetGameInstanceSubsystem_ReturnValue_10) == 0x0000E0, "Member 'Title_C_ExecuteUbergraph_Title::CallFunc_GetGameInstanceSubsystem_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Title_C_ExecuteUbergraph_Title, CallFunc_GetGameInstanceSubsystem_ReturnValue_11) == 0x0000E8, "Member 'Title_C_ExecuteUbergraph_Title::CallFunc_GetGameInstanceSubsystem_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(Title_C_ExecuteUbergraph_Title, CallFunc_IsCrashReportAllowedBuild_ReturnValue) == 0x0000F0, "Member 'Title_C_ExecuteUbergraph_Title::CallFunc_IsCrashReportAllowedBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(Title_C_ExecuteUbergraph_Title, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000F4, "Member 'Title_C_ExecuteUbergraph_Title::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Title_C_ExecuteUbergraph_Title, CallFunc_Create_ReturnValue_4) == 0x000108, "Member 'Title_C_ExecuteUbergraph_Title::CallFunc_Create_ReturnValue_4' has a wrong offset!");

// Function Title.Title_C.LoadSettingsData
// 0x00C0 (0x00C0 - 0x0000)
struct Title_C_LoadSettingsData final
{
public:
	class FText                                   Temp_text_Variable;                                // 0x0000(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0010(0x0010)()
	class FText                                   Temp_text_Variable_2;                              // 0x0020(0x0010)()
	class UWBP_Dialog_YesNo_C*                    CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USaveSubsystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_3;                              // 0x0040(0x0010)()
	ESaveExistsType                               CallFunc_LoadSettings_ReturnValue;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_4;                              // 0x0078(0x0010)()
	ESaveExistsType                               Temp_byte_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInitialSettingsDone_ReturnValue;        // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00A0(0x0010)()
	class USaveSubsystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveSettings_ReturnValue;                 // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Title_C_LoadSettingsData) == 0x000008, "Wrong alignment on Title_C_LoadSettingsData");
static_assert(sizeof(Title_C_LoadSettingsData) == 0x0000C0, "Wrong size on Title_C_LoadSettingsData");
static_assert(offsetof(Title_C_LoadSettingsData, Temp_text_Variable) == 0x000000, "Member 'Title_C_LoadSettingsData::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(Title_C_LoadSettingsData, Temp_text_Variable_1) == 0x000010, "Member 'Title_C_LoadSettingsData::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(Title_C_LoadSettingsData, Temp_text_Variable_2) == 0x000020, "Member 'Title_C_LoadSettingsData::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(Title_C_LoadSettingsData, CallFunc_Create_ReturnValue) == 0x000030, "Member 'Title_C_LoadSettingsData::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Title_C_LoadSettingsData, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000038, "Member 'Title_C_LoadSettingsData::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Title_C_LoadSettingsData, Temp_text_Variable_3) == 0x000040, "Member 'Title_C_LoadSettingsData::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(Title_C_LoadSettingsData, CallFunc_LoadSettings_ReturnValue) == 0x000050, "Member 'Title_C_LoadSettingsData::CallFunc_LoadSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(Title_C_LoadSettingsData, K2Node_SwitchEnum_CmpSuccess) == 0x000051, "Member 'Title_C_LoadSettingsData::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Title_C_LoadSettingsData, K2Node_CreateDelegate_OutputDelegate) == 0x000054, "Member 'Title_C_LoadSettingsData::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Title_C_LoadSettingsData, K2Node_CreateDelegate_OutputDelegate_1) == 0x000064, "Member 'Title_C_LoadSettingsData::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Title_C_LoadSettingsData, Temp_text_Variable_4) == 0x000078, "Member 'Title_C_LoadSettingsData::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(Title_C_LoadSettingsData, Temp_byte_Variable) == 0x000088, "Member 'Title_C_LoadSettingsData::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Title_C_LoadSettingsData, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000090, "Member 'Title_C_LoadSettingsData::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Title_C_LoadSettingsData, CallFunc_IsInitialSettingsDone_ReturnValue) == 0x000098, "Member 'Title_C_LoadSettingsData::CallFunc_IsInitialSettingsDone_ReturnValue' has a wrong offset!");
static_assert(offsetof(Title_C_LoadSettingsData, K2Node_Select_Default) == 0x0000A0, "Member 'Title_C_LoadSettingsData::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Title_C_LoadSettingsData, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x0000B0, "Member 'Title_C_LoadSettingsData::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Title_C_LoadSettingsData, CallFunc_SaveSettings_ReturnValue) == 0x0000B8, "Member 'Title_C_LoadSettingsData::CallFunc_SaveSettings_ReturnValue' has a wrong offset!");

// Function Title.Title_C.OnGammaSelected
// 0x0001 (0x0001 - 0x0000)
struct Title_C_OnGammaSelected final
{
public:
	bool                                          bConfirmed;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Title_C_OnGammaSelected) == 0x000001, "Wrong alignment on Title_C_OnGammaSelected");
static_assert(sizeof(Title_C_OnGammaSelected) == 0x000001, "Wrong size on Title_C_OnGammaSelected");
static_assert(offsetof(Title_C_OnGammaSelected, bConfirmed) == 0x000000, "Member 'Title_C_OnGammaSelected::bConfirmed' has a wrong offset!");

// Function Title.Title_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct Title_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Title_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on Title_C_ReceiveEndPlay");
static_assert(sizeof(Title_C_ReceiveEndPlay) == 0x000001, "Wrong size on Title_C_ReceiveEndPlay");
static_assert(offsetof(Title_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'Title_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function Title.Title_C.SetupProfile
// 0x0010 (0x0010 - 0x0000)
struct Title_C_SetupProfile final
{
public:
	class UProfileSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingProfileSystem_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Title_C_SetupProfile) == 0x000008, "Wrong alignment on Title_C_SetupProfile");
static_assert(sizeof(Title_C_SetupProfile) == 0x000010, "Wrong size on Title_C_SetupProfile");
static_assert(offsetof(Title_C_SetupProfile, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'Title_C_SetupProfile::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Title_C_SetupProfile, CallFunc_IsUsingProfileSystem_ReturnValue) == 0x000008, "Member 'Title_C_SetupProfile::CallFunc_IsUsingProfileSystem_ReturnValue' has a wrong offset!");

}

