#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugMenu_Page_Map

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_DebugMenu_Page_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DebugMenu_Page_Map.WBP_DebugMenu_Page_Map_C
// 0x0038 (0x04B8 - 0x0480)
class UWBP_DebugMenu_Page_Map_C final : public UWBP_DebugMenu_Page_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           VerticalBoxContainer;                              // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Button_C*        WBP_DebugMenu_Element_Button_ClearAllMapsFogOfWar; // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Button_C*        WBP_DebugMenu_Element_Button_MarkAllMapIconsAsSeen; // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Button_C*        WBP_DebugMenu_Element_Button_MarkAllMapZonesAsVisited; // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Button_C*        WBP_DebugMenu_Element_Button_ResetAllMapsFogOfWar; // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_OverrideMapTransitionDisplay; // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_DebugMenu_Page_Other_WBP_DebugMenu_Element_Button_ClearAllMapsFogOfWar_K2Node_ComponentBoundEvent_7_OnConfirm__DelegateSignature();
	void BndEvt__WBP_DebugMenu_Page_Other_WBP_DebugMenu_Element_Button_MarkAllMapIconsAsSeen_1_K2Node_ComponentBoundEvent_10_OnConfirm__DelegateSignature();
	void BndEvt__WBP_DebugMenu_Page_Other_WBP_DebugMenu_Element_Button_MarkAllMapIconsAsSeen_K2Node_ComponentBoundEvent_8_OnConfirm__DelegateSignature();
	void BndEvt__WBP_DebugMenu_Page_Other_WBP_DebugMenu_Element_Button_ResetAllMapsFogOfWar_K2Node_ComponentBoundEvent_6_OnConfirm__DelegateSignature();
	void ExecuteUbergraph_WBP_DebugMenu_Page_Map(int32 EntryPoint);
	void OnFinish_976BC0BD463A44DD12E1D7A67D975B4F();
	void OnFinish_A5AAD87345CEC51C62B4178D7F1A6ECC();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DebugMenu_Page_Map_C">();
	}
	static class UWBP_DebugMenu_Page_Map_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DebugMenu_Page_Map_C>();
	}
};
static_assert(alignof(UWBP_DebugMenu_Page_Map_C) == 0x000008, "Wrong alignment on UWBP_DebugMenu_Page_Map_C");
static_assert(sizeof(UWBP_DebugMenu_Page_Map_C) == 0x0004B8, "Wrong size on UWBP_DebugMenu_Page_Map_C");
static_assert(offsetof(UWBP_DebugMenu_Page_Map_C, UberGraphFrame) == 0x000480, "Member 'UWBP_DebugMenu_Page_Map_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Map_C, VerticalBoxContainer) == 0x000488, "Member 'UWBP_DebugMenu_Page_Map_C::VerticalBoxContainer' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Map_C, WBP_DebugMenu_Element_Button_ClearAllMapsFogOfWar) == 0x000490, "Member 'UWBP_DebugMenu_Page_Map_C::WBP_DebugMenu_Element_Button_ClearAllMapsFogOfWar' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Map_C, WBP_DebugMenu_Element_Button_MarkAllMapIconsAsSeen) == 0x000498, "Member 'UWBP_DebugMenu_Page_Map_C::WBP_DebugMenu_Element_Button_MarkAllMapIconsAsSeen' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Map_C, WBP_DebugMenu_Element_Button_MarkAllMapZonesAsVisited) == 0x0004A0, "Member 'UWBP_DebugMenu_Page_Map_C::WBP_DebugMenu_Element_Button_MarkAllMapZonesAsVisited' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Map_C, WBP_DebugMenu_Element_Button_ResetAllMapsFogOfWar) == 0x0004A8, "Member 'UWBP_DebugMenu_Page_Map_C::WBP_DebugMenu_Element_Button_ResetAllMapsFogOfWar' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Map_C, WBP_DebugMenu_Element_Choice_Toggle_Command_OverrideMapTransitionDisplay) == 0x0004B0, "Member 'UWBP_DebugMenu_Page_Map_C::WBP_DebugMenu_Element_Choice_Toggle_Command_OverrideMapTransitionDisplay' has a wrong offset!");

}

