#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Item_EquipmentData_Stat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Zion_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Item_EquipmentData_Stat.WBP_Item_EquipmentData_Stat_C
// 0x0080 (0x04E0 - 0x0460)
class UWBP_Item_EquipmentData_Stat_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Icon;                                              // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line;                                              // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Operator_;                                         // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           OverStatBar;                                       // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ResultValue;                                       // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           StatBar;                                           // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Label;                                             // 0x0498(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	class UPaperSprite*                           IconSprite;                                        // 0x04A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_Default;                                     // 0x04B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_Increase;                                    // 0x04C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_Decrease;                                    // 0x04D0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Item_EquipmentData_Stat(int32 EntryPoint);
	struct FLinearColor GetGaugeColor(int32 Value, int32 ComparatorValue);
	struct FSlateColor GetTextColor(int32 Value, int32 ComparatorValue);
	void PreConstruct(bool IsDesignTime);
	void Setup(int32 Value, int32 ComparatorValue, int32 MaxValue);
	void SetupGauge(int32 Value, int32 ComparatorValue, int32 MaxValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Item_EquipmentData_Stat_C">();
	}
	static class UWBP_Item_EquipmentData_Stat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Item_EquipmentData_Stat_C>();
	}
};
static_assert(alignof(UWBP_Item_EquipmentData_Stat_C) == 0x000008, "Wrong alignment on UWBP_Item_EquipmentData_Stat_C");
static_assert(sizeof(UWBP_Item_EquipmentData_Stat_C) == 0x0004E0, "Wrong size on UWBP_Item_EquipmentData_Stat_C");
static_assert(offsetof(UWBP_Item_EquipmentData_Stat_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Item_EquipmentData_Stat_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Item_EquipmentData_Stat_C, Icon) == 0x000468, "Member 'UWBP_Item_EquipmentData_Stat_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_Item_EquipmentData_Stat_C, Line) == 0x000470, "Member 'UWBP_Item_EquipmentData_Stat_C::Line' has a wrong offset!");
static_assert(offsetof(UWBP_Item_EquipmentData_Stat_C, Operator_) == 0x000478, "Member 'UWBP_Item_EquipmentData_Stat_C::Operator_' has a wrong offset!");
static_assert(offsetof(UWBP_Item_EquipmentData_Stat_C, OverStatBar) == 0x000480, "Member 'UWBP_Item_EquipmentData_Stat_C::OverStatBar' has a wrong offset!");
static_assert(offsetof(UWBP_Item_EquipmentData_Stat_C, ResultValue) == 0x000488, "Member 'UWBP_Item_EquipmentData_Stat_C::ResultValue' has a wrong offset!");
static_assert(offsetof(UWBP_Item_EquipmentData_Stat_C, StatBar) == 0x000490, "Member 'UWBP_Item_EquipmentData_Stat_C::StatBar' has a wrong offset!");
static_assert(offsetof(UWBP_Item_EquipmentData_Stat_C, Label) == 0x000498, "Member 'UWBP_Item_EquipmentData_Stat_C::Label' has a wrong offset!");
static_assert(offsetof(UWBP_Item_EquipmentData_Stat_C, IconSprite) == 0x0004A8, "Member 'UWBP_Item_EquipmentData_Stat_C::IconSprite' has a wrong offset!");
static_assert(offsetof(UWBP_Item_EquipmentData_Stat_C, Color_Default) == 0x0004B0, "Member 'UWBP_Item_EquipmentData_Stat_C::Color_Default' has a wrong offset!");
static_assert(offsetof(UWBP_Item_EquipmentData_Stat_C, Color_Increase) == 0x0004C0, "Member 'UWBP_Item_EquipmentData_Stat_C::Color_Increase' has a wrong offset!");
static_assert(offsetof(UWBP_Item_EquipmentData_Stat_C, Color_Decrease) == 0x0004D0, "Member 'UWBP_Item_EquipmentData_Stat_C::Color_Decrease' has a wrong offset!");

}

