#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Recollection_BossRush_RecordEntry_Current

#include "Basic.hpp"

#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function WBP_Recollection_BossRush_RecordEntry_Current.WBP_Recollection_BossRush_RecordEntry_Current_C.ExecuteUbergraph_WBP_Recollection_BossRush_RecordEntry_Current
// 0x0010 (0x0010 - 0x0000)
struct WBP_Recollection_BossRush_RecordEntry_Current_C_ExecuteUbergraph_WBP_Recollection_BossRush_RecordEntry_Current final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_BossRush_RecordEntry_Current_C_ExecuteUbergraph_WBP_Recollection_BossRush_RecordEntry_Current) == 0x000008, "Wrong alignment on WBP_Recollection_BossRush_RecordEntry_Current_C_ExecuteUbergraph_WBP_Recollection_BossRush_RecordEntry_Current");
static_assert(sizeof(WBP_Recollection_BossRush_RecordEntry_Current_C_ExecuteUbergraph_WBP_Recollection_BossRush_RecordEntry_Current) == 0x000010, "Wrong size on WBP_Recollection_BossRush_RecordEntry_Current_C_ExecuteUbergraph_WBP_Recollection_BossRush_RecordEntry_Current");
static_assert(offsetof(WBP_Recollection_BossRush_RecordEntry_Current_C_ExecuteUbergraph_WBP_Recollection_BossRush_RecordEntry_Current, EntryPoint) == 0x000000, "Member 'WBP_Recollection_BossRush_RecordEntry_Current_C_ExecuteUbergraph_WBP_Recollection_BossRush_RecordEntry_Current::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_RecordEntry_Current_C_ExecuteUbergraph_WBP_Recollection_BossRush_RecordEntry_Current, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'WBP_Recollection_BossRush_RecordEntry_Current_C_ExecuteUbergraph_WBP_Recollection_BossRush_RecordEntry_Current::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_Recollection_BossRush_RecordEntry_Current.WBP_Recollection_BossRush_RecordEntry_Current_C.Set Record Text
// 0x0004 (0x0004 - 0x0000)
struct WBP_Recollection_BossRush_RecordEntry_Current_C_Set_Record_Text final
{
public:
	struct FRecollectionBossRushRecordData        RecordData;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Recollection_BossRush_RecordEntry_Current_C_Set_Record_Text) == 0x000004, "Wrong alignment on WBP_Recollection_BossRush_RecordEntry_Current_C_Set_Record_Text");
static_assert(sizeof(WBP_Recollection_BossRush_RecordEntry_Current_C_Set_Record_Text) == 0x000004, "Wrong size on WBP_Recollection_BossRush_RecordEntry_Current_C_Set_Record_Text");
static_assert(offsetof(WBP_Recollection_BossRush_RecordEntry_Current_C_Set_Record_Text, RecordData) == 0x000000, "Member 'WBP_Recollection_BossRush_RecordEntry_Current_C_Set_Record_Text::RecordData' has a wrong offset!");

}

