#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugWidget

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_DebugWidget.WBP_DebugWidget_C.ExecuteUbergraph_WBP_DebugWidget
// 0x0190 (0x0190 - 0x0000)
struct WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0024(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CharacterZion_C*                    K2Node_DynamicCast_AsBP_Character_Zion;            // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasInputKeyJustPressed_ReturnValue;       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue;               // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDM_Base_C*                             CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UDM_Base_C*>                     CallFunc_Map_Values_Values;                        // 0x00B0(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UDM_Base_C*>                     CallFunc_Map_Values_Values_1;                      // 0x00C0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UDM_Base_C*                             CallFunc_Array_Get_Item_1;                         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FKey, class UDM_Base_C*>          K2Node_MakeMap_Map;                                // 0x00E0(0x0050)(ContainsInstancedReference)
	TArray<class UDM_Base_C*>                     K2Node_MakeArray_Array;                            // 0x0130(0x0010)(ReferenceParm, ContainsInstancedReference)
	TMap<struct FKey, class UDM_Base_C*>          K2Node_MakeMap_Map_1;                              // 0x0140(0x0050)(ContainsInstancedReference)
};
static_assert(alignof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget) == 0x000008, "Wrong alignment on WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget");
static_assert(sizeof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget) == 0x000190, "Wrong size on WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, EntryPoint) == 0x000000, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, K2Node_Event_MyGeometry) == 0x000024, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, K2Node_Event_InDeltaTime) == 0x00005C, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, CallFunc_GetPlayerPawn_ReturnValue) == 0x000060, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000068, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, K2Node_DynamicCast_AsBP_Character_Zion) == 0x000070, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::K2Node_DynamicCast_AsBP_Character_Zion' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, CallFunc_GetPlayerController_ReturnValue) == 0x000080, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, CallFunc_WasInputKeyJustPressed_ReturnValue) == 0x000088, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::CallFunc_WasInputKeyJustPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, CallFunc_IsInputKeyDown_ReturnValue) == 0x000089, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::CallFunc_IsInputKeyDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x00008C, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, CallFunc_Add_IntInt_ReturnValue_2) == 0x000090, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, CallFunc_GetChildrenCount_ReturnValue) == 0x000094, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, CallFunc_Percent_IntInt_ReturnValue) == 0x000098, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, CallFunc_Array_Length_ReturnValue) == 0x0000A8, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, CallFunc_Less_IntInt_ReturnValue) == 0x0000AC, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, CallFunc_Map_Values_Values) == 0x0000B0, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, CallFunc_Map_Values_Values_1) == 0x0000C0, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::CallFunc_Map_Values_Values_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, CallFunc_Array_Get_Item_1) == 0x0000D0, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, CallFunc_Array_Length_ReturnValue_1) == 0x0000D8, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000DC, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, K2Node_MakeMap_Map) == 0x0000E0, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, K2Node_MakeArray_Array) == 0x000130, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget, K2Node_MakeMap_Map_1) == 0x000140, "Member 'WBP_DebugWidget_C_ExecuteUbergraph_WBP_DebugWidget::K2Node_MakeMap_Map_1' has a wrong offset!");

// Function WBP_DebugWidget.WBP_DebugWidget_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_DebugWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugWidget_C_Tick) == 0x000004, "Wrong alignment on WBP_DebugWidget_C_Tick");
static_assert(sizeof(WBP_DebugWidget_C_Tick) == 0x00003C, "Wrong size on WBP_DebugWidget_C_Tick");
static_assert(offsetof(WBP_DebugWidget_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_DebugWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_DebugWidget_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_DebugWidget.WBP_DebugWidget_C.TryToggleModules
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_DebugWidget_C_TryToggleModules final
{
public:
	TMap<struct FKey, class UDM_Base_C*>          Modules;                                           // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	TArray<struct FKey>                           CallFunc_Map_Keys_Keys;                            // 0x0050(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   CallFunc_Array_Get_Item;                           // 0x0068(0x0018)(HasGetValueTypeHash)
	class UDM_Base_C*                             CallFunc_Map_Find_Value;                           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasInputKeyJustPressed_ReturnValue;       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugWidget_C_TryToggleModules) == 0x000008, "Wrong alignment on WBP_DebugWidget_C_TryToggleModules");
static_assert(sizeof(WBP_DebugWidget_C_TryToggleModules) == 0x0000A8, "Wrong size on WBP_DebugWidget_C_TryToggleModules");
static_assert(offsetof(WBP_DebugWidget_C_TryToggleModules, Modules) == 0x000000, "Member 'WBP_DebugWidget_C_TryToggleModules::Modules' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_TryToggleModules, CallFunc_Map_Keys_Keys) == 0x000050, "Member 'WBP_DebugWidget_C_TryToggleModules::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_TryToggleModules, Temp_int_Array_Index_Variable) == 0x000060, "Member 'WBP_DebugWidget_C_TryToggleModules::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_TryToggleModules, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'WBP_DebugWidget_C_TryToggleModules::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_TryToggleModules, CallFunc_Array_Get_Item) == 0x000068, "Member 'WBP_DebugWidget_C_TryToggleModules::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_TryToggleModules, CallFunc_Map_Find_Value) == 0x000080, "Member 'WBP_DebugWidget_C_TryToggleModules::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_TryToggleModules, CallFunc_Map_Find_ReturnValue) == 0x000088, "Member 'WBP_DebugWidget_C_TryToggleModules::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_TryToggleModules, Temp_int_Loop_Counter_Variable) == 0x00008C, "Member 'WBP_DebugWidget_C_TryToggleModules::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_TryToggleModules, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'WBP_DebugWidget_C_TryToggleModules::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_TryToggleModules, CallFunc_Add_IntInt_ReturnValue) == 0x000094, "Member 'WBP_DebugWidget_C_TryToggleModules::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_TryToggleModules, CallFunc_GetPlayerController_ReturnValue) == 0x000098, "Member 'WBP_DebugWidget_C_TryToggleModules::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugWidget_C_TryToggleModules, CallFunc_WasInputKeyJustPressed_ReturnValue) == 0x0000A0, "Member 'WBP_DebugWidget_C_TryToggleModules::CallFunc_WasInputKeyJustPressed_ReturnValue' has a wrong offset!");

}

