#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Minimap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Minimap.WBP_Minimap_C
// 0x0028 (0x0648 - 0x0620)
class UWBP_Minimap_C final : public UUserWidgetMinimap
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0620(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URefreshableRichTextBlock*              ChangeDisplayModeInput;                            // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MainHolder;                                        // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           NoDataHolder;                                      // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Minimap(int32 EntryPoint);
	void OnRefreshMinimap();
	void ToggleFullScreen();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Minimap_C">();
	}
	static class UWBP_Minimap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Minimap_C>();
	}
};
static_assert(alignof(UWBP_Minimap_C) == 0x000008, "Wrong alignment on UWBP_Minimap_C");
static_assert(sizeof(UWBP_Minimap_C) == 0x000648, "Wrong size on UWBP_Minimap_C");
static_assert(offsetof(UWBP_Minimap_C, UberGraphFrame) == 0x000620, "Member 'UWBP_Minimap_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Minimap_C, ChangeDisplayModeInput) == 0x000628, "Member 'UWBP_Minimap_C::ChangeDisplayModeInput' has a wrong offset!");
static_assert(offsetof(UWBP_Minimap_C, MainHolder) == 0x000630, "Member 'UWBP_Minimap_C::MainHolder' has a wrong offset!");
static_assert(offsetof(UWBP_Minimap_C, NoDataHolder) == 0x000638, "Member 'UWBP_Minimap_C::NoDataHolder' has a wrong offset!");
static_assert(offsetof(UWBP_Minimap_C, WidgetSwitcher) == 0x000640, "Member 'UWBP_Minimap_C::WidgetSwitcher' has a wrong offset!");

}

