#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Dialog_YesNo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Dialog_YesNo.WBP_Dialog_YesNo_C
// 0x0030 (0x04E0 - 0x04B0)
class UWBP_Dialog_YesNo_C final : public UUserWidgetDialogYesNo
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideAnim;                                          // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_Button_Generic_C*                  WBP_Button_Generic_NO;                             // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Generic_C*                  WBP_Button_Generic_YES;                            // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Dialog_C*                          WBP_Dialog;                                        // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Dialog_YesNo_WBP_Button_Generic_NO_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void BndEvt__WBP_Dialog_YesNo_WBP_Button_Generic_YES_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void Construct();
	void ExecuteUbergraph_WBP_Dialog_YesNo(int32 EntryPoint);
	void OnFinish_72C7DC1544F90D6FD9C21884236CC3B7();
	void OnFinish_72C7DC1544F90D6FD9C2188455F6B577();
	void OnFinish_72C7DC1544F90D6FD9C21884EF580793();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Dialog_YesNo_C">();
	}
	static class UWBP_Dialog_YesNo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Dialog_YesNo_C>();
	}
};
static_assert(alignof(UWBP_Dialog_YesNo_C) == 0x000008, "Wrong alignment on UWBP_Dialog_YesNo_C");
static_assert(sizeof(UWBP_Dialog_YesNo_C) == 0x0004E0, "Wrong size on UWBP_Dialog_YesNo_C");
static_assert(offsetof(UWBP_Dialog_YesNo_C, UberGraphFrame) == 0x0004B0, "Member 'UWBP_Dialog_YesNo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_YesNo_C, HideAnim) == 0x0004B8, "Member 'UWBP_Dialog_YesNo_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_YesNo_C, ShowAnim) == 0x0004C0, "Member 'UWBP_Dialog_YesNo_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_YesNo_C, WBP_Button_Generic_NO) == 0x0004C8, "Member 'UWBP_Dialog_YesNo_C::WBP_Button_Generic_NO' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_YesNo_C, WBP_Button_Generic_YES) == 0x0004D0, "Member 'UWBP_Dialog_YesNo_C::WBP_Button_Generic_YES' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_YesNo_C, WBP_Dialog) == 0x0004D8, "Member 'UWBP_Dialog_YesNo_C::WBP_Dialog' has a wrong offset!");

}

