#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Extra_Page_Gallery

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Zion_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Extra_Page_Gallery.WBP_Extra_Page_Gallery_C.BuyAllRemainingItems
// 0x02B0 (0x02B0 - 0x0000)
struct WBP_Extra_Page_Gallery_C_BuyAllRemainingItems final
{
public:
	int32                                         Cost;                                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BuyCount;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Dialog_YesNo_C*                    CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Dialog_OK_C*                       CallFunc_Create_ReturnValue_1;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAllRemainingItemsCountAndCost_OutBuyCount; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAllRemainingItemsCountAndCost_OutCost; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0080(0x0048)(HasGetValueTypeHash)
	struct FCurrencyValue                         K2Node_MakeStruct_CurrencyValue;                   // 0x00C8(0x0008)(NoDestructor)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_2;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00E0(0x0048)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_3;            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0130(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0140(0x0048)(HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_1;                              // 0x0188(0x0010)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0198(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_2;                              // 0x01A8(0x0010)()
	ECurrencyType                                 Temp_byte_Variable;                                // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x01C8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x01D8(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_CanSpendCurrency_ReturnValue;             // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0228(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0238(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0248(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0290(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x02A0(0x0010)()
};
static_assert(alignof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems) == 0x000008, "Wrong alignment on WBP_Extra_Page_Gallery_C_BuyAllRemainingItems");
static_assert(sizeof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems) == 0x0002B0, "Wrong size on WBP_Extra_Page_Gallery_C_BuyAllRemainingItems");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems, Cost) == 0x000000, "Member 'WBP_Extra_Page_Gallery_C_BuyAllRemainingItems::Cost' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems, BuyCount) == 0x000004, "Member 'WBP_Extra_Page_Gallery_C_BuyAllRemainingItems::BuyCount' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_Extra_Page_Gallery_C_BuyAllRemainingItems::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems, CallFunc_Create_ReturnValue_1) == 0x000010, "Member 'WBP_Extra_Page_Gallery_C_BuyAllRemainingItems::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems, CallFunc_MakeLiteralByte_ReturnValue) == 0x000018, "Member 'WBP_Extra_Page_Gallery_C_BuyAllRemainingItems::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems, CallFunc_GetAllRemainingItemsCountAndCost_OutBuyCount) == 0x00001C, "Member 'WBP_Extra_Page_Gallery_C_BuyAllRemainingItems::CallFunc_GetAllRemainingItemsCountAndCost_OutBuyCount' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems, CallFunc_GetAllRemainingItemsCountAndCost_OutCost) == 0x000020, "Member 'WBP_Extra_Page_Gallery_C_BuyAllRemainingItems::CallFunc_GetAllRemainingItemsCountAndCost_OutCost' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000028, "Member 'WBP_Extra_Page_Gallery_C_BuyAllRemainingItems::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000030, "Member 'WBP_Extra_Page_Gallery_C_BuyAllRemainingItems::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'WBP_Extra_Page_Gallery_C_BuyAllRemainingItems::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems, K2Node_MakeStruct_FormatArgumentData_1) == 0x000080, "Member 'WBP_Extra_Page_Gallery_C_BuyAllRemainingItems::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems, K2Node_MakeStruct_CurrencyValue) == 0x0000C8, "Member 'WBP_Extra_Page_Gallery_C_BuyAllRemainingItems::K2Node_MakeStruct_CurrencyValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems, CallFunc_Conv_IntToInt64_ReturnValue_2) == 0x0000D0, "Member 'WBP_Extra_Page_Gallery_C_BuyAllRemainingItems::CallFunc_Conv_IntToInt64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems, CallFunc_Greater_IntInt_ReturnValue) == 0x0000D8, "Member 'WBP_Extra_Page_Gallery_C_BuyAllRemainingItems::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000E0, "Member 'WBP_Extra_Page_Gallery_C_BuyAllRemainingItems::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems, CallFunc_Conv_IntToInt64_ReturnValue_3) == 0x000128, "Member 'WBP_Extra_Page_Gallery_C_BuyAllRemainingItems::CallFunc_Conv_IntToInt64_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems, Temp_text_Variable) == 0x000130, "Member 'WBP_Extra_Page_Gallery_C_BuyAllRemainingItems::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems, K2Node_MakeStruct_FormatArgumentData_3) == 0x000140, "Member 'WBP_Extra_Page_Gallery_C_BuyAllRemainingItems::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems, Temp_text_Variable_1) == 0x000188, "Member 'WBP_Extra_Page_Gallery_C_BuyAllRemainingItems::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems, K2Node_CreateDelegate_OutputDelegate) == 0x000198, "Member 'WBP_Extra_Page_Gallery_C_BuyAllRemainingItems::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems, Temp_text_Variable_2) == 0x0001A8, "Member 'WBP_Extra_Page_Gallery_C_BuyAllRemainingItems::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems, Temp_byte_Variable) == 0x0001B8, "Member 'WBP_Extra_Page_Gallery_C_BuyAllRemainingItems::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems, CallFunc_Get_ReturnValue) == 0x0001C0, "Member 'WBP_Extra_Page_Gallery_C_BuyAllRemainingItems::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems, K2Node_Select_Default) == 0x0001C8, "Member 'WBP_Extra_Page_Gallery_C_BuyAllRemainingItems::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems, K2Node_MakeStruct_FormatArgumentData_4) == 0x0001D8, "Member 'WBP_Extra_Page_Gallery_C_BuyAllRemainingItems::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems, CallFunc_CanSpendCurrency_ReturnValue) == 0x000220, "Member 'WBP_Extra_Page_Gallery_C_BuyAllRemainingItems::CallFunc_CanSpendCurrency_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems, K2Node_MakeArray_Array) == 0x000228, "Member 'WBP_Extra_Page_Gallery_C_BuyAllRemainingItems::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems, CallFunc_Format_ReturnValue) == 0x000238, "Member 'WBP_Extra_Page_Gallery_C_BuyAllRemainingItems::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems, K2Node_MakeStruct_FormatArgumentData_5) == 0x000248, "Member 'WBP_Extra_Page_Gallery_C_BuyAllRemainingItems::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems, K2Node_MakeArray_Array_1) == 0x000290, "Member 'WBP_Extra_Page_Gallery_C_BuyAllRemainingItems::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyAllRemainingItems, CallFunc_Format_ReturnValue_1) == 0x0002A0, "Member 'WBP_Extra_Page_Gallery_C_BuyAllRemainingItems::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function WBP_Extra_Page_Gallery.WBP_Extra_Page_Gallery_C.BuyGalleryEntryData
// 0x0030 (0x0030 - 0x0000)
struct WBP_Extra_Page_Gallery_C_BuyGalleryEntryData final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    CallFunc_GetDataHandle_DataHandle;                 // 0x0008(0x0010)(NoDestructor)
	struct FCurrencyValue                         CallFunc_GetCurrencyValue_CurrencyValue;           // 0x0018(0x0008)(NoDestructor)
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SpendCurrency_ReturnValue;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddItem_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Page_Gallery_C_BuyGalleryEntryData) == 0x000008, "Wrong alignment on WBP_Extra_Page_Gallery_C_BuyGalleryEntryData");
static_assert(sizeof(WBP_Extra_Page_Gallery_C_BuyGalleryEntryData) == 0x000030, "Wrong size on WBP_Extra_Page_Gallery_C_BuyGalleryEntryData");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyGalleryEntryData, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_Extra_Page_Gallery_C_BuyGalleryEntryData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyGalleryEntryData, CallFunc_GetDataHandle_DataHandle) == 0x000008, "Member 'WBP_Extra_Page_Gallery_C_BuyGalleryEntryData::CallFunc_GetDataHandle_DataHandle' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyGalleryEntryData, CallFunc_GetCurrencyValue_CurrencyValue) == 0x000018, "Member 'WBP_Extra_Page_Gallery_C_BuyGalleryEntryData::CallFunc_GetCurrencyValue_CurrencyValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyGalleryEntryData, CallFunc_Get_ReturnValue) == 0x000020, "Member 'WBP_Extra_Page_Gallery_C_BuyGalleryEntryData::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyGalleryEntryData, CallFunc_SpendCurrency_ReturnValue) == 0x000028, "Member 'WBP_Extra_Page_Gallery_C_BuyGalleryEntryData::CallFunc_SpendCurrency_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_BuyGalleryEntryData, CallFunc_AddItem_ReturnValue) == 0x00002C, "Member 'WBP_Extra_Page_Gallery_C_BuyGalleryEntryData::CallFunc_AddItem_ReturnValue' has a wrong offset!");

// Function WBP_Extra_Page_Gallery.WBP_Extra_Page_Gallery_C.ExecuteUbergraph_WBP_Extra_Page_Gallery
// 0x0310 (0x0310 - 0x0000)
struct WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Extra_Gallery_Entry_C*             K2Node_CustomEvent_GalleryEntry_1;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Extra_Gallery_Entry_C*             K2Node_CustomEvent_GalleryEntry;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FInventoryItemGalleryData              CallFunc_GetItemGalleryData_out_ItemData;          // 0x0018(0x01E0)()
	bool                                          CallFunc_GetItemGalleryData_ReturnValue;           // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetImageName_Name;                        // 0x0200(0x0010)()
	int32                                         CallFunc_GetCost_Cost;                             // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGalleryDataAlreadyBought_IsAlreadyBought; // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetUMGZOrder_ReturnValue;                 // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x021C(0x0008)(NoDestructor)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_Extra_Gallery_Entry_C*>     CallFunc_GetAllBoughtEntries_BoughtEntries;        // 0x0228(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0238(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x024C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0260(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0274(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0288(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0298(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x02A8(0x0010)(ConstParm)
	class UWBP_Dialog_OK_C*                       CallFunc_Create_ReturnValue;                       // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Extra_Gallery_Entry_C*             CallFunc_Array_Get_Item;                           // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    CallFunc_GetDataHandle_DataHandle;                 // 0x02D8(0x0010)(NoDestructor)
	struct FCurrencyValue                         CallFunc_GetCurrencyValue_CurrencyValue;           // 0x02E8(0x0008)(NoDestructor)
	bool                                          CallFunc_AddItem_ReturnValue;                      // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SpendCurrency_ReturnValue;                // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGalleryDataAlreadyBought_IsAlreadyBought_1; // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FB[0x1];                                      // 0x02FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Extra_Dialog_GalleryImage_C*       CallFunc_Create_ReturnValue_1;                     // 0x0308(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery) == 0x000008, "Wrong alignment on WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery");
static_assert(sizeof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery) == 0x000310, "Wrong size on WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, EntryPoint) == 0x000000, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, K2Node_CustomEvent_GalleryEntry_1) == 0x000008, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::K2Node_CustomEvent_GalleryEntry_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, K2Node_CustomEvent_GalleryEntry) == 0x000010, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::K2Node_CustomEvent_GalleryEntry' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, CallFunc_GetItemGalleryData_out_ItemData) == 0x000018, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::CallFunc_GetItemGalleryData_out_ItemData' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, CallFunc_GetItemGalleryData_ReturnValue) == 0x0001F8, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::CallFunc_GetItemGalleryData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, CallFunc_GetImageName_Name) == 0x000200, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::CallFunc_GetImageName_Name' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, CallFunc_GetCost_Cost) == 0x000210, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::CallFunc_GetCost_Cost' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, CallFunc_IsGalleryDataAlreadyBought_IsAlreadyBought) == 0x000214, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::CallFunc_IsGalleryDataAlreadyBought_IsAlreadyBought' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, CallFunc_GetUMGZOrder_ReturnValue) == 0x000218, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::CallFunc_GetUMGZOrder_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, K2Node_Event_InFocusEvent) == 0x00021C, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, CallFunc_GetAllBoughtEntries_BoughtEntries) == 0x000228, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::CallFunc_GetAllBoughtEntries_BoughtEntries' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, K2Node_CreateDelegate_OutputDelegate) == 0x000238, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, CallFunc_Array_Length_ReturnValue) == 0x000248, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, K2Node_CreateDelegate_OutputDelegate_1) == 0x00024C, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, CallFunc_Greater_IntInt_ReturnValue) == 0x00025C, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, K2Node_CreateDelegate_OutputDelegate_2) == 0x000260, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, Temp_int_Loop_Counter_Variable) == 0x000270, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, K2Node_CreateDelegate_OutputDelegate_3) == 0x000274, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, CallFunc_Add_IntInt_ReturnValue) == 0x000284, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, K2Node_CreateDelegate_OutputDelegate_4) == 0x000288, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, K2Node_CreateDelegate_OutputDelegate_5) == 0x000298, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, Temp_text_Variable) == 0x0002A8, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, CallFunc_Create_ReturnValue) == 0x0002B8, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, CallFunc_Get_ReturnValue) == 0x0002C0, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, CallFunc_IsValid_ReturnValue) == 0x0002C8, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, CallFunc_Array_Get_Item) == 0x0002D0, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, CallFunc_GetDataHandle_DataHandle) == 0x0002D8, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::CallFunc_GetDataHandle_DataHandle' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, CallFunc_GetCurrencyValue_CurrencyValue) == 0x0002E8, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::CallFunc_GetCurrencyValue_CurrencyValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, CallFunc_AddItem_ReturnValue) == 0x0002F0, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::CallFunc_AddItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, CallFunc_SpendCurrency_ReturnValue) == 0x0002F4, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::CallFunc_SpendCurrency_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, CallFunc_IsGalleryDataAlreadyBought_IsAlreadyBought_1) == 0x0002F8, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::CallFunc_IsGalleryDataAlreadyBought_IsAlreadyBought_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, CallFunc_Not_PreBool_ReturnValue) == 0x0002F9, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, CallFunc_BooleanAND_ReturnValue) == 0x0002FA, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, CallFunc_Array_Length_ReturnValue_1) == 0x0002FC, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, CallFunc_Less_IntInt_ReturnValue) == 0x000300, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery, CallFunc_Create_ReturnValue_1) == 0x000308, "Member 'WBP_Extra_Page_Gallery_C_ExecuteUbergraph_WBP_Extra_Page_Gallery::CallFunc_Create_ReturnValue_1' has a wrong offset!");

// Function WBP_Extra_Page_Gallery.WBP_Extra_Page_Gallery_C.GenerateEntries
// 0x0090 (0x0090 - 0x0000)
struct WBP_Extra_Page_Gallery_C_GenerateEntries final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_Extra_Gallery_Entry_C* GalleryEntry)> K2Node_CreateDelegate_OutputDelegate; // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_Extra_Gallery_Entry_C* GalleryEntry)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Extra_Gallery_Entry_C*             CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeZion*                          CallFunc_Get_ReturnValue_1;                        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             CallFunc_GetDataTableItemGallery_ReturnValue;      // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0058(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0078(0x0010)(NoDestructor)
	bool                                          CallFunc_HasItem_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemGalleryVisible_ReturnValue;         // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Page_Gallery_C_GenerateEntries) == 0x000008, "Wrong alignment on WBP_Extra_Page_Gallery_C_GenerateEntries");
static_assert(sizeof(WBP_Extra_Page_Gallery_C_GenerateEntries) == 0x000090, "Wrong size on WBP_Extra_Page_Gallery_C_GenerateEntries");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GenerateEntries, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_Extra_Page_Gallery_C_GenerateEntries::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GenerateEntries, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Extra_Page_Gallery_C_GenerateEntries::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GenerateEntries, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Extra_Page_Gallery_C_GenerateEntries::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GenerateEntries, CallFunc_Get_ReturnValue) == 0x000010, "Member 'WBP_Extra_Page_Gallery_C_GenerateEntries::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GenerateEntries, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_Extra_Page_Gallery_C_GenerateEntries::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GenerateEntries, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'WBP_Extra_Page_Gallery_C_GenerateEntries::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GenerateEntries, CallFunc_Create_ReturnValue) == 0x000038, "Member 'WBP_Extra_Page_Gallery_C_GenerateEntries::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GenerateEntries, CallFunc_Array_AddUnique_ReturnValue) == 0x000040, "Member 'WBP_Extra_Page_Gallery_C_GenerateEntries::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GenerateEntries, CallFunc_Get_ReturnValue_1) == 0x000048, "Member 'WBP_Extra_Page_Gallery_C_GenerateEntries::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GenerateEntries, CallFunc_GetDataTableItemGallery_ReturnValue) == 0x000050, "Member 'WBP_Extra_Page_Gallery_C_GenerateEntries::CallFunc_GetDataTableItemGallery_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GenerateEntries, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000058, "Member 'WBP_Extra_Page_Gallery_C_GenerateEntries::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GenerateEntries, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'WBP_Extra_Page_Gallery_C_GenerateEntries::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GenerateEntries, CallFunc_Array_Get_Item) == 0x00006C, "Member 'WBP_Extra_Page_Gallery_C_GenerateEntries::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GenerateEntries, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'WBP_Extra_Page_Gallery_C_GenerateEntries::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GenerateEntries, K2Node_MakeStruct_DataTableRowHandle) == 0x000078, "Member 'WBP_Extra_Page_Gallery_C_GenerateEntries::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GenerateEntries, CallFunc_HasItem_ReturnValue) == 0x000088, "Member 'WBP_Extra_Page_Gallery_C_GenerateEntries::CallFunc_HasItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GenerateEntries, CallFunc_IsItemGalleryVisible_ReturnValue) == 0x000089, "Member 'WBP_Extra_Page_Gallery_C_GenerateEntries::CallFunc_IsItemGalleryVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GenerateEntries, CallFunc_BooleanOR_ReturnValue) == 0x00008A, "Member 'WBP_Extra_Page_Gallery_C_GenerateEntries::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_Extra_Page_Gallery.WBP_Extra_Page_Gallery_C.GetAllBoughtEntries
// 0x0048 (0x0048 - 0x0000)
struct WBP_Extra_Page_Gallery_C_GetAllBoughtEntries final
{
public:
	TArray<class UWBP_Extra_Gallery_Entry_C*>     BoughtEntries;                                     // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UWBP_Extra_Gallery_Entry_C*>     LocalBoughtEntries;                                // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Extra_Gallery_Entry_C*             CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGalleryDataAlreadyBought_IsAlreadyBought; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Page_Gallery_C_GetAllBoughtEntries) == 0x000008, "Wrong alignment on WBP_Extra_Page_Gallery_C_GetAllBoughtEntries");
static_assert(sizeof(WBP_Extra_Page_Gallery_C_GetAllBoughtEntries) == 0x000048, "Wrong size on WBP_Extra_Page_Gallery_C_GetAllBoughtEntries");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GetAllBoughtEntries, BoughtEntries) == 0x000000, "Member 'WBP_Extra_Page_Gallery_C_GetAllBoughtEntries::BoughtEntries' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GetAllBoughtEntries, LocalBoughtEntries) == 0x000010, "Member 'WBP_Extra_Page_Gallery_C_GetAllBoughtEntries::LocalBoughtEntries' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GetAllBoughtEntries, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WBP_Extra_Page_Gallery_C_GetAllBoughtEntries::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GetAllBoughtEntries, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WBP_Extra_Page_Gallery_C_GetAllBoughtEntries::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GetAllBoughtEntries, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_Extra_Page_Gallery_C_GetAllBoughtEntries::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GetAllBoughtEntries, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'WBP_Extra_Page_Gallery_C_GetAllBoughtEntries::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GetAllBoughtEntries, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_Extra_Page_Gallery_C_GetAllBoughtEntries::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GetAllBoughtEntries, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'WBP_Extra_Page_Gallery_C_GetAllBoughtEntries::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GetAllBoughtEntries, CallFunc_Array_Add_ReturnValue) == 0x00003C, "Member 'WBP_Extra_Page_Gallery_C_GetAllBoughtEntries::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GetAllBoughtEntries, CallFunc_IsGalleryDataAlreadyBought_IsAlreadyBought) == 0x000040, "Member 'WBP_Extra_Page_Gallery_C_GetAllBoughtEntries::CallFunc_IsGalleryDataAlreadyBought_IsAlreadyBought' has a wrong offset!");

// Function WBP_Extra_Page_Gallery.WBP_Extra_Page_Gallery_C.GetAllRemainingItemsCountAndCost
// 0x0048 (0x0048 - 0x0000)
struct WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost final
{
public:
	int32                                         OutBuyCount;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OutCost;                                           // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Cost;                                              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BuyCount;                                          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Extra_Gallery_Entry_C*             CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCost_Cost;                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGalleryDataAlreadyBought_IsAlreadyBought; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost) == 0x000008, "Wrong alignment on WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost");
static_assert(sizeof(WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost) == 0x000048, "Wrong size on WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost, OutBuyCount) == 0x000000, "Member 'WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost::OutBuyCount' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost, OutCost) == 0x000004, "Member 'WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost::OutCost' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost, Cost) == 0x000008, "Member 'WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost::Cost' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost, BuyCount) == 0x00000C, "Member 'WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost::BuyCount' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost, Temp_int_Variable) == 0x000020, "Member 'WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost, CallFunc_GetCost_Cost) == 0x000034, "Member 'WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost::CallFunc_GetCost_Cost' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost, CallFunc_Add_IntInt_ReturnValue_2) == 0x00003C, "Member 'WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost, CallFunc_IsGalleryDataAlreadyBought_IsAlreadyBought) == 0x000040, "Member 'WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost::CallFunc_IsGalleryDataAlreadyBought_IsAlreadyBought' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost, CallFunc_Not_PreBool_ReturnValue) == 0x000041, "Member 'WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost, CallFunc_BooleanAND_ReturnValue) == 0x000042, "Member 'WBP_Extra_Page_Gallery_C_GetAllRemainingItemsCountAndCost::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_Extra_Page_Gallery.WBP_Extra_Page_Gallery_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_Extra_Page_Gallery_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Extra_Page_Gallery_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on WBP_Extra_Page_Gallery_C_OnAddedToFocusPath");
static_assert(sizeof(WBP_Extra_Page_Gallery_C_OnAddedToFocusPath) == 0x000008, "Wrong size on WBP_Extra_Page_Gallery_C_OnAddedToFocusPath");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_Extra_Page_Gallery_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_Extra_Page_Gallery.WBP_Extra_Page_Gallery_C.OnEntryFocused
// 0x0008 (0x0008 - 0x0000)
struct WBP_Extra_Page_Gallery_C_OnEntryFocused final
{
public:
	class UWBP_Extra_Gallery_Entry_C*             GalleryEntry;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Page_Gallery_C_OnEntryFocused) == 0x000008, "Wrong alignment on WBP_Extra_Page_Gallery_C_OnEntryFocused");
static_assert(sizeof(WBP_Extra_Page_Gallery_C_OnEntryFocused) == 0x000008, "Wrong size on WBP_Extra_Page_Gallery_C_OnEntryFocused");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_OnEntryFocused, GalleryEntry) == 0x000000, "Member 'WBP_Extra_Page_Gallery_C_OnEntryFocused::GalleryEntry' has a wrong offset!");

// Function WBP_Extra_Page_Gallery.WBP_Extra_Page_Gallery_C.OnEntryPressed
// 0x0008 (0x0008 - 0x0000)
struct WBP_Extra_Page_Gallery_C_OnEntryPressed final
{
public:
	class UWBP_Extra_Gallery_Entry_C*             GalleryEntry;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Page_Gallery_C_OnEntryPressed) == 0x000008, "Wrong alignment on WBP_Extra_Page_Gallery_C_OnEntryPressed");
static_assert(sizeof(WBP_Extra_Page_Gallery_C_OnEntryPressed) == 0x000008, "Wrong size on WBP_Extra_Page_Gallery_C_OnEntryPressed");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_OnEntryPressed, GalleryEntry) == 0x000000, "Member 'WBP_Extra_Page_Gallery_C_OnEntryPressed::GalleryEntry' has a wrong offset!");

// Function WBP_Extra_Page_Gallery.WBP_Extra_Page_Gallery_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_Extra_Page_Gallery_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Page_Gallery_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Extra_Page_Gallery_C_OnFocusReceived");
static_assert(sizeof(WBP_Extra_Page_Gallery_C_OnFocusReceived) == 0x0001B8, "Wrong size on WBP_Extra_Page_Gallery_C_OnFocusReceived");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Extra_Page_Gallery_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Extra_Page_Gallery_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Page_Gallery_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Extra_Page_Gallery_C_OnFocusReceived::ReturnValue' has a wrong offset!");
