#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugMenu_Element_FocusDisplay

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_DebugMenu_Element_FocusDisplay.WBP_DebugMenu_Element_FocusDisplay_C.SetFocusDisplay
// 0x0005 (0x0005 - 0x0000)
struct WBP_DebugMenu_Element_FocusDisplay_C_SetFocusDisplay final
{
public:
	bool                                          Focused;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Element_FocusDisplay_C_SetFocusDisplay) == 0x000001, "Wrong alignment on WBP_DebugMenu_Element_FocusDisplay_C_SetFocusDisplay");
static_assert(sizeof(WBP_DebugMenu_Element_FocusDisplay_C_SetFocusDisplay) == 0x000005, "Wrong size on WBP_DebugMenu_Element_FocusDisplay_C_SetFocusDisplay");
static_assert(offsetof(WBP_DebugMenu_Element_FocusDisplay_C_SetFocusDisplay, Focused) == 0x000000, "Member 'WBP_DebugMenu_Element_FocusDisplay_C_SetFocusDisplay::Focused' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_FocusDisplay_C_SetFocusDisplay, Temp_byte_Variable) == 0x000001, "Member 'WBP_DebugMenu_Element_FocusDisplay_C_SetFocusDisplay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_FocusDisplay_C_SetFocusDisplay, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_DebugMenu_Element_FocusDisplay_C_SetFocusDisplay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_FocusDisplay_C_SetFocusDisplay, Temp_bool_Variable) == 0x000003, "Member 'WBP_DebugMenu_Element_FocusDisplay_C_SetFocusDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_FocusDisplay_C_SetFocusDisplay, K2Node_Select_Default) == 0x000004, "Member 'WBP_DebugMenu_Element_FocusDisplay_C_SetFocusDisplay::K2Node_Select_Default' has a wrong offset!");

// Function WBP_DebugMenu_Element_FocusDisplay.WBP_DebugMenu_Element_FocusDisplay_C.ExecuteUbergraph_WBP_DebugMenu_Element_FocusDisplay
// 0x0004 (0x0004 - 0x0000)
struct WBP_DebugMenu_Element_FocusDisplay_C_ExecuteUbergraph_WBP_DebugMenu_Element_FocusDisplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Element_FocusDisplay_C_ExecuteUbergraph_WBP_DebugMenu_Element_FocusDisplay) == 0x000004, "Wrong alignment on WBP_DebugMenu_Element_FocusDisplay_C_ExecuteUbergraph_WBP_DebugMenu_Element_FocusDisplay");
static_assert(sizeof(WBP_DebugMenu_Element_FocusDisplay_C_ExecuteUbergraph_WBP_DebugMenu_Element_FocusDisplay) == 0x000004, "Wrong size on WBP_DebugMenu_Element_FocusDisplay_C_ExecuteUbergraph_WBP_DebugMenu_Element_FocusDisplay");
static_assert(offsetof(WBP_DebugMenu_Element_FocusDisplay_C_ExecuteUbergraph_WBP_DebugMenu_Element_FocusDisplay, EntryPoint) == 0x000000, "Member 'WBP_DebugMenu_Element_FocusDisplay_C_ExecuteUbergraph_WBP_DebugMenu_Element_FocusDisplay::EntryPoint' has a wrong offset!");

}

