#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RestPointList_MapAreaName

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_RestPointList_MapAreaName.WBP_RestPointList_MapAreaName_C.SetCompleteState
// 0x0001 (0x0001 - 0x0000)
struct WBP_RestPointList_MapAreaName_C_SetCompleteState final
{
public:
	bool                                          CompleteState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RestPointList_MapAreaName_C_SetCompleteState) == 0x000001, "Wrong alignment on WBP_RestPointList_MapAreaName_C_SetCompleteState");
static_assert(sizeof(WBP_RestPointList_MapAreaName_C_SetCompleteState) == 0x000001, "Wrong size on WBP_RestPointList_MapAreaName_C_SetCompleteState");
static_assert(offsetof(WBP_RestPointList_MapAreaName_C_SetCompleteState, CompleteState) == 0x000000, "Member 'WBP_RestPointList_MapAreaName_C_SetCompleteState::CompleteState' has a wrong offset!");

// Function WBP_RestPointList_MapAreaName.WBP_RestPointList_MapAreaName_C.SetMapAreaName
// 0x0018 (0x0018 - 0x0000)
struct WBP_RestPointList_MapAreaName_C_SetMapAreaName final
{
public:
	class FText                                   MapAreaName_0;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RestPointList_MapAreaName_C_SetMapAreaName) == 0x000008, "Wrong alignment on WBP_RestPointList_MapAreaName_C_SetMapAreaName");
static_assert(sizeof(WBP_RestPointList_MapAreaName_C_SetMapAreaName) == 0x000018, "Wrong size on WBP_RestPointList_MapAreaName_C_SetMapAreaName");
static_assert(offsetof(WBP_RestPointList_MapAreaName_C_SetMapAreaName, MapAreaName_0) == 0x000000, "Member 'WBP_RestPointList_MapAreaName_C_SetMapAreaName::MapAreaName_0' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapAreaName_C_SetMapAreaName, Temp_bool_Variable) == 0x000010, "Member 'WBP_RestPointList_MapAreaName_C_SetMapAreaName::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapAreaName_C_SetMapAreaName, CallFunc_TextIsEmpty_ReturnValue) == 0x000011, "Member 'WBP_RestPointList_MapAreaName_C_SetMapAreaName::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapAreaName_C_SetMapAreaName, Temp_byte_Variable) == 0x000012, "Member 'WBP_RestPointList_MapAreaName_C_SetMapAreaName::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapAreaName_C_SetMapAreaName, Temp_byte_Variable_1) == 0x000013, "Member 'WBP_RestPointList_MapAreaName_C_SetMapAreaName::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapAreaName_C_SetMapAreaName, K2Node_Select_Default) == 0x000014, "Member 'WBP_RestPointList_MapAreaName_C_SetMapAreaName::K2Node_Select_Default' has a wrong offset!");

}

