#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Recollection_BossRush_Timer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Recollection_BossRush_Timer.WBP_Recollection_BossRush_Timer_C
// 0x0048 (0x04A8 - 0x0460)
class UWBP_Recollection_BossRush_Timer_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       StartTimerAnim;                                    // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PauseTimerAnim;                                    // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideAnim;                                          // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel;                                       // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TimerText;                                         // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Recollection_BossRush_BossProgression_C* WBP_Recollection_BossRush_BossProgression;   // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URecollectionBossRushComponent*         BossRushComponent;                                 // 0x04A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void SetCurrentBossIndex(int32 Index_0);
	void RefreshVisibility();
	void RefreshTimerText();
	void PauseTimer(bool bPaused);
	void OnDisplayPlayerUIChanged();
	void ExecuteUbergraph_WBP_Recollection_BossRush_Timer(int32 EntryPoint);
	void Destruct();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Recollection_BossRush_Timer_C">();
	}
	static class UWBP_Recollection_BossRush_Timer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Recollection_BossRush_Timer_C>();
	}
};
static_assert(alignof(UWBP_Recollection_BossRush_Timer_C) == 0x000008, "Wrong alignment on UWBP_Recollection_BossRush_Timer_C");
static_assert(sizeof(UWBP_Recollection_BossRush_Timer_C) == 0x0004A8, "Wrong size on UWBP_Recollection_BossRush_Timer_C");
static_assert(offsetof(UWBP_Recollection_BossRush_Timer_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Recollection_BossRush_Timer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_Timer_C, StartTimerAnim) == 0x000468, "Member 'UWBP_Recollection_BossRush_Timer_C::StartTimerAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_Timer_C, PauseTimerAnim) == 0x000470, "Member 'UWBP_Recollection_BossRush_Timer_C::PauseTimerAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_Timer_C, HideAnim) == 0x000478, "Member 'UWBP_Recollection_BossRush_Timer_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_Timer_C, ShowAnim) == 0x000480, "Member 'UWBP_Recollection_BossRush_Timer_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_Timer_C, CanvasPanel) == 0x000488, "Member 'UWBP_Recollection_BossRush_Timer_C::CanvasPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_Timer_C, TimerText) == 0x000490, "Member 'UWBP_Recollection_BossRush_Timer_C::TimerText' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_Timer_C, WBP_Recollection_BossRush_BossProgression) == 0x000498, "Member 'UWBP_Recollection_BossRush_Timer_C::WBP_Recollection_BossRush_BossProgression' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_Timer_C, BossRushComponent) == 0x0004A0, "Member 'UWBP_Recollection_BossRush_Timer_C::BossRushComponent' has a wrong offset!");

}

