#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MapIconDetails_RestPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MapIconDetails_RestPoint.WBP_MapIconDetails_RestPoint_C
// 0x0070 (0x04E0 - 0x0470)
class UWBP_MapIconDetails_RestPoint_C final : public UUserWidgetMapIconDetails
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideAnim;                                          // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ButtonBG;                                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URefreshableRichTextBlock*              FastTravel_Text;                                   // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URefreshableRichTextBlock*              FastTravel_Unavailable_Text;                       // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_1;                                         // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_FastTravel;                                // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RestPointName;                                     // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RestpointThumb;                                    // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const struct FMapRestPointData& MapRestPointData)> OnRequestFastTravel; // 0x04C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IgnoreCanFastTravelCheck;                          // 0x04D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowed;                                           // 0x04D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void CanFastTravel(bool* CanFastTravel_0);
	void Construct();
	void ExecuteUbergraph_WBP_MapIconDetails_RestPoint(int32 EntryPoint);
	void OnFinish_62ADF4714227018B5CF2B9AED9E7AE61();
	void OnFinish_E2B585F54F7C767FFF6D0FA937C0B766();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnPressConfirm(const struct FKeyEvent& KeyEvent);
	void OnPressFastTravel();
	void OnRemoveIconDetails(bool bInstant);
	void Refresh_Fast_Travel_Button();
	void RefreshWidgetDetails();
	void SetIgnoreCanFastTravelCheck(bool IgnoreCanFastTravelCheck_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MapIconDetails_RestPoint_C">();
	}
	static class UWBP_MapIconDetails_RestPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MapIconDetails_RestPoint_C>();
	}
};
static_assert(alignof(UWBP_MapIconDetails_RestPoint_C) == 0x000008, "Wrong alignment on UWBP_MapIconDetails_RestPoint_C");
static_assert(sizeof(UWBP_MapIconDetails_RestPoint_C) == 0x0004E0, "Wrong size on UWBP_MapIconDetails_RestPoint_C");
static_assert(offsetof(UWBP_MapIconDetails_RestPoint_C, UberGraphFrame) == 0x000470, "Member 'UWBP_MapIconDetails_RestPoint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_RestPoint_C, HideAnim) == 0x000478, "Member 'UWBP_MapIconDetails_RestPoint_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_RestPoint_C, ShowAnim) == 0x000480, "Member 'UWBP_MapIconDetails_RestPoint_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_RestPoint_C, ButtonBG) == 0x000488, "Member 'UWBP_MapIconDetails_RestPoint_C::ButtonBG' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_RestPoint_C, FastTravel_Text) == 0x000490, "Member 'UWBP_MapIconDetails_RestPoint_C::FastTravel_Text' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_RestPoint_C, FastTravel_Unavailable_Text) == 0x000498, "Member 'UWBP_MapIconDetails_RestPoint_C::FastTravel_Unavailable_Text' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_RestPoint_C, Overlay_1) == 0x0004A0, "Member 'UWBP_MapIconDetails_RestPoint_C::Overlay_1' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_RestPoint_C, Overlay_FastTravel) == 0x0004A8, "Member 'UWBP_MapIconDetails_RestPoint_C::Overlay_FastTravel' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_RestPoint_C, RestPointName) == 0x0004B0, "Member 'UWBP_MapIconDetails_RestPoint_C::RestPointName' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_RestPoint_C, RestpointThumb) == 0x0004B8, "Member 'UWBP_MapIconDetails_RestPoint_C::RestpointThumb' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_RestPoint_C, WidgetSwitcher) == 0x0004C0, "Member 'UWBP_MapIconDetails_RestPoint_C::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_RestPoint_C, OnRequestFastTravel) == 0x0004C8, "Member 'UWBP_MapIconDetails_RestPoint_C::OnRequestFastTravel' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_RestPoint_C, IgnoreCanFastTravelCheck) == 0x0004D8, "Member 'UWBP_MapIconDetails_RestPoint_C::IgnoreCanFastTravelCheck' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_RestPoint_C, bShowed) == 0x0004D9, "Member 'UWBP_MapIconDetails_RestPoint_C::bShowed' has a wrong offset!");

}

