#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MapAreaName

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_MapAreaName.WBP_MapAreaName_C.EnableMapChangeRickTextInputs
// 0x0005 (0x0005 - 0x0000)
struct WBP_MapAreaName_C_EnableMapChangeRickTextInputs final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapAreaName_C_EnableMapChangeRickTextInputs) == 0x000001, "Wrong alignment on WBP_MapAreaName_C_EnableMapChangeRickTextInputs");
static_assert(sizeof(WBP_MapAreaName_C_EnableMapChangeRickTextInputs) == 0x000005, "Wrong size on WBP_MapAreaName_C_EnableMapChangeRickTextInputs");
static_assert(offsetof(WBP_MapAreaName_C_EnableMapChangeRickTextInputs, bEnabled) == 0x000000, "Member 'WBP_MapAreaName_C_EnableMapChangeRickTextInputs::bEnabled' has a wrong offset!");
static_assert(offsetof(WBP_MapAreaName_C_EnableMapChangeRickTextInputs, Temp_bool_Variable) == 0x000001, "Member 'WBP_MapAreaName_C_EnableMapChangeRickTextInputs::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MapAreaName_C_EnableMapChangeRickTextInputs, Temp_byte_Variable) == 0x000002, "Member 'WBP_MapAreaName_C_EnableMapChangeRickTextInputs::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MapAreaName_C_EnableMapChangeRickTextInputs, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_MapAreaName_C_EnableMapChangeRickTextInputs::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MapAreaName_C_EnableMapChangeRickTextInputs, K2Node_Select_Default) == 0x000004, "Member 'WBP_MapAreaName_C_EnableMapChangeRickTextInputs::K2Node_Select_Default' has a wrong offset!");

// Function WBP_MapAreaName.WBP_MapAreaName_C.SetCompleted
// 0x0001 (0x0001 - 0x0000)
struct WBP_MapAreaName_C_SetCompleted final
{
public:
	bool                                          Completed;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapAreaName_C_SetCompleted) == 0x000001, "Wrong alignment on WBP_MapAreaName_C_SetCompleted");
static_assert(sizeof(WBP_MapAreaName_C_SetCompleted) == 0x000001, "Wrong size on WBP_MapAreaName_C_SetCompleted");
static_assert(offsetof(WBP_MapAreaName_C_SetCompleted, Completed) == 0x000000, "Member 'WBP_MapAreaName_C_SetCompleted::Completed' has a wrong offset!");

// Function WBP_MapAreaName.WBP_MapAreaName_C.SetCompletionPercentage
// 0x0008 (0x0008 - 0x0000)
struct WBP_MapAreaName_C_SetCompletionPercentage final
{
public:
	int32                                         CompletionPercentage;                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapAreaName_C_SetCompletionPercentage) == 0x000004, "Wrong alignment on WBP_MapAreaName_C_SetCompletionPercentage");
static_assert(sizeof(WBP_MapAreaName_C_SetCompletionPercentage) == 0x000008, "Wrong size on WBP_MapAreaName_C_SetCompletionPercentage");
static_assert(offsetof(WBP_MapAreaName_C_SetCompletionPercentage, CompletionPercentage) == 0x000000, "Member 'WBP_MapAreaName_C_SetCompletionPercentage::CompletionPercentage' has a wrong offset!");
static_assert(offsetof(WBP_MapAreaName_C_SetCompletionPercentage, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000004, "Member 'WBP_MapAreaName_C_SetCompletionPercentage::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_MapAreaName.WBP_MapAreaName_C.SetMapAreaName
// 0x0018 (0x0018 - 0x0000)
struct WBP_MapAreaName_C_SetMapAreaName final
{
public:
	class FText                                   MapAreaName_0;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapAreaName_C_SetMapAreaName) == 0x000008, "Wrong alignment on WBP_MapAreaName_C_SetMapAreaName");
static_assert(sizeof(WBP_MapAreaName_C_SetMapAreaName) == 0x000018, "Wrong size on WBP_MapAreaName_C_SetMapAreaName");
static_assert(offsetof(WBP_MapAreaName_C_SetMapAreaName, MapAreaName_0) == 0x000000, "Member 'WBP_MapAreaName_C_SetMapAreaName::MapAreaName_0' has a wrong offset!");
static_assert(offsetof(WBP_MapAreaName_C_SetMapAreaName, Temp_bool_Variable) == 0x000010, "Member 'WBP_MapAreaName_C_SetMapAreaName::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MapAreaName_C_SetMapAreaName, CallFunc_TextIsEmpty_ReturnValue) == 0x000011, "Member 'WBP_MapAreaName_C_SetMapAreaName::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapAreaName_C_SetMapAreaName, Temp_byte_Variable) == 0x000012, "Member 'WBP_MapAreaName_C_SetMapAreaName::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MapAreaName_C_SetMapAreaName, Temp_byte_Variable_1) == 0x000013, "Member 'WBP_MapAreaName_C_SetMapAreaName::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MapAreaName_C_SetMapAreaName, K2Node_Select_Default) == 0x000014, "Member 'WBP_MapAreaName_C_SetMapAreaName::K2Node_Select_Default' has a wrong offset!");

}

