#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InventoryEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InventoryEntry.WBP_InventoryEntry_C
// 0x0028 (0x0488 - 0x0460)
class UWBP_InventoryEntry_C : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMulticastInlineDelegate<void(class UWBP_InventoryEntry_C* Entry)> OnFocused;                    // 0x0468(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FDataTableRowHandle                    ItemHandle;                                        // 0x0478(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor)

public:
	void Construct();
	void ExecuteUbergraph_WBP_InventoryEntry(int32 EntryPoint);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void SetFocusedState(bool Focus);
	void Setup(const struct FDataTableRowHandle& ItemHandle_0, int32 Count, const class FText& FallbackText, bool bNew);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_InventoryEntry_C">();
	}
	static class UWBP_InventoryEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InventoryEntry_C>();
	}
};
static_assert(alignof(UWBP_InventoryEntry_C) == 0x000008, "Wrong alignment on UWBP_InventoryEntry_C");
static_assert(sizeof(UWBP_InventoryEntry_C) == 0x000488, "Wrong size on UWBP_InventoryEntry_C");
static_assert(offsetof(UWBP_InventoryEntry_C, UberGraphFrame) == 0x000460, "Member 'UWBP_InventoryEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEntry_C, OnFocused) == 0x000468, "Member 'UWBP_InventoryEntry_C::OnFocused' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEntry_C, ItemHandle) == 0x000478, "Member 'UWBP_InventoryEntry_C::ItemHandle' has a wrong offset!");

}

