#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Event_Choice

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Event_Choice.WBP_Event_Choice_C.OnPressConfirm
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Event_Choice_C_OnPressConfirm final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Event_Choice_C_OnPressConfirm) == 0x000008, "Wrong alignment on WBP_Event_Choice_C_OnPressConfirm");
static_assert(sizeof(WBP_Event_Choice_C_OnPressConfirm) == 0x0001B0, "Wrong size on WBP_Event_Choice_C_OnPressConfirm");
static_assert(offsetof(WBP_Event_Choice_C_OnPressConfirm, KeyEvent) == 0x000000, "Member 'WBP_Event_Choice_C_OnPressConfirm::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Event_Choice_C_OnPressConfirm, ReturnValue) == 0x000040, "Member 'WBP_Event_Choice_C_OnPressConfirm::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_Choice_C_OnPressConfirm, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Event_Choice_C_OnPressConfirm::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Event_Choice.WBP_Event_Choice_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Event_Choice_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Event_Choice_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Event_Choice_C_OnFocusReceived");
static_assert(sizeof(WBP_Event_Choice_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_Event_Choice_C_OnFocusReceived");
static_assert(offsetof(WBP_Event_Choice_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Event_Choice_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Event_Choice_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Event_Choice_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Event_Choice_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Event_Choice_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_Choice_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Event_Choice_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Event_Choice.WBP_Event_Choice_C.ExecuteUbergraph_WBP_Event_Choice
// 0x0048 (0x0048 - 0x0000)
struct WBP_Event_Choice_C_ExecuteUbergraph_WBP_Event_Choice final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent;               // 0x0008(0x0040)()
};
static_assert(alignof(WBP_Event_Choice_C_ExecuteUbergraph_WBP_Event_Choice) == 0x000008, "Wrong alignment on WBP_Event_Choice_C_ExecuteUbergraph_WBP_Event_Choice");
static_assert(sizeof(WBP_Event_Choice_C_ExecuteUbergraph_WBP_Event_Choice) == 0x000048, "Wrong size on WBP_Event_Choice_C_ExecuteUbergraph_WBP_Event_Choice");
static_assert(offsetof(WBP_Event_Choice_C_ExecuteUbergraph_WBP_Event_Choice, EntryPoint) == 0x000000, "Member 'WBP_Event_Choice_C_ExecuteUbergraph_WBP_Event_Choice::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Event_Choice_C_ExecuteUbergraph_WBP_Event_Choice, K2Node_ComponentBoundEvent_KeyEvent) == 0x000008, "Member 'WBP_Event_Choice_C_ExecuteUbergraph_WBP_Event_Choice::K2Node_ComponentBoundEvent_KeyEvent' has a wrong offset!");

// Function WBP_Event_Choice.WBP_Event_Choice_C.BndEvt__WBP_Event_Choice_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_Event_Choice_C_BndEvt__WBP_Event_Choice_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Event_Choice_C_BndEvt__WBP_Event_Choice_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Event_Choice_C_BndEvt__WBP_Event_Choice_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Event_Choice_C_BndEvt__WBP_Event_Choice_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_Event_Choice_C_BndEvt__WBP_Event_Choice_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Event_Choice_C_BndEvt__WBP_Event_Choice_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_Event_Choice_C_BndEvt__WBP_Event_Choice_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

}

