#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugMenu_Page_Other

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function WBP_DebugMenu_Page_Other.WBP_DebugMenu_Page_Other_C.BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Choice_Toggle_InputActions_K2Node_ComponentBoundEvent_3_OnToggle__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_DebugMenu_Page_Other_C_BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Choice_Toggle_InputActions_K2Node_ComponentBoundEvent_3_OnToggle__DelegateSignature final
{
public:
	bool                                          ToggleValue;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Page_Other_C_BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Choice_Toggle_InputActions_K2Node_ComponentBoundEvent_3_OnToggle__DelegateSignature) == 0x000001, "Wrong alignment on WBP_DebugMenu_Page_Other_C_BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Choice_Toggle_InputActions_K2Node_ComponentBoundEvent_3_OnToggle__DelegateSignature");
static_assert(sizeof(WBP_DebugMenu_Page_Other_C_BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Choice_Toggle_InputActions_K2Node_ComponentBoundEvent_3_OnToggle__DelegateSignature) == 0x000001, "Wrong size on WBP_DebugMenu_Page_Other_C_BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Choice_Toggle_InputActions_K2Node_ComponentBoundEvent_3_OnToggle__DelegateSignature");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Choice_Toggle_InputActions_K2Node_ComponentBoundEvent_3_OnToggle__DelegateSignature, ToggleValue) == 0x000000, "Member 'WBP_DebugMenu_Page_Other_C_BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Choice_Toggle_InputActions_K2Node_ComponentBoundEvent_3_OnToggle__DelegateSignature::ToggleValue' has a wrong offset!");

// Function WBP_DebugMenu_Page_Other.WBP_DebugMenu_Page_Other_C.BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Choice_Toggle_K2Node_ComponentBoundEvent_0_OnToggle__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_DebugMenu_Page_Other_C_BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Choice_Toggle_K2Node_ComponentBoundEvent_0_OnToggle__DelegateSignature final
{
public:
	bool                                          ToggleValue;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Page_Other_C_BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Choice_Toggle_K2Node_ComponentBoundEvent_0_OnToggle__DelegateSignature) == 0x000001, "Wrong alignment on WBP_DebugMenu_Page_Other_C_BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Choice_Toggle_K2Node_ComponentBoundEvent_0_OnToggle__DelegateSignature");
static_assert(sizeof(WBP_DebugMenu_Page_Other_C_BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Choice_Toggle_K2Node_ComponentBoundEvent_0_OnToggle__DelegateSignature) == 0x000001, "Wrong size on WBP_DebugMenu_Page_Other_C_BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Choice_Toggle_K2Node_ComponentBoundEvent_0_OnToggle__DelegateSignature");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Choice_Toggle_K2Node_ComponentBoundEvent_0_OnToggle__DelegateSignature, ToggleValue) == 0x000000, "Member 'WBP_DebugMenu_Page_Other_C_BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Choice_Toggle_K2Node_ComponentBoundEvent_0_OnToggle__DelegateSignature::ToggleValue' has a wrong offset!");

// Function WBP_DebugMenu_Page_Other.WBP_DebugMenu_Page_Other_C.ExecuteUbergraph_WBP_DebugMenu_Page_Other
// 0x0330 (0x0330 - 0x0000)
struct WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeZion*                          CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PassiveUnlock_C*                   CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_ToggleValue_1;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_ToggleValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Recollection_C*                    CallFunc_Create_ReturnValue_1;                     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStatHPComponent*                       CallFunc_GetComponentByClass_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UKnockbackComponent*                    CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SkillUnlock_C*                     CallFunc_Create_ReturnValue_2;                     // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue_1;                        // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLevel_ReturnValue;                     // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue_2;                        // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValue_CurrValue;                       // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Shop_C*                            CallFunc_Create_ReturnValue_3;                     // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValue_CurrValue_1;                     // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValue_CurrValue_2;                     // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue_1; // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValue_CurrValue_3;                     // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValue_CurrValue_4;                     // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue_2; // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_3;           // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FDamageData                            K2Node_MakeStruct_DamageData;                      // 0x0178(0x0058)(NoDestructor)
	bool                                          CallFunc_DoDamage_ReturnValue;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Extra_C*                           CallFunc_Create_ReturnValue_4;                     // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Difficulty_C*                      CallFunc_Create_ReturnValue_5;                     // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGameModeZion*                          CallFunc_Get_ReturnValue_3;                        // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameModeZion*                          CallFunc_Get_ReturnValue_4;                        // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue_3; // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_2;              // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStatusEffectComponent*                 CallFunc_GetComponentByClass_ReturnValue_2;        // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_3;              // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_4;              // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22A[0x6];                                      // 0x022A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStatusEffectComponent*                 CallFunc_GetComponentByClass_ReturnValue_3;        // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStatusEffectComponent*                 CallFunc_GetComponentByClass_ReturnValue_4;        // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGameModeZion*                          CallFunc_Get_ReturnValue_5;                        // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameModeZion*                          CallFunc_Get_ReturnValue_6;                        // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             CallFunc_GetDataTableItemSpirits_ReturnValue;      // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             CallFunc_GetDataTableItemSkills_ReturnValue;       // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameModeZion*                          CallFunc_Get_ReturnValue_7;                        // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameModeZion*                          CallFunc_Get_ReturnValue_8;                        // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             CallFunc_GetDataTableItemAptitudes_ReturnValue;    // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue_9;                        // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameModeZion*                          CallFunc_Get_ReturnValue_10;                       // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UEventAsset>             CallFunc_Array_Get_Item;                           // 0x0288(0x0028)(HasGetValueTypeHash)
	struct FSoftObjectPath                        CallFunc_Conv_SoftObjRefToSoftObjPath_ReturnValue; // 0x02B0(0x0020)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_BreakSoftObjectPath_PathString;           // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetBaseFilename_ReturnValue;              // 0x02F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DebugMarkEventAsCleared_ReturnValue;      // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetValue_CurrValue_5;                     // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_4;           // 0x0310(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0320(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other) == 0x000008, "Wrong alignment on WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other");
static_assert(sizeof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other) == 0x000330, "Wrong size on WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, EntryPoint) == 0x000000, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Get_ReturnValue) == 0x000008, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Create_ReturnValue) == 0x000020, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, K2Node_ComponentBoundEvent_ToggleValue_1) == 0x000028, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::K2Node_ComponentBoundEvent_ToggleValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, K2Node_ComponentBoundEvent_ToggleValue) == 0x000029, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::K2Node_ComponentBoundEvent_ToggleValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_GetPlayerPawn_ReturnValue) == 0x000030, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Create_ReturnValue_1) == 0x000038, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_GetComponentByClass_ReturnValue) == 0x000048, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000058, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_IsValid_ReturnValue_2) == 0x000060, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_GetActorForwardVector_ReturnValue) == 0x000068, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000080, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000098, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Create_ReturnValue_2) == 0x0000A0, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Get_ReturnValue_1) == 0x0000A8, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_GetLevel_ReturnValue) == 0x0000B0, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_GetLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Get_ReturnValue_2) == 0x0000B8, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Get_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_GetValue_CurrValue) == 0x0000C0, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_GetValue_CurrValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Create_ReturnValue_3) == 0x0000C8, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_GetValue_CurrValue_1) == 0x0000D0, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_GetValue_CurrValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Conv_IntToString_ReturnValue) == 0x0000D8, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_GetValue_CurrValue_2) == 0x0000E8, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_GetValue_CurrValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Concat_StrStr_ReturnValue) == 0x0000F0, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000100, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000110, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000120, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_GetConsoleVariableIntValue_ReturnValue_1) == 0x000124, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_GetConsoleVariableIntValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_GetValue_CurrValue_3) == 0x000128, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_GetValue_CurrValue_3' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Conv_IntToString_ReturnValue_2) == 0x000130, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000140, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_GetValue_CurrValue_4) == 0x000150, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_GetValue_CurrValue_4' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_GetConsoleVariableIntValue_ReturnValue_2) == 0x000154, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_GetConsoleVariableIntValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Conv_IntToString_ReturnValue_3) == 0x000158, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Conv_IntToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000168, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, K2Node_MakeStruct_DamageData) == 0x000178, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::K2Node_MakeStruct_DamageData' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_DoDamage_ReturnValue) == 0x0001D0, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_DoDamage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Create_ReturnValue_4) == 0x0001D8, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Create_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Create_ReturnValue_5) == 0x0001E0, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Create_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Get_ReturnValue_3) == 0x0001E8, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Get_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Get_ReturnValue_4) == 0x0001F0, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Get_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_GetConsoleVariableIntValue_ReturnValue_3) == 0x0001F8, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_GetConsoleVariableIntValue_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_GetPlayerPawn_ReturnValue_2) == 0x000200, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_GetPlayerPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_IsValid_ReturnValue_3) == 0x000208, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_GetComponentByClass_ReturnValue_2) == 0x000210, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_GetPlayerPawn_ReturnValue_3) == 0x000218, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_GetPlayerPawn_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_GetPlayerPawn_ReturnValue_4) == 0x000220, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_GetPlayerPawn_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_IsValid_ReturnValue_4) == 0x000228, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_IsValid_ReturnValue_5) == 0x000229, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_GetComponentByClass_ReturnValue_3) == 0x000230, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_GetComponentByClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_GetComponentByClass_ReturnValue_4) == 0x000238, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_GetComponentByClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Get_ReturnValue_5) == 0x000240, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Get_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Get_ReturnValue_6) == 0x000248, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Get_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_GetDataTableItemSpirits_ReturnValue) == 0x000250, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_GetDataTableItemSpirits_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_GetDataTableItemSkills_ReturnValue) == 0x000258, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_GetDataTableItemSkills_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Get_ReturnValue_7) == 0x000260, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Get_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Get_ReturnValue_8) == 0x000268, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Get_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_GetDataTableItemAptitudes_ReturnValue) == 0x000270, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_GetDataTableItemAptitudes_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Get_ReturnValue_9) == 0x000278, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Get_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Get_ReturnValue_10) == 0x000280, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Get_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Array_Get_Item) == 0x000288, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Conv_SoftObjRefToSoftObjPath_ReturnValue) == 0x0002B0, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Conv_SoftObjRefToSoftObjPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Array_Length_ReturnValue) == 0x0002D0, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_BreakSoftObjectPath_PathString) == 0x0002D8, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_BreakSoftObjectPath_PathString' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Less_IntInt_ReturnValue) == 0x0002E8, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_GetBaseFilename_ReturnValue) == 0x0002F0, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_GetBaseFilename_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Conv_StringToName_ReturnValue) == 0x000300, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_DebugMarkEventAsCleared_ReturnValue) == 0x000308, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_DebugMarkEventAsCleared_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_GetValue_CurrValue_5) == 0x00030C, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_GetValue_CurrValue_5' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Conv_IntToString_ReturnValue_4) == 0x000310, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Conv_IntToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000320, "Member 'WBP_DebugMenu_Page_Other_C_ExecuteUbergraph_WBP_DebugMenu_Page_Other::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");

// Function WBP_DebugMenu_Page_Other.WBP_DebugMenu_Page_Other_C.GrantAllItemsFromDataTable
// 0x0050 (0x0050 - 0x0000)
struct WBP_DebugMenu_Page_Other_C_GrantAllItemsFromDataTable final
{
public:
	const class UDataTable*                       Table;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0008(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0028(0x0010)(NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddItem_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Page_Other_C_GrantAllItemsFromDataTable) == 0x000008, "Wrong alignment on WBP_DebugMenu_Page_Other_C_GrantAllItemsFromDataTable");
static_assert(sizeof(WBP_DebugMenu_Page_Other_C_GrantAllItemsFromDataTable) == 0x000050, "Wrong size on WBP_DebugMenu_Page_Other_C_GrantAllItemsFromDataTable");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_GrantAllItemsFromDataTable, Table) == 0x000000, "Member 'WBP_DebugMenu_Page_Other_C_GrantAllItemsFromDataTable::Table' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_GrantAllItemsFromDataTable, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000008, "Member 'WBP_DebugMenu_Page_Other_C_GrantAllItemsFromDataTable::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_GrantAllItemsFromDataTable, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_DebugMenu_Page_Other_C_GrantAllItemsFromDataTable::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_GrantAllItemsFromDataTable, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'WBP_DebugMenu_Page_Other_C_GrantAllItemsFromDataTable::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_GrantAllItemsFromDataTable, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_DebugMenu_Page_Other_C_GrantAllItemsFromDataTable::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_GrantAllItemsFromDataTable, K2Node_MakeStruct_DataTableRowHandle) == 0x000028, "Member 'WBP_DebugMenu_Page_Other_C_GrantAllItemsFromDataTable::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_GrantAllItemsFromDataTable, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'WBP_DebugMenu_Page_Other_C_GrantAllItemsFromDataTable::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_GrantAllItemsFromDataTable, CallFunc_Get_ReturnValue) == 0x000040, "Member 'WBP_DebugMenu_Page_Other_C_GrantAllItemsFromDataTable::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_GrantAllItemsFromDataTable, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'WBP_DebugMenu_Page_Other_C_GrantAllItemsFromDataTable::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_GrantAllItemsFromDataTable, CallFunc_AddItem_ReturnValue) == 0x000049, "Member 'WBP_DebugMenu_Page_Other_C_GrantAllItemsFromDataTable::CallFunc_AddItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_GrantAllItemsFromDataTable, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'WBP_DebugMenu_Page_Other_C_GrantAllItemsFromDataTable::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_DebugMenu_Page_Other.WBP_DebugMenu_Page_Other_C.InitToggleForMenu
// 0x0030 (0x0030 - 0x0000)
struct WBP_DebugMenu_Page_Other_C_InitToggleForMenu final
{
public:
	TSubclassOf<class UUserWidget>                ClassToFind;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UUserWidget*                            WidgetInstance;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_C* Toggle;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGameViewportZion*                      CallFunc_Get_ReturnValue;                          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetInStack_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Page_Other_C_InitToggleForMenu) == 0x000008, "Wrong alignment on WBP_DebugMenu_Page_Other_C_InitToggleForMenu");
static_assert(sizeof(WBP_DebugMenu_Page_Other_C_InitToggleForMenu) == 0x000030, "Wrong size on WBP_DebugMenu_Page_Other_C_InitToggleForMenu");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_InitToggleForMenu, ClassToFind) == 0x000000, "Member 'WBP_DebugMenu_Page_Other_C_InitToggleForMenu::ClassToFind' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_InitToggleForMenu, WidgetInstance) == 0x000008, "Member 'WBP_DebugMenu_Page_Other_C_InitToggleForMenu::WidgetInstance' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_InitToggleForMenu, Toggle) == 0x000010, "Member 'WBP_DebugMenu_Page_Other_C_InitToggleForMenu::Toggle' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_InitToggleForMenu, CallFunc_Get_ReturnValue) == 0x000018, "Member 'WBP_DebugMenu_Page_Other_C_InitToggleForMenu::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_InitToggleForMenu, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_DebugMenu_Page_Other_C_InitToggleForMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_InitToggleForMenu, CallFunc_GetUserWidgetInStack_ReturnValue) == 0x000028, "Member 'WBP_DebugMenu_Page_Other_C_InitToggleForMenu::CallFunc_GetUserWidgetInStack_ReturnValue' has a wrong offset!");

// Function WBP_DebugMenu_Page_Other.WBP_DebugMenu_Page_Other_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_DebugMenu_Page_Other_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Page_Other_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_DebugMenu_Page_Other_C_OnFocusReceived");
static_assert(sizeof(WBP_DebugMenu_Page_Other_C_OnFocusReceived) == 0x0001B8, "Wrong size on WBP_DebugMenu_Page_Other_C_OnFocusReceived");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_DebugMenu_Page_Other_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_DebugMenu_Page_Other_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_DebugMenu_Page_Other_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_DebugMenu_Page_Other_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_OnFocusReceived, CallFunc_GetChildAt_ReturnValue) == 0x0001B0, "Member 'WBP_DebugMenu_Page_Other_C_OnFocusReceived::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");

// Function WBP_DebugMenu_Page_Other.WBP_DebugMenu_Page_Other_C.Shake
// 0x0018 (0x0018 - 0x0000)
struct WBP_DebugMenu_Page_Other_C_Shake final
{
public:
	class UForceFeedbackEffect*                   ForceFeedbackEffect;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Page_Other_C_Shake) == 0x000008, "Wrong alignment on WBP_DebugMenu_Page_Other_C_Shake");
static_assert(sizeof(WBP_DebugMenu_Page_Other_C_Shake) == 0x000018, "Wrong size on WBP_DebugMenu_Page_Other_C_Shake");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_Shake, ForceFeedbackEffect) == 0x000000, "Member 'WBP_DebugMenu_Page_Other_C_Shake::ForceFeedbackEffect' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_Shake, CallFunc_Get_ReturnValue) == 0x000008, "Member 'WBP_DebugMenu_Page_Other_C_Shake::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_Shake, CallFunc_MakeLiteralName_ReturnValue) == 0x000010, "Member 'WBP_DebugMenu_Page_Other_C_Shake::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");

// Function WBP_DebugMenu_Page_Other.WBP_DebugMenu_Page_Other_C.ToggleMenuOverlay
// 0x0028 (0x0028 - 0x0000)
struct WBP_DebugMenu_Page_Other_C_ToggleMenuOverlay final
{
public:
	bool                                          Toggle;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 WidgetClass;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            WidgetInstance;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Page_Other_C_ToggleMenuOverlay) == 0x000008, "Wrong alignment on WBP_DebugMenu_Page_Other_C_ToggleMenuOverlay");
static_assert(sizeof(WBP_DebugMenu_Page_Other_C_ToggleMenuOverlay) == 0x000028, "Wrong size on WBP_DebugMenu_Page_Other_C_ToggleMenuOverlay");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ToggleMenuOverlay, Toggle) == 0x000000, "Member 'WBP_DebugMenu_Page_Other_C_ToggleMenuOverlay::Toggle' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ToggleMenuOverlay, WidgetClass) == 0x000008, "Member 'WBP_DebugMenu_Page_Other_C_ToggleMenuOverlay::WidgetClass' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Other_C_ToggleMenuOverlay, WidgetInstance) == 0x000010, "Member 'WBP_DebugMenu_Page_Other_C_ToggleMenuOverlay::WidgetInstance' has a wrong offset!");
