#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Cursor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Cursor.WBP_Cursor_C
// 0x0018 (0x0308 - 0x02F0)
class UWBP_Cursor_C final : public UUserWidgetCursor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_18;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CursorImg;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Cursor(int32 EntryPoint);
	void SetVisible(bool bVisible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Cursor_C">();
	}
	static class UWBP_Cursor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Cursor_C>();
	}
};
static_assert(alignof(UWBP_Cursor_C) == 0x000008, "Wrong alignment on UWBP_Cursor_C");
static_assert(sizeof(UWBP_Cursor_C) == 0x000308, "Wrong size on UWBP_Cursor_C");
static_assert(offsetof(UWBP_Cursor_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_Cursor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Cursor_C, CanvasPanel_18) == 0x0002F8, "Member 'UWBP_Cursor_C::CanvasPanel_18' has a wrong offset!");
static_assert(offsetof(UWBP_Cursor_C, CursorImg) == 0x000300, "Member 'UWBP_Cursor_C::CursorImg' has a wrong offset!");

}

