#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RestPointList_MapArea

#include "Basic.hpp"

#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function WBP_RestPointList_MapArea.WBP_RestPointList_MapArea_C.ExecuteUbergraph_WBP_RestPointList_MapArea
// 0x0018 (0x0018 - 0x0000)
struct WBP_RestPointList_MapArea_C_ExecuteUbergraph_WBP_RestPointList_MapArea final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidgetMapIcon_RestPoint*           K2Node_CustomEvent_RestPointIcon;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMapRestPointData                      K2Node_CustomEvent_MapRestPointData;               // 0x0010(0x0008)(NoDestructor)
};
static_assert(alignof(WBP_RestPointList_MapArea_C_ExecuteUbergraph_WBP_RestPointList_MapArea) == 0x000008, "Wrong alignment on WBP_RestPointList_MapArea_C_ExecuteUbergraph_WBP_RestPointList_MapArea");
static_assert(sizeof(WBP_RestPointList_MapArea_C_ExecuteUbergraph_WBP_RestPointList_MapArea) == 0x000018, "Wrong size on WBP_RestPointList_MapArea_C_ExecuteUbergraph_WBP_RestPointList_MapArea");
static_assert(offsetof(WBP_RestPointList_MapArea_C_ExecuteUbergraph_WBP_RestPointList_MapArea, EntryPoint) == 0x000000, "Member 'WBP_RestPointList_MapArea_C_ExecuteUbergraph_WBP_RestPointList_MapArea::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapArea_C_ExecuteUbergraph_WBP_RestPointList_MapArea, K2Node_CustomEvent_RestPointIcon) == 0x000008, "Member 'WBP_RestPointList_MapArea_C_ExecuteUbergraph_WBP_RestPointList_MapArea::K2Node_CustomEvent_RestPointIcon' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapArea_C_ExecuteUbergraph_WBP_RestPointList_MapArea, K2Node_CustomEvent_MapRestPointData) == 0x000010, "Member 'WBP_RestPointList_MapArea_C_ExecuteUbergraph_WBP_RestPointList_MapArea::K2Node_CustomEvent_MapRestPointData' has a wrong offset!");

// Function WBP_RestPointList_MapArea.WBP_RestPointList_MapArea_C.GenerateRestPointEntries
// 0x0060 (0x0060 - 0x0000)
struct WBP_RestPointList_MapArea_C_GenerateRestPointEntries final
{
public:
	TArray<class UUserWidgetMapIcon_RestPoint*>   RestPointIcons;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidgetMapIcon_RestPoint*           CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FMapRestPointData& RestPointData)> K2Node_CreateDelegate_OutputDelegate; // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUserWidgetMapIcon_RestPoint* RestPointIcon)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_RestPointList_Entry_C*             CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RestPointList_MapArea_C_GenerateRestPointEntries) == 0x000008, "Wrong alignment on WBP_RestPointList_MapArea_C_GenerateRestPointEntries");
static_assert(sizeof(WBP_RestPointList_MapArea_C_GenerateRestPointEntries) == 0x000060, "Wrong size on WBP_RestPointList_MapArea_C_GenerateRestPointEntries");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GenerateRestPointEntries, RestPointIcons) == 0x000000, "Member 'WBP_RestPointList_MapArea_C_GenerateRestPointEntries::RestPointIcons' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GenerateRestPointEntries, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_RestPointList_MapArea_C_GenerateRestPointEntries::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GenerateRestPointEntries, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WBP_RestPointList_MapArea_C_GenerateRestPointEntries::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GenerateRestPointEntries, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_RestPointList_MapArea_C_GenerateRestPointEntries::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GenerateRestPointEntries, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_RestPointList_MapArea_C_GenerateRestPointEntries::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GenerateRestPointEntries, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'WBP_RestPointList_MapArea_C_GenerateRestPointEntries::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GenerateRestPointEntries, K2Node_CreateDelegate_OutputDelegate_1) == 0x000034, "Member 'WBP_RestPointList_MapArea_C_GenerateRestPointEntries::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GenerateRestPointEntries, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'WBP_RestPointList_MapArea_C_GenerateRestPointEntries::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GenerateRestPointEntries, CallFunc_Create_ReturnValue) == 0x000048, "Member 'WBP_RestPointList_MapArea_C_GenerateRestPointEntries::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GenerateRestPointEntries, CallFunc_AddChild_ReturnValue) == 0x000050, "Member 'WBP_RestPointList_MapArea_C_GenerateRestPointEntries::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GenerateRestPointEntries, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'WBP_RestPointList_MapArea_C_GenerateRestPointEntries::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GenerateRestPointEntries, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'WBP_RestPointList_MapArea_C_GenerateRestPointEntries::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_RestPointList_MapArea.WBP_RestPointList_MapArea_C.GetFirstEntry
// 0x0010 (0x0010 - 0x0000)
struct WBP_RestPointList_MapArea_C_GetFirstEntry final
{
public:
	class UWidget*                                FirstEntry;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RestPointList_MapArea_C_GetFirstEntry) == 0x000008, "Wrong alignment on WBP_RestPointList_MapArea_C_GetFirstEntry");
static_assert(sizeof(WBP_RestPointList_MapArea_C_GetFirstEntry) == 0x000010, "Wrong size on WBP_RestPointList_MapArea_C_GetFirstEntry");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GetFirstEntry, FirstEntry) == 0x000000, "Member 'WBP_RestPointList_MapArea_C_GetFirstEntry::FirstEntry' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GetFirstEntry, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'WBP_RestPointList_MapArea_C_GetFirstEntry::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");

// Function WBP_RestPointList_MapArea.WBP_RestPointList_MapArea_C.GetLastEntry
// 0x0018 (0x0018 - 0x0000)
struct WBP_RestPointList_MapArea_C_GetLastEntry final
{
public:
	class UWidget*                                LastEntry;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RestPointList_MapArea_C_GetLastEntry) == 0x000008, "Wrong alignment on WBP_RestPointList_MapArea_C_GetLastEntry");
static_assert(sizeof(WBP_RestPointList_MapArea_C_GetLastEntry) == 0x000018, "Wrong size on WBP_RestPointList_MapArea_C_GetLastEntry");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GetLastEntry, LastEntry) == 0x000000, "Member 'WBP_RestPointList_MapArea_C_GetLastEntry::LastEntry' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GetLastEntry, CallFunc_GetChildrenCount_ReturnValue) == 0x000008, "Member 'WBP_RestPointList_MapArea_C_GetLastEntry::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GetLastEntry, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_RestPointList_MapArea_C_GetLastEntry::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GetLastEntry, CallFunc_GetChildAt_ReturnValue) == 0x000010, "Member 'WBP_RestPointList_MapArea_C_GetLastEntry::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");

// Function WBP_RestPointList_MapArea.WBP_RestPointList_MapArea_C.GoToMapArea
// 0x0048 (0x0048 - 0x0000)
struct WBP_RestPointList_MapArea_C_GoToMapArea final
{
public:
	class UUserWidgetMapIcon_RestPoint*           NearestRestPointIcon;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                WidgetFocused;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_RestPointList_Entry_C*             K2Node_DynamicCast_AsWBP_Rest_Point_List_Entry;    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRestPointIcon_ReturnValue;              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RestPointList_MapArea_C_GoToMapArea) == 0x000008, "Wrong alignment on WBP_RestPointList_MapArea_C_GoToMapArea");
static_assert(sizeof(WBP_RestPointList_MapArea_C_GoToMapArea) == 0x000048, "Wrong size on WBP_RestPointList_MapArea_C_GoToMapArea");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GoToMapArea, NearestRestPointIcon) == 0x000000, "Member 'WBP_RestPointList_MapArea_C_GoToMapArea::NearestRestPointIcon' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GoToMapArea, WidgetFocused) == 0x000008, "Member 'WBP_RestPointList_MapArea_C_GoToMapArea::WidgetFocused' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GoToMapArea, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_RestPointList_MapArea_C_GoToMapArea::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GoToMapArea, Temp_int_Variable) == 0x000014, "Member 'WBP_RestPointList_MapArea_C_GoToMapArea::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GoToMapArea, CallFunc_GetChildAt_ReturnValue) == 0x000018, "Member 'WBP_RestPointList_MapArea_C_GoToMapArea::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GoToMapArea, CallFunc_GetChildrenCount_ReturnValue) == 0x000020, "Member 'WBP_RestPointList_MapArea_C_GoToMapArea::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GoToMapArea, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'WBP_RestPointList_MapArea_C_GoToMapArea::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GoToMapArea, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'WBP_RestPointList_MapArea_C_GoToMapArea::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GoToMapArea, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000029, "Member 'WBP_RestPointList_MapArea_C_GoToMapArea::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GoToMapArea, K2Node_DynamicCast_AsWBP_Rest_Point_List_Entry) == 0x000030, "Member 'WBP_RestPointList_MapArea_C_GoToMapArea::K2Node_DynamicCast_AsWBP_Rest_Point_List_Entry' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GoToMapArea, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_RestPointList_MapArea_C_GoToMapArea::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GoToMapArea, CallFunc_IsRestPointIcon_ReturnValue) == 0x000039, "Member 'WBP_RestPointList_MapArea_C_GoToMapArea::CallFunc_IsRestPointIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GoToMapArea, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_RestPointList_MapArea_C_GoToMapArea::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_MapArea_C_GoToMapArea, CallFunc_GetChildAt_ReturnValue_1) == 0x000040, "Member 'WBP_RestPointList_MapArea_C_GoToMapArea::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");

// Function WBP_RestPointList_MapArea.WBP_RestPointList_MapArea_C.RestPointListEntryFocused
// 0x0008 (0x0008 - 0x0000)
struct WBP_RestPointList_MapArea_C_RestPointListEntryFocused final
{
public:
	class UUserWidgetMapIcon_RestPoint*           RestPointIcon;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RestPointList_MapArea_C_RestPointListEntryFocused) == 0x000008, "Wrong alignment on WBP_RestPointList_MapArea_C_RestPointListEntryFocused");
static_assert(sizeof(WBP_RestPointList_MapArea_C_RestPointListEntryFocused) == 0x000008, "Wrong size on WBP_RestPointList_MapArea_C_RestPointListEntryFocused");
static_assert(offsetof(WBP_RestPointList_MapArea_C_RestPointListEntryFocused, RestPointIcon) == 0x000000, "Member 'WBP_RestPointList_MapArea_C_RestPointListEntryFocused::RestPointIcon' has a wrong offset!");

// Function WBP_RestPointList_MapArea.WBP_RestPointList_MapArea_C.RestPointListEntryPressed
// 0x0008 (0x0008 - 0x0000)
struct WBP_RestPointList_MapArea_C_RestPointListEntryPressed final
{
public:
	struct FMapRestPointData                      MapRestPointData;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_RestPointList_MapArea_C_RestPointListEntryPressed) == 0x000004, "Wrong alignment on WBP_RestPointList_MapArea_C_RestPointListEntryPressed");
static_assert(sizeof(WBP_RestPointList_MapArea_C_RestPointListEntryPressed) == 0x000008, "Wrong size on WBP_RestPointList_MapArea_C_RestPointListEntryPressed");
static_assert(offsetof(WBP_RestPointList_MapArea_C_RestPointListEntryPressed, MapRestPointData) == 0x000000, "Member 'WBP_RestPointList_MapArea_C_RestPointListEntryPressed::MapRestPointData' has a wrong offset!");

}

