#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Extra_Costume

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Extra_Costume.WBP_Extra_Costume_C.BuyCostumeData
// 0x0020 (0x0020 - 0x0000)
struct WBP_Extra_Costume_C_BuyCostumeData final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FCurrencyValue                         CallFunc_ToCurrencyValue_ReturnValue;              // 0x0010(0x0008)(NoDestructor)
	bool                                          CallFunc_AddItem_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SpendCurrency_ReturnValue;                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Costume_C_BuyCostumeData) == 0x000008, "Wrong alignment on WBP_Extra_Costume_C_BuyCostumeData");
static_assert(sizeof(WBP_Extra_Costume_C_BuyCostumeData) == 0x000020, "Wrong size on WBP_Extra_Costume_C_BuyCostumeData");
static_assert(offsetof(WBP_Extra_Costume_C_BuyCostumeData, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_Extra_Costume_C_BuyCostumeData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_BuyCostumeData, CallFunc_Get_ReturnValue) == 0x000008, "Member 'WBP_Extra_Costume_C_BuyCostumeData::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_BuyCostumeData, CallFunc_ToCurrencyValue_ReturnValue) == 0x000010, "Member 'WBP_Extra_Costume_C_BuyCostumeData::CallFunc_ToCurrencyValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_BuyCostumeData, CallFunc_AddItem_ReturnValue) == 0x000018, "Member 'WBP_Extra_Costume_C_BuyCostumeData::CallFunc_AddItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_BuyCostumeData, CallFunc_SpendCurrency_ReturnValue) == 0x00001C, "Member 'WBP_Extra_Costume_C_BuyCostumeData::CallFunc_SpendCurrency_ReturnValue' has a wrong offset!");

// Function WBP_Extra_Costume.WBP_Extra_Costume_C.CacheEquippedCostumeHandle
// 0x0030 (0x0030 - 0x0000)
struct WBP_Extra_Costume_C_CacheEquippedCostumeHandle final
{
public:
	class AGameModeZion*                          CallFunc_Get_ReturnValue;                          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             CallFunc_GetDataTableItemCostumes_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEquippedCostumeID_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0020(0x0010)(NoDestructor)
};
static_assert(alignof(WBP_Extra_Costume_C_CacheEquippedCostumeHandle) == 0x000008, "Wrong alignment on WBP_Extra_Costume_C_CacheEquippedCostumeHandle");
static_assert(sizeof(WBP_Extra_Costume_C_CacheEquippedCostumeHandle) == 0x000030, "Wrong size on WBP_Extra_Costume_C_CacheEquippedCostumeHandle");
static_assert(offsetof(WBP_Extra_Costume_C_CacheEquippedCostumeHandle, CallFunc_Get_ReturnValue) == 0x000000, "Member 'WBP_Extra_Costume_C_CacheEquippedCostumeHandle::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_CacheEquippedCostumeHandle, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_Extra_Costume_C_CacheEquippedCostumeHandle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_CacheEquippedCostumeHandle, CallFunc_GetDataTableItemCostumes_ReturnValue) == 0x000010, "Member 'WBP_Extra_Costume_C_CacheEquippedCostumeHandle::CallFunc_GetDataTableItemCostumes_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_CacheEquippedCostumeHandle, CallFunc_GetEquippedCostumeID_ReturnValue) == 0x000018, "Member 'WBP_Extra_Costume_C_CacheEquippedCostumeHandle::CallFunc_GetEquippedCostumeID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_CacheEquippedCostumeHandle, K2Node_MakeStruct_DataTableRowHandle) == 0x000020, "Member 'WBP_Extra_Costume_C_CacheEquippedCostumeHandle::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");

// Function WBP_Extra_Costume.WBP_Extra_Costume_C.ExecuteUbergraph_WBP_Extra_Costume
// 0x02F8 (0x02F8 - 0x0000)
struct WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Extra_CostumeEntry_C*              K2Node_CustomEvent_CostumeEntry_1;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCostumeOwned_IsCostumeOwned;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Extra_CostumeEntry_C*              K2Node_CustomEvent_CostumeEntry;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCurrencyValue                         CallFunc_ToCurrencyValue_ReturnValue;              // 0x002C(0x0008)(NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInventoryItemCostumeData              CallFunc_GetItemCostumeData_out_ItemData;          // 0x0038(0x0278)()
	bool                                          CallFunc_GetItemCostumeData_ReturnValue;           // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B2[0x2];                                      // 0x02B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEquippedCostumeID_ReturnValue;         // 0x02B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USpineAnimatorComponent*                CallFunc_GetComponentByClass_ReturnValue;          // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue_1;                        // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInEvent_ReturnValue;                    // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x02EC(0x0008)(NoDestructor)
};
static_assert(alignof(WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume) == 0x000008, "Wrong alignment on WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume");
static_assert(sizeof(WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume) == 0x0002F8, "Wrong size on WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume");
static_assert(offsetof(WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume, EntryPoint) == 0x000000, "Member 'WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume, CallFunc_Get_ReturnValue) == 0x000008, "Member 'WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume, K2Node_CustomEvent_CostumeEntry_1) == 0x000010, "Member 'WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume::K2Node_CustomEvent_CostumeEntry_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume, CallFunc_IsCostumeOwned_IsCostumeOwned) == 0x000018, "Member 'WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume::CallFunc_IsCostumeOwned_IsCostumeOwned' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume, K2Node_CustomEvent_CostumeEntry) == 0x000020, "Member 'WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume::K2Node_CustomEvent_CostumeEntry' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume, CallFunc_ToCurrencyValue_ReturnValue) == 0x00002C, "Member 'WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume::CallFunc_ToCurrencyValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume, CallFunc_GetItemCostumeData_out_ItemData) == 0x000038, "Member 'WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume::CallFunc_GetItemCostumeData_out_ItemData' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume, CallFunc_GetItemCostumeData_ReturnValue) == 0x0002B0, "Member 'WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume::CallFunc_GetItemCostumeData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume, CallFunc_IsValid_ReturnValue_2) == 0x0002B1, "Member 'WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume, CallFunc_GetEquippedCostumeID_ReturnValue) == 0x0002B4, "Member 'WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume::CallFunc_GetEquippedCostumeID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume, CallFunc_NotEqual_NameName_ReturnValue) == 0x0002BC, "Member 'WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume, CallFunc_GetPlayerPawn_ReturnValue) == 0x0002C0, "Member 'WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume, CallFunc_IsValid_ReturnValue_3) == 0x0002C8, "Member 'WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume, CallFunc_GetComponentByClass_ReturnValue) == 0x0002D0, "Member 'WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume, CallFunc_IsValid_ReturnValue_4) == 0x0002D8, "Member 'WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume, CallFunc_Get_ReturnValue_1) == 0x0002E0, "Member 'WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume, CallFunc_IsInEvent_ReturnValue) == 0x0002E8, "Member 'WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume::CallFunc_IsInEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume, K2Node_Event_InFocusEvent) == 0x0002EC, "Member 'WBP_Extra_Costume_C_ExecuteUbergraph_WBP_Extra_Costume::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function WBP_Extra_Costume.WBP_Extra_Costume_C.GenerateCostumeEntries
// 0x0090 (0x0090 - 0x0000)
struct WBP_Extra_Costume_C_GenerateCostumeEntries final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_Extra_CostumeEntry_C* CostumeEntry)> K2Node_CreateDelegate_OutputDelegate; // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Extra_CostumeEntry_C*              CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_Extra_CostumeEntry_C* CostumeEntry)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeZion*                          CallFunc_Get_ReturnValue;                          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             CallFunc_GetDataTableItemCostumes_ReturnValue;     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0058(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0078(0x0010)(NoDestructor)
	bool                                          CallFunc_CanDisplayCostumeData_bResult;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Costume_C_GenerateCostumeEntries) == 0x000008, "Wrong alignment on WBP_Extra_Costume_C_GenerateCostumeEntries");
static_assert(sizeof(WBP_Extra_Costume_C_GenerateCostumeEntries) == 0x000090, "Wrong size on WBP_Extra_Costume_C_GenerateCostumeEntries");
static_assert(offsetof(WBP_Extra_Costume_C_GenerateCostumeEntries, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_Extra_Costume_C_GenerateCostumeEntries::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_GenerateCostumeEntries, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Extra_Costume_C_GenerateCostumeEntries::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_GenerateCostumeEntries, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Extra_Costume_C_GenerateCostumeEntries::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_GenerateCostumeEntries, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'WBP_Extra_Costume_C_GenerateCostumeEntries::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_GenerateCostumeEntries, CallFunc_Create_ReturnValue) == 0x000020, "Member 'WBP_Extra_Costume_C_GenerateCostumeEntries::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_GenerateCostumeEntries, CallFunc_AddChild_ReturnValue) == 0x000028, "Member 'WBP_Extra_Costume_C_GenerateCostumeEntries::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_GenerateCostumeEntries, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'WBP_Extra_Costume_C_GenerateCostumeEntries::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_GenerateCostumeEntries, CallFunc_Array_AddUnique_ReturnValue) == 0x000040, "Member 'WBP_Extra_Costume_C_GenerateCostumeEntries::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_GenerateCostumeEntries, CallFunc_Get_ReturnValue) == 0x000048, "Member 'WBP_Extra_Costume_C_GenerateCostumeEntries::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_GenerateCostumeEntries, CallFunc_GetDataTableItemCostumes_ReturnValue) == 0x000050, "Member 'WBP_Extra_Costume_C_GenerateCostumeEntries::CallFunc_GetDataTableItemCostumes_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_GenerateCostumeEntries, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000058, "Member 'WBP_Extra_Costume_C_GenerateCostumeEntries::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_GenerateCostumeEntries, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'WBP_Extra_Costume_C_GenerateCostumeEntries::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_GenerateCostumeEntries, CallFunc_Array_Get_Item) == 0x00006C, "Member 'WBP_Extra_Costume_C_GenerateCostumeEntries::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_GenerateCostumeEntries, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'WBP_Extra_Costume_C_GenerateCostumeEntries::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_GenerateCostumeEntries, K2Node_MakeStruct_DataTableRowHandle) == 0x000078, "Member 'WBP_Extra_Costume_C_GenerateCostumeEntries::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_GenerateCostumeEntries, CallFunc_CanDisplayCostumeData_bResult) == 0x000088, "Member 'WBP_Extra_Costume_C_GenerateCostumeEntries::CallFunc_CanDisplayCostumeData_bResult' has a wrong offset!");

// Function WBP_Extra_Costume.WBP_Extra_Costume_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_Extra_Costume_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Extra_Costume_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on WBP_Extra_Costume_C_OnAddedToFocusPath");
static_assert(sizeof(WBP_Extra_Costume_C_OnAddedToFocusPath) == 0x000008, "Wrong size on WBP_Extra_Costume_C_OnAddedToFocusPath");
static_assert(offsetof(WBP_Extra_Costume_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_Extra_Costume_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_Extra_Costume.WBP_Extra_Costume_C.OnEntryFocused
// 0x0008 (0x0008 - 0x0000)
struct WBP_Extra_Costume_C_OnEntryFocused final
{
public:
	class UWBP_Extra_CostumeEntry_C*              CostumeEntry;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Costume_C_OnEntryFocused) == 0x000008, "Wrong alignment on WBP_Extra_Costume_C_OnEntryFocused");
static_assert(sizeof(WBP_Extra_Costume_C_OnEntryFocused) == 0x000008, "Wrong size on WBP_Extra_Costume_C_OnEntryFocused");
static_assert(offsetof(WBP_Extra_Costume_C_OnEntryFocused, CostumeEntry) == 0x000000, "Member 'WBP_Extra_Costume_C_OnEntryFocused::CostumeEntry' has a wrong offset!");

// Function WBP_Extra_Costume.WBP_Extra_Costume_C.OnEntryPressed
// 0x0008 (0x0008 - 0x0000)
struct WBP_Extra_Costume_C_OnEntryPressed final
{
public:
	class UWBP_Extra_CostumeEntry_C*              CostumeEntry;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Costume_C_OnEntryPressed) == 0x000008, "Wrong alignment on WBP_Extra_Costume_C_OnEntryPressed");
static_assert(sizeof(WBP_Extra_Costume_C_OnEntryPressed) == 0x000008, "Wrong size on WBP_Extra_Costume_C_OnEntryPressed");
static_assert(offsetof(WBP_Extra_Costume_C_OnEntryPressed, CostumeEntry) == 0x000000, "Member 'WBP_Extra_Costume_C_OnEntryPressed::CostumeEntry' has a wrong offset!");

// Function WBP_Extra_Costume.WBP_Extra_Costume_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_Extra_Costume_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Costume_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Extra_Costume_C_OnFocusReceived");
static_assert(sizeof(WBP_Extra_Costume_C_OnFocusReceived) == 0x0001B8, "Wrong size on WBP_Extra_Costume_C_OnFocusReceived");
static_assert(offsetof(WBP_Extra_Costume_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Extra_Costume_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Extra_Costume_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Extra_Costume_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Extra_Costume_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_OnFocusReceived, CallFunc_GetChildAt_ReturnValue) == 0x0001B0, "Member 'WBP_Extra_Costume_C_OnFocusReceived::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");

// Function WBP_Extra_Costume.WBP_Extra_Costume_C.RefreshCompletionPercentage
// 0x0008 (0x0008 - 0x0000)
struct WBP_Extra_Costume_C_RefreshCompletionPercentage final
{
public:
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCompletionPercentageForItemType_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Costume_C_RefreshCompletionPercentage) == 0x000004, "Wrong alignment on WBP_Extra_Costume_C_RefreshCompletionPercentage");
static_assert(sizeof(WBP_Extra_Costume_C_RefreshCompletionPercentage) == 0x000008, "Wrong size on WBP_Extra_Costume_C_RefreshCompletionPercentage");
static_assert(offsetof(WBP_Extra_Costume_C_RefreshCompletionPercentage, CallFunc_MakeLiteralByte_ReturnValue) == 0x000000, "Member 'WBP_Extra_Costume_C_RefreshCompletionPercentage::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_RefreshCompletionPercentage, CallFunc_GetCompletionPercentageForItemType_ReturnValue) == 0x000004, "Member 'WBP_Extra_Costume_C_RefreshCompletionPercentage::CallFunc_GetCompletionPercentageForItemType_ReturnValue' has a wrong offset!");

// Function WBP_Extra_Costume.WBP_Extra_Costume_C.RefreshCostumeInformation
// 0x0010 (0x0010 - 0x0000)
struct WBP_Extra_Costume_C_RefreshCostumeInformation final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCostumeOwned_IsCostumeOwned;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEqual_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Costume_C_RefreshCostumeInformation) == 0x000008, "Wrong alignment on WBP_Extra_Costume_C_RefreshCostumeInformation");
static_assert(sizeof(WBP_Extra_Costume_C_RefreshCostumeInformation) == 0x000010, "Wrong size on WBP_Extra_Costume_C_RefreshCostumeInformation");
static_assert(offsetof(WBP_Extra_Costume_C_RefreshCostumeInformation, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_Extra_Costume_C_RefreshCostumeInformation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_RefreshCostumeInformation, CallFunc_IsCostumeOwned_IsCostumeOwned) == 0x000001, "Member 'WBP_Extra_Costume_C_RefreshCostumeInformation::CallFunc_IsCostumeOwned_IsCostumeOwned' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_RefreshCostumeInformation, CallFunc_IsEqual_ReturnValue) == 0x000002, "Member 'WBP_Extra_Costume_C_RefreshCostumeInformation::CallFunc_IsEqual_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_RefreshCostumeInformation, Temp_bool_Variable) == 0x000003, "Member 'WBP_Extra_Costume_C_RefreshCostumeInformation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_RefreshCostumeInformation, K2Node_Select_Default) == 0x000008, "Member 'WBP_Extra_Costume_C_RefreshCostumeInformation::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Extra_Costume.WBP_Extra_Costume_C.RefreshEntriesPrice
// 0x0020 (0x0020 - 0x0000)
struct WBP_Extra_Costume_C_RefreshEntriesPrice final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Extra_CostumeEntry_C*              CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Costume_C_RefreshEntriesPrice) == 0x000008, "Wrong alignment on WBP_Extra_Costume_C_RefreshEntriesPrice");
static_assert(sizeof(WBP_Extra_Costume_C_RefreshEntriesPrice) == 0x000020, "Wrong size on WBP_Extra_Costume_C_RefreshEntriesPrice");
static_assert(offsetof(WBP_Extra_Costume_C_RefreshEntriesPrice, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_Extra_Costume_C_RefreshEntriesPrice::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_RefreshEntriesPrice, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Extra_Costume_C_RefreshEntriesPrice::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_RefreshEntriesPrice, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Extra_Costume_C_RefreshEntriesPrice::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_RefreshEntriesPrice, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'WBP_Extra_Costume_C_RefreshEntriesPrice::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_RefreshEntriesPrice, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_Extra_Costume_C_RefreshEntriesPrice::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_RefreshEntriesPrice, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Extra_Costume_C_RefreshEntriesPrice::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Extra_Costume.WBP_Extra_Costume_C.RefreshSelectedCostumeEntries
// 0x0030 (0x0030 - 0x0000)
struct WBP_Extra_Costume_C_RefreshSelectedCostumeEntries final
{
public:
	class FName                                   EquippedCostumeID;                                 // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Extra_CostumeEntry_C*              CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Costume_C_RefreshSelectedCostumeEntries) == 0x000008, "Wrong alignment on WBP_Extra_Costume_C_RefreshSelectedCostumeEntries");
static_assert(sizeof(WBP_Extra_Costume_C_RefreshSelectedCostumeEntries) == 0x000030, "Wrong size on WBP_Extra_Costume_C_RefreshSelectedCostumeEntries");
static_assert(offsetof(WBP_Extra_Costume_C_RefreshSelectedCostumeEntries, EquippedCostumeID) == 0x000000, "Member 'WBP_Extra_Costume_C_RefreshSelectedCostumeEntries::EquippedCostumeID' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_RefreshSelectedCostumeEntries, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_Extra_Costume_C_RefreshSelectedCostumeEntries::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_RefreshSelectedCostumeEntries, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_Extra_Costume_C_RefreshSelectedCostumeEntries::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_RefreshSelectedCostumeEntries, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_Extra_Costume_C_RefreshSelectedCostumeEntries::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_RefreshSelectedCostumeEntries, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_Extra_Costume_C_RefreshSelectedCostumeEntries::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_RefreshSelectedCostumeEntries, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_Extra_Costume_C_RefreshSelectedCostumeEntries::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_RefreshSelectedCostumeEntries, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_Extra_Costume_C_RefreshSelectedCostumeEntries::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_RefreshSelectedCostumeEntries, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'WBP_Extra_Costume_C_RefreshSelectedCostumeEntries::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_RefreshSelectedCostumeEntries, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000029, "Member 'WBP_Extra_Costume_C_RefreshSelectedCostumeEntries::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function WBP_Extra_Costume.WBP_Extra_Costume_C.SpendCurrency
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Extra_Costume_C_SpendCurrency final
{
public:
	class FText                                   ItemName;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Cost;                                              // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0010)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	struct FCurrencyValue                         K2Node_MakeStruct_CurrencyValue;                   // 0x0078(0x0008)(NoDestructor)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0080(0x0048)(HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_1;                              // 0x00C8(0x0010)()
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Dialog_YesNo_C*                    CallFunc_Create_ReturnValue;                       // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Dialog_OK_C*                       CallFunc_Create_ReturnValue_1;                     // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_2;                              // 0x00F0(0x0010)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0100(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECurrencyType                                 Temp_byte_Variable;                                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_3;                              // 0x0118(0x0010)(ConstParm)
	class FText                                   K2Node_Select_Default;                             // 0x0128(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0138(0x0048)(HasGetValueTypeHash)
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0188(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0198(0x0010)()
	bool                                          CallFunc_CanSpendCurrency_ReturnValue;             // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Costume_C_SpendCurrency) == 0x000008, "Wrong alignment on WBP_Extra_Costume_C_SpendCurrency");
static_assert(sizeof(WBP_Extra_Costume_C_SpendCurrency) == 0x0001B0, "Wrong size on WBP_Extra_Costume_C_SpendCurrency");
static_assert(offsetof(WBP_Extra_Costume_C_SpendCurrency, ItemName) == 0x000000, "Member 'WBP_Extra_Costume_C_SpendCurrency::ItemName' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_SpendCurrency, Cost) == 0x000010, "Member 'WBP_Extra_Costume_C_SpendCurrency::Cost' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_SpendCurrency, Temp_text_Variable) == 0x000018, "Member 'WBP_Extra_Costume_C_SpendCurrency::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_SpendCurrency, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000028, "Member 'WBP_Extra_Costume_C_SpendCurrency::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_SpendCurrency, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'WBP_Extra_Costume_C_SpendCurrency::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_SpendCurrency, K2Node_MakeStruct_CurrencyValue) == 0x000078, "Member 'WBP_Extra_Costume_C_SpendCurrency::K2Node_MakeStruct_CurrencyValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_SpendCurrency, K2Node_MakeStruct_FormatArgumentData_1) == 0x000080, "Member 'WBP_Extra_Costume_C_SpendCurrency::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_SpendCurrency, Temp_text_Variable_1) == 0x0000C8, "Member 'WBP_Extra_Costume_C_SpendCurrency::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_SpendCurrency, CallFunc_MakeLiteralByte_ReturnValue) == 0x0000D8, "Member 'WBP_Extra_Costume_C_SpendCurrency::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_SpendCurrency, CallFunc_Create_ReturnValue) == 0x0000E0, "Member 'WBP_Extra_Costume_C_SpendCurrency::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_SpendCurrency, CallFunc_Create_ReturnValue_1) == 0x0000E8, "Member 'WBP_Extra_Costume_C_SpendCurrency::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_SpendCurrency, Temp_text_Variable_2) == 0x0000F0, "Member 'WBP_Extra_Costume_C_SpendCurrency::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_SpendCurrency, K2Node_CreateDelegate_OutputDelegate) == 0x000100, "Member 'WBP_Extra_Costume_C_SpendCurrency::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_SpendCurrency, Temp_byte_Variable) == 0x000110, "Member 'WBP_Extra_Costume_C_SpendCurrency::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_SpendCurrency, Temp_text_Variable_3) == 0x000118, "Member 'WBP_Extra_Costume_C_SpendCurrency::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_SpendCurrency, K2Node_Select_Default) == 0x000128, "Member 'WBP_Extra_Costume_C_SpendCurrency::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_SpendCurrency, K2Node_MakeStruct_FormatArgumentData_2) == 0x000138, "Member 'WBP_Extra_Costume_C_SpendCurrency::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_SpendCurrency, CallFunc_Get_ReturnValue) == 0x000180, "Member 'WBP_Extra_Costume_C_SpendCurrency::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_SpendCurrency, K2Node_MakeArray_Array) == 0x000188, "Member 'WBP_Extra_Costume_C_SpendCurrency::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_SpendCurrency, CallFunc_Format_ReturnValue) == 0x000198, "Member 'WBP_Extra_Costume_C_SpendCurrency::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_SpendCurrency, CallFunc_CanSpendCurrency_ReturnValue) == 0x0001A8, "Member 'WBP_Extra_Costume_C_SpendCurrency::CallFunc_CanSpendCurrency_ReturnValue' has a wrong offset!");

// Function WBP_Extra_Costume.WBP_Extra_Costume_C.CanDisplayCostumeData
// 0x02A8 (0x02A8 - 0x0000)
struct WBP_Extra_Costume_C_CanDisplayCostumeData final
{
public:
	struct FDataTableRowHandle                    Handle;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	bool                                          bResult;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEarlyAccessBuild_ReturnValue;           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCostumeOwned_IsCostumeOwned;            // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInventoryItemCostumeData              CallFunc_GetItemCostumeData_out_ItemData;          // 0x0018(0x0278)()
	bool                                          CallFunc_GetItemCostumeData_ReturnValue;           // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckItemConditions_ReturnValue;          // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Costume_C_CanDisplayCostumeData) == 0x000008, "Wrong alignment on WBP_Extra_Costume_C_CanDisplayCostumeData");
static_assert(sizeof(WBP_Extra_Costume_C_CanDisplayCostumeData) == 0x0002A8, "Wrong size on WBP_Extra_Costume_C_CanDisplayCostumeData");
static_assert(offsetof(WBP_Extra_Costume_C_CanDisplayCostumeData, Handle) == 0x000000, "Member 'WBP_Extra_Costume_C_CanDisplayCostumeData::Handle' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_CanDisplayCostumeData, bResult) == 0x000010, "Member 'WBP_Extra_Costume_C_CanDisplayCostumeData::bResult' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_CanDisplayCostumeData, CallFunc_IsEarlyAccessBuild_ReturnValue) == 0x000011, "Member 'WBP_Extra_Costume_C_CanDisplayCostumeData::CallFunc_IsEarlyAccessBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_CanDisplayCostumeData, CallFunc_IsCostumeOwned_IsCostumeOwned) == 0x000012, "Member 'WBP_Extra_Costume_C_CanDisplayCostumeData::CallFunc_IsCostumeOwned_IsCostumeOwned' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_CanDisplayCostumeData, CallFunc_Not_PreBool_ReturnValue) == 0x000013, "Member 'WBP_Extra_Costume_C_CanDisplayCostumeData::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_CanDisplayCostumeData, CallFunc_GetItemCostumeData_out_ItemData) == 0x000018, "Member 'WBP_Extra_Costume_C_CanDisplayCostumeData::CallFunc_GetItemCostumeData_out_ItemData' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_CanDisplayCostumeData, CallFunc_GetItemCostumeData_ReturnValue) == 0x000290, "Member 'WBP_Extra_Costume_C_CanDisplayCostumeData::CallFunc_GetItemCostumeData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_CanDisplayCostumeData, CallFunc_Get_ReturnValue) == 0x000298, "Member 'WBP_Extra_Costume_C_CanDisplayCostumeData::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_CanDisplayCostumeData, CallFunc_CheckItemConditions_ReturnValue) == 0x0002A0, "Member 'WBP_Extra_Costume_C_CanDisplayCostumeData::CallFunc_CheckItemConditions_ReturnValue' has a wrong offset!");

// Function WBP_Extra_Costume.WBP_Extra_Costume_C.IsCostumeOwned
// 0x0028 (0x0028 - 0x0000)
struct WBP_Extra_Costume_C_IsCostumeOwned final
{
public:
	struct FDataTableRowHandle                    CostumeDataRowHandle;                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          IsCostumeOwned_0;                                  // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasItem_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Costume_C_IsCostumeOwned) == 0x000008, "Wrong alignment on WBP_Extra_Costume_C_IsCostumeOwned");
static_assert(sizeof(WBP_Extra_Costume_C_IsCostumeOwned) == 0x000028, "Wrong size on WBP_Extra_Costume_C_IsCostumeOwned");
static_assert(offsetof(WBP_Extra_Costume_C_IsCostumeOwned, CostumeDataRowHandle) == 0x000000, "Member 'WBP_Extra_Costume_C_IsCostumeOwned::CostumeDataRowHandle' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_IsCostumeOwned, IsCostumeOwned_0) == 0x000010, "Member 'WBP_Extra_Costume_C_IsCostumeOwned::IsCostumeOwned_0' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Costume_C_IsCostumeOwned, CallFunc_Get_ReturnValue) == 0x000018, "Member 'WBP_Extra_Costume_C_IsCostumeOwned::CallFunc_Get_ReturnValue' has a wrong offset!");
