#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SpiritSkillSet

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Zion_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_SpiritSkillSet.WBP_SpiritSkillSet_C.ExecuteUbergraph_WBP_SpiritSkillSet
// 0x02B8 (0x02B8 - 0x0000)
struct WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    Temp_struct_Variable;                              // 0x0008(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SpiritSkillEntry_C*                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SpiritSkillEntry_C*                K2Node_CustomEvent_SpiritSkillEntry_1;             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SpiritSkillEntry_C*                K2Node_CustomEvent_SpiritSkillEntry;               // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInventoryItemSpiritData               CallFunc_GetDataTableRowFromName_OutRow;           // 0x0058(0x0208)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UWBP_SpiritSkillEntry_C* SpiritSkillEntry)> K2Node_CreateDelegate_OutputDelegate; // 0x0264(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_SpiritSkillEntry_C* SpiritSkillEntry)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0278(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_Select_Default;                             // 0x0290(0x0010)(NoDestructor)
	TArray<class UWBP_SpiritSkillEntry_C*>        K2Node_MakeArray_Array;                            // 0x02A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x02B0(0x0008)(NoDestructor)
};
static_assert(alignof(WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet) == 0x000008, "Wrong alignment on WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet");
static_assert(sizeof(WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet) == 0x0002B8, "Wrong size on WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet");
static_assert(offsetof(WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet, EntryPoint) == 0x000000, "Member 'WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet, Temp_struct_Variable) == 0x000008, "Member 'WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet, Temp_bool_Variable) == 0x000038, "Member 'WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet, K2Node_CustomEvent_SpiritSkillEntry_1) == 0x000040, "Member 'WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet::K2Node_CustomEvent_SpiritSkillEntry_1' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet, K2Node_CustomEvent_SpiritSkillEntry) == 0x000048, "Member 'WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet::K2Node_CustomEvent_SpiritSkillEntry' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet, CallFunc_Array_Find_ReturnValue) == 0x000050, "Member 'WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet, CallFunc_GetDataTableRowFromName_OutRow) == 0x000058, "Member 'WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000260, "Member 'WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet, K2Node_CreateDelegate_OutputDelegate) == 0x000264, "Member 'WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet, CallFunc_Array_Length_ReturnValue_1) == 0x000274, "Member 'WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet, K2Node_CreateDelegate_OutputDelegate_1) == 0x000278, "Member 'WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet, CallFunc_Less_IntInt_ReturnValue_1) == 0x000288, "Member 'WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet, K2Node_Select_Default) == 0x000290, "Member 'WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet, K2Node_MakeArray_Array) == 0x0002A0, "Member 'WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet, K2Node_Event_InFocusEvent) == 0x0002B0, "Member 'WBP_SpiritSkillSet_C_ExecuteUbergraph_WBP_SpiritSkillSet::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function WBP_SpiritSkillSet.WBP_SpiritSkillSet_C.Get First Valid Entry from Index Desc
// 0x0028 (0x0028 - 0x0000)
struct WBP_SpiritSkillSet_C_Get_First_Valid_Entry_from_Index_Desc final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SpiritSkillEntry_C*                SkillEntry;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_SpiritSkillEntry_C*                CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidEntry_IsValid;                     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpiritSkillSet_C_Get_First_Valid_Entry_from_Index_Desc) == 0x000008, "Wrong alignment on WBP_SpiritSkillSet_C_Get_First_Valid_Entry_from_Index_Desc");
static_assert(sizeof(WBP_SpiritSkillSet_C_Get_First_Valid_Entry_from_Index_Desc) == 0x000028, "Wrong size on WBP_SpiritSkillSet_C_Get_First_Valid_Entry_from_Index_Desc");
static_assert(offsetof(WBP_SpiritSkillSet_C_Get_First_Valid_Entry_from_Index_Desc, Index_0) == 0x000000, "Member 'WBP_SpiritSkillSet_C_Get_First_Valid_Entry_from_Index_Desc::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_Get_First_Valid_Entry_from_Index_Desc, SkillEntry) == 0x000008, "Member 'WBP_SpiritSkillSet_C_Get_First_Valid_Entry_from_Index_Desc::SkillEntry' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_Get_First_Valid_Entry_from_Index_Desc, Temp_int_Variable) == 0x000010, "Member 'WBP_SpiritSkillSet_C_Get_First_Valid_Entry_from_Index_Desc::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_Get_First_Valid_Entry_from_Index_Desc, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'WBP_SpiritSkillSet_C_Get_First_Valid_Entry_from_Index_Desc::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_Get_First_Valid_Entry_from_Index_Desc, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_SpiritSkillSet_C_Get_First_Valid_Entry_from_Index_Desc::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_Get_First_Valid_Entry_from_Index_Desc, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000020, "Member 'WBP_SpiritSkillSet_C_Get_First_Valid_Entry_from_Index_Desc::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_Get_First_Valid_Entry_from_Index_Desc, CallFunc_IsValidEntry_IsValid) == 0x000021, "Member 'WBP_SpiritSkillSet_C_Get_First_Valid_Entry_from_Index_Desc::CallFunc_IsValidEntry_IsValid' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_Get_First_Valid_Entry_from_Index_Desc, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'WBP_SpiritSkillSet_C_Get_First_Valid_Entry_from_Index_Desc::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_SpiritSkillSet.WBP_SpiritSkillSet_C.GetFocusedIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_SpiritSkillSet_C_GetFocusedIndex final
{
public:
	int32                                         FocusedIndex_0;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpiritSkillSet_C_GetFocusedIndex) == 0x000004, "Wrong alignment on WBP_SpiritSkillSet_C_GetFocusedIndex");
static_assert(sizeof(WBP_SpiritSkillSet_C_GetFocusedIndex) == 0x000004, "Wrong size on WBP_SpiritSkillSet_C_GetFocusedIndex");
static_assert(offsetof(WBP_SpiritSkillSet_C_GetFocusedIndex, FocusedIndex_0) == 0x000000, "Member 'WBP_SpiritSkillSet_C_GetFocusedIndex::FocusedIndex_0' has a wrong offset!");

// Function WBP_SpiritSkillSet.WBP_SpiritSkillSet_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_SpiritSkillSet_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_SpiritSkillSet_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_SpiritSkillSet_C_OnFocusReceived");
static_assert(sizeof(WBP_SpiritSkillSet_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_SpiritSkillSet_C_OnFocusReceived");
static_assert(offsetof(WBP_SpiritSkillSet_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_SpiritSkillSet_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_SpiritSkillSet_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_SpiritSkillSet_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_SpiritSkillSet_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_SpiritSkillSet.WBP_SpiritSkillSet_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_SpiritSkillSet_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_SpiritSkillSet_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on WBP_SpiritSkillSet_C_OnRemovedFromFocusPath");
static_assert(sizeof(WBP_SpiritSkillSet_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on WBP_SpiritSkillSet_C_OnRemovedFromFocusPath");
static_assert(offsetof(WBP_SpiritSkillSet_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_SpiritSkillSet_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_SpiritSkillSet.WBP_SpiritSkillSet_C.OnSpiritSkillEntryFocused
// 0x0008 (0x0008 - 0x0000)
struct WBP_SpiritSkillSet_C_OnSpiritSkillEntryFocused final
{
public:
	class UWBP_SpiritSkillEntry_C*                SpiritSkillEntry;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpiritSkillSet_C_OnSpiritSkillEntryFocused) == 0x000008, "Wrong alignment on WBP_SpiritSkillSet_C_OnSpiritSkillEntryFocused");
static_assert(sizeof(WBP_SpiritSkillSet_C_OnSpiritSkillEntryFocused) == 0x000008, "Wrong size on WBP_SpiritSkillSet_C_OnSpiritSkillEntryFocused");
static_assert(offsetof(WBP_SpiritSkillSet_C_OnSpiritSkillEntryFocused, SpiritSkillEntry) == 0x000000, "Member 'WBP_SpiritSkillSet_C_OnSpiritSkillEntryFocused::SpiritSkillEntry' has a wrong offset!");

// Function WBP_SpiritSkillSet.WBP_SpiritSkillSet_C.OnSpiritSkillEntryPressed
// 0x0008 (0x0008 - 0x0000)
struct WBP_SpiritSkillSet_C_OnSpiritSkillEntryPressed final
{
public:
	class UWBP_SpiritSkillEntry_C*                SpiritSkillEntry;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpiritSkillSet_C_OnSpiritSkillEntryPressed) == 0x000008, "Wrong alignment on WBP_SpiritSkillSet_C_OnSpiritSkillEntryPressed");
static_assert(sizeof(WBP_SpiritSkillSet_C_OnSpiritSkillEntryPressed) == 0x000008, "Wrong size on WBP_SpiritSkillSet_C_OnSpiritSkillEntryPressed");
static_assert(offsetof(WBP_SpiritSkillSet_C_OnSpiritSkillEntryPressed, SpiritSkillEntry) == 0x000000, "Member 'WBP_SpiritSkillSet_C_OnSpiritSkillEntryPressed::SpiritSkillEntry' has a wrong offset!");

// Function WBP_SpiritSkillSet.WBP_SpiritSkillSet_C.Refresh
// 0x0020 (0x0020 - 0x0000)
struct WBP_SpiritSkillSet_C_Refresh final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SpiritSkillEntry_C*                CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpiritSkillSet_C_Refresh) == 0x000008, "Wrong alignment on WBP_SpiritSkillSet_C_Refresh");
static_assert(sizeof(WBP_SpiritSkillSet_C_Refresh) == 0x000020, "Wrong size on WBP_SpiritSkillSet_C_Refresh");
static_assert(offsetof(WBP_SpiritSkillSet_C_Refresh, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_SpiritSkillSet_C_Refresh::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_Refresh, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_SpiritSkillSet_C_Refresh::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_Refresh, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_SpiritSkillSet_C_Refresh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_Refresh, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_SpiritSkillSet_C_Refresh::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_Refresh, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_SpiritSkillSet_C_Refresh::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_Refresh, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_SpiritSkillSet_C_Refresh::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_SpiritSkillSet.WBP_SpiritSkillSet_C.SetEntryCustomBoundaryNavigation
// 0x0020 (0x0020 - 0x0000)
struct WBP_SpiritSkillSet_C_SetEntryCustomBoundaryNavigation final
{
public:
	int32                                         EntryIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUINavigation                                 Direction;                                         // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EUINavigation Navigation)>     CustomDelegate;                                    // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_SpiritSkillEntry_C*                CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpiritSkillSet_C_SetEntryCustomBoundaryNavigation) == 0x000008, "Wrong alignment on WBP_SpiritSkillSet_C_SetEntryCustomBoundaryNavigation");
static_assert(sizeof(WBP_SpiritSkillSet_C_SetEntryCustomBoundaryNavigation) == 0x000020, "Wrong size on WBP_SpiritSkillSet_C_SetEntryCustomBoundaryNavigation");
static_assert(offsetof(WBP_SpiritSkillSet_C_SetEntryCustomBoundaryNavigation, EntryIndex) == 0x000000, "Member 'WBP_SpiritSkillSet_C_SetEntryCustomBoundaryNavigation::EntryIndex' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_SetEntryCustomBoundaryNavigation, Direction) == 0x000004, "Member 'WBP_SpiritSkillSet_C_SetEntryCustomBoundaryNavigation::Direction' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_SetEntryCustomBoundaryNavigation, CustomDelegate) == 0x000008, "Member 'WBP_SpiritSkillSet_C_SetEntryCustomBoundaryNavigation::CustomDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_SetEntryCustomBoundaryNavigation, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_SpiritSkillSet_C_SetEntryCustomBoundaryNavigation::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_SpiritSkillSet.WBP_SpiritSkillSet_C.SetEntryExplicitNavigation
// 0x0018 (0x0018 - 0x0000)
struct WBP_SpiritSkillSet_C_SetEntryExplicitNavigation final
{
public:
	int32                                         EntryIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUINavigation                                 Direction;                                         // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                TargetWidget;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SpiritSkillEntry_C*                CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpiritSkillSet_C_SetEntryExplicitNavigation) == 0x000008, "Wrong alignment on WBP_SpiritSkillSet_C_SetEntryExplicitNavigation");
static_assert(sizeof(WBP_SpiritSkillSet_C_SetEntryExplicitNavigation) == 0x000018, "Wrong size on WBP_SpiritSkillSet_C_SetEntryExplicitNavigation");
static_assert(offsetof(WBP_SpiritSkillSet_C_SetEntryExplicitNavigation, EntryIndex) == 0x000000, "Member 'WBP_SpiritSkillSet_C_SetEntryExplicitNavigation::EntryIndex' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_SetEntryExplicitNavigation, Direction) == 0x000004, "Member 'WBP_SpiritSkillSet_C_SetEntryExplicitNavigation::Direction' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_SetEntryExplicitNavigation, TargetWidget) == 0x000008, "Member 'WBP_SpiritSkillSet_C_SetEntryExplicitNavigation::TargetWidget' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_SetEntryExplicitNavigation, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_SpiritSkillSet_C_SetEntryExplicitNavigation::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_SpiritSkillSet.WBP_SpiritSkillSet_C.UnEquipAllSkills
// 0x0030 (0x0030 - 0x0000)
struct WBP_SpiritSkillSet_C_UnEquipAllSkills final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_SpiritSkillEntry_C*                CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkillComponent*                        CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESkillSlot                                    CallFunc_GetEquippedSkillSlotFromID_ReturnValue;   // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpiritSkillSet_C_UnEquipAllSkills) == 0x000008, "Wrong alignment on WBP_SpiritSkillSet_C_UnEquipAllSkills");
static_assert(sizeof(WBP_SpiritSkillSet_C_UnEquipAllSkills) == 0x000030, "Wrong size on WBP_SpiritSkillSet_C_UnEquipAllSkills");
static_assert(offsetof(WBP_SpiritSkillSet_C_UnEquipAllSkills, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_SpiritSkillSet_C_UnEquipAllSkills::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_UnEquipAllSkills, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_SpiritSkillSet_C_UnEquipAllSkills::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillSet_C_UnEquipAllSkills, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_SpiritSkillSet_C_UnEquipAllSkills::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
