#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MapIcon_CustomMarker

#include "Basic.hpp"

#include "Zion_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_MapIcon_CustomMarker.WBP_MapIcon_CustomMarker_C.OnSetScale
// 0x0004 (0x0004 - 0x0000)
struct WBP_MapIcon_CustomMarker_C_OnSetScale final
{
public:
	float                                         NewScale;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapIcon_CustomMarker_C_OnSetScale) == 0x000004, "Wrong alignment on WBP_MapIcon_CustomMarker_C_OnSetScale");
static_assert(sizeof(WBP_MapIcon_CustomMarker_C_OnSetScale) == 0x000004, "Wrong size on WBP_MapIcon_CustomMarker_C_OnSetScale");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_OnSetScale, NewScale) == 0x000000, "Member 'WBP_MapIcon_CustomMarker_C_OnSetScale::NewScale' has a wrong offset!");

// Function WBP_MapIcon_CustomMarker.WBP_MapIcon_CustomMarker_C.OnSetCustomMarkerData
// 0x0028 (0x0028 - 0x0000)
struct WBP_MapIcon_CustomMarker_C_OnSetCustomMarkerData final
{
public:
	struct FMapCustomMarkerIconData               NewCustomMarkerData;                               // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapIcon_CustomMarker_C_OnSetCustomMarkerData) == 0x000008, "Wrong alignment on WBP_MapIcon_CustomMarker_C_OnSetCustomMarkerData");
static_assert(sizeof(WBP_MapIcon_CustomMarker_C_OnSetCustomMarkerData) == 0x000028, "Wrong size on WBP_MapIcon_CustomMarker_C_OnSetCustomMarkerData");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_OnSetCustomMarkerData, NewCustomMarkerData) == 0x000000, "Member 'WBP_MapIcon_CustomMarker_C_OnSetCustomMarkerData::NewCustomMarkerData' has a wrong offset!");

// Function WBP_MapIcon_CustomMarker.WBP_MapIcon_CustomMarker_C.GetMarkerColor
// 0x0040 (0x0040 - 0x0000)
struct WBP_MapIcon_CustomMarker_C_GetMarkerColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMapCustomMarkerIconData               CallFunc_GetCustomMarkerIconData_ReturnValue;      // 0x0010(0x0028)(ConstParm, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapIcon_CustomMarker_C_GetMarkerColor) == 0x000008, "Wrong alignment on WBP_MapIcon_CustomMarker_C_GetMarkerColor");
static_assert(sizeof(WBP_MapIcon_CustomMarker_C_GetMarkerColor) == 0x000040, "Wrong size on WBP_MapIcon_CustomMarker_C_GetMarkerColor");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_GetMarkerColor, Color) == 0x000000, "Member 'WBP_MapIcon_CustomMarker_C_GetMarkerColor::Color' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_GetMarkerColor, CallFunc_GetCustomMarkerIconData_ReturnValue) == 0x000010, "Member 'WBP_MapIcon_CustomMarker_C_GetMarkerColor::CallFunc_GetCustomMarkerIconData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_GetMarkerColor, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_MapIcon_CustomMarker_C_GetMarkerColor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_GetMarkerColor, CallFunc_Percent_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_MapIcon_CustomMarker_C_GetMarkerColor::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_MapIcon_CustomMarker.WBP_MapIcon_CustomMarker_C.ExecuteUbergraph_WBP_MapIcon_CustomMarker
// 0x0170 (0x0170 - 0x0000)
struct WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCustomMarkerDisplayID_ReturnValue;     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
	struct FLinearColor                           CallFunc_GetMarkerColor_Color;                     // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewScale;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMapCustomMarkerIconData               K2Node_Event_NewCustomMarkerData;                  // 0x0078(0x0028)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBorderSlot*                            CallFunc_SlotAsBorderSlot_ReturnValue;             // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBorderSlot*                            CallFunc_SlotAsBorderSlot_ReturnValue_1;           // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1;   // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast_2;   // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast_3;   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2;   // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_3;   // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_4;   // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_X_ImplicitCast;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_Y_ImplicitCast;              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_5;   // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Left_ImplicitCast;               // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Top_ImplicitCast;                // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Right_ImplicitCast;              // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Bottom_ImplicitCast;             // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_SetFieldsInStruct_Size_ImplicitCast;        // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_DefaultFontSize_ImplicitCast;   // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDeprecateSlateVector2D                K2Node_SetFieldsInStruct_ImageSize_ImplicitCast;   // 0x0158(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_VariableSet_DefaultIconSize_ImplicitCast;   // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker) == 0x000008, "Wrong alignment on WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker");
static_assert(sizeof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker) == 0x000170, "Wrong size on WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, EntryPoint) == 0x000000, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, CallFunc_GetCustomMarkerDisplayID_ReturnValue) == 0x000004, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::CallFunc_GetCustomMarkerDisplayID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, CallFunc_GetMarkerColor_Color) == 0x000018, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::CallFunc_GetMarkerColor_Color' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, K2Node_Event_NewScale) == 0x000028, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::K2Node_Event_NewScale' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, CallFunc_MakeVector2D_ReturnValue) == 0x000030, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000048, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000050, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000058, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, K2Node_MakeStruct_Margin) == 0x000060, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000070, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, K2Node_Event_NewCustomMarkerData) == 0x000078, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::K2Node_Event_NewCustomMarkerData' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, CallFunc_Multiply_Vector2DVector2D_ReturnValue) == 0x0000A0, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::CallFunc_Multiply_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0000B0, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, CallFunc_SlotAsBorderSlot_ReturnValue) == 0x0000B8, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::CallFunc_SlotAsBorderSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x0000C0, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, CallFunc_FTrunc_ReturnValue) == 0x0000C8, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, CallFunc_SlotAsBorderSlot_ReturnValue_1) == 0x0000D0, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::CallFunc_SlotAsBorderSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x0000D8, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1) == 0x0000E0, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, CallFunc_Multiply_DoubleDouble_B_ImplicitCast_2) == 0x0000E8, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::CallFunc_Multiply_DoubleDouble_B_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, CallFunc_Multiply_DoubleDouble_B_ImplicitCast_3) == 0x0000F0, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::CallFunc_Multiply_DoubleDouble_B_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0000F8, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x000100, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2) == 0x000108, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_3) == 0x000110, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_4) == 0x000118, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, CallFunc_MakeVector2D_X_ImplicitCast) == 0x000120, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::CallFunc_MakeVector2D_X_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, CallFunc_MakeVector2D_Y_ImplicitCast) == 0x000128, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::CallFunc_MakeVector2D_Y_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_5) == 0x000130, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, K2Node_MakeStruct_Left_ImplicitCast) == 0x000138, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::K2Node_MakeStruct_Left_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, K2Node_MakeStruct_Top_ImplicitCast) == 0x00013C, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::K2Node_MakeStruct_Top_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, K2Node_MakeStruct_Right_ImplicitCast) == 0x000140, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::K2Node_MakeStruct_Right_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, K2Node_MakeStruct_Bottom_ImplicitCast) == 0x000144, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::K2Node_MakeStruct_Bottom_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, K2Node_SetFieldsInStruct_Size_ImplicitCast) == 0x000148, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::K2Node_SetFieldsInStruct_Size_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, K2Node_VariableSet_DefaultFontSize_ImplicitCast) == 0x000150, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::K2Node_VariableSet_DefaultFontSize_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, K2Node_SetFieldsInStruct_ImageSize_ImplicitCast) == 0x000158, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::K2Node_SetFieldsInStruct_ImageSize_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker, K2Node_VariableSet_DefaultIconSize_ImplicitCast) == 0x000160, "Member 'WBP_MapIcon_CustomMarker_C_ExecuteUbergraph_WBP_MapIcon_CustomMarker::K2Node_VariableSet_DefaultIconSize_ImplicitCast' has a wrong offset!");

}

