#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Recollection_Page_BossRush

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Recollection_Page_BossRush.WBP_Recollection_Page_BossRush_C.BndEvt__WBP_Recollection_Page_BossRush_WBP_Button_Difficulty_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_Recollection_Page_BossRush_C_BndEvt__WBP_Recollection_Page_BossRush_WBP_Button_Difficulty_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Recollection_Page_BossRush_C_BndEvt__WBP_Recollection_Page_BossRush_WBP_Button_Difficulty_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Recollection_Page_BossRush_C_BndEvt__WBP_Recollection_Page_BossRush_WBP_Button_Difficulty_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Recollection_Page_BossRush_C_BndEvt__WBP_Recollection_Page_BossRush_WBP_Button_Difficulty_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_Recollection_Page_BossRush_C_BndEvt__WBP_Recollection_Page_BossRush_WBP_Button_Difficulty_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_BndEvt__WBP_Recollection_Page_BossRush_WBP_Button_Difficulty_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_Recollection_Page_BossRush_C_BndEvt__WBP_Recollection_Page_BossRush_WBP_Button_Difficulty_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_Recollection_Page_BossRush.WBP_Recollection_Page_BossRush_C.BndEvt__WBP_Recollection_Page_BossRush_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_Recollection_Page_BossRush_C_BndEvt__WBP_Recollection_Page_BossRush_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Recollection_Page_BossRush_C_BndEvt__WBP_Recollection_Page_BossRush_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Recollection_Page_BossRush_C_BndEvt__WBP_Recollection_Page_BossRush_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Recollection_Page_BossRush_C_BndEvt__WBP_Recollection_Page_BossRush_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_Recollection_Page_BossRush_C_BndEvt__WBP_Recollection_Page_BossRush_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_BndEvt__WBP_Recollection_Page_BossRush_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_Recollection_Page_BossRush_C_BndEvt__WBP_Recollection_Page_BossRush_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_Recollection_Page_BossRush.WBP_Recollection_Page_BossRush_C.ExecuteUbergraph_WBP_Recollection_Page_BossRush
// 0x0150 (0x0150 - 0x0000)
struct WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_1;             // 0x0008(0x0040)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameModeZion*                          CallFunc_Get_ReturnValue;                          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNewGamePlusAvailable_bResult;           // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNativeWidgetHost*                      K2Node_Event_FocusedWidgetHost;                    // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_FocusEvent;                           // 0x0070(0x0008)(ConstParm, NoDestructor)
	class UWBP_Difficulty_C*                      CallFunc_Create_ReturnValue;                       // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0080(0x0010)(ConstParm)
	bool                                          Temp_bool_Variable;                                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSubsystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidgetFooter*                      CallFunc_GetActiveFooter_ReturnValue;              // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent;               // 0x00B0(0x0040)()
	class UWBP_Dialog_YesNo_C*                    CallFunc_Create_ReturnValue_1;                     // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        K2Node_MakeArray_Array;                            // 0x00F8(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFooterData>                    K2Node_Select_Default;                             // 0x0110(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EDifficultyPreset SelectedPreset, const struct FDifficultySettings& SelectedSettings)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0120(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EDifficultyPreset                             K2Node_CustomEvent_SelectedPreset;                 // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDifficultySettings                    K2Node_CustomEvent_SelectedSettings;               // 0x0134(0x0018)(NoDestructor)
};
static_assert(alignof(WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush) == 0x000008, "Wrong alignment on WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush");
static_assert(sizeof(WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush) == 0x000150, "Wrong size on WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush, EntryPoint) == 0x000000, "Member 'WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush, K2Node_ComponentBoundEvent_KeyEvent_1) == 0x000008, "Member 'WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush::K2Node_ComponentBoundEvent_KeyEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush, CallFunc_Get_ReturnValue) == 0x000058, "Member 'WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush, CallFunc_IsNewGamePlusAvailable_bResult) == 0x000060, "Member 'WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush::CallFunc_IsNewGamePlusAvailable_bResult' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush, CallFunc_SelectInt_ReturnValue) == 0x000064, "Member 'WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush, K2Node_Event_FocusedWidgetHost) == 0x000068, "Member 'WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush::K2Node_Event_FocusedWidgetHost' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush, K2Node_Event_FocusEvent) == 0x000070, "Member 'WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush::K2Node_Event_FocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush, CallFunc_Create_ReturnValue) == 0x000078, "Member 'WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush, Temp_text_Variable) == 0x000080, "Member 'WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush, Temp_bool_Variable) == 0x000090, "Member 'WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000098, "Member 'WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush, CallFunc_GetActiveFooter_ReturnValue) == 0x0000A0, "Member 'WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush::CallFunc_GetActiveFooter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush, K2Node_ComponentBoundEvent_KeyEvent) == 0x0000B0, "Member 'WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush::K2Node_ComponentBoundEvent_KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush, CallFunc_Create_ReturnValue_1) == 0x0000F0, "Member 'WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush, K2Node_MakeArray_Array) == 0x0000F8, "Member 'WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush, CallFunc_Array_Contains_ReturnValue) == 0x000108, "Member 'WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush, K2Node_Select_Default) == 0x000110, "Member 'WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush, K2Node_CreateDelegate_OutputDelegate_1) == 0x000120, "Member 'WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush, K2Node_CustomEvent_SelectedPreset) == 0x000130, "Member 'WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush::K2Node_CustomEvent_SelectedPreset' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush, K2Node_CustomEvent_SelectedSettings) == 0x000134, "Member 'WBP_Recollection_Page_BossRush_C_ExecuteUbergraph_WBP_Recollection_Page_BossRush::K2Node_CustomEvent_SelectedSettings' has a wrong offset!");

// Function WBP_Recollection_Page_BossRush.WBP_Recollection_Page_BossRush_C.GetMaxBossesDefeated
// 0x0018 (0x0018 - 0x0000)
struct WBP_Recollection_Page_BossRush_C_GetMaxBossesDefeated final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeZion*                          CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxBossesDefeatedCount_ReturnValue;    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_Page_BossRush_C_GetMaxBossesDefeated) == 0x000008, "Wrong alignment on WBP_Recollection_Page_BossRush_C_GetMaxBossesDefeated");
static_assert(sizeof(WBP_Recollection_Page_BossRush_C_GetMaxBossesDefeated) == 0x000018, "Wrong size on WBP_Recollection_Page_BossRush_C_GetMaxBossesDefeated");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_GetMaxBossesDefeated, Count) == 0x000000, "Member 'WBP_Recollection_Page_BossRush_C_GetMaxBossesDefeated::Count' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_GetMaxBossesDefeated, CallFunc_Get_ReturnValue) == 0x000008, "Member 'WBP_Recollection_Page_BossRush_C_GetMaxBossesDefeated::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_GetMaxBossesDefeated, CallFunc_GetMaxBossesDefeatedCount_ReturnValue) == 0x000010, "Member 'WBP_Recollection_Page_BossRush_C_GetMaxBossesDefeated::CallFunc_GetMaxBossesDefeatedCount_ReturnValue' has a wrong offset!");

// Function WBP_Recollection_Page_BossRush.WBP_Recollection_Page_BossRush_C.InitializeNewGameDifficultyLabel
// 0x0090 (0x0090 - 0x0000)
struct WBP_Recollection_Page_BossRush_C_InitializeNewGameDifficultyLabel final
{
public:
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0000(0x0010)()
	class AGameModeZion*                          CallFunc_Get_ReturnValue;                          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxEnvironmentLevel_ReturnValue;       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0080(0x0010)()
};
static_assert(alignof(WBP_Recollection_Page_BossRush_C_InitializeNewGameDifficultyLabel) == 0x000008, "Wrong alignment on WBP_Recollection_Page_BossRush_C_InitializeNewGameDifficultyLabel");
static_assert(sizeof(WBP_Recollection_Page_BossRush_C_InitializeNewGameDifficultyLabel) == 0x000090, "Wrong size on WBP_Recollection_Page_BossRush_C_InitializeNewGameDifficultyLabel");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_InitializeNewGameDifficultyLabel, CallFunc_MakeLiteralText_ReturnValue) == 0x000000, "Member 'WBP_Recollection_Page_BossRush_C_InitializeNewGameDifficultyLabel::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_InitializeNewGameDifficultyLabel, CallFunc_Get_ReturnValue) == 0x000010, "Member 'WBP_Recollection_Page_BossRush_C_InitializeNewGameDifficultyLabel::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_InitializeNewGameDifficultyLabel, CallFunc_GetMaxEnvironmentLevel_ReturnValue) == 0x000018, "Member 'WBP_Recollection_Page_BossRush_C_InitializeNewGameDifficultyLabel::CallFunc_GetMaxEnvironmentLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_InitializeNewGameDifficultyLabel, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000020, "Member 'WBP_Recollection_Page_BossRush_C_InitializeNewGameDifficultyLabel::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_InitializeNewGameDifficultyLabel, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'WBP_Recollection_Page_BossRush_C_InitializeNewGameDifficultyLabel::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_InitializeNewGameDifficultyLabel, K2Node_MakeArray_Array) == 0x000070, "Member 'WBP_Recollection_Page_BossRush_C_InitializeNewGameDifficultyLabel::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_InitializeNewGameDifficultyLabel, CallFunc_Format_ReturnValue) == 0x000080, "Member 'WBP_Recollection_Page_BossRush_C_InitializeNewGameDifficultyLabel::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_Recollection_Page_BossRush.WBP_Recollection_Page_BossRush_C.IsBossRushAlreadyCleared
// 0x0020 (0x0020 - 0x0000)
struct WBP_Recollection_Page_BossRush_C_IsBossRushAlreadyCleared final
{
public:
	bool                                          bResult;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeZion*                          CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRecollectionBossRushRecordData        CallFunc_GetRecordData_ReturnValue;                // 0x0010(0x0004)(NoDestructor)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_Page_BossRush_C_IsBossRushAlreadyCleared) == 0x000008, "Wrong alignment on WBP_Recollection_Page_BossRush_C_IsBossRushAlreadyCleared");
static_assert(sizeof(WBP_Recollection_Page_BossRush_C_IsBossRushAlreadyCleared) == 0x000020, "Wrong size on WBP_Recollection_Page_BossRush_C_IsBossRushAlreadyCleared");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_IsBossRushAlreadyCleared, bResult) == 0x000000, "Member 'WBP_Recollection_Page_BossRush_C_IsBossRushAlreadyCleared::bResult' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_IsBossRushAlreadyCleared, CallFunc_Get_ReturnValue) == 0x000008, "Member 'WBP_Recollection_Page_BossRush_C_IsBossRushAlreadyCleared::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_IsBossRushAlreadyCleared, CallFunc_GetRecordData_ReturnValue) == 0x000010, "Member 'WBP_Recollection_Page_BossRush_C_IsBossRushAlreadyCleared::CallFunc_GetRecordData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_IsBossRushAlreadyCleared, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000014, "Member 'WBP_Recollection_Page_BossRush_C_IsBossRushAlreadyCleared::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_IsBossRushAlreadyCleared, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000018, "Member 'WBP_Recollection_Page_BossRush_C_IsBossRushAlreadyCleared::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_Recollection_Page_BossRush.WBP_Recollection_Page_BossRush_C.IsNewGamePlusAvailable
// 0x0018 (0x0018 - 0x0000)
struct WBP_Recollection_Page_BossRush_C_IsNewGamePlusAvailable final
{
public:
	bool                                          bResult;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNewGamePlusEnabled_ReturnValue;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeZion*                          CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInNewGamePlus_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_Page_BossRush_C_IsNewGamePlusAvailable) == 0x000008, "Wrong alignment on WBP_Recollection_Page_BossRush_C_IsNewGamePlusAvailable");
static_assert(sizeof(WBP_Recollection_Page_BossRush_C_IsNewGamePlusAvailable) == 0x000018, "Wrong size on WBP_Recollection_Page_BossRush_C_IsNewGamePlusAvailable");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_IsNewGamePlusAvailable, bResult) == 0x000000, "Member 'WBP_Recollection_Page_BossRush_C_IsNewGamePlusAvailable::bResult' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_IsNewGamePlusAvailable, CallFunc_IsNewGamePlusEnabled_ReturnValue) == 0x000001, "Member 'WBP_Recollection_Page_BossRush_C_IsNewGamePlusAvailable::CallFunc_IsNewGamePlusEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_IsNewGamePlusAvailable, CallFunc_Get_ReturnValue) == 0x000008, "Member 'WBP_Recollection_Page_BossRush_C_IsNewGamePlusAvailable::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_IsNewGamePlusAvailable, CallFunc_IsInNewGamePlus_ReturnValue) == 0x000010, "Member 'WBP_Recollection_Page_BossRush_C_IsNewGamePlusAvailable::CallFunc_IsInNewGamePlus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_IsNewGamePlusAvailable, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'WBP_Recollection_Page_BossRush_C_IsNewGamePlusAvailable::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_IsNewGamePlusAvailable, CallFunc_BooleanAND_ReturnValue) == 0x000012, "Member 'WBP_Recollection_Page_BossRush_C_IsNewGamePlusAvailable::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_Recollection_Page_BossRush.WBP_Recollection_Page_BossRush_C.OnChildFocused
// 0x0010 (0x0010 - 0x0000)
struct WBP_Recollection_Page_BossRush_C_OnChildFocused final
{
public:
	class UNativeWidgetHost*                      FocusedWidgetHost;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            FocusEvent;                                        // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(WBP_Recollection_Page_BossRush_C_OnChildFocused) == 0x000008, "Wrong alignment on WBP_Recollection_Page_BossRush_C_OnChildFocused");
static_assert(sizeof(WBP_Recollection_Page_BossRush_C_OnChildFocused) == 0x000010, "Wrong size on WBP_Recollection_Page_BossRush_C_OnChildFocused");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_OnChildFocused, FocusedWidgetHost) == 0x000000, "Member 'WBP_Recollection_Page_BossRush_C_OnChildFocused::FocusedWidgetHost' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_OnChildFocused, FocusEvent) == 0x000008, "Member 'WBP_Recollection_Page_BossRush_C_OnChildFocused::FocusEvent' has a wrong offset!");

// Function WBP_Recollection_Page_BossRush.WBP_Recollection_Page_BossRush_C.OnCloseBossRushDifficultySettings
// 0x001C (0x001C - 0x0000)
struct WBP_Recollection_Page_BossRush_C_OnCloseBossRushDifficultySettings final
{
public:
	EDifficultyPreset                             SelectedPreset;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDifficultySettings                    SelectedSettings;                                  // 0x0004(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Recollection_Page_BossRush_C_OnCloseBossRushDifficultySettings) == 0x000004, "Wrong alignment on WBP_Recollection_Page_BossRush_C_OnCloseBossRushDifficultySettings");
static_assert(sizeof(WBP_Recollection_Page_BossRush_C_OnCloseBossRushDifficultySettings) == 0x00001C, "Wrong size on WBP_Recollection_Page_BossRush_C_OnCloseBossRushDifficultySettings");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_OnCloseBossRushDifficultySettings, SelectedPreset) == 0x000000, "Member 'WBP_Recollection_Page_BossRush_C_OnCloseBossRushDifficultySettings::SelectedPreset' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_OnCloseBossRushDifficultySettings, SelectedSettings) == 0x000004, "Member 'WBP_Recollection_Page_BossRush_C_OnCloseBossRushDifficultySettings::SelectedSettings' has a wrong offset!");

// Function WBP_Recollection_Page_BossRush.WBP_Recollection_Page_BossRush_C.OnFocusReceived
// 0x01C0 (0x01C0 - 0x0000)
struct WBP_Recollection_Page_BossRush_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNewGamePlusAvailable_bResult;           // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0100(0x00B8)()
	class UWidget*                                K2Node_Select_Default;                             // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_Page_BossRush_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Recollection_Page_BossRush_C_OnFocusReceived");
static_assert(sizeof(WBP_Recollection_Page_BossRush_C_OnFocusReceived) == 0x0001C0, "Wrong size on WBP_Recollection_Page_BossRush_C_OnFocusReceived");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Recollection_Page_BossRush_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Recollection_Page_BossRush_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Recollection_Page_BossRush_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_OnFocusReceived, Temp_bool_Variable) == 0x0000F8, "Member 'WBP_Recollection_Page_BossRush_C_OnFocusReceived::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_OnFocusReceived, CallFunc_IsNewGamePlusAvailable_bResult) == 0x0000F9, "Member 'WBP_Recollection_Page_BossRush_C_OnFocusReceived::CallFunc_IsNewGamePlusAvailable_bResult' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000100, "Member 'WBP_Recollection_Page_BossRush_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_OnFocusReceived, K2Node_Select_Default) == 0x0001B8, "Member 'WBP_Recollection_Page_BossRush_C_OnFocusReceived::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Recollection_Page_BossRush.WBP_Recollection_Page_BossRush_C.OnPressContext
// 0x0268 (0x0268 - 0x0000)
struct WBP_Recollection_Page_BossRush_C_OnPressContext final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_OnPressContext_ReturnValue;               // 0x00F8(0x00B8)()
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x01B0(0x00B8)()
};
static_assert(alignof(WBP_Recollection_Page_BossRush_C_OnPressContext) == 0x000008, "Wrong alignment on WBP_Recollection_Page_BossRush_C_OnPressContext");
static_assert(sizeof(WBP_Recollection_Page_BossRush_C_OnPressContext) == 0x000268, "Wrong size on WBP_Recollection_Page_BossRush_C_OnPressContext");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_OnPressContext, KeyEvent) == 0x000000, "Member 'WBP_Recollection_Page_BossRush_C_OnPressContext::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_OnPressContext, ReturnValue) == 0x000040, "Member 'WBP_Recollection_Page_BossRush_C_OnPressContext::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_OnPressContext, CallFunc_OnPressContext_ReturnValue) == 0x0000F8, "Member 'WBP_Recollection_Page_BossRush_C_OnPressContext::CallFunc_OnPressContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_OnPressContext, CallFunc_Handled_ReturnValue) == 0x0001B0, "Member 'WBP_Recollection_Page_BossRush_C_OnPressContext::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Recollection_Page_BossRush.WBP_Recollection_Page_BossRush_C.RefreshNoRecordDisplay
// 0x0088 (0x0088 - 0x0000)
struct WBP_Recollection_Page_BossRush_C_RefreshNoRecordDisplay final
{
public:
	int32                                         CallFunc_GetMaxBossesDefeated_Count;               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxBossesDefeated_Count_1;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_IsBossRushAlreadyCleared_bResult;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0070(0x0010)()
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_Page_BossRush_C_RefreshNoRecordDisplay) == 0x000008, "Wrong alignment on WBP_Recollection_Page_BossRush_C_RefreshNoRecordDisplay");
static_assert(sizeof(WBP_Recollection_Page_BossRush_C_RefreshNoRecordDisplay) == 0x000088, "Wrong size on WBP_Recollection_Page_BossRush_C_RefreshNoRecordDisplay");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_RefreshNoRecordDisplay, CallFunc_GetMaxBossesDefeated_Count) == 0x000000, "Member 'WBP_Recollection_Page_BossRush_C_RefreshNoRecordDisplay::CallFunc_GetMaxBossesDefeated_Count' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_RefreshNoRecordDisplay, CallFunc_GetMaxBossesDefeated_Count_1) == 0x000004, "Member 'WBP_Recollection_Page_BossRush_C_RefreshNoRecordDisplay::CallFunc_GetMaxBossesDefeated_Count_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_RefreshNoRecordDisplay, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000008, "Member 'WBP_Recollection_Page_BossRush_C_RefreshNoRecordDisplay::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_RefreshNoRecordDisplay, K2Node_MakeStruct_FormatArgumentData) == 0x000010, "Member 'WBP_Recollection_Page_BossRush_C_RefreshNoRecordDisplay::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_RefreshNoRecordDisplay, CallFunc_IsBossRushAlreadyCleared_bResult) == 0x000058, "Member 'WBP_Recollection_Page_BossRush_C_RefreshNoRecordDisplay::CallFunc_IsBossRushAlreadyCleared_bResult' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_RefreshNoRecordDisplay, K2Node_MakeArray_Array) == 0x000060, "Member 'WBP_Recollection_Page_BossRush_C_RefreshNoRecordDisplay::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_RefreshNoRecordDisplay, CallFunc_Format_ReturnValue) == 0x000070, "Member 'WBP_Recollection_Page_BossRush_C_RefreshNoRecordDisplay::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_RefreshNoRecordDisplay, CallFunc_SelectInt_ReturnValue) == 0x000080, "Member 'WBP_Recollection_Page_BossRush_C_RefreshNoRecordDisplay::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function WBP_Recollection_Page_BossRush.WBP_Recollection_Page_BossRush_C.RefreshPresetDisplay
// 0x0138 (0x0138 - 0x0000)
struct WBP_Recollection_Page_BossRush_C_RefreshPresetDisplay final
{
public:
	EDifficultyPreset                             Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0018(0x0010)()
	class FText                                   Temp_text_Variable_2;                              // 0x0028(0x0010)()
	class FText                                   Temp_text_Variable_3;                              // 0x0038(0x0010)()
	class FText                                   Temp_text_Variable_4;                              // 0x0048(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0058(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0068(0x0048)(HasGetValueTypeHash)
	class UDifficultySystemComponent*             CallFunc_Get_ReturnValue;                          // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EDifficultyPreset                             CallFunc_GetDifficultyPresetForMode_ReturnValue;   // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00C0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00D0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0118(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0128(0x0010)()
};
static_assert(alignof(WBP_Recollection_Page_BossRush_C_RefreshPresetDisplay) == 0x000008, "Wrong alignment on WBP_Recollection_Page_BossRush_C_RefreshPresetDisplay");
static_assert(sizeof(WBP_Recollection_Page_BossRush_C_RefreshPresetDisplay) == 0x000138, "Wrong size on WBP_Recollection_Page_BossRush_C_RefreshPresetDisplay");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_RefreshPresetDisplay, Temp_byte_Variable) == 0x000000, "Member 'WBP_Recollection_Page_BossRush_C_RefreshPresetDisplay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_BossRush_C_RefreshPresetDisplay, Temp_text_Variable) == 0x000008, "Member 'WBP_Recollection_Page_BossRush_C_RefreshPresetDisplay::Temp_text_Variable' has a wrong offset!");
