#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TextureChecker_Holder

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TextureChecker_Holder.WBP_TextureChecker_Holder_C
// 0x0020 (0x0300 - 0x02E0)
class UWBP_TextureChecker_Holder_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           TextureInfosHolder;                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             Texture;                                           // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	ETextureGroup                                 Texture_Group;                                     // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetTextureInfos();
	void RefreshTextureInfo();
	void ExecuteUbergraph_WBP_TextureChecker_Holder(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TextureChecker_Holder_C">();
	}
	static class UWBP_TextureChecker_Holder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TextureChecker_Holder_C>();
	}
};
static_assert(alignof(UWBP_TextureChecker_Holder_C) == 0x000008, "Wrong alignment on UWBP_TextureChecker_Holder_C");
static_assert(sizeof(UWBP_TextureChecker_Holder_C) == 0x000300, "Wrong size on UWBP_TextureChecker_Holder_C");
static_assert(offsetof(UWBP_TextureChecker_Holder_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_TextureChecker_Holder_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TextureChecker_Holder_C, TextureInfosHolder) == 0x0002E8, "Member 'UWBP_TextureChecker_Holder_C::TextureInfosHolder' has a wrong offset!");
static_assert(offsetof(UWBP_TextureChecker_Holder_C, Texture) == 0x0002F0, "Member 'UWBP_TextureChecker_Holder_C::Texture' has a wrong offset!");
static_assert(offsetof(UWBP_TextureChecker_Holder_C, Texture_Group) == 0x0002F8, "Member 'UWBP_TextureChecker_Holder_C::Texture_Group' has a wrong offset!");

}

