#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MapIconDetails_CustomMarker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MapIconDetails_CustomMarker.WBP_MapIconDetails_CustomMarker_C
// 0x0058 (0x04C8 - 0x0470)
class UWBP_MapIconDetails_CustomMarker_C final : public UUserWidgetMapIconDetails
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideAnim;                                          // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ButtonBG;                                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CustomMarkerName;                                  // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MouseClickButton;                                  // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_1;                                         // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URefreshableRichTextBlock*              RemoveText;                                        // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UUserWidgetMapIcon_CustomMarker* CustomMarkerIcon)> OnRequestRemoveCustomMarker; // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IgnoreCanFastTravelCheck;                          // 0x04C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowed;                                           // 0x04C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void BndEvt__WBP_MapIconDetails_CustomMarker_Button_108_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_MapIconDetails_CustomMarker(int32 EntryPoint);
	void OnFinish_0DD8E0764B5AE8D4D5B3709D3C5744E7();
	void OnFinish_F4B1F41246E6B9841EF57584F748C3C6();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnPressRemove();
	void OnRemoveIconDetails(bool bInstant);
	void RefreshWidgetDetails();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MapIconDetails_CustomMarker_C">();
	}
	static class UWBP_MapIconDetails_CustomMarker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MapIconDetails_CustomMarker_C>();
	}
};
static_assert(alignof(UWBP_MapIconDetails_CustomMarker_C) == 0x000008, "Wrong alignment on UWBP_MapIconDetails_CustomMarker_C");
static_assert(sizeof(UWBP_MapIconDetails_CustomMarker_C) == 0x0004C8, "Wrong size on UWBP_MapIconDetails_CustomMarker_C");
static_assert(offsetof(UWBP_MapIconDetails_CustomMarker_C, UberGraphFrame) == 0x000470, "Member 'UWBP_MapIconDetails_CustomMarker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_CustomMarker_C, HideAnim) == 0x000478, "Member 'UWBP_MapIconDetails_CustomMarker_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_CustomMarker_C, ShowAnim) == 0x000480, "Member 'UWBP_MapIconDetails_CustomMarker_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_CustomMarker_C, ButtonBG) == 0x000488, "Member 'UWBP_MapIconDetails_CustomMarker_C::ButtonBG' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_CustomMarker_C, CustomMarkerName) == 0x000490, "Member 'UWBP_MapIconDetails_CustomMarker_C::CustomMarkerName' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_CustomMarker_C, MouseClickButton) == 0x000498, "Member 'UWBP_MapIconDetails_CustomMarker_C::MouseClickButton' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_CustomMarker_C, Overlay_1) == 0x0004A0, "Member 'UWBP_MapIconDetails_CustomMarker_C::Overlay_1' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_CustomMarker_C, RemoveText) == 0x0004A8, "Member 'UWBP_MapIconDetails_CustomMarker_C::RemoveText' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_CustomMarker_C, OnRequestRemoveCustomMarker) == 0x0004B0, "Member 'UWBP_MapIconDetails_CustomMarker_C::OnRequestRemoveCustomMarker' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_CustomMarker_C, IgnoreCanFastTravelCheck) == 0x0004C0, "Member 'UWBP_MapIconDetails_CustomMarker_C::IgnoreCanFastTravelCheck' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_CustomMarker_C, bShowed) == 0x0004C1, "Member 'UWBP_MapIconDetails_CustomMarker_C::bShowed' has a wrong offset!");

}

