#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RestPointList_MapAreaName

#include "Basic.hpp"

#include "Zion_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RestPointList_MapAreaName.WBP_RestPointList_MapAreaName_C
// 0x0018 (0x0478 - 0x0460)
class UWBP_RestPointList_MapAreaName_C final : public UUserWidgetZion
{
public:
	class UImage*                                 Line;                                              // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MapAreaName;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MapArea_Completed_C*               WBP_MapArea_Completed;                             // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetCompleteState(bool CompleteState);
	void SetMapAreaName(const class FText& MapAreaName_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RestPointList_MapAreaName_C">();
	}
	static class UWBP_RestPointList_MapAreaName_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RestPointList_MapAreaName_C>();
	}
};
static_assert(alignof(UWBP_RestPointList_MapAreaName_C) == 0x000008, "Wrong alignment on UWBP_RestPointList_MapAreaName_C");
static_assert(sizeof(UWBP_RestPointList_MapAreaName_C) == 0x000478, "Wrong size on UWBP_RestPointList_MapAreaName_C");
static_assert(offsetof(UWBP_RestPointList_MapAreaName_C, Line) == 0x000460, "Member 'UWBP_RestPointList_MapAreaName_C::Line' has a wrong offset!");
static_assert(offsetof(UWBP_RestPointList_MapAreaName_C, MapAreaName) == 0x000468, "Member 'UWBP_RestPointList_MapAreaName_C::MapAreaName' has a wrong offset!");
static_assert(offsetof(UWBP_RestPointList_MapAreaName_C, WBP_MapArea_Completed) == 0x000470, "Member 'UWBP_RestPointList_MapAreaName_C::WBP_MapArea_Completed' has a wrong offset!");

}

