#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ZoneName

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ZoneName.WBP_ZoneName_C
// 0x0028 (0x0308 - 0x02E0)
class UWBP_ZoneName_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Interactable;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         InteractableContainer;                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Zone;                                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ZoneLevel;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ZoneName(int32 EntryPoint);
	void GetClosest(TArray<class AActor*>& Actors, class AActor** closest);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ZoneName_C">();
	}
	static class UWBP_ZoneName_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ZoneName_C>();
	}
};
static_assert(alignof(UWBP_ZoneName_C) == 0x000008, "Wrong alignment on UWBP_ZoneName_C");
static_assert(sizeof(UWBP_ZoneName_C) == 0x000308, "Wrong size on UWBP_ZoneName_C");
static_assert(offsetof(UWBP_ZoneName_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_ZoneName_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ZoneName_C, Interactable) == 0x0002E8, "Member 'UWBP_ZoneName_C::Interactable' has a wrong offset!");
static_assert(offsetof(UWBP_ZoneName_C, InteractableContainer) == 0x0002F0, "Member 'UWBP_ZoneName_C::InteractableContainer' has a wrong offset!");
static_assert(offsetof(UWBP_ZoneName_C, Zone) == 0x0002F8, "Member 'UWBP_ZoneName_C::Zone' has a wrong offset!");
static_assert(offsetof(UWBP_ZoneName_C, ZoneLevel) == 0x000300, "Member 'UWBP_ZoneName_C::ZoneLevel' has a wrong offset!");

}

