#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_Page_Video

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Settings_Page_Video.WBP_Settings_Page_Video_C.BndEvt__WBP_Settings_Page_Video_WBP_Button_Generic_Apply_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Button_Generic_Apply_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Button_Generic_Apply_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Button_Generic_Apply_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Button_Generic_Apply_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Button_Generic_Apply_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Button_Generic_Apply_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Button_Generic_Apply_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_Settings_Page_Video.WBP_Settings_Page_Video_C.BndEvt__WBP_Settings_Page_Video_WBP_Button_Generic_Gamma_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Button_Generic_Gamma_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Button_Generic_Gamma_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Button_Generic_Gamma_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Button_Generic_Gamma_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Button_Generic_Gamma_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Button_Generic_Gamma_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Button_Generic_Gamma_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_Settings_Page_Video.WBP_Settings_Page_Video_C.BndEvt__WBP_Settings_Page_Video_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_Settings_Page_Video.WBP_Settings_Page_Video_C.BndEvt__WBP_Settings_Page_Video_WBP_Settings_Entry_Choice_Toggle_ConstraintHUDAspectRatio_K2Node_ComponentBoundEvent_6_OnToggle__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Settings_Entry_Choice_Toggle_ConstraintHUDAspectRatio_K2Node_ComponentBoundEvent_6_OnToggle__DelegateSignature final
{
public:
	bool                                          ToggleValue;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Settings_Entry_Choice_Toggle_ConstraintHUDAspectRatio_K2Node_ComponentBoundEvent_6_OnToggle__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Settings_Entry_Choice_Toggle_ConstraintHUDAspectRatio_K2Node_ComponentBoundEvent_6_OnToggle__DelegateSignature");
static_assert(sizeof(WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Settings_Entry_Choice_Toggle_ConstraintHUDAspectRatio_K2Node_ComponentBoundEvent_6_OnToggle__DelegateSignature) == 0x000001, "Wrong size on WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Settings_Entry_Choice_Toggle_ConstraintHUDAspectRatio_K2Node_ComponentBoundEvent_6_OnToggle__DelegateSignature");
static_assert(offsetof(WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Settings_Entry_Choice_Toggle_ConstraintHUDAspectRatio_K2Node_ComponentBoundEvent_6_OnToggle__DelegateSignature, ToggleValue) == 0x000000, "Member 'WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Settings_Entry_Choice_Toggle_ConstraintHUDAspectRatio_K2Node_ComponentBoundEvent_6_OnToggle__DelegateSignature::ToggleValue' has a wrong offset!");

// Function WBP_Settings_Page_Video.WBP_Settings_Page_Video_C.BndEvt__WBP_Settings_Page_Video_WBP_Settings_Entry_Choice_Toggle_VSync_K2Node_ComponentBoundEvent_4_OnToggle__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Settings_Entry_Choice_Toggle_VSync_K2Node_ComponentBoundEvent_4_OnToggle__DelegateSignature final
{
public:
	bool                                          ToggleValue;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Settings_Entry_Choice_Toggle_VSync_K2Node_ComponentBoundEvent_4_OnToggle__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Settings_Entry_Choice_Toggle_VSync_K2Node_ComponentBoundEvent_4_OnToggle__DelegateSignature");
static_assert(sizeof(WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Settings_Entry_Choice_Toggle_VSync_K2Node_ComponentBoundEvent_4_OnToggle__DelegateSignature) == 0x000001, "Wrong size on WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Settings_Entry_Choice_Toggle_VSync_K2Node_ComponentBoundEvent_4_OnToggle__DelegateSignature");
static_assert(offsetof(WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Settings_Entry_Choice_Toggle_VSync_K2Node_ComponentBoundEvent_4_OnToggle__DelegateSignature, ToggleValue) == 0x000000, "Member 'WBP_Settings_Page_Video_C_BndEvt__WBP_Settings_Page_Video_WBP_Settings_Entry_Choice_Toggle_VSync_K2Node_ComponentBoundEvent_4_OnToggle__DelegateSignature::ToggleValue' has a wrong offset!");

// Function WBP_Settings_Page_Video.WBP_Settings_Page_Video_C.ExecuteUbergraph_WBP_Settings_Page_Video
// 0x0160 (0x0160 - 0x0000)
struct WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_2;             // 0x0010(0x0040)()
	bool                                          K2Node_ComponentBoundEvent_ToggleValue_1;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_1;        // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_1;             // 0x0070(0x0040)()
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent;               // 0x00B0(0x0040)()
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_2;        // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Settings_Gamma_C*                  CallFunc_Create_ReturnValue;                       // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_ToggleValue;            // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetConstraintHUDAspectRatio_ReturnValue;  // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Dialog_YesNo_C*                    CallFunc_Create_ReturnValue_1;                     // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGameViewportZion*                      CallFunc_Get_ReturnValue;                          // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameViewportZion*                      CallFunc_Get_ReturnValue_1;                        // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x013C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0150(0x0010)(ConstParm)
};
static_assert(alignof(WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video) == 0x000008, "Wrong alignment on WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video");
static_assert(sizeof(WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video) == 0x000160, "Wrong size on WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video");
static_assert(offsetof(WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video, EntryPoint) == 0x000000, "Member 'WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video, CallFunc_GetGameUserSettings_ReturnValue) == 0x000008, "Member 'WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video, K2Node_ComponentBoundEvent_KeyEvent_2) == 0x000010, "Member 'WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video::K2Node_ComponentBoundEvent_KeyEvent_2' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video, K2Node_ComponentBoundEvent_ToggleValue_1) == 0x000050, "Member 'WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video::K2Node_ComponentBoundEvent_ToggleValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video, CallFunc_GetGameUserSettings_ReturnValue_1) == 0x000058, "Member 'WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video::CallFunc_GetGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video, K2Node_CreateDelegate_OutputDelegate) == 0x000060, "Member 'WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video, K2Node_ComponentBoundEvent_KeyEvent_1) == 0x000070, "Member 'WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video::K2Node_ComponentBoundEvent_KeyEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video, K2Node_ComponentBoundEvent_KeyEvent) == 0x0000B0, "Member 'WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video::K2Node_ComponentBoundEvent_KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000F0, "Member 'WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video, CallFunc_GetGameUserSettings_ReturnValue_2) == 0x0000F8, "Member 'WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video::CallFunc_GetGameUserSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video, CallFunc_Create_ReturnValue) == 0x000100, "Member 'WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video, K2Node_ComponentBoundEvent_ToggleValue) == 0x000108, "Member 'WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video::K2Node_ComponentBoundEvent_ToggleValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video, CallFunc_SetConstraintHUDAspectRatio_ReturnValue) == 0x000109, "Member 'WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video::CallFunc_SetConstraintHUDAspectRatio_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video, CallFunc_Create_ReturnValue_1) == 0x000110, "Member 'WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video, CallFunc_Get_ReturnValue) == 0x000118, "Member 'WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video, K2Node_CreateDelegate_OutputDelegate_1) == 0x000120, "Member 'WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video, CallFunc_Get_ReturnValue_1) == 0x000130, "Member 'WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video, CallFunc_IsValid_ReturnValue) == 0x000138, "Member 'WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video, K2Node_CreateDelegate_OutputDelegate_2) == 0x00013C, "Member 'WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video, Temp_text_Variable) == 0x000150, "Member 'WBP_Settings_Page_Video_C_ExecuteUbergraph_WBP_Settings_Page_Video::Temp_text_Variable' has a wrong offset!");

// Function WBP_Settings_Page_Video.WBP_Settings_Page_Video_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Settings_Page_Video_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Settings_Page_Video_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Settings_Page_Video_C_OnFocusReceived");
static_assert(sizeof(WBP_Settings_Page_Video_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_Settings_Page_Video_C_OnFocusReceived");
static_assert(offsetof(WBP_Settings_Page_Video_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Settings_Page_Video_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Video_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Settings_Page_Video_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Video_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Settings_Page_Video_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Video_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Settings_Page_Video_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Settings_Page_Video.WBP_Settings_Page_Video_C.RevertGameUserSettingsToDefault
// 0x0030 (0x0030 - 0x0000)
struct WBP_Settings_Page_Video_C_RevertGameUserSettingsToDefault final
{
public:
	struct FIntPoint                              ScreenResolution;                                  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWindowMode                                   FullscreenMode;                                    // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_GetLastConfirmedScreenResolution_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWindowMode                                   CallFunc_GetLastConfirmedFullscreenMode_ReturnValue; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Page_Video_C_RevertGameUserSettingsToDefault) == 0x000008, "Wrong alignment on WBP_Settings_Page_Video_C_RevertGameUserSettingsToDefault");
static_assert(sizeof(WBP_Settings_Page_Video_C_RevertGameUserSettingsToDefault) == 0x000030, "Wrong size on WBP_Settings_Page_Video_C_RevertGameUserSettingsToDefault");
static_assert(offsetof(WBP_Settings_Page_Video_C_RevertGameUserSettingsToDefault, ScreenResolution) == 0x000000, "Member 'WBP_Settings_Page_Video_C_RevertGameUserSettingsToDefault::ScreenResolution' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Video_C_RevertGameUserSettingsToDefault, FullscreenMode) == 0x000008, "Member 'WBP_Settings_Page_Video_C_RevertGameUserSettingsToDefault::FullscreenMode' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Video_C_RevertGameUserSettingsToDefault, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'WBP_Settings_Page_Video_C_RevertGameUserSettingsToDefault::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Video_C_RevertGameUserSettingsToDefault, CallFunc_GetGameUserSettings_ReturnValue) == 0x000018, "Member 'WBP_Settings_Page_Video_C_RevertGameUserSettingsToDefault::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Video_C_RevertGameUserSettingsToDefault, CallFunc_GetLastConfirmedScreenResolution_ReturnValue) == 0x000020, "Member 'WBP_Settings_Page_Video_C_RevertGameUserSettingsToDefault::CallFunc_GetLastConfirmedScreenResolution_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Video_C_RevertGameUserSettingsToDefault, CallFunc_GetLastConfirmedFullscreenMode_ReturnValue) == 0x000028, "Member 'WBP_Settings_Page_Video_C_RevertGameUserSettingsToDefault::CallFunc_GetLastConfirmedFullscreenMode_ReturnValue' has a wrong offset!");

// Function WBP_Settings_Page_Video.WBP_Settings_Page_Video_C.SetupValues
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_Page_Video_C_SetupValues final
{
public:
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConstraintHUDAspectRatio_ReturnValue;  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVSyncEnabled_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Page_Video_C_SetupValues) == 0x000008, "Wrong alignment on WBP_Settings_Page_Video_C_SetupValues");
static_assert(sizeof(WBP_Settings_Page_Video_C_SetupValues) == 0x000020, "Wrong size on WBP_Settings_Page_Video_C_SetupValues");
static_assert(offsetof(WBP_Settings_Page_Video_C_SetupValues, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'WBP_Settings_Page_Video_C_SetupValues::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Video_C_SetupValues, CallFunc_GetConstraintHUDAspectRatio_ReturnValue) == 0x000008, "Member 'WBP_Settings_Page_Video_C_SetupValues::CallFunc_GetConstraintHUDAspectRatio_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Video_C_SetupValues, CallFunc_GetGameUserSettings_ReturnValue) == 0x000010, "Member 'WBP_Settings_Page_Video_C_SetupValues::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Video_C_SetupValues, CallFunc_IsVSyncEnabled_ReturnValue) == 0x000018, "Member 'WBP_Settings_Page_Video_C_SetupValues::CallFunc_IsVSyncEnabled_ReturnValue' has a wrong offset!");

}

