#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TextureChecker

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_TextureChecker.WBP_TextureChecker_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_TextureChecker_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TextureChecker_C_Tick) == 0x000004, "Wrong alignment on WBP_TextureChecker_C_Tick");
static_assert(sizeof(WBP_TextureChecker_C_Tick) == 0x00003C, "Wrong size on WBP_TextureChecker_C_Tick");
static_assert(offsetof(WBP_TextureChecker_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_TextureChecker_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TextureChecker_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_TextureChecker_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_TextureChecker.WBP_TextureChecker_C.ExecuteUbergraph_WBP_TextureChecker
// 0x0088 (0x0088 - 0x0000)
struct WBP_TextureChecker_C_ExecuteUbergraph_WBP_TextureChecker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USpineSkeletonAnimationComponent*       CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0018(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetRuntimeTextureInfos_ReturnValue;       // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0078(0x0010)()
};
static_assert(alignof(WBP_TextureChecker_C_ExecuteUbergraph_WBP_TextureChecker) == 0x000008, "Wrong alignment on WBP_TextureChecker_C_ExecuteUbergraph_WBP_TextureChecker");
static_assert(sizeof(WBP_TextureChecker_C_ExecuteUbergraph_WBP_TextureChecker) == 0x000088, "Wrong size on WBP_TextureChecker_C_ExecuteUbergraph_WBP_TextureChecker");
static_assert(offsetof(WBP_TextureChecker_C_ExecuteUbergraph_WBP_TextureChecker, EntryPoint) == 0x000000, "Member 'WBP_TextureChecker_C_ExecuteUbergraph_WBP_TextureChecker::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TextureChecker_C_ExecuteUbergraph_WBP_TextureChecker, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'WBP_TextureChecker_C_ExecuteUbergraph_WBP_TextureChecker::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextureChecker_C_ExecuteUbergraph_WBP_TextureChecker, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'WBP_TextureChecker_C_ExecuteUbergraph_WBP_TextureChecker::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextureChecker_C_ExecuteUbergraph_WBP_TextureChecker, K2Node_Event_MyGeometry) == 0x000018, "Member 'WBP_TextureChecker_C_ExecuteUbergraph_WBP_TextureChecker::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TextureChecker_C_ExecuteUbergraph_WBP_TextureChecker, K2Node_Event_InDeltaTime) == 0x000050, "Member 'WBP_TextureChecker_C_ExecuteUbergraph_WBP_TextureChecker::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_TextureChecker_C_ExecuteUbergraph_WBP_TextureChecker, CallFunc_IsValid_ReturnValue) == 0x000054, "Member 'WBP_TextureChecker_C_ExecuteUbergraph_WBP_TextureChecker::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextureChecker_C_ExecuteUbergraph_WBP_TextureChecker, CallFunc_Array_Get_Item) == 0x000058, "Member 'WBP_TextureChecker_C_ExecuteUbergraph_WBP_TextureChecker::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_TextureChecker_C_ExecuteUbergraph_WBP_TextureChecker, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'WBP_TextureChecker_C_ExecuteUbergraph_WBP_TextureChecker::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TextureChecker_C_ExecuteUbergraph_WBP_TextureChecker, CallFunc_GetRuntimeTextureInfos_ReturnValue) == 0x000068, "Member 'WBP_TextureChecker_C_ExecuteUbergraph_WBP_TextureChecker::CallFunc_GetRuntimeTextureInfos_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextureChecker_C_ExecuteUbergraph_WBP_TextureChecker, CallFunc_Conv_StringToText_ReturnValue) == 0x000078, "Member 'WBP_TextureChecker_C_ExecuteUbergraph_WBP_TextureChecker::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

