#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SpiritSkillList

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_SpiritSkillList.WBP_SpiritSkillList_C.CreateSkillList
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_SpiritSkillList_C_CreateSkillList final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SpiritSkillSet_C*                  CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_SpiritSkillSet_C* SpiritSkillSet, class UWBP_SpiritSkillEntry_C* SpiritSkillEntry)> K2Node_CreateDelegate_OutputDelegate; // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_SpiritSkillSet_C* SpiritSkillSet, class UWBP_SpiritSkillEntry_C* SpiritSkillEntry)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInventory*                             CallFunc_GetSpiritInventory_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, int32>                      CallFunc_GetAllItems_ReturnValue;                  // 0x0050(0x0050)(ConstParm)
	const class UDataTable*                       CallFunc_GetDataTable_ReturnValue;                 // 0x00A0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x00A8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x00BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x00C8(0x0010)(NoDestructor)
};
static_assert(alignof(WBP_SpiritSkillList_C_CreateSkillList) == 0x000008, "Wrong alignment on WBP_SpiritSkillList_C_CreateSkillList");
static_assert(sizeof(WBP_SpiritSkillList_C_CreateSkillList) == 0x0000D8, "Wrong size on WBP_SpiritSkillList_C_CreateSkillList");
static_assert(offsetof(WBP_SpiritSkillList_C_CreateSkillList, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_SpiritSkillList_C_CreateSkillList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_CreateSkillList, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_SpiritSkillList_C_CreateSkillList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_CreateSkillList, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_SpiritSkillList_C_CreateSkillList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_CreateSkillList, CallFunc_Create_ReturnValue) == 0x000010, "Member 'WBP_SpiritSkillList_C_CreateSkillList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_CreateSkillList, CallFunc_AddChild_ReturnValue) == 0x000018, "Member 'WBP_SpiritSkillList_C_CreateSkillList::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_CreateSkillList, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WBP_SpiritSkillList_C_CreateSkillList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_CreateSkillList, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'WBP_SpiritSkillList_C_CreateSkillList::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_CreateSkillList, CallFunc_Get_ReturnValue) == 0x000040, "Member 'WBP_SpiritSkillList_C_CreateSkillList::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_CreateSkillList, CallFunc_GetSpiritInventory_ReturnValue) == 0x000048, "Member 'WBP_SpiritSkillList_C_CreateSkillList::CallFunc_GetSpiritInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_CreateSkillList, CallFunc_GetAllItems_ReturnValue) == 0x000050, "Member 'WBP_SpiritSkillList_C_CreateSkillList::CallFunc_GetAllItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_CreateSkillList, CallFunc_GetDataTable_ReturnValue) == 0x0000A0, "Member 'WBP_SpiritSkillList_C_CreateSkillList::CallFunc_GetDataTable_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_CreateSkillList, CallFunc_Map_Keys_Keys) == 0x0000A8, "Member 'WBP_SpiritSkillList_C_CreateSkillList::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_CreateSkillList, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'WBP_SpiritSkillList_C_CreateSkillList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_CreateSkillList, CallFunc_Array_Get_Item) == 0x0000BC, "Member 'WBP_SpiritSkillList_C_CreateSkillList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_CreateSkillList, CallFunc_Less_IntInt_ReturnValue) == 0x0000C4, "Member 'WBP_SpiritSkillList_C_CreateSkillList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_CreateSkillList, K2Node_MakeStruct_DataTableRowHandle) == 0x0000C8, "Member 'WBP_SpiritSkillList_C_CreateSkillList::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");

// Function WBP_SpiritSkillList.WBP_SpiritSkillList_C.ExecuteUbergraph_WBP_SpiritSkillList
// 0x0030 (0x0030 - 0x0000)
struct WBP_SpiritSkillList_C_ExecuteUbergraph_WBP_SpiritSkillList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SpiritSkillSet_C*                  K2Node_CustomEvent_SpiritSkilSet;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SpiritSkillEntry_C*                K2Node_CustomEvent_SpiritSkillEntry;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SpiritSkillSet_C*                  K2Node_CustomEvent_SpiritSkillSet;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SpiritSkillEntry_C*                K2Node_CustomEvent_SpiritSkillEntry_1;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0028(0x0008)(NoDestructor)
};
static_assert(alignof(WBP_SpiritSkillList_C_ExecuteUbergraph_WBP_SpiritSkillList) == 0x000008, "Wrong alignment on WBP_SpiritSkillList_C_ExecuteUbergraph_WBP_SpiritSkillList");
static_assert(sizeof(WBP_SpiritSkillList_C_ExecuteUbergraph_WBP_SpiritSkillList) == 0x000030, "Wrong size on WBP_SpiritSkillList_C_ExecuteUbergraph_WBP_SpiritSkillList");
static_assert(offsetof(WBP_SpiritSkillList_C_ExecuteUbergraph_WBP_SpiritSkillList, EntryPoint) == 0x000000, "Member 'WBP_SpiritSkillList_C_ExecuteUbergraph_WBP_SpiritSkillList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_ExecuteUbergraph_WBP_SpiritSkillList, K2Node_CustomEvent_SpiritSkilSet) == 0x000008, "Member 'WBP_SpiritSkillList_C_ExecuteUbergraph_WBP_SpiritSkillList::K2Node_CustomEvent_SpiritSkilSet' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_ExecuteUbergraph_WBP_SpiritSkillList, K2Node_CustomEvent_SpiritSkillEntry) == 0x000010, "Member 'WBP_SpiritSkillList_C_ExecuteUbergraph_WBP_SpiritSkillList::K2Node_CustomEvent_SpiritSkillEntry' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_ExecuteUbergraph_WBP_SpiritSkillList, K2Node_CustomEvent_SpiritSkillSet) == 0x000018, "Member 'WBP_SpiritSkillList_C_ExecuteUbergraph_WBP_SpiritSkillList::K2Node_CustomEvent_SpiritSkillSet' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_ExecuteUbergraph_WBP_SpiritSkillList, K2Node_CustomEvent_SpiritSkillEntry_1) == 0x000020, "Member 'WBP_SpiritSkillList_C_ExecuteUbergraph_WBP_SpiritSkillList::K2Node_CustomEvent_SpiritSkillEntry_1' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_ExecuteUbergraph_WBP_SpiritSkillList, K2Node_Event_InFocusEvent) == 0x000028, "Member 'WBP_SpiritSkillList_C_ExecuteUbergraph_WBP_SpiritSkillList::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function WBP_SpiritSkillList.WBP_SpiritSkillList_C.Get Skill Entry to Focus from Navigation
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation final
{
public:
	EUINavigation                                 Direction;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SkillSetIndex;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SkillEntryIndex;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SpiritSkillEntry_C*                SkillEntry;                                        // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFirstRow_bIsFocused;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLastRow_bIsFocused;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SpiritSkillSet_C*                  K2Node_DynamicCast_AsWBP_Spirit_Skill_Set;         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SpiritSkillEntry_C*                CallFunc_Get_First_Valid_Entry_from_Index_Desc_SkillEntry; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SpiritSkillSet_C*                  K2Node_DynamicCast_AsWBP_Spirit_Skill_Set_1;       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SpiritSkillEntry_C*                CallFunc_Get_First_Valid_Entry_from_Index_Desc_SkillEntry_1; // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue_1;           // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_2;                 // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SpiritSkillSet_C*                  K2Node_DynamicCast_AsWBP_Spirit_Skill_Set_2;       // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SpiritSkillEntry_C*                CallFunc_Get_First_Valid_Entry_from_Index_Desc_SkillEntry_2; // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_3;                 // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SpiritSkillSet_C*                  K2Node_DynamicCast_AsWBP_Spirit_Skill_Set_3;       // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SpiritSkillEntry_C*                CallFunc_Get_First_Valid_Entry_from_Index_Desc_SkillEntry_3; // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation) == 0x000008, "Wrong alignment on WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation");
static_assert(sizeof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation) == 0x0000E8, "Wrong size on WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, Direction) == 0x000000, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::Direction' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, SkillSetIndex) == 0x000004, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::SkillSetIndex' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, SkillEntryIndex) == 0x000008, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::SkillEntryIndex' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, SkillEntry) == 0x000010, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::SkillEntry' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, CallFunc_IsFirstRow_bIsFocused) == 0x000018, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::CallFunc_IsFirstRow_bIsFocused' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, CallFunc_IsLastRow_bIsFocused) == 0x000019, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::CallFunc_IsLastRow_bIsFocused' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, K2Node_SwitchEnum_CmpSuccess) == 0x00001A, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, CallFunc_GetChildrenCount_ReturnValue) == 0x000020, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000028, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, CallFunc_Min_ReturnValue) == 0x00002C, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000030, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, CallFunc_GetChildAt_ReturnValue) == 0x000038, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, CallFunc_SelectInt_ReturnValue) == 0x000040, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, K2Node_DynamicCast_AsWBP_Spirit_Skill_Set) == 0x000048, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::K2Node_DynamicCast_AsWBP_Spirit_Skill_Set' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, CallFunc_GetChildAt_ReturnValue_1) == 0x000058, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, CallFunc_Get_First_Valid_Entry_from_Index_Desc_SkillEntry) == 0x000060, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::CallFunc_Get_First_Valid_Entry_from_Index_Desc_SkillEntry' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, K2Node_DynamicCast_AsWBP_Spirit_Skill_Set_1) == 0x000068, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::K2Node_DynamicCast_AsWBP_Spirit_Skill_Set_1' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, CallFunc_Get_First_Valid_Entry_from_Index_Desc_SkillEntry_1) == 0x000078, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::CallFunc_Get_First_Valid_Entry_from_Index_Desc_SkillEntry_1' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, CallFunc_GetChildrenCount_ReturnValue_1) == 0x000080, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::CallFunc_GetChildrenCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, CallFunc_Percent_IntInt_ReturnValue) == 0x000084, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000088, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, CallFunc_Divide_IntInt_ReturnValue) == 0x00008C, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, CallFunc_Multiply_IntInt_ReturnValue) == 0x000090, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, CallFunc_GetChildAt_ReturnValue_2) == 0x000098, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::CallFunc_GetChildAt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000A0, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, K2Node_DynamicCast_AsWBP_Spirit_Skill_Set_2) == 0x0000A8, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::K2Node_DynamicCast_AsWBP_Spirit_Skill_Set_2' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, K2Node_DynamicCast_bSuccess_2) == 0x0000B0, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, CallFunc_Greater_IntInt_ReturnValue) == 0x0000B1, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, CallFunc_Get_First_Valid_Entry_from_Index_Desc_SkillEntry_2) == 0x0000B8, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::CallFunc_Get_First_Valid_Entry_from_Index_Desc_SkillEntry_2' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x0000C0, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, CallFunc_SelectInt_ReturnValue_1) == 0x0000C4, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, CallFunc_GetChildAt_ReturnValue_3) == 0x0000C8, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::CallFunc_GetChildAt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, K2Node_DynamicCast_AsWBP_Spirit_Skill_Set_3) == 0x0000D0, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::K2Node_DynamicCast_AsWBP_Spirit_Skill_Set_3' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, K2Node_DynamicCast_bSuccess_3) == 0x0000D8, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation, CallFunc_Get_First_Valid_Entry_from_Index_Desc_SkillEntry_3) == 0x0000E0, "Member 'WBP_SpiritSkillList_C_Get_Skill_Entry_to_Focus_from_Navigation::CallFunc_Get_First_Valid_Entry_from_Index_Desc_SkillEntry_3' has a wrong offset!");

// Function WBP_SpiritSkillList.WBP_SpiritSkillList_C.GetFirstRowCount
// 0x000C (0x000C - 0x0000)
struct WBP_SpiritSkillList_C_GetFirstRowCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpiritSkillList_C_GetFirstRowCount) == 0x000004, "Wrong alignment on WBP_SpiritSkillList_C_GetFirstRowCount");
static_assert(sizeof(WBP_SpiritSkillList_C_GetFirstRowCount) == 0x00000C, "Wrong size on WBP_SpiritSkillList_C_GetFirstRowCount");
static_assert(offsetof(WBP_SpiritSkillList_C_GetFirstRowCount, ReturnValue) == 0x000000, "Member 'WBP_SpiritSkillList_C_GetFirstRowCount::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_GetFirstRowCount, CallFunc_GetChildrenCount_ReturnValue) == 0x000004, "Member 'WBP_SpiritSkillList_C_GetFirstRowCount::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_GetFirstRowCount, CallFunc_Min_ReturnValue) == 0x000008, "Member 'WBP_SpiritSkillList_C_GetFirstRowCount::CallFunc_Min_ReturnValue' has a wrong offset!");

// Function WBP_SpiritSkillList.WBP_SpiritSkillList_C.GetFirstSpiritSetOfLastRow
// 0x0020 (0x0020 - 0x0000)
struct WBP_SpiritSkillList_C_GetFirstSpiritSetOfLastRow final
{
public:
	class UWBP_SpiritSkillSet_C*                  AsWBP_Spirit_Skill_Set;                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_SpiritSkillSet_C*                  CallFunc_GetSkillSpiritSet_AsWBP_Spirit_Skill_Set; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpiritSkillList_C_GetFirstSpiritSetOfLastRow) == 0x000008, "Wrong alignment on WBP_SpiritSkillList_C_GetFirstSpiritSetOfLastRow");
static_assert(sizeof(WBP_SpiritSkillList_C_GetFirstSpiritSetOfLastRow) == 0x000020, "Wrong size on WBP_SpiritSkillList_C_GetFirstSpiritSetOfLastRow");
static_assert(offsetof(WBP_SpiritSkillList_C_GetFirstSpiritSetOfLastRow, AsWBP_Spirit_Skill_Set) == 0x000000, "Member 'WBP_SpiritSkillList_C_GetFirstSpiritSetOfLastRow::AsWBP_Spirit_Skill_Set' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_GetFirstSpiritSetOfLastRow, CallFunc_GetChildrenCount_ReturnValue) == 0x000008, "Member 'WBP_SpiritSkillList_C_GetFirstSpiritSetOfLastRow::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_GetFirstSpiritSetOfLastRow, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_SpiritSkillList_C_GetFirstSpiritSetOfLastRow::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_GetFirstSpiritSetOfLastRow, CallFunc_Percent_IntInt_ReturnValue) == 0x000010, "Member 'WBP_SpiritSkillList_C_GetFirstSpiritSetOfLastRow::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_GetFirstSpiritSetOfLastRow, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000014, "Member 'WBP_SpiritSkillList_C_GetFirstSpiritSetOfLastRow::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_GetFirstSpiritSetOfLastRow, CallFunc_GetSkillSpiritSet_AsWBP_Spirit_Skill_Set) == 0x000018, "Member 'WBP_SpiritSkillList_C_GetFirstSpiritSetOfLastRow::CallFunc_GetSkillSpiritSet_AsWBP_Spirit_Skill_Set' has a wrong offset!");

// Function WBP_SpiritSkillList.WBP_SpiritSkillList_C.GetSkillEntryToFocusFromFocusedSpiritSet
// 0x0028 (0x0028 - 0x0000)
struct WBP_SpiritSkillList_C_GetSkillEntryToFocusFromFocusedSpiritSet final
{
public:
	EUINavigation                                 Direction;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SpiritSkillEntry_C*                SkillEntry;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildIndex_ReturnValue;                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFocusedIndex_FocusedIndex;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SpiritSkillEntry_C*                CallFunc_Get_Skill_Entry_to_Focus_from_Navigation_SkillEntry; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpiritSkillList_C_GetSkillEntryToFocusFromFocusedSpiritSet) == 0x000008, "Wrong alignment on WBP_SpiritSkillList_C_GetSkillEntryToFocusFromFocusedSpiritSet");
static_assert(sizeof(WBP_SpiritSkillList_C_GetSkillEntryToFocusFromFocusedSpiritSet) == 0x000028, "Wrong size on WBP_SpiritSkillList_C_GetSkillEntryToFocusFromFocusedSpiritSet");
static_assert(offsetof(WBP_SpiritSkillList_C_GetSkillEntryToFocusFromFocusedSpiritSet, Direction) == 0x000000, "Member 'WBP_SpiritSkillList_C_GetSkillEntryToFocusFromFocusedSpiritSet::Direction' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_GetSkillEntryToFocusFromFocusedSpiritSet, SkillEntry) == 0x000008, "Member 'WBP_SpiritSkillList_C_GetSkillEntryToFocusFromFocusedSpiritSet::SkillEntry' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_GetSkillEntryToFocusFromFocusedSpiritSet, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_SpiritSkillList_C_GetSkillEntryToFocusFromFocusedSpiritSet::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_GetSkillEntryToFocusFromFocusedSpiritSet, CallFunc_GetChildIndex_ReturnValue) == 0x000014, "Member 'WBP_SpiritSkillList_C_GetSkillEntryToFocusFromFocusedSpiritSet::CallFunc_GetChildIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_GetSkillEntryToFocusFromFocusedSpiritSet, CallFunc_GetFocusedIndex_FocusedIndex) == 0x000018, "Member 'WBP_SpiritSkillList_C_GetSkillEntryToFocusFromFocusedSpiritSet::CallFunc_GetFocusedIndex_FocusedIndex' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_GetSkillEntryToFocusFromFocusedSpiritSet, CallFunc_Get_Skill_Entry_to_Focus_from_Navigation_SkillEntry) == 0x000020, "Member 'WBP_SpiritSkillList_C_GetSkillEntryToFocusFromFocusedSpiritSet::CallFunc_Get_Skill_Entry_to_Focus_from_Navigation_SkillEntry' has a wrong offset!");

// Function WBP_SpiritSkillList.WBP_SpiritSkillList_C.GetSkillSpiritSet
// 0x0028 (0x0028 - 0x0000)
struct WBP_SpiritSkillList_C_GetSkillSpiritSet final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SpiritSkillSet_C*                  AsWBP_Spirit_Skill_Set;                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SpiritSkillSet_C*                  K2Node_DynamicCast_AsWBP_Spirit_Skill_Set;         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpiritSkillList_C_GetSkillSpiritSet) == 0x000008, "Wrong alignment on WBP_SpiritSkillList_C_GetSkillSpiritSet");
static_assert(sizeof(WBP_SpiritSkillList_C_GetSkillSpiritSet) == 0x000028, "Wrong size on WBP_SpiritSkillList_C_GetSkillSpiritSet");
static_assert(offsetof(WBP_SpiritSkillList_C_GetSkillSpiritSet, Index_0) == 0x000000, "Member 'WBP_SpiritSkillList_C_GetSkillSpiritSet::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_GetSkillSpiritSet, AsWBP_Spirit_Skill_Set) == 0x000008, "Member 'WBP_SpiritSkillList_C_GetSkillSpiritSet::AsWBP_Spirit_Skill_Set' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_GetSkillSpiritSet, CallFunc_GetChildAt_ReturnValue) == 0x000010, "Member 'WBP_SpiritSkillList_C_GetSkillSpiritSet::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_GetSkillSpiritSet, K2Node_DynamicCast_AsWBP_Spirit_Skill_Set) == 0x000018, "Member 'WBP_SpiritSkillList_C_GetSkillSpiritSet::K2Node_DynamicCast_AsWBP_Spirit_Skill_Set' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_GetSkillSpiritSet, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_SpiritSkillList_C_GetSkillSpiritSet::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_SpiritSkillList.WBP_SpiritSkillList_C.IsEmpty
// 0x0003 (0x0003 - 0x0000)
struct WBP_SpiritSkillList_C_IsEmpty final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpiritSkillList_C_IsEmpty) == 0x000001, "Wrong alignment on WBP_SpiritSkillList_C_IsEmpty");
static_assert(sizeof(WBP_SpiritSkillList_C_IsEmpty) == 0x000003, "Wrong size on WBP_SpiritSkillList_C_IsEmpty");
static_assert(offsetof(WBP_SpiritSkillList_C_IsEmpty, ReturnValue) == 0x000000, "Member 'WBP_SpiritSkillList_C_IsEmpty::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_IsEmpty, CallFunc_HasAnyChildren_ReturnValue) == 0x000001, "Member 'WBP_SpiritSkillList_C_IsEmpty::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_IsEmpty, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WBP_SpiritSkillList_C_IsEmpty::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_SpiritSkillList.WBP_SpiritSkillList_C.IsFirstRow
// 0x0010 (0x0010 - 0x0000)
struct WBP_SpiritSkillList_C_IsFirstRow final
{
public:
	int32                                         SkillSetIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFocused;                                        // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpiritSkillList_C_IsFirstRow) == 0x000004, "Wrong alignment on WBP_SpiritSkillList_C_IsFirstRow");
static_assert(sizeof(WBP_SpiritSkillList_C_IsFirstRow) == 0x000010, "Wrong size on WBP_SpiritSkillList_C_IsFirstRow");
static_assert(offsetof(WBP_SpiritSkillList_C_IsFirstRow, SkillSetIndex) == 0x000000, "Member 'WBP_SpiritSkillList_C_IsFirstRow::SkillSetIndex' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_IsFirstRow, bIsFocused) == 0x000004, "Member 'WBP_SpiritSkillList_C_IsFirstRow::bIsFocused' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_IsFirstRow, CallFunc_Divide_IntInt_ReturnValue) == 0x000008, "Member 'WBP_SpiritSkillList_C_IsFirstRow::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_IsFirstRow, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_SpiritSkillList_C_IsFirstRow::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_SpiritSkillList.WBP_SpiritSkillList_C.IsLastRow
// 0x0018 (0x0018 - 0x0000)
struct WBP_SpiritSkillList_C_IsLastRow final
{
public:
	int32                                         SkillSetIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFocused;                                        // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpiritSkillList_C_IsLastRow) == 0x000004, "Wrong alignment on WBP_SpiritSkillList_C_IsLastRow");
static_assert(sizeof(WBP_SpiritSkillList_C_IsLastRow) == 0x000018, "Wrong size on WBP_SpiritSkillList_C_IsLastRow");
static_assert(offsetof(WBP_SpiritSkillList_C_IsLastRow, SkillSetIndex) == 0x000000, "Member 'WBP_SpiritSkillList_C_IsLastRow::SkillSetIndex' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_IsLastRow, bIsFocused) == 0x000004, "Member 'WBP_SpiritSkillList_C_IsLastRow::bIsFocused' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_IsLastRow, CallFunc_GetChildrenCount_ReturnValue) == 0x000008, "Member 'WBP_SpiritSkillList_C_IsLastRow::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_IsLastRow, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_SpiritSkillList_C_IsLastRow::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_IsLastRow, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000010, "Member 'WBP_SpiritSkillList_C_IsLastRow::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_IsLastRow, CallFunc_Greater_IntInt_ReturnValue) == 0x000014, "Member 'WBP_SpiritSkillList_C_IsLastRow::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_SpiritSkillList.WBP_SpiritSkillList_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_SpiritSkillList_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpiritSkillList_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_SpiritSkillList_C_OnFocusReceived");
static_assert(sizeof(WBP_SpiritSkillList_C_OnFocusReceived) == 0x0001B8, "Wrong size on WBP_SpiritSkillList_C_OnFocusReceived");
static_assert(offsetof(WBP_SpiritSkillList_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_SpiritSkillList_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_SpiritSkillList_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_SpiritSkillList_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_SpiritSkillList_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_OnFocusReceived, CallFunc_GetChildAt_ReturnValue) == 0x0001B0, "Member 'WBP_SpiritSkillList_C_OnFocusReceived::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");

// Function WBP_SpiritSkillList.WBP_SpiritSkillList_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_SpiritSkillList_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_SpiritSkillList_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on WBP_SpiritSkillList_C_OnRemovedFromFocusPath");
static_assert(sizeof(WBP_SpiritSkillList_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on WBP_SpiritSkillList_C_OnRemovedFromFocusPath");
static_assert(offsetof(WBP_SpiritSkillList_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_SpiritSkillList_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_SpiritSkillList.WBP_SpiritSkillList_C.OnSpiritSkillEntryFocused
// 0x0010 (0x0010 - 0x0000)
struct WBP_SpiritSkillList_C_OnSpiritSkillEntryFocused final
{
public:
	class UWBP_SpiritSkillSet_C*                  SpiritSkilSet;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SpiritSkillEntry_C*                SpiritSkillEntry;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpiritSkillList_C_OnSpiritSkillEntryFocused) == 0x000008, "Wrong alignment on WBP_SpiritSkillList_C_OnSpiritSkillEntryFocused");
static_assert(sizeof(WBP_SpiritSkillList_C_OnSpiritSkillEntryFocused) == 0x000010, "Wrong size on WBP_SpiritSkillList_C_OnSpiritSkillEntryFocused");
static_assert(offsetof(WBP_SpiritSkillList_C_OnSpiritSkillEntryFocused, SpiritSkilSet) == 0x000000, "Member 'WBP_SpiritSkillList_C_OnSpiritSkillEntryFocused::SpiritSkilSet' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_OnSpiritSkillEntryFocused, SpiritSkillEntry) == 0x000008, "Member 'WBP_SpiritSkillList_C_OnSpiritSkillEntryFocused::SpiritSkillEntry' has a wrong offset!");

// Function WBP_SpiritSkillList.WBP_SpiritSkillList_C.OnSpiritSkillEntryPressed
// 0x0010 (0x0010 - 0x0000)
struct WBP_SpiritSkillList_C_OnSpiritSkillEntryPressed final
{
public:
	class UWBP_SpiritSkillSet_C*                  SpiritSkillSet;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SpiritSkillEntry_C*                SpiritSkillEntry;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpiritSkillList_C_OnSpiritSkillEntryPressed) == 0x000008, "Wrong alignment on WBP_SpiritSkillList_C_OnSpiritSkillEntryPressed");
static_assert(sizeof(WBP_SpiritSkillList_C_OnSpiritSkillEntryPressed) == 0x000010, "Wrong size on WBP_SpiritSkillList_C_OnSpiritSkillEntryPressed");
static_assert(offsetof(WBP_SpiritSkillList_C_OnSpiritSkillEntryPressed, SpiritSkillSet) == 0x000000, "Member 'WBP_SpiritSkillList_C_OnSpiritSkillEntryPressed::SpiritSkillSet' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_OnSpiritSkillEntryPressed, SpiritSkillEntry) == 0x000008, "Member 'WBP_SpiritSkillList_C_OnSpiritSkillEntryPressed::SpiritSkillEntry' has a wrong offset!");

// Function WBP_SpiritSkillList.WBP_SpiritSkillList_C.Refresh
// 0x0048 (0x0048 - 0x0000)
struct WBP_SpiritSkillList_C_Refresh final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SpiritSkillSet_C*                  K2Node_DynamicCast_AsWBP_Spirit_Skill_Set;         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpiritSkillList_C_Refresh) == 0x000008, "Wrong alignment on WBP_SpiritSkillList_C_Refresh");
static_assert(sizeof(WBP_SpiritSkillList_C_Refresh) == 0x000048, "Wrong size on WBP_SpiritSkillList_C_Refresh");
static_assert(offsetof(WBP_SpiritSkillList_C_Refresh, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_SpiritSkillList_C_Refresh::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Refresh, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_SpiritSkillList_C_Refresh::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Refresh, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_SpiritSkillList_C_Refresh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Refresh, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'WBP_SpiritSkillList_C_Refresh::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Refresh, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_SpiritSkillList_C_Refresh::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Refresh, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_SpiritSkillList_C_Refresh::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Refresh, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_SpiritSkillList_C_Refresh::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Refresh, K2Node_DynamicCast_AsWBP_Spirit_Skill_Set) == 0x000038, "Member 'WBP_SpiritSkillList_C_Refresh::K2Node_DynamicCast_AsWBP_Spirit_Skill_Set' has a wrong offset!");
static_assert(offsetof(WBP_SpiritSkillList_C_Refresh, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_SpiritSkillList_C_Refresh::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_SpiritSkillList.WBP_SpiritSkillList_C.SetupListNavigation
// 0x0058 (0x0058 - 0x0000)
struct WBP_SpiritSkillList_C_SetupListNavigation final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_SpiritSkillEntry_C*                CallFunc_Get_Skill_Entry_to_Focus_from_Navigation_SkillEntry; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_SpiritSkillEntry_C*                CallFunc_Get_Skill_Entry_to_Focus_from_Navigation_SkillEntry_1; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
