#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Loadout

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Loadout.WBP_Loadout_C
// 0x0038 (0x0498 - 0x0460)
class UWBP_Loadout_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWrapBox*                               EntriesHolder;                                     // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_416;                                         // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URefreshableRichTextBlock*              Left;                                              // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URefreshableRichTextBlock*              Right;                                             // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         SelectedIndex;                                     // 0x0490(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Loadout(int32 EntryPoint);
	void GetEntryCount(int32* Count);
	void GetNextEntryIndex(int32* NextIndex);
	void GetPreviousEntryIndex(int32* NextIndex);
	void GetSelectedEntryIndex(int32* Index_0);
	void PreConstruct(bool IsDesignTime);
	void RefreshEntrySelectedState();
	void SetSelectedEntry(int32 EntryIndex);
	void ShowInputs(bool bShow);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Loadout_C">();
	}
	static class UWBP_Loadout_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Loadout_C>();
	}
};
static_assert(alignof(UWBP_Loadout_C) == 0x000008, "Wrong alignment on UWBP_Loadout_C");
static_assert(sizeof(UWBP_Loadout_C) == 0x000498, "Wrong size on UWBP_Loadout_C");
static_assert(offsetof(UWBP_Loadout_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Loadout_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Loadout_C, EntriesHolder) == 0x000468, "Member 'UWBP_Loadout_C::EntriesHolder' has a wrong offset!");
static_assert(offsetof(UWBP_Loadout_C, Image_416) == 0x000470, "Member 'UWBP_Loadout_C::Image_416' has a wrong offset!");
static_assert(offsetof(UWBP_Loadout_C, Left) == 0x000478, "Member 'UWBP_Loadout_C::Left' has a wrong offset!");
static_assert(offsetof(UWBP_Loadout_C, Right) == 0x000480, "Member 'UWBP_Loadout_C::Right' has a wrong offset!");
static_assert(offsetof(UWBP_Loadout_C, TextBlock) == 0x000488, "Member 'UWBP_Loadout_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_Loadout_C, SelectedIndex) == 0x000490, "Member 'UWBP_Loadout_C::SelectedIndex' has a wrong offset!");

}

