#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Recollection_BossRush_Leaderboard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Recollection_BossRush_Leaderboard.WBP_Recollection_BossRush_Leaderboard_C
// 0x0030 (0x0490 - 0x0460)
class UWBP_Recollection_BossRush_Leaderboard_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Recollection_BossRush_RecordEntry_C* WBP_Recollection_BossRush_RecordEntry_1;         // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Recollection_BossRush_RecordEntry_C* WBP_Recollection_BossRush_RecordEntry_2;         // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Recollection_BossRush_RecordEntry_C* WBP_Recollection_BossRush_RecordEntry_3;         // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_Recollection_BossRush_RecordEntry_C*> RecordEntries;                           // 0x0480(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay)

public:
	void SetNewFlagAtIndex(int32 Index_0, bool ShowNewFlag);
	void SetLeaderboardTexts();
	void Set_Text_at_Index(int32 Index_0, const struct FRecollectionBossRushRecordData& RecordData);
	void ExecuteUbergraph_WBP_Recollection_BossRush_Leaderboard(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Recollection_BossRush_Leaderboard_C">();
	}
	static class UWBP_Recollection_BossRush_Leaderboard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Recollection_BossRush_Leaderboard_C>();
	}
};
static_assert(alignof(UWBP_Recollection_BossRush_Leaderboard_C) == 0x000008, "Wrong alignment on UWBP_Recollection_BossRush_Leaderboard_C");
static_assert(sizeof(UWBP_Recollection_BossRush_Leaderboard_C) == 0x000490, "Wrong size on UWBP_Recollection_BossRush_Leaderboard_C");
static_assert(offsetof(UWBP_Recollection_BossRush_Leaderboard_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Recollection_BossRush_Leaderboard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_Leaderboard_C, WBP_Recollection_BossRush_RecordEntry_1) == 0x000468, "Member 'UWBP_Recollection_BossRush_Leaderboard_C::WBP_Recollection_BossRush_RecordEntry_1' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_Leaderboard_C, WBP_Recollection_BossRush_RecordEntry_2) == 0x000470, "Member 'UWBP_Recollection_BossRush_Leaderboard_C::WBP_Recollection_BossRush_RecordEntry_2' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_Leaderboard_C, WBP_Recollection_BossRush_RecordEntry_3) == 0x000478, "Member 'UWBP_Recollection_BossRush_Leaderboard_C::WBP_Recollection_BossRush_RecordEntry_3' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_Leaderboard_C, RecordEntries) == 0x000480, "Member 'UWBP_Recollection_BossRush_Leaderboard_C::RecordEntries' has a wrong offset!");

}

