#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MapCursor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MapCursor.WBP_MapCursor_C
// 0x0020 (0x0500 - 0x04E0)
class UWBP_MapCursor_C final : public UUserWidgetMapCursor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideAnim;                                          // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOnIcon;                                          // 0x04F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_MapCursor(int32 EntryPoint);
	void OnLeaveIcon();
	void OnReachedIcon();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MapCursor_C">();
	}
	static class UWBP_MapCursor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MapCursor_C>();
	}
};
static_assert(alignof(UWBP_MapCursor_C) == 0x000008, "Wrong alignment on UWBP_MapCursor_C");
static_assert(sizeof(UWBP_MapCursor_C) == 0x000500, "Wrong size on UWBP_MapCursor_C");
static_assert(offsetof(UWBP_MapCursor_C, UberGraphFrame) == 0x0004E0, "Member 'UWBP_MapCursor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MapCursor_C, HideAnim) == 0x0004E8, "Member 'UWBP_MapCursor_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UWBP_MapCursor_C, ShowAnim) == 0x0004F0, "Member 'UWBP_MapCursor_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UWBP_MapCursor_C, IsOnIcon) == 0x0004F8, "Member 'UWBP_MapCursor_C::IsOnIcon' has a wrong offset!");

}

