#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WorldSpace_RestoreHealingItems

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_WorldSpace_RestoreHealingItems.WBP_WorldSpace_RestoreHealingItems_C
// 0x0028 (0x0340 - 0x0318)
class UWBP_WorldSpace_RestoreHealingItems_C final : public UUserWidgetWorldSpace
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideAnim;                                          // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             RestoredCountText;                                 // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         DisplayTime;                                       // 0x0338(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void WidgetAnimationEvt_HideAnim_K2Node_WidgetAnimationEvent_2();
	void SetRestoredHealingItemCount(int32 RestoredCount);
	void OnShow();
	void OnHide();
	void ExecuteUbergraph_WBP_WorldSpace_RestoreHealingItems(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_WorldSpace_RestoreHealingItems_C">();
	}
	static class UWBP_WorldSpace_RestoreHealingItems_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_WorldSpace_RestoreHealingItems_C>();
	}
};
static_assert(alignof(UWBP_WorldSpace_RestoreHealingItems_C) == 0x000008, "Wrong alignment on UWBP_WorldSpace_RestoreHealingItems_C");
static_assert(sizeof(UWBP_WorldSpace_RestoreHealingItems_C) == 0x000340, "Wrong size on UWBP_WorldSpace_RestoreHealingItems_C");
static_assert(offsetof(UWBP_WorldSpace_RestoreHealingItems_C, UberGraphFrame) == 0x000318, "Member 'UWBP_WorldSpace_RestoreHealingItems_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_WorldSpace_RestoreHealingItems_C, HideAnim) == 0x000320, "Member 'UWBP_WorldSpace_RestoreHealingItems_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UWBP_WorldSpace_RestoreHealingItems_C, ShowAnim) == 0x000328, "Member 'UWBP_WorldSpace_RestoreHealingItems_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UWBP_WorldSpace_RestoreHealingItems_C, RestoredCountText) == 0x000330, "Member 'UWBP_WorldSpace_RestoreHealingItems_C::RestoredCountText' has a wrong offset!");
static_assert(offsetof(UWBP_WorldSpace_RestoreHealingItems_C, DisplayTime) == 0x000338, "Member 'UWBP_WorldSpace_RestoreHealingItems_C::DisplayTime' has a wrong offset!");

}

