#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EquipSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_EquipSlot.WBP_EquipSlot_C
// 0x0078 (0x04F8 - 0x0480)
class UWBP_EquipSlot_C : public UUserWidgetButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Focused;                                           // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Icon_LR;                                           // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Type;                                         // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_FocusedContainer;                          // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_SelectedContainer;                         // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Item_C*                     WBP_Button_Item;                                   // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWBP_EquipSlot_C* SlotEntry)> OnPressed;                     // 0x04B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FDataTableRowHandle                    EquipHandle;                                       // 0x04C8(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor)
	TMulticastInlineDelegate<void(class UWBP_EquipSlot_C* EquipmentSlot)> OnFocusedEquipSlot;        // 0x04D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UPaperSprite*                           SpriteLR;                                          // 0x04E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           SpriteType;                                        // 0x04F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_EquipSlot(int32 EntryPoint);
	void OnFocusStateChanged(bool bFocused);
	struct FEventReply OnPressConfirm(const struct FKeyEvent& KeyEvent);
	void PreConstruct(bool IsDesignTime);
	void Refresh();
	void SetFocusedState(bool Focus);
	void SetSelected(bool bSelected);
	void Setup(const struct FDataTableRowHandle& EquipmentHandle);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_EquipSlot_C">();
	}
	static class UWBP_EquipSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_EquipSlot_C>();
	}
};
static_assert(alignof(UWBP_EquipSlot_C) == 0x000008, "Wrong alignment on UWBP_EquipSlot_C");
static_assert(sizeof(UWBP_EquipSlot_C) == 0x0004F8, "Wrong size on UWBP_EquipSlot_C");
static_assert(offsetof(UWBP_EquipSlot_C, UberGraphFrame) == 0x000480, "Member 'UWBP_EquipSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_EquipSlot_C, Focused) == 0x000488, "Member 'UWBP_EquipSlot_C::Focused' has a wrong offset!");
static_assert(offsetof(UWBP_EquipSlot_C, Icon_LR) == 0x000490, "Member 'UWBP_EquipSlot_C::Icon_LR' has a wrong offset!");
static_assert(offsetof(UWBP_EquipSlot_C, Icon_Type) == 0x000498, "Member 'UWBP_EquipSlot_C::Icon_Type' has a wrong offset!");
static_assert(offsetof(UWBP_EquipSlot_C, Overlay_FocusedContainer) == 0x0004A0, "Member 'UWBP_EquipSlot_C::Overlay_FocusedContainer' has a wrong offset!");
static_assert(offsetof(UWBP_EquipSlot_C, Overlay_SelectedContainer) == 0x0004A8, "Member 'UWBP_EquipSlot_C::Overlay_SelectedContainer' has a wrong offset!");
static_assert(offsetof(UWBP_EquipSlot_C, WBP_Button_Item) == 0x0004B0, "Member 'UWBP_EquipSlot_C::WBP_Button_Item' has a wrong offset!");
static_assert(offsetof(UWBP_EquipSlot_C, OnPressed) == 0x0004B8, "Member 'UWBP_EquipSlot_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UWBP_EquipSlot_C, EquipHandle) == 0x0004C8, "Member 'UWBP_EquipSlot_C::EquipHandle' has a wrong offset!");
static_assert(offsetof(UWBP_EquipSlot_C, OnFocusedEquipSlot) == 0x0004D8, "Member 'UWBP_EquipSlot_C::OnFocusedEquipSlot' has a wrong offset!");
static_assert(offsetof(UWBP_EquipSlot_C, SpriteLR) == 0x0004E8, "Member 'UWBP_EquipSlot_C::SpriteLR' has a wrong offset!");
static_assert(offsetof(UWBP_EquipSlot_C, SpriteType) == 0x0004F0, "Member 'UWBP_EquipSlot_C::SpriteType' has a wrong offset!");

}

