#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MapIconDetails_RestPoint

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function WBP_MapIconDetails_RestPoint.WBP_MapIconDetails_RestPoint_C.CanFastTravel
// 0x0018 (0x0018 - 0x0000)
struct WBP_MapIconDetails_RestPoint_C_CanFastTravel final
{
public:
	bool                                          CanFastTravel_0;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAptitudeType                                 FastTravelAptitude;                                // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAptitude_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapIconDetails_RestPoint_C_CanFastTravel) == 0x000008, "Wrong alignment on WBP_MapIconDetails_RestPoint_C_CanFastTravel");
static_assert(sizeof(WBP_MapIconDetails_RestPoint_C_CanFastTravel) == 0x000018, "Wrong size on WBP_MapIconDetails_RestPoint_C_CanFastTravel");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_CanFastTravel, CanFastTravel_0) == 0x000000, "Member 'WBP_MapIconDetails_RestPoint_C_CanFastTravel::CanFastTravel_0' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_CanFastTravel, FastTravelAptitude) == 0x000001, "Member 'WBP_MapIconDetails_RestPoint_C_CanFastTravel::FastTravelAptitude' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_CanFastTravel, CallFunc_Get_ReturnValue) == 0x000008, "Member 'WBP_MapIconDetails_RestPoint_C_CanFastTravel::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_CanFastTravel, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_MapIconDetails_RestPoint_C_CanFastTravel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_CanFastTravel, CallFunc_HasAptitude_ReturnValue) == 0x000011, "Member 'WBP_MapIconDetails_RestPoint_C_CanFastTravel::CallFunc_HasAptitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_CanFastTravel, CallFunc_BooleanOR_ReturnValue) == 0x000012, "Member 'WBP_MapIconDetails_RestPoint_C_CanFastTravel::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_MapIconDetails_RestPoint.WBP_MapIconDetails_RestPoint_C.ExecuteUbergraph_WBP_MapIconDetails_RestPoint
// 0x0060 (0x0060 - 0x0000)
struct WBP_MapIconDetails_RestPoint_C_ExecuteUbergraph_WBP_MapIconDetails_RestPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidgetMapIcon_RestPoint*           K2Node_DynamicCast_AsUser_Widget_Map_Icon_Rest_Point; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMapRestPointData                      CallFunc_GetRestPointData_ReturnValue;             // 0x0034(0x0008)(NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInstant;                             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue_1;           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapIconDetails_RestPoint_C_ExecuteUbergraph_WBP_MapIconDetails_RestPoint) == 0x000008, "Wrong alignment on WBP_MapIconDetails_RestPoint_C_ExecuteUbergraph_WBP_MapIconDetails_RestPoint");
static_assert(sizeof(WBP_MapIconDetails_RestPoint_C_ExecuteUbergraph_WBP_MapIconDetails_RestPoint) == 0x000060, "Wrong size on WBP_MapIconDetails_RestPoint_C_ExecuteUbergraph_WBP_MapIconDetails_RestPoint");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_ExecuteUbergraph_WBP_MapIconDetails_RestPoint, EntryPoint) == 0x000000, "Member 'WBP_MapIconDetails_RestPoint_C_ExecuteUbergraph_WBP_MapIconDetails_RestPoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_ExecuteUbergraph_WBP_MapIconDetails_RestPoint, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_MapIconDetails_RestPoint_C_ExecuteUbergraph_WBP_MapIconDetails_RestPoint::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_ExecuteUbergraph_WBP_MapIconDetails_RestPoint, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_MapIconDetails_RestPoint_C_ExecuteUbergraph_WBP_MapIconDetails_RestPoint::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_ExecuteUbergraph_WBP_MapIconDetails_RestPoint, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'WBP_MapIconDetails_RestPoint_C_ExecuteUbergraph_WBP_MapIconDetails_RestPoint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_ExecuteUbergraph_WBP_MapIconDetails_RestPoint, K2Node_DynamicCast_AsUser_Widget_Map_Icon_Rest_Point) == 0x000028, "Member 'WBP_MapIconDetails_RestPoint_C_ExecuteUbergraph_WBP_MapIconDetails_RestPoint::K2Node_DynamicCast_AsUser_Widget_Map_Icon_Rest_Point' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_ExecuteUbergraph_WBP_MapIconDetails_RestPoint, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_MapIconDetails_RestPoint_C_ExecuteUbergraph_WBP_MapIconDetails_RestPoint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_ExecuteUbergraph_WBP_MapIconDetails_RestPoint, CallFunc_GetRestPointData_ReturnValue) == 0x000034, "Member 'WBP_MapIconDetails_RestPoint_C_ExecuteUbergraph_WBP_MapIconDetails_RestPoint::CallFunc_GetRestPointData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_ExecuteUbergraph_WBP_MapIconDetails_RestPoint, CallFunc_PlayUMGAnimation_ReturnValue) == 0x000040, "Member 'WBP_MapIconDetails_RestPoint_C_ExecuteUbergraph_WBP_MapIconDetails_RestPoint::CallFunc_PlayUMGAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_ExecuteUbergraph_WBP_MapIconDetails_RestPoint, K2Node_Event_bInstant) == 0x000048, "Member 'WBP_MapIconDetails_RestPoint_C_ExecuteUbergraph_WBP_MapIconDetails_RestPoint::K2Node_Event_bInstant' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_ExecuteUbergraph_WBP_MapIconDetails_RestPoint, CallFunc_Not_PreBool_ReturnValue) == 0x000049, "Member 'WBP_MapIconDetails_RestPoint_C_ExecuteUbergraph_WBP_MapIconDetails_RestPoint::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_ExecuteUbergraph_WBP_MapIconDetails_RestPoint, CallFunc_IsValid_ReturnValue_1) == 0x00004A, "Member 'WBP_MapIconDetails_RestPoint_C_ExecuteUbergraph_WBP_MapIconDetails_RestPoint::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_ExecuteUbergraph_WBP_MapIconDetails_RestPoint, CallFunc_PlayUMGAnimation_ReturnValue_1) == 0x000050, "Member 'WBP_MapIconDetails_RestPoint_C_ExecuteUbergraph_WBP_MapIconDetails_RestPoint::CallFunc_PlayUMGAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_ExecuteUbergraph_WBP_MapIconDetails_RestPoint, CallFunc_IsValid_ReturnValue_2) == 0x000058, "Member 'WBP_MapIconDetails_RestPoint_C_ExecuteUbergraph_WBP_MapIconDetails_RestPoint::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function WBP_MapIconDetails_RestPoint.WBP_MapIconDetails_RestPoint_C.OnFocusReceived
// 0x0270 (0x0270 - 0x0000)
struct WBP_MapIconDetails_RestPoint_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x00F8(0x00B8)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x01B8(0x00B8)()
};
static_assert(alignof(WBP_MapIconDetails_RestPoint_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_MapIconDetails_RestPoint_C_OnFocusReceived");
static_assert(sizeof(WBP_MapIconDetails_RestPoint_C_OnFocusReceived) == 0x000270, "Wrong size on WBP_MapIconDetails_RestPoint_C_OnFocusReceived");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_MapIconDetails_RestPoint_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_MapIconDetails_RestPoint_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_MapIconDetails_RestPoint_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_OnFocusReceived, CallFunc_Unhandled_ReturnValue) == 0x0000F8, "Member 'WBP_MapIconDetails_RestPoint_C_OnFocusReceived::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_OnFocusReceived, CallFunc_Not_PreBool_ReturnValue) == 0x0001B0, "Member 'WBP_MapIconDetails_RestPoint_C_OnFocusReceived::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0001B8, "Member 'WBP_MapIconDetails_RestPoint_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_MapIconDetails_RestPoint.WBP_MapIconDetails_RestPoint_C.OnPressConfirm
// 0x0270 (0x0270 - 0x0000)
struct WBP_MapIconDetails_RestPoint_C_OnPressConfirm final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x00F8(0x00B8)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x01B8(0x00B8)()
};
static_assert(alignof(WBP_MapIconDetails_RestPoint_C_OnPressConfirm) == 0x000008, "Wrong alignment on WBP_MapIconDetails_RestPoint_C_OnPressConfirm");
static_assert(sizeof(WBP_MapIconDetails_RestPoint_C_OnPressConfirm) == 0x000270, "Wrong size on WBP_MapIconDetails_RestPoint_C_OnPressConfirm");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_OnPressConfirm, KeyEvent) == 0x000000, "Member 'WBP_MapIconDetails_RestPoint_C_OnPressConfirm::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_OnPressConfirm, ReturnValue) == 0x000040, "Member 'WBP_MapIconDetails_RestPoint_C_OnPressConfirm::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_OnPressConfirm, CallFunc_Unhandled_ReturnValue) == 0x0000F8, "Member 'WBP_MapIconDetails_RestPoint_C_OnPressConfirm::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_OnPressConfirm, CallFunc_Not_PreBool_ReturnValue) == 0x0001B0, "Member 'WBP_MapIconDetails_RestPoint_C_OnPressConfirm::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_OnPressConfirm, CallFunc_Handled_ReturnValue) == 0x0001B8, "Member 'WBP_MapIconDetails_RestPoint_C_OnPressConfirm::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_MapIconDetails_RestPoint.WBP_MapIconDetails_RestPoint_C.OnRemoveIconDetails
// 0x0001 (0x0001 - 0x0000)
struct WBP_MapIconDetails_RestPoint_C_OnRemoveIconDetails final
{
public:
	bool                                          bInstant;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapIconDetails_RestPoint_C_OnRemoveIconDetails) == 0x000001, "Wrong alignment on WBP_MapIconDetails_RestPoint_C_OnRemoveIconDetails");
static_assert(sizeof(WBP_MapIconDetails_RestPoint_C_OnRemoveIconDetails) == 0x000001, "Wrong size on WBP_MapIconDetails_RestPoint_C_OnRemoveIconDetails");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_OnRemoveIconDetails, bInstant) == 0x000000, "Member 'WBP_MapIconDetails_RestPoint_C_OnRemoveIconDetails::bInstant' has a wrong offset!");

// Function WBP_MapIconDetails_RestPoint.WBP_MapIconDetails_RestPoint_C.Refresh Fast Travel Button
// 0x0030 (0x0030 - 0x0000)
struct WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button final
{
public:
	EAptitudeType                                 FastTravelAptitude;                                // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanFastTravel_CanFastTravel;              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFastTravelLocked_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAptitude_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button) == 0x000008, "Wrong alignment on WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button");
static_assert(sizeof(WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button) == 0x000030, "Wrong size on WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button, FastTravelAptitude) == 0x000000, "Member 'WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button::FastTravelAptitude' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button, Temp_byte_Variable) == 0x000001, "Member 'WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button, Temp_bool_Variable) == 0x000003, "Member 'WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button, Temp_bool_Variable_1) == 0x000004, "Member 'WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button, Temp_byte_Variable_2) == 0x000005, "Member 'WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button, Temp_byte_Variable_3) == 0x000006, "Member 'WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button, CallFunc_CanFastTravel_CanFastTravel) == 0x000007, "Member 'WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button::CallFunc_CanFastTravel_CanFastTravel' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button, Temp_bool_Variable_2) == 0x000008, "Member 'WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button, CallFunc_Get_ReturnValue) == 0x000010, "Member 'WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button, CallFunc_IsFastTravelLocked_ReturnValue) == 0x000018, "Member 'WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button::CallFunc_IsFastTravelLocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button, CallFunc_Not_PreBool_ReturnValue_1) == 0x00001A, "Member 'WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button, CallFunc_BooleanAND_ReturnValue) == 0x00001B, "Member 'WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button, CallFunc_BooleanOR_ReturnValue) == 0x00001C, "Member 'WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button, CallFunc_HasAptitude_ReturnValue) == 0x00001D, "Member 'WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button::CallFunc_HasAptitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button, CallFunc_BooleanOR_ReturnValue_1) == 0x00001E, "Member 'WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button, K2Node_Select_Default) == 0x000020, "Member 'WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button, K2Node_Select_Default_1) == 0x000028, "Member 'WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button, CallFunc_BooleanAND_ReturnValue_1) == 0x000029, "Member 'WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button, K2Node_Select_Default_2) == 0x00002A, "Member 'WBP_MapIconDetails_RestPoint_C_Refresh_Fast_Travel_Button::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_MapIconDetails_RestPoint.WBP_MapIconDetails_RestPoint_C.RefreshWidgetDetails
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_MapIconDetails_RestPoint_C_RefreshWidgetDetails final
{
public:
	class AGameModeZion*                          CallFunc_Get_ReturnValue;                          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             CallFunc_GetDataTableRestPoints_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidgetMapIcon_RestPoint*           K2Node_DynamicCast_AsUser_Widget_Map_Icon_Rest_Point; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMapRestPointData                      CallFunc_GetRestPointData_ReturnValue;             // 0x0024(0x0008)(NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRestPointData                         CallFunc_GetDataTableRowFromName_OutRow;           // 0x0030(0x0088)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapIconDetails_RestPoint_C_RefreshWidgetDetails) == 0x000008, "Wrong alignment on WBP_MapIconDetails_RestPoint_C_RefreshWidgetDetails");
static_assert(sizeof(WBP_MapIconDetails_RestPoint_C_RefreshWidgetDetails) == 0x0000C0, "Wrong size on WBP_MapIconDetails_RestPoint_C_RefreshWidgetDetails");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_RefreshWidgetDetails, CallFunc_Get_ReturnValue) == 0x000000, "Member 'WBP_MapIconDetails_RestPoint_C_RefreshWidgetDetails::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_RefreshWidgetDetails, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_MapIconDetails_RestPoint_C_RefreshWidgetDetails::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_RefreshWidgetDetails, CallFunc_IsValid_ReturnValue_1) == 0x000009, "Member 'WBP_MapIconDetails_RestPoint_C_RefreshWidgetDetails::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_RefreshWidgetDetails, CallFunc_GetDataTableRestPoints_ReturnValue) == 0x000010, "Member 'WBP_MapIconDetails_RestPoint_C_RefreshWidgetDetails::CallFunc_GetDataTableRestPoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_RefreshWidgetDetails, K2Node_DynamicCast_AsUser_Widget_Map_Icon_Rest_Point) == 0x000018, "Member 'WBP_MapIconDetails_RestPoint_C_RefreshWidgetDetails::K2Node_DynamicCast_AsUser_Widget_Map_Icon_Rest_Point' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_RefreshWidgetDetails, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_MapIconDetails_RestPoint_C_RefreshWidgetDetails::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_RefreshWidgetDetails, CallFunc_IsValid_ReturnValue_2) == 0x000021, "Member 'WBP_MapIconDetails_RestPoint_C_RefreshWidgetDetails::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_RefreshWidgetDetails, CallFunc_GetRestPointData_ReturnValue) == 0x000024, "Member 'WBP_MapIconDetails_RestPoint_C_RefreshWidgetDetails::CallFunc_GetRestPointData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_RefreshWidgetDetails, CallFunc_GetDataTableRowFromName_OutRow) == 0x000030, "Member 'WBP_MapIconDetails_RestPoint_C_RefreshWidgetDetails::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_RefreshWidgetDetails, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000B8, "Member 'WBP_MapIconDetails_RestPoint_C_RefreshWidgetDetails::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function WBP_MapIconDetails_RestPoint.WBP_MapIconDetails_RestPoint_C.SetIgnoreCanFastTravelCheck
// 0x0001 (0x0001 - 0x0000)
struct WBP_MapIconDetails_RestPoint_C_SetIgnoreCanFastTravelCheck final
{
public:
	bool                                          IgnoreCanFastTravelCheck_0;                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapIconDetails_RestPoint_C_SetIgnoreCanFastTravelCheck) == 0x000001, "Wrong alignment on WBP_MapIconDetails_RestPoint_C_SetIgnoreCanFastTravelCheck");
static_assert(sizeof(WBP_MapIconDetails_RestPoint_C_SetIgnoreCanFastTravelCheck) == 0x000001, "Wrong size on WBP_MapIconDetails_RestPoint_C_SetIgnoreCanFastTravelCheck");
static_assert(offsetof(WBP_MapIconDetails_RestPoint_C_SetIgnoreCanFastTravelCheck, IgnoreCanFastTravelCheck_0) == 0x000000, "Member 'WBP_MapIconDetails_RestPoint_C_SetIgnoreCanFastTravelCheck::IgnoreCanFastTravelCheck_0' has a wrong offset!");

}

