#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_Entry_Choice_AspectRatio

#include "Basic.hpp"

#include "Zion_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Settings_Entry_Choice_AspectRatio.WBP_Settings_Entry_Choice_AspectRatio_C.ComputeCurrentAspectRatioIndex
// 0x0008 (0x0008 - 0x0000)
struct WBP_Settings_Entry_Choice_AspectRatio_C_ComputeCurrentAspectRatioIndex final
{
public:
	EConstraintCameraAspectRatio                  CallFunc_GetConstraintAspectRatio_ConstraintAspectRatio; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Choice_AspectRatio_C_ComputeCurrentAspectRatioIndex) == 0x000004, "Wrong alignment on WBP_Settings_Entry_Choice_AspectRatio_C_ComputeCurrentAspectRatioIndex");
static_assert(sizeof(WBP_Settings_Entry_Choice_AspectRatio_C_ComputeCurrentAspectRatioIndex) == 0x000008, "Wrong size on WBP_Settings_Entry_Choice_AspectRatio_C_ComputeCurrentAspectRatioIndex");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_ComputeCurrentAspectRatioIndex, CallFunc_GetConstraintAspectRatio_ConstraintAspectRatio) == 0x000000, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_ComputeCurrentAspectRatioIndex::CallFunc_GetConstraintAspectRatio_ConstraintAspectRatio' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_ComputeCurrentAspectRatioIndex, CallFunc_Array_Find_ReturnValue) == 0x000004, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_ComputeCurrentAspectRatioIndex::CallFunc_Array_Find_ReturnValue' has a wrong offset!");

// Function WBP_Settings_Entry_Choice_AspectRatio.WBP_Settings_Entry_Choice_AspectRatio_C.ExecuteUbergraph_WBP_Settings_Entry_Choice_AspectRatio
// 0x0028 (0x0028 - 0x0000)
struct WBP_Settings_Entry_Choice_AspectRatio_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AspectRatio final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_LoopAround_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Choice_AspectRatio_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AspectRatio) == 0x000004, "Wrong alignment on WBP_Settings_Entry_Choice_AspectRatio_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AspectRatio");
static_assert(sizeof(WBP_Settings_Entry_Choice_AspectRatio_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AspectRatio) == 0x000028, "Wrong size on WBP_Settings_Entry_Choice_AspectRatio_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AspectRatio");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AspectRatio, EntryPoint) == 0x000000, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AspectRatio::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AspectRatio, Temp_int_Variable) == 0x000004, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AspectRatio::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AspectRatio, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AspectRatio::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AspectRatio, Temp_int_Variable_1) == 0x00000C, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AspectRatio::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AspectRatio, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AspectRatio::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AspectRatio, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AspectRatio::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AspectRatio, CallFunc_Array_Length_ReturnValue_1) == 0x000018, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AspectRatio::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AspectRatio, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00001C, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AspectRatio::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AspectRatio, K2Node_Event_IsDesignTime) == 0x000020, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AspectRatio::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AspectRatio, CallFunc_LoopAround_ReturnValue) == 0x000024, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AspectRatio::CallFunc_LoopAround_ReturnValue' has a wrong offset!");

// Function WBP_Settings_Entry_Choice_AspectRatio.WBP_Settings_Entry_Choice_AspectRatio_C.GetConstraintAspectRatio
// 0x0018 (0x0018 - 0x0000)
struct WBP_Settings_Entry_Choice_AspectRatio_C_GetConstraintAspectRatio final
{
public:
	EConstraintCameraAspectRatio                  ConstraintAspectRatio;                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EConstraintCameraAspectRatio                  CallFunc_GetConstraintCameraAspectRatio_ReturnValue; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EConstraintCameraAspectRatio                  CallFunc_GetUIAspectRatio_ReturnValue;             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EConstraintCameraAspectRatio                  K2Node_Select_Default;                             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Choice_AspectRatio_C_GetConstraintAspectRatio) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Choice_AspectRatio_C_GetConstraintAspectRatio");
static_assert(sizeof(WBP_Settings_Entry_Choice_AspectRatio_C_GetConstraintAspectRatio) == 0x000018, "Wrong size on WBP_Settings_Entry_Choice_AspectRatio_C_GetConstraintAspectRatio");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_GetConstraintAspectRatio, ConstraintAspectRatio) == 0x000000, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_GetConstraintAspectRatio::ConstraintAspectRatio' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_GetConstraintAspectRatio, Temp_bool_Variable) == 0x000001, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_GetConstraintAspectRatio::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_GetConstraintAspectRatio, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_GetConstraintAspectRatio::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_GetConstraintAspectRatio, CallFunc_GetConstraintCameraAspectRatio_ReturnValue) == 0x000010, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_GetConstraintAspectRatio::CallFunc_GetConstraintCameraAspectRatio_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_GetConstraintAspectRatio, CallFunc_GetUIAspectRatio_ReturnValue) == 0x000011, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_GetConstraintAspectRatio::CallFunc_GetUIAspectRatio_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_GetConstraintAspectRatio, K2Node_Select_Default) == 0x000012, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_GetConstraintAspectRatio::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Settings_Entry_Choice_AspectRatio.WBP_Settings_Entry_Choice_AspectRatio_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Settings_Entry_Choice_AspectRatio_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Settings_Entry_Choice_AspectRatio_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Choice_AspectRatio_C_OnFocusReceived");
static_assert(sizeof(WBP_Settings_Entry_Choice_AspectRatio_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_Settings_Entry_Choice_AspectRatio_C_OnFocusReceived");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Settings_Entry_Choice_AspectRatio.WBP_Settings_Entry_Choice_AspectRatio_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_Entry_Choice_AspectRatio_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Choice_AspectRatio_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Settings_Entry_Choice_AspectRatio_C_PreConstruct");
static_assert(sizeof(WBP_Settings_Entry_Choice_AspectRatio_C_PreConstruct) == 0x000001, "Wrong size on WBP_Settings_Entry_Choice_AspectRatio_C_PreConstruct");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Settings_Entry_Choice_AspectRatio.WBP_Settings_Entry_Choice_AspectRatio_C.RefreshText
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_Entry_Choice_AspectRatio_C_RefreshText final
{
public:
	EConstraintCameraAspectRatio                  CallFunc_GetConstraintAspectRatio_ConstraintAspectRatio; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0008(0x0010)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Choice_AspectRatio_C_RefreshText) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Choice_AspectRatio_C_RefreshText");
static_assert(sizeof(WBP_Settings_Entry_Choice_AspectRatio_C_RefreshText) == 0x000020, "Wrong size on WBP_Settings_Entry_Choice_AspectRatio_C_RefreshText");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_RefreshText, CallFunc_GetConstraintAspectRatio_ConstraintAspectRatio) == 0x000000, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_RefreshText::CallFunc_GetConstraintAspectRatio_ConstraintAspectRatio' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_RefreshText, CallFunc_Map_Find_Value) == 0x000008, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_RefreshText::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_RefreshText, CallFunc_Map_Find_ReturnValue) == 0x000018, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_RefreshText::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WBP_Settings_Entry_Choice_AspectRatio.WBP_Settings_Entry_Choice_AspectRatio_C.SetAspectRatio
// 0x0028 (0x0028 - 0x0000)
struct WBP_Settings_Entry_Choice_AspectRatio_C_SetAspectRatio final
{
public:
	int32                                         ResolutionIndex;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EConstraintCameraAspectRatio                  CallFunc_SetUIAspectRatio_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EConstraintCameraAspectRatio                  CallFunc_SetConstraintCameraAspectRatio_ReturnValue; // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Choice_AspectRatio_C_SetAspectRatio) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Choice_AspectRatio_C_SetAspectRatio");
static_assert(sizeof(WBP_Settings_Entry_Choice_AspectRatio_C_SetAspectRatio) == 0x000028, "Wrong size on WBP_Settings_Entry_Choice_AspectRatio_C_SetAspectRatio");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_SetAspectRatio, ResolutionIndex) == 0x000000, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_SetAspectRatio::ResolutionIndex' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_SetAspectRatio, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_SetAspectRatio::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_SetAspectRatio, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_SetAspectRatio::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_SetAspectRatio, CallFunc_SetUIAspectRatio_ReturnValue) == 0x000014, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_SetAspectRatio::CallFunc_SetUIAspectRatio_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_SetAspectRatio, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_SetAspectRatio::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_SetAspectRatio, CallFunc_SetConstraintCameraAspectRatio_ReturnValue) == 0x00001C, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_SetAspectRatio::CallFunc_SetConstraintCameraAspectRatio_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AspectRatio_C_SetAspectRatio, CallFunc_Clamp_ReturnValue) == 0x000020, "Member 'WBP_Settings_Entry_Choice_AspectRatio_C_SetAspectRatio::CallFunc_Clamp_ReturnValue' has a wrong offset!");

}

