#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_Entry_Choice_AntiAliasingQuality

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Settings_Entry_Choice_AntiAliasingQuality.WBP_Settings_Entry_Choice_AntiAliasingQuality_C
// 0x0028 (0x0488 - 0x0460)
class UWBP_Settings_Entry_Choice_AntiAliasingQuality_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Settings_Entry_Choice_Text_C*      WBP_Settings_Entry_Choice_Text;                    // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrIndex;                                         // 0x0470(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_474[0x4];                                      // 0x0474(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           AntiAliasingQualities;                             // 0x0478(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)

public:
	void BndEvt__WBP_Settings_Entry_Choice_FPSLimit_WBP_Settings_Entry_Choice_Text_K2Node_ComponentBoundEvent_0_OnLeft__DelegateSignature();
	void BndEvt__WBP_Settings_Entry_Choice_FPSLimit_WBP_Settings_Entry_Choice_Text_K2Node_ComponentBoundEvent_1_OnRight__DelegateSignature();
	void ComputeCurrIndex();
	void Construct();
	void ExecuteUbergraph_WBP_Settings_Entry_Choice_AntiAliasingQuality(int32 EntryPoint);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnSetIsEnabled(bool bInIsEnabled);
	void PreConstruct(bool IsDesignTime);
	void Refresh();
	void RefreshText();
	void SetAAQualityFromIndex(int32 Index_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Settings_Entry_Choice_AntiAliasingQuality_C">();
	}
	static class UWBP_Settings_Entry_Choice_AntiAliasingQuality_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Settings_Entry_Choice_AntiAliasingQuality_C>();
	}
};
static_assert(alignof(UWBP_Settings_Entry_Choice_AntiAliasingQuality_C) == 0x000008, "Wrong alignment on UWBP_Settings_Entry_Choice_AntiAliasingQuality_C");
static_assert(sizeof(UWBP_Settings_Entry_Choice_AntiAliasingQuality_C) == 0x000488, "Wrong size on UWBP_Settings_Entry_Choice_AntiAliasingQuality_C");
static_assert(offsetof(UWBP_Settings_Entry_Choice_AntiAliasingQuality_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Settings_Entry_Choice_AntiAliasingQuality_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_Choice_AntiAliasingQuality_C, WBP_Settings_Entry_Choice_Text) == 0x000468, "Member 'UWBP_Settings_Entry_Choice_AntiAliasingQuality_C::WBP_Settings_Entry_Choice_Text' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_Choice_AntiAliasingQuality_C, CurrIndex) == 0x000470, "Member 'UWBP_Settings_Entry_Choice_AntiAliasingQuality_C::CurrIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_Choice_AntiAliasingQuality_C, AntiAliasingQualities) == 0x000478, "Member 'UWBP_Settings_Entry_Choice_AntiAliasingQuality_C::AntiAliasingQualities' has a wrong offset!");

}

