#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugMenu_Page_Default

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function WBP_DebugMenu_Page_Default.WBP_DebugMenu_Page_Default_C.BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Choice_Toggle_SlowMotion_K2Node_ComponentBoundEvent_1_OnToggle__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_DebugMenu_Page_Default_C_BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Choice_Toggle_SlowMotion_K2Node_ComponentBoundEvent_1_OnToggle__DelegateSignature final
{
public:
	bool                                          ToggleValue;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Page_Default_C_BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Choice_Toggle_SlowMotion_K2Node_ComponentBoundEvent_1_OnToggle__DelegateSignature) == 0x000001, "Wrong alignment on WBP_DebugMenu_Page_Default_C_BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Choice_Toggle_SlowMotion_K2Node_ComponentBoundEvent_1_OnToggle__DelegateSignature");
static_assert(sizeof(WBP_DebugMenu_Page_Default_C_BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Choice_Toggle_SlowMotion_K2Node_ComponentBoundEvent_1_OnToggle__DelegateSignature) == 0x000001, "Wrong size on WBP_DebugMenu_Page_Default_C_BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Choice_Toggle_SlowMotion_K2Node_ComponentBoundEvent_1_OnToggle__DelegateSignature");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Choice_Toggle_SlowMotion_K2Node_ComponentBoundEvent_1_OnToggle__DelegateSignature, ToggleValue) == 0x000000, "Member 'WBP_DebugMenu_Page_Default_C_BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Choice_Toggle_SlowMotion_K2Node_ComponentBoundEvent_1_OnToggle__DelegateSignature::ToggleValue' has a wrong offset!");

// Function WBP_DebugMenu_Page_Default.WBP_DebugMenu_Page_Default_C.ExecuteUbergraph_WBP_DebugMenu_Page_Default
// 0x01F8 (0x01F8 - 0x0000)
struct WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Map_C*                             CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFadeSubsystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFadeParameters                        K2Node_MakeStruct_FadeParameters;                  // 0x0020(0x0014)(NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFadeDescriptionData                   K2Node_MakeStruct_FadeDescriptionData;             // 0x0038(0x0020)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_GameMenu_C*                        CallFunc_Create_ReturnValue_1;                     // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Map_C*                             CallFunc_Create_ReturnValue_2;                     // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USaveSubsystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDelayFrameAsyncAction*                 CallFunc_DelayFrame_ReturnValue;                   // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDelayFrameAsyncAction*                 CallFunc_DelayFrame_ReturnValue_1;                 // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Result;                         // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_ToggleValue;            // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB[0x1];                                       // 0x00BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGlobalTimeDilation_ReturnValue;        // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeZion*                          CallFunc_Get_ReturnValue;                          // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             CallFunc_GetDataTableItemSpirits_ReturnValue;      // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameModeZion*                          CallFunc_Get_ReturnValue_1;                        // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             CallFunc_GetDataTableItemAptitudes_ReturnValue;    // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameModeZion*                          CallFunc_Get_ReturnValue_2;                        // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             CallFunc_GetDataTableItemPassives_ReturnValue;     // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameModeZion*                          CallFunc_Get_ReturnValue_3;                        // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             CallFunc_GetDataTableItemSkills_ReturnValue;       // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameModeZion*                          CallFunc_Get_ReturnValue_4;                        // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             CallFunc_GetDataTableItemEquipments_ReturnValue;   // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameModeZion*                          CallFunc_Get_ReturnValue_5;                        // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             CallFunc_GetDataTableItemAssists_ReturnValue;      // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName RestPointID, const struct FRestPointData& RestPointData)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0128(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_RestPointID;                    // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRestPointData                         K2Node_CustomEvent_RestPointData;                  // 0x0140(0x0088)()
	class AGameModeZion*                          CallFunc_Get_ReturnValue_6;                        // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameModeZion*                          CallFunc_Get_ReturnValue_7;                        // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Result)>                  K2Node_CreateDelegate_OutputDelegate_4;            // 0x01E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default) == 0x000008, "Wrong alignment on WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default");
static_assert(sizeof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default) == 0x0001F8, "Wrong size on WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, EntryPoint) == 0x000000, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, K2Node_MakeStruct_FadeParameters) == 0x000020, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::K2Node_MakeStruct_FadeParameters' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, K2Node_MakeStruct_FadeDescriptionData) == 0x000038, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::K2Node_MakeStruct_FadeDescriptionData' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, CallFunc_Create_ReturnValue_1) == 0x000068, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, CallFunc_Create_ReturnValue_2) == 0x000070, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000078, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, K2Node_CreateDelegate_OutputDelegate_1) == 0x000080, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, CallFunc_DelayFrame_ReturnValue) == 0x000090, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::CallFunc_DelayFrame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, K2Node_CreateDelegate_OutputDelegate_2) == 0x000098, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, CallFunc_IsValid_ReturnValue_1) == 0x0000A8, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, CallFunc_DelayFrame_ReturnValue_1) == 0x0000B0, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::CallFunc_DelayFrame_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, K2Node_CustomEvent_Result) == 0x0000B8, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, CallFunc_IsValid_ReturnValue_2) == 0x0000B9, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, K2Node_ComponentBoundEvent_ToggleValue) == 0x0000BA, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::K2Node_ComponentBoundEvent_ToggleValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, CallFunc_GetGlobalTimeDilation_ReturnValue) == 0x0000BC, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::CallFunc_GetGlobalTimeDilation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0000C0, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, CallFunc_Get_ReturnValue) == 0x0000C8, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, CallFunc_GetDataTableItemSpirits_ReturnValue) == 0x0000D0, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::CallFunc_GetDataTableItemSpirits_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, CallFunc_Get_ReturnValue_1) == 0x0000D8, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, CallFunc_GetDataTableItemAptitudes_ReturnValue) == 0x0000E0, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::CallFunc_GetDataTableItemAptitudes_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, CallFunc_Get_ReturnValue_2) == 0x0000E8, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::CallFunc_Get_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, CallFunc_GetDataTableItemPassives_ReturnValue) == 0x0000F0, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::CallFunc_GetDataTableItemPassives_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, CallFunc_Get_ReturnValue_3) == 0x0000F8, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::CallFunc_Get_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, CallFunc_GetDataTableItemSkills_ReturnValue) == 0x000100, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::CallFunc_GetDataTableItemSkills_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, CallFunc_Get_ReturnValue_4) == 0x000108, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::CallFunc_Get_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, CallFunc_GetDataTableItemEquipments_ReturnValue) == 0x000110, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::CallFunc_GetDataTableItemEquipments_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, CallFunc_Get_ReturnValue_5) == 0x000118, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::CallFunc_Get_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, CallFunc_GetDataTableItemAssists_ReturnValue) == 0x000120, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::CallFunc_GetDataTableItemAssists_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, K2Node_CreateDelegate_OutputDelegate_3) == 0x000128, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, K2Node_CustomEvent_RestPointID) == 0x000138, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::K2Node_CustomEvent_RestPointID' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, K2Node_CustomEvent_RestPointData) == 0x000140, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::K2Node_CustomEvent_RestPointData' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, CallFunc_Get_ReturnValue_6) == 0x0001C8, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::CallFunc_Get_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, CallFunc_Get_ReturnValue_7) == 0x0001D0, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::CallFunc_Get_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, CallFunc_MakeLiteralName_ReturnValue) == 0x0001D8, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001E0, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x0001F0, "Member 'WBP_DebugMenu_Page_Default_C_ExecuteUbergraph_WBP_DebugMenu_Page_Default::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_DebugMenu_Page_Default.WBP_DebugMenu_Page_Default_C.Grant All Items from Data Table
// 0x0050 (0x0050 - 0x0000)
struct WBP_DebugMenu_Page_Default_C_Grant_All_Items_from_Data_Table final
{
public:
	class UDataTable*                             Table;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0008(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0028(0x0010)(NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddItem_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Page_Default_C_Grant_All_Items_from_Data_Table) == 0x000008, "Wrong alignment on WBP_DebugMenu_Page_Default_C_Grant_All_Items_from_Data_Table");
static_assert(sizeof(WBP_DebugMenu_Page_Default_C_Grant_All_Items_from_Data_Table) == 0x000050, "Wrong size on WBP_DebugMenu_Page_Default_C_Grant_All_Items_from_Data_Table");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_Grant_All_Items_from_Data_Table, Table) == 0x000000, "Member 'WBP_DebugMenu_Page_Default_C_Grant_All_Items_from_Data_Table::Table' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_Grant_All_Items_from_Data_Table, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000008, "Member 'WBP_DebugMenu_Page_Default_C_Grant_All_Items_from_Data_Table::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_Grant_All_Items_from_Data_Table, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_DebugMenu_Page_Default_C_Grant_All_Items_from_Data_Table::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_Grant_All_Items_from_Data_Table, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'WBP_DebugMenu_Page_Default_C_Grant_All_Items_from_Data_Table::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_Grant_All_Items_from_Data_Table, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_DebugMenu_Page_Default_C_Grant_All_Items_from_Data_Table::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_Grant_All_Items_from_Data_Table, K2Node_MakeStruct_DataTableRowHandle) == 0x000028, "Member 'WBP_DebugMenu_Page_Default_C_Grant_All_Items_from_Data_Table::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_Grant_All_Items_from_Data_Table, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'WBP_DebugMenu_Page_Default_C_Grant_All_Items_from_Data_Table::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_Grant_All_Items_from_Data_Table, CallFunc_Get_ReturnValue) == 0x000040, "Member 'WBP_DebugMenu_Page_Default_C_Grant_All_Items_from_Data_Table::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_Grant_All_Items_from_Data_Table, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'WBP_DebugMenu_Page_Default_C_Grant_All_Items_from_Data_Table::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_Grant_All_Items_from_Data_Table, CallFunc_AddItem_ReturnValue) == 0x000049, "Member 'WBP_DebugMenu_Page_Default_C_Grant_All_Items_from_Data_Table::CallFunc_AddItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_Grant_All_Items_from_Data_Table, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'WBP_DebugMenu_Page_Default_C_Grant_All_Items_from_Data_Table::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_DebugMenu_Page_Default.WBP_DebugMenu_Page_Default_C.OnFastTravelRequested
// 0x0090 (0x0090 - 0x0000)
struct WBP_DebugMenu_Page_Default_C_OnFastTravelRequested final
{
public:
	class FName                                   RestPointID;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRestPointData                         RestPointData;                                     // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_DebugMenu_Page_Default_C_OnFastTravelRequested) == 0x000008, "Wrong alignment on WBP_DebugMenu_Page_Default_C_OnFastTravelRequested");
static_assert(sizeof(WBP_DebugMenu_Page_Default_C_OnFastTravelRequested) == 0x000090, "Wrong size on WBP_DebugMenu_Page_Default_C_OnFastTravelRequested");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_OnFastTravelRequested, RestPointID) == 0x000000, "Member 'WBP_DebugMenu_Page_Default_C_OnFastTravelRequested::RestPointID' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_OnFastTravelRequested, RestPointData) == 0x000008, "Member 'WBP_DebugMenu_Page_Default_C_OnFastTravelRequested::RestPointData' has a wrong offset!");

// Function WBP_DebugMenu_Page_Default.WBP_DebugMenu_Page_Default_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_DebugMenu_Page_Default_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Page_Default_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_DebugMenu_Page_Default_C_OnFocusReceived");
static_assert(sizeof(WBP_DebugMenu_Page_Default_C_OnFocusReceived) == 0x0001B8, "Wrong size on WBP_DebugMenu_Page_Default_C_OnFocusReceived");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_DebugMenu_Page_Default_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_DebugMenu_Page_Default_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_DebugMenu_Page_Default_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_DebugMenu_Page_Default_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_OnFocusReceived, CallFunc_GetChildAt_ReturnValue) == 0x0001B0, "Member 'WBP_DebugMenu_Page_Default_C_OnFocusReceived::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");

// Function WBP_DebugMenu_Page_Default.WBP_DebugMenu_Page_Default_C.OnSaveFinished
// 0x0001 (0x0001 - 0x0000)
struct WBP_DebugMenu_Page_Default_C_OnSaveFinished final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Page_Default_C_OnSaveFinished) == 0x000001, "Wrong alignment on WBP_DebugMenu_Page_Default_C_OnSaveFinished");
static_assert(sizeof(WBP_DebugMenu_Page_Default_C_OnSaveFinished) == 0x000001, "Wrong size on WBP_DebugMenu_Page_Default_C_OnSaveFinished");
static_assert(offsetof(WBP_DebugMenu_Page_Default_C_OnSaveFinished, Result) == 0x000000, "Member 'WBP_DebugMenu_Page_Default_C_OnSaveFinished::Result' has a wrong offset!");

}

