#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WorldSpace_Talk

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "UMG_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_WorldSpace_Talk.WBP_WorldSpace_Talk_C.ExecuteUbergraph_WBP_WorldSpace_Talk
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Text;                                 // 0x0028(0x0010)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_SpeakerName;                          // 0x0040(0x0010)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTalkParameters                        K2Node_Event_TalkParameters;                       // 0x0058(0x0028)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0088(0x0008)(NoDestructor)
	struct FTalkParameters                        Temp_struct_Variable;                              // 0x0090(0x0028)()
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue;             // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue_1;           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk) == 0x000008, "Wrong alignment on WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk");
static_assert(sizeof(WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk) == 0x0000D8, "Wrong size on WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk");
static_assert(offsetof(WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk, EntryPoint) == 0x000000, "Member 'WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk, K2Node_Event_Text) == 0x000028, "Member 'WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk::K2Node_Event_Text' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk, CallFunc_PlayAnimationForward_ReturnValue) == 0x000038, "Member 'WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk, K2Node_Event_SpeakerName) == 0x000040, "Member 'WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk::K2Node_Event_SpeakerName' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000050, "Member 'WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk, K2Node_Event_TalkParameters) == 0x000058, "Member 'WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk::K2Node_Event_TalkParameters' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk, CallFunc_PlayAnimation_ReturnValue) == 0x000080, "Member 'WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk, CallFunc_PlayEvent2D_ReturnValue) == 0x000088, "Member 'WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk, Temp_struct_Variable) == 0x000090, "Member 'WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk, CallFunc_PlayUMGAnimation_ReturnValue) == 0x0000B8, "Member 'WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk::CallFunc_PlayUMGAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk, CallFunc_PlayUMGAnimation_ReturnValue_1) == 0x0000C8, "Member 'WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk::CallFunc_PlayUMGAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk, CallFunc_IsValid_ReturnValue_1) == 0x0000D0, "Member 'WBP_WorldSpace_Talk_C_ExecuteUbergraph_WBP_WorldSpace_Talk::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_WorldSpace_Talk.WBP_WorldSpace_Talk_C.OnTalk
// 0x0028 (0x0028 - 0x0000)
struct WBP_WorldSpace_Talk_C_OnTalk final
{
public:
	struct FTalkParameters                        TalkParameters;                                    // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_WorldSpace_Talk_C_OnTalk) == 0x000008, "Wrong alignment on WBP_WorldSpace_Talk_C_OnTalk");
static_assert(sizeof(WBP_WorldSpace_Talk_C_OnTalk) == 0x000028, "Wrong size on WBP_WorldSpace_Talk_C_OnTalk");
static_assert(offsetof(WBP_WorldSpace_Talk_C_OnTalk, TalkParameters) == 0x000000, "Member 'WBP_WorldSpace_Talk_C_OnTalk::TalkParameters' has a wrong offset!");

// Function WBP_WorldSpace_Talk.WBP_WorldSpace_Talk_C.SetSpeakerName
// 0x0010 (0x0010 - 0x0000)
struct WBP_WorldSpace_Talk_C_SetSpeakerName final
{
public:
	class FText                                   SpeakerName;                                       // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_WorldSpace_Talk_C_SetSpeakerName) == 0x000008, "Wrong alignment on WBP_WorldSpace_Talk_C_SetSpeakerName");
static_assert(sizeof(WBP_WorldSpace_Talk_C_SetSpeakerName) == 0x000010, "Wrong size on WBP_WorldSpace_Talk_C_SetSpeakerName");
static_assert(offsetof(WBP_WorldSpace_Talk_C_SetSpeakerName, SpeakerName) == 0x000000, "Member 'WBP_WorldSpace_Talk_C_SetSpeakerName::SpeakerName' has a wrong offset!");

// Function WBP_WorldSpace_Talk.WBP_WorldSpace_Talk_C.SetTalk
// 0x0050 (0x0050 - 0x0000)
struct WBP_WorldSpace_Talk_C_SetTalk final
{
public:
	struct FTalkParameters                        TalkParameters;                                    // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETalkDesign                                   Temp_byte_Variable_1;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_1;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldSpace_Talk_C_SetTalk) == 0x000008, "Wrong alignment on WBP_WorldSpace_Talk_C_SetTalk");
static_assert(sizeof(WBP_WorldSpace_Talk_C_SetTalk) == 0x000050, "Wrong size on WBP_WorldSpace_Talk_C_SetTalk");
static_assert(offsetof(WBP_WorldSpace_Talk_C_SetTalk, TalkParameters) == 0x000000, "Member 'WBP_WorldSpace_Talk_C_SetTalk::TalkParameters' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Talk_C_SetTalk, Temp_byte_Variable) == 0x000028, "Member 'WBP_WorldSpace_Talk_C_SetTalk::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Talk_C_SetTalk, Temp_byte_Variable_1) == 0x000029, "Member 'WBP_WorldSpace_Talk_C_SetTalk::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Talk_C_SetTalk, Temp_byte_Variable_2) == 0x00002A, "Member 'WBP_WorldSpace_Talk_C_SetTalk::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Talk_C_SetTalk, Temp_bool_Variable) == 0x00002B, "Member 'WBP_WorldSpace_Talk_C_SetTalk::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Talk_C_SetTalk, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'WBP_WorldSpace_Talk_C_SetTalk::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Talk_C_SetTalk, K2Node_Select_Default) == 0x00003C, "Member 'WBP_WorldSpace_Talk_C_SetTalk::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Talk_C_SetTalk, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000040, "Member 'WBP_WorldSpace_Talk_C_SetTalk::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Talk_C_SetTalk, K2Node_Select_Default_1) == 0x000048, "Member 'WBP_WorldSpace_Talk_C_SetTalk::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_WorldSpace_Talk.WBP_WorldSpace_Talk_C.SetText
// 0x0010 (0x0010 - 0x0000)
struct WBP_WorldSpace_Talk_C_SetText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_WorldSpace_Talk_C_SetText) == 0x000008, "Wrong alignment on WBP_WorldSpace_Talk_C_SetText");
static_assert(sizeof(WBP_WorldSpace_Talk_C_SetText) == 0x000010, "Wrong size on WBP_WorldSpace_Talk_C_SetText");
static_assert(offsetof(WBP_WorldSpace_Talk_C_SetText, Text) == 0x000000, "Member 'WBP_WorldSpace_Talk_C_SetText::Text' has a wrong offset!");

}

