#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HealingItemIcon

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_HealingItemIcon.WBP_HealingItemIcon_C.MarkUsed
// 0x0001 (0x0001 - 0x0000)
struct WBP_HealingItemIcon_C_MarkUsed final
{
public:
	bool                                          SkipAnimation;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HealingItemIcon_C_MarkUsed) == 0x000001, "Wrong alignment on WBP_HealingItemIcon_C_MarkUsed");
static_assert(sizeof(WBP_HealingItemIcon_C_MarkUsed) == 0x000001, "Wrong size on WBP_HealingItemIcon_C_MarkUsed");
static_assert(offsetof(WBP_HealingItemIcon_C_MarkUsed, SkipAnimation) == 0x000000, "Member 'WBP_HealingItemIcon_C_MarkUsed::SkipAnimation' has a wrong offset!");

// Function WBP_HealingItemIcon.WBP_HealingItemIcon_C.ExecuteUbergraph_WBP_HealingItemIcon
// 0x0008 (0x0008 - 0x0000)
struct WBP_HealingItemIcon_C_ExecuteUbergraph_WBP_HealingItemIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_SkipAnimation;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HealingItemIcon_C_ExecuteUbergraph_WBP_HealingItemIcon) == 0x000004, "Wrong alignment on WBP_HealingItemIcon_C_ExecuteUbergraph_WBP_HealingItemIcon");
static_assert(sizeof(WBP_HealingItemIcon_C_ExecuteUbergraph_WBP_HealingItemIcon) == 0x000008, "Wrong size on WBP_HealingItemIcon_C_ExecuteUbergraph_WBP_HealingItemIcon");
static_assert(offsetof(WBP_HealingItemIcon_C_ExecuteUbergraph_WBP_HealingItemIcon, EntryPoint) == 0x000000, "Member 'WBP_HealingItemIcon_C_ExecuteUbergraph_WBP_HealingItemIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HealingItemIcon_C_ExecuteUbergraph_WBP_HealingItemIcon, K2Node_CustomEvent_SkipAnimation) == 0x000004, "Member 'WBP_HealingItemIcon_C_ExecuteUbergraph_WBP_HealingItemIcon::K2Node_CustomEvent_SkipAnimation' has a wrong offset!");

}

