#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EquippedSkillSet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_EquippedSkillSet.WBP_EquippedSkillSet_C
// 0x0050 (0x04B0 - 0x0460)
class UWBP_EquippedSkillSet_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BG;                                                // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquippedSkillEntry_C*              WBP_SkillEntry_AttackA;                            // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquippedSkillEntry_C*              WBP_SkillEntry_AttackB;                            // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquippedSkillEntry_C*              WBP_SkillEntry_AttackC;                            // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquippedSkillEntry_C*              WBP_SkillEntry_AttackD;                            // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWBP_EquippedSkillEntry_C* EquippedSkillEntry)> OnEquippedSkillPressed; // 0x0490(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UWBP_EquippedSkillEntry_C* EquippedSkillEntry)> OnEquippedSkillFocused; // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Construct();
	void ExecuteUbergraph_WBP_EquippedSkillSet(int32 EntryPoint);
	void OnEquippedSkillEntryFocused(class UWBP_EquippedSkillEntry_C* EquippedSkillEntry);
	void OnEquippedSkillEntryPressed(class UWBP_EquippedSkillEntry_C* EquippedSkillEntry);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void Refresh();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_EquippedSkillSet_C">();
	}
	static class UWBP_EquippedSkillSet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_EquippedSkillSet_C>();
	}
};
static_assert(alignof(UWBP_EquippedSkillSet_C) == 0x000008, "Wrong alignment on UWBP_EquippedSkillSet_C");
static_assert(sizeof(UWBP_EquippedSkillSet_C) == 0x0004B0, "Wrong size on UWBP_EquippedSkillSet_C");
static_assert(offsetof(UWBP_EquippedSkillSet_C, UberGraphFrame) == 0x000460, "Member 'UWBP_EquippedSkillSet_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_EquippedSkillSet_C, BG) == 0x000468, "Member 'UWBP_EquippedSkillSet_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_EquippedSkillSet_C, WBP_SkillEntry_AttackA) == 0x000470, "Member 'UWBP_EquippedSkillSet_C::WBP_SkillEntry_AttackA' has a wrong offset!");
static_assert(offsetof(UWBP_EquippedSkillSet_C, WBP_SkillEntry_AttackB) == 0x000478, "Member 'UWBP_EquippedSkillSet_C::WBP_SkillEntry_AttackB' has a wrong offset!");
static_assert(offsetof(UWBP_EquippedSkillSet_C, WBP_SkillEntry_AttackC) == 0x000480, "Member 'UWBP_EquippedSkillSet_C::WBP_SkillEntry_AttackC' has a wrong offset!");
static_assert(offsetof(UWBP_EquippedSkillSet_C, WBP_SkillEntry_AttackD) == 0x000488, "Member 'UWBP_EquippedSkillSet_C::WBP_SkillEntry_AttackD' has a wrong offset!");
static_assert(offsetof(UWBP_EquippedSkillSet_C, OnEquippedSkillPressed) == 0x000490, "Member 'UWBP_EquippedSkillSet_C::OnEquippedSkillPressed' has a wrong offset!");
static_assert(offsetof(UWBP_EquippedSkillSet_C, OnEquippedSkillFocused) == 0x0004A0, "Member 'UWBP_EquippedSkillSet_C::OnEquippedSkillFocused' has a wrong offset!");

}

