#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GameMenu_Page_Equipment

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GameMenu_Page_Equipment.WBP_GameMenu_Page_Equipment_C
// 0x02A0 (0x0718 - 0x0478)
class UWBP_GameMenu_Page_Equipment_C final : public UUserWidgetGameMenu_Page
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0478(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUniformGridPanelZion*                  AssistHolder;                                      // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         CanvasEquipSlotContainer;                          // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanelZion*                  EquipmentHolder_Armor;                             // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanelZion*                  EquipmentHolder_Extra;                             // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         EquipSlotNavigationBlocker;                        // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URefreshableRichTextBlock*              Left;                                              // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line;                                              // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URefreshableRichTextBlock*              Right;                                             // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               TabHolder;                                         // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Tab_C*                      WBP_Button_Tab_Armor;                              // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Tab_C*                      WBP_Button_Tab_Assist;                             // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Tab_C*                      WBP_Button_Tab_Extra;                              // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipLock_C*                       WBP_EquipLock;                                     // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Equipment_Stats_C*                 WBP_Equipment_Stats;                               // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipSlot_NewAssist_C*             WBP_EquipSlot_Assist;                              // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipSlot_Equipment_C*             WBP_EquipSlot_Equipment_A;                         // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipSlot_Equipment_C*             WBP_EquipSlot_Equipment_B;                         // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipSlot_Equipment_C*             WBP_EquipSlot_Equipment_Extra;                     // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Item_Description_C*                WBP_Item_Description;                              // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Loadout_C*                         WBP_Loadout;                                       // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Scrollbox_C*                       WBP_Scrollbox_Equipment;                           // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Category;                           // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEquipmentComponent*                    Equipment_Component;                               // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash)
	class UWBP_EquipSlot_C*                       SelectedEquipSlot;                                 // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UWBP_EquipmentEntry_C*                  SelectedEquipmentEntry;                            // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	TArray<class UWBP_EquipSlot_C*>               EquipSlots;                                        // 0x0550(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay)
	class UAssistComponent*                       Assist_Component;                                  // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<class UWBP_Button_Tab_C*>              Tabs;                                              // 0x0568(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay)
	struct FFooterData                            FooterEntry_Cancel;                                // 0x0578(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FFooterData                            FooterEntry_Equip;                                 // 0x05D0(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FFooterData                            FooterEntry_Unequip;                               // 0x0628(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FFooterData                            FooterEntry_Select;                                // 0x0680(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly)
	class UWBP_EquipSlot_C*                       FocusedEquipSlot;                                  // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             SE_Equip;                                          // 0x06E0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             SE_Confirm;                                        // 0x06E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             SE_Cancel;                                         // 0x06F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             SE_Tab;                                            // 0x06F8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         FocusedEntryIndex;                                 // 0x0700(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_704[0x4];                                      // 0x0704(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFMODEvent*                             SE_Unequip;                                        // 0x0708(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             SE_LoadoutChange;                                  // 0x0710(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void Cancel_Equipment_Selection(class UWidget* WidgetToFocus);
	void CanChangeLoadout(bool* bCanChange);
	void ChangeEquippedLoadout(int32 NewLoadoutIndex);
	void Construct();
	void CreateAssistList();
	void CreateEquipmentList();
	void EquipAssistEntry(class UWBP_EquipmentEntry_C* EquipmentEntry);
	void EquipEntry(class UWBP_EquipmentEntry_C* EquipmentEntry);
	void EquipEquipmentEntry(class UWBP_EquipmentEntry_C* EquipmentEntry);
	void ExecuteUbergraph_WBP_GameMenu_Page_Equipment(int32 EntryPoint);
	void FocusAssistList();
	void FocusEquipmentList(class UWBP_EquipSlot_C* EquipmentSlot);
	void FocusEquipmentSlot();
	void GetEntryHolderForSlot(EEquipmentSlot EquipmentSlot, class UUniformGridPanelZion** EquipmentHolder);
	class UUniformGridPanelZion* GetEntryHolderForSlotEntry(class UWBP_EquipSlot_C* EquipmentSlot);
	void GetEquipmentSlotForEntryHolder(class UObject* EntryHolder, class UWBP_EquipSlot_C** EquipSlot);
	int32 GetPageIndexForEquipmentSlot(class UWBP_EquipSlot_C* EquipmentSlot);
	void GoToPage(int32 PageOffset);
	bool IsInEquipmentSelection();
	class UWidget* Nav_ToEquipmentList(EUINavigation Navigation_0);
	class UWidget* Nav_ToEquipmentSlot(EUINavigation Navigation_0);
	void OnEquipmentEntryFocused(class UWBP_EquipmentEntry_C* EquipmentEntry);
	void OnEquipmentEntryPressed(class UWBP_EquipmentEntry_C* EquipmentEntry);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnPageClosed();
	struct FEventReply OnPressCancel(const struct FKeyEvent& KeyEvent);
	struct FEventReply OnPressContext(const struct FKeyEvent& KeyEvent);
	void OnPressedTab(const struct FKeyEvent& KeyEvent, class UWBP_Button_Tab_C* PressedButtonTab);
	struct FEventReply OnPressNextAlt(const struct FKeyEvent& KeyEvent);
	struct FEventReply OnPressPreviousAlt(const struct FKeyEvent& KeyEvent);
	void OnSlotEntryFocused(class UWBP_EquipSlot_C* SlotEntry);
	void OnSlotEntryPressed(class UWBP_EquipSlot_C* SlotEntry);
	void OnStartEquipmentSelection();
	void RefreshEquippedVisibility(class UWBP_EquipSlot_C* EquipmentSlot);
	void RefreshLoadoutVisibility();
	void RefreshStatsTextsForEquipmentEntry(class UWBP_EquipmentEntry_C* EquipmentEntry);
	void RefreshTabButtonVisibility();
	void SetLockVisibility();
	void SetupFooter();
	void SetupTabs();
	void ShowPage(int32 PageIndex);
	void UnequipFromEquipSlot(class UWBP_EquipSlot_C* EquipSlot);
	void UnequipIDFromAnySlot(class FName EquipmentID);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GameMenu_Page_Equipment_C">();
	}
	static class UWBP_GameMenu_Page_Equipment_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GameMenu_Page_Equipment_C>();
	}
};
static_assert(alignof(UWBP_GameMenu_Page_Equipment_C) == 0x000008, "Wrong alignment on UWBP_GameMenu_Page_Equipment_C");
static_assert(sizeof(UWBP_GameMenu_Page_Equipment_C) == 0x000718, "Wrong size on UWBP_GameMenu_Page_Equipment_C");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, UberGraphFrame) == 0x000478, "Member 'UWBP_GameMenu_Page_Equipment_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, AssistHolder) == 0x000480, "Member 'UWBP_GameMenu_Page_Equipment_C::AssistHolder' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, BG) == 0x000488, "Member 'UWBP_GameMenu_Page_Equipment_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, CanvasEquipSlotContainer) == 0x000490, "Member 'UWBP_GameMenu_Page_Equipment_C::CanvasEquipSlotContainer' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, EquipmentHolder_Armor) == 0x000498, "Member 'UWBP_GameMenu_Page_Equipment_C::EquipmentHolder_Armor' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, EquipmentHolder_Extra) == 0x0004A0, "Member 'UWBP_GameMenu_Page_Equipment_C::EquipmentHolder_Extra' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, EquipSlotNavigationBlocker) == 0x0004A8, "Member 'UWBP_GameMenu_Page_Equipment_C::EquipSlotNavigationBlocker' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, Left) == 0x0004B0, "Member 'UWBP_GameMenu_Page_Equipment_C::Left' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, Line) == 0x0004B8, "Member 'UWBP_GameMenu_Page_Equipment_C::Line' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, Right) == 0x0004C0, "Member 'UWBP_GameMenu_Page_Equipment_C::Right' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, TabHolder) == 0x0004C8, "Member 'UWBP_GameMenu_Page_Equipment_C::TabHolder' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, WBP_Button_Tab_Armor) == 0x0004D0, "Member 'UWBP_GameMenu_Page_Equipment_C::WBP_Button_Tab_Armor' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, WBP_Button_Tab_Assist) == 0x0004D8, "Member 'UWBP_GameMenu_Page_Equipment_C::WBP_Button_Tab_Assist' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, WBP_Button_Tab_Extra) == 0x0004E0, "Member 'UWBP_GameMenu_Page_Equipment_C::WBP_Button_Tab_Extra' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, WBP_EquipLock) == 0x0004E8, "Member 'UWBP_GameMenu_Page_Equipment_C::WBP_EquipLock' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, WBP_Equipment_Stats) == 0x0004F0, "Member 'UWBP_GameMenu_Page_Equipment_C::WBP_Equipment_Stats' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, WBP_EquipSlot_Assist) == 0x0004F8, "Member 'UWBP_GameMenu_Page_Equipment_C::WBP_EquipSlot_Assist' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, WBP_EquipSlot_Equipment_A) == 0x000500, "Member 'UWBP_GameMenu_Page_Equipment_C::WBP_EquipSlot_Equipment_A' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, WBP_EquipSlot_Equipment_B) == 0x000508, "Member 'UWBP_GameMenu_Page_Equipment_C::WBP_EquipSlot_Equipment_B' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, WBP_EquipSlot_Equipment_Extra) == 0x000510, "Member 'UWBP_GameMenu_Page_Equipment_C::WBP_EquipSlot_Equipment_Extra' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, WBP_Item_Description) == 0x000518, "Member 'UWBP_GameMenu_Page_Equipment_C::WBP_Item_Description' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, WBP_Loadout) == 0x000520, "Member 'UWBP_GameMenu_Page_Equipment_C::WBP_Loadout' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, WBP_Scrollbox_Equipment) == 0x000528, "Member 'UWBP_GameMenu_Page_Equipment_C::WBP_Scrollbox_Equipment' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, WidgetSwitcher_Category) == 0x000530, "Member 'UWBP_GameMenu_Page_Equipment_C::WidgetSwitcher_Category' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, Equipment_Component) == 0x000538, "Member 'UWBP_GameMenu_Page_Equipment_C::Equipment_Component' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, SelectedEquipSlot) == 0x000540, "Member 'UWBP_GameMenu_Page_Equipment_C::SelectedEquipSlot' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, SelectedEquipmentEntry) == 0x000548, "Member 'UWBP_GameMenu_Page_Equipment_C::SelectedEquipmentEntry' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, EquipSlots) == 0x000550, "Member 'UWBP_GameMenu_Page_Equipment_C::EquipSlots' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, Assist_Component) == 0x000560, "Member 'UWBP_GameMenu_Page_Equipment_C::Assist_Component' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, Tabs) == 0x000568, "Member 'UWBP_GameMenu_Page_Equipment_C::Tabs' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, FooterEntry_Cancel) == 0x000578, "Member 'UWBP_GameMenu_Page_Equipment_C::FooterEntry_Cancel' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, FooterEntry_Equip) == 0x0005D0, "Member 'UWBP_GameMenu_Page_Equipment_C::FooterEntry_Equip' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, FooterEntry_Unequip) == 0x000628, "Member 'UWBP_GameMenu_Page_Equipment_C::FooterEntry_Unequip' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, FooterEntry_Select) == 0x000680, "Member 'UWBP_GameMenu_Page_Equipment_C::FooterEntry_Select' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, FocusedEquipSlot) == 0x0006D8, "Member 'UWBP_GameMenu_Page_Equipment_C::FocusedEquipSlot' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, SE_Equip) == 0x0006E0, "Member 'UWBP_GameMenu_Page_Equipment_C::SE_Equip' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, SE_Confirm) == 0x0006E8, "Member 'UWBP_GameMenu_Page_Equipment_C::SE_Confirm' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, SE_Cancel) == 0x0006F0, "Member 'UWBP_GameMenu_Page_Equipment_C::SE_Cancel' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, SE_Tab) == 0x0006F8, "Member 'UWBP_GameMenu_Page_Equipment_C::SE_Tab' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, FocusedEntryIndex) == 0x000700, "Member 'UWBP_GameMenu_Page_Equipment_C::FocusedEntryIndex' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, SE_Unequip) == 0x000708, "Member 'UWBP_GameMenu_Page_Equipment_C::SE_Unequip' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Equipment_C, SE_LoadoutChange) == 0x000710, "Member 'UWBP_GameMenu_Page_Equipment_C::SE_LoadoutChange' has a wrong offset!");

}

