#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FieldTalkHolder

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FieldTalkHolder.WBP_FieldTalkHolder_C
// 0x0070 (0x04D8 - 0x0468)
class UWBP_FieldTalkHolder_C final : public UUserWidgetFieldTalkHolder
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0468(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideTextAnim;                                      // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowTextAnim;                                      // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideAnim;                                          // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_1;                                              // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SpeakerName;                                       // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SpeakerText;                                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SubLine;                                           // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox;                                       // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnFinish;                                          // 0x04C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsTextVisible;                                     // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void WidgetAnimationEvt_ShowTextAnim_K2Node_WidgetAnimationEvent_3();
	void WidgetAnimationEvt_HideAnim_K2Node_WidgetAnimationEvent_4();
	void OnShowText(const struct FFieldTalkEntry& FieldTalkEntry);
	void OnLaunchFieldTalk();
	void OnFinishFieldTalk(bool bSkipActiveFieldTalk);
	void Finished_DE4987724EC506D4A807008E43649FE1();
	void ExecuteUbergraph_WBP_FieldTalkHolder(int32 EntryPoint);
	void Construct();

	bool IsUIReady() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_FieldTalkHolder_C">();
	}
	static class UWBP_FieldTalkHolder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FieldTalkHolder_C>();
	}
};
static_assert(alignof(UWBP_FieldTalkHolder_C) == 0x000008, "Wrong alignment on UWBP_FieldTalkHolder_C");
static_assert(sizeof(UWBP_FieldTalkHolder_C) == 0x0004D8, "Wrong size on UWBP_FieldTalkHolder_C");
static_assert(offsetof(UWBP_FieldTalkHolder_C, UberGraphFrame) == 0x000468, "Member 'UWBP_FieldTalkHolder_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_FieldTalkHolder_C, HideTextAnim) == 0x000470, "Member 'UWBP_FieldTalkHolder_C::HideTextAnim' has a wrong offset!");
static_assert(offsetof(UWBP_FieldTalkHolder_C, ShowTextAnim) == 0x000478, "Member 'UWBP_FieldTalkHolder_C::ShowTextAnim' has a wrong offset!");
static_assert(offsetof(UWBP_FieldTalkHolder_C, HideAnim) == 0x000480, "Member 'UWBP_FieldTalkHolder_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UWBP_FieldTalkHolder_C, ShowAnim) == 0x000488, "Member 'UWBP_FieldTalkHolder_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UWBP_FieldTalkHolder_C, BG) == 0x000490, "Member 'UWBP_FieldTalkHolder_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_FieldTalkHolder_C, BG_1) == 0x000498, "Member 'UWBP_FieldTalkHolder_C::BG_1' has a wrong offset!");
static_assert(offsetof(UWBP_FieldTalkHolder_C, SpeakerName) == 0x0004A0, "Member 'UWBP_FieldTalkHolder_C::SpeakerName' has a wrong offset!");
static_assert(offsetof(UWBP_FieldTalkHolder_C, SpeakerText) == 0x0004A8, "Member 'UWBP_FieldTalkHolder_C::SpeakerText' has a wrong offset!");
static_assert(offsetof(UWBP_FieldTalkHolder_C, SubLine) == 0x0004B0, "Member 'UWBP_FieldTalkHolder_C::SubLine' has a wrong offset!");
static_assert(offsetof(UWBP_FieldTalkHolder_C, VerticalBox) == 0x0004B8, "Member 'UWBP_FieldTalkHolder_C::VerticalBox' has a wrong offset!");
static_assert(offsetof(UWBP_FieldTalkHolder_C, OnFinish) == 0x0004C0, "Member 'UWBP_FieldTalkHolder_C::OnFinish' has a wrong offset!");
static_assert(offsetof(UWBP_FieldTalkHolder_C, IsTextVisible) == 0x0004D0, "Member 'UWBP_FieldTalkHolder_C::IsTextVisible' has a wrong offset!");

}

