#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_Gamma

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Settings_Gamma.WBP_Settings_Gamma_C
// 0x0068 (0x04C8 - 0x0460)
class UWBP_Settings_Gamma_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hide;                                              // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Show;                                              // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bright;                                            // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dark;                                              // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Generic_C*                  WBP_Button_Generic;                                // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Footer_C*                          WBP_Footer;                                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_Entry_Slider_C*           WBP_Settings_Entry_Slider;                         // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(bool bConfirmed)> OnClosed;                                        // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UFMODEvent*                             ResetSoundEvent;                                   // 0x04B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         PrevGammaSettings;                                 // 0x04C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Settings_Gamma_WBP_Button_Generic_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void BndEvt__WBP_Settings_Gamma_WBP_Settings_Entry_Slider_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature(double Value);
	void Close(bool bConfirmed);
	void Construct();
	void ExecuteUbergraph_WBP_Settings_Gamma(int32 EntryPoint);
	void OnFinish_72C7DC1544F90D6FD9C218841E1FDCC6();
	void OnFinish_72C7DC1544F90D6FD9C21884264FE8F4();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnPressCancel(const struct FKeyEvent& KeyEvent);
	struct FEventReply OnPressConfirm(const struct FKeyEvent& KeyEvent);
	struct FEventReply OnPressContext(const struct FKeyEvent& KeyEvent);
	void OnPressedCancel();
	void OnResetToDefault();
	void RefreshSliderValue();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Settings_Gamma_C">();
	}
	static class UWBP_Settings_Gamma_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Settings_Gamma_C>();
	}
};
static_assert(alignof(UWBP_Settings_Gamma_C) == 0x000008, "Wrong alignment on UWBP_Settings_Gamma_C");
static_assert(sizeof(UWBP_Settings_Gamma_C) == 0x0004C8, "Wrong size on UWBP_Settings_Gamma_C");
static_assert(offsetof(UWBP_Settings_Gamma_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Settings_Gamma_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Gamma_C, Hide) == 0x000468, "Member 'UWBP_Settings_Gamma_C::Hide' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Gamma_C, Show) == 0x000470, "Member 'UWBP_Settings_Gamma_C::Show' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Gamma_C, BG) == 0x000478, "Member 'UWBP_Settings_Gamma_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Gamma_C, Bright) == 0x000480, "Member 'UWBP_Settings_Gamma_C::Bright' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Gamma_C, Dark) == 0x000488, "Member 'UWBP_Settings_Gamma_C::Dark' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Gamma_C, WBP_Button_Generic) == 0x000490, "Member 'UWBP_Settings_Gamma_C::WBP_Button_Generic' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Gamma_C, WBP_Footer) == 0x000498, "Member 'UWBP_Settings_Gamma_C::WBP_Footer' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Gamma_C, WBP_Settings_Entry_Slider) == 0x0004A0, "Member 'UWBP_Settings_Gamma_C::WBP_Settings_Entry_Slider' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Gamma_C, OnClosed) == 0x0004A8, "Member 'UWBP_Settings_Gamma_C::OnClosed' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Gamma_C, ResetSoundEvent) == 0x0004B8, "Member 'UWBP_Settings_Gamma_C::ResetSoundEvent' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Gamma_C, PrevGammaSettings) == 0x0004C0, "Member 'UWBP_Settings_Gamma_C::PrevGammaSettings' has a wrong offset!");

}

