#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Equipment_Stats

#include "Basic.hpp"

#include "Zion_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Equipment_Stats.WBP_Equipment_Stats_C.CanDisplaySP
// 0x0018 (0x0018 - 0x0000)
struct WBP_Equipment_Stats_C_CanDisplaySP final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAptitude_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Equipment_Stats_C_CanDisplaySP) == 0x000008, "Wrong alignment on WBP_Equipment_Stats_C_CanDisplaySP");
static_assert(sizeof(WBP_Equipment_Stats_C_CanDisplaySP) == 0x000018, "Wrong size on WBP_Equipment_Stats_C_CanDisplaySP");
static_assert(offsetof(WBP_Equipment_Stats_C_CanDisplaySP, ReturnValue) == 0x000000, "Member 'WBP_Equipment_Stats_C_CanDisplaySP::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_CanDisplaySP, CallFunc_MakeLiteralByte_ReturnValue) == 0x000001, "Member 'WBP_Equipment_Stats_C_CanDisplaySP::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_CanDisplaySP, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WBP_Equipment_Stats_C_CanDisplaySP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_CanDisplaySP, CallFunc_Get_ReturnValue) == 0x000008, "Member 'WBP_Equipment_Stats_C_CanDisplaySP::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_CanDisplaySP, CallFunc_HasAptitude_ReturnValue) == 0x000010, "Member 'WBP_Equipment_Stats_C_CanDisplaySP::CallFunc_HasAptitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_CanDisplaySP, CallFunc_BooleanOR_ReturnValue) == 0x000011, "Member 'WBP_Equipment_Stats_C_CanDisplaySP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_Equipment_Stats.WBP_Equipment_Stats_C.ExecuteUbergraph_WBP_Equipment_Stats
// 0x0010 (0x0010 - 0x0000)
struct WBP_Equipment_Stats_C_ExecuteUbergraph_WBP_Equipment_Stats final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Equipment_Stats_C_ExecuteUbergraph_WBP_Equipment_Stats) == 0x000008, "Wrong alignment on WBP_Equipment_Stats_C_ExecuteUbergraph_WBP_Equipment_Stats");
static_assert(sizeof(WBP_Equipment_Stats_C_ExecuteUbergraph_WBP_Equipment_Stats) == 0x000010, "Wrong size on WBP_Equipment_Stats_C_ExecuteUbergraph_WBP_Equipment_Stats");
static_assert(offsetof(WBP_Equipment_Stats_C_ExecuteUbergraph_WBP_Equipment_Stats, EntryPoint) == 0x000000, "Member 'WBP_Equipment_Stats_C_ExecuteUbergraph_WBP_Equipment_Stats::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_ExecuteUbergraph_WBP_Equipment_Stats, CallFunc_Get_ReturnValue) == 0x000008, "Member 'WBP_Equipment_Stats_C_ExecuteUbergraph_WBP_Equipment_Stats::CallFunc_Get_ReturnValue' has a wrong offset!");

// Function WBP_Equipment_Stats.WBP_Equipment_Stats_C.IsEquippedOnSameFamilySlot
// 0x0028 (0x0028 - 0x0000)
struct WBP_Equipment_Stats_C_IsEquippedOnSameFamilySlot final
{
public:
	EEquipmentSlot                                EquipmentSlotType;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    EquipmentHandle;                                   // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEquippedOnSlot_ReturnValue;             // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEquippedOnSlot_ReturnValue_1;           // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Equipment_Stats_C_IsEquippedOnSameFamilySlot) == 0x000008, "Wrong alignment on WBP_Equipment_Stats_C_IsEquippedOnSameFamilySlot");
static_assert(sizeof(WBP_Equipment_Stats_C_IsEquippedOnSameFamilySlot) == 0x000028, "Wrong size on WBP_Equipment_Stats_C_IsEquippedOnSameFamilySlot");
static_assert(offsetof(WBP_Equipment_Stats_C_IsEquippedOnSameFamilySlot, EquipmentSlotType) == 0x000000, "Member 'WBP_Equipment_Stats_C_IsEquippedOnSameFamilySlot::EquipmentSlotType' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_IsEquippedOnSameFamilySlot, EquipmentHandle) == 0x000008, "Member 'WBP_Equipment_Stats_C_IsEquippedOnSameFamilySlot::EquipmentHandle' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_IsEquippedOnSameFamilySlot, ReturnValue) == 0x000018, "Member 'WBP_Equipment_Stats_C_IsEquippedOnSameFamilySlot::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_IsEquippedOnSameFamilySlot, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000019, "Member 'WBP_Equipment_Stats_C_IsEquippedOnSameFamilySlot::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_IsEquippedOnSameFamilySlot, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00001A, "Member 'WBP_Equipment_Stats_C_IsEquippedOnSameFamilySlot::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_IsEquippedOnSameFamilySlot, CallFunc_IsEquippedOnSlot_ReturnValue) == 0x00001B, "Member 'WBP_Equipment_Stats_C_IsEquippedOnSameFamilySlot::CallFunc_IsEquippedOnSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_IsEquippedOnSameFamilySlot, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'WBP_Equipment_Stats_C_IsEquippedOnSameFamilySlot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_IsEquippedOnSameFamilySlot, CallFunc_BooleanAND_ReturnValue) == 0x00001D, "Member 'WBP_Equipment_Stats_C_IsEquippedOnSameFamilySlot::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_IsEquippedOnSameFamilySlot, CallFunc_IsEquippedOnSlot_ReturnValue_1) == 0x00001E, "Member 'WBP_Equipment_Stats_C_IsEquippedOnSameFamilySlot::CallFunc_IsEquippedOnSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_IsEquippedOnSameFamilySlot, CallFunc_BooleanAND_ReturnValue_1) == 0x00001F, "Member 'WBP_Equipment_Stats_C_IsEquippedOnSameFamilySlot::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_IsEquippedOnSameFamilySlot, CallFunc_BooleanOR_ReturnValue) == 0x000020, "Member 'WBP_Equipment_Stats_C_IsEquippedOnSameFamilySlot::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_Equipment_Stats.WBP_Equipment_Stats_C.SetStatText
// 0x0090 (0x0090 - 0x0000)
struct WBP_Equipment_Stats_C_SetStatText final
{
public:
	class UTextBlock*                             Text;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ComparatorValue;                                   // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0010)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0028(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x003C(0x0014)()
	bool                                          Temp_bool_Variable_1;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0054(0x0014)()
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0068(0x0014)()
	struct FSlateColor                            K2Node_Select_Default_1;                           // 0x007C(0x0014)()
};
static_assert(alignof(WBP_Equipment_Stats_C_SetStatText) == 0x000008, "Wrong alignment on WBP_Equipment_Stats_C_SetStatText");
static_assert(sizeof(WBP_Equipment_Stats_C_SetStatText) == 0x000090, "Wrong size on WBP_Equipment_Stats_C_SetStatText");
static_assert(offsetof(WBP_Equipment_Stats_C_SetStatText, Text) == 0x000000, "Member 'WBP_Equipment_Stats_C_SetStatText::Text' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetStatText, Value) == 0x000008, "Member 'WBP_Equipment_Stats_C_SetStatText::Value' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetStatText, ComparatorValue) == 0x00000C, "Member 'WBP_Equipment_Stats_C_SetStatText::ComparatorValue' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetStatText, Temp_bool_Variable) == 0x000010, "Member 'WBP_Equipment_Stats_C_SetStatText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetStatText, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000011, "Member 'WBP_Equipment_Stats_C_SetStatText::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetStatText, CallFunc_Greater_IntInt_ReturnValue) == 0x000012, "Member 'WBP_Equipment_Stats_C_SetStatText::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetStatText, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'WBP_Equipment_Stats_C_SetStatText::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetStatText, K2Node_MakeStruct_SlateColor) == 0x000028, "Member 'WBP_Equipment_Stats_C_SetStatText::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetStatText, K2Node_MakeStruct_SlateColor_1) == 0x00003C, "Member 'WBP_Equipment_Stats_C_SetStatText::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetStatText, Temp_bool_Variable_1) == 0x000050, "Member 'WBP_Equipment_Stats_C_SetStatText::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetStatText, K2Node_MakeStruct_SlateColor_2) == 0x000054, "Member 'WBP_Equipment_Stats_C_SetStatText::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetStatText, K2Node_Select_Default) == 0x000068, "Member 'WBP_Equipment_Stats_C_SetStatText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetStatText, K2Node_Select_Default_1) == 0x00007C, "Member 'WBP_Equipment_Stats_C_SetStatText::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_Equipment_Stats.WBP_Equipment_Stats_C.SetupFromStats
// 0x0210 (0x0210 - 0x0000)
struct WBP_Equipment_Stats_C_SetupFromStats final
{
public:
	struct FExtendedStatsData                     DefaultStats;                                      // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FExtendedStatsData                     ItemStats;                                         // 0x0050(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          SubtractEquipmentStats;                            // 0x00A0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanDisplaySP_ReturnValue;                 // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FExtendedStatsData                     CallFunc_ExtendedStatsData_Subtract_ReturnValue;   // 0x00A8(0x0050)()
	struct FExtendedStatsData                     CallFunc_ExtendedStatsData_Add_ReturnValue;        // 0x00F8(0x0050)()
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FExtendedStatsData                     CallFunc_GetPlayerMaxPossibleStats_ReturnValue;    // 0x0150(0x0050)(ConstParm)
	int32                                         CallFunc_GetSPGaugeValue_ReturnValue;              // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_1;              // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FExtendedStatsData                     K2Node_Select_Default;                             // 0x01B8(0x0050)(ConstParm)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_2;              // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_2;                  // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Equipment_Stats_C_SetupFromStats) == 0x000008, "Wrong alignment on WBP_Equipment_Stats_C_SetupFromStats");
static_assert(sizeof(WBP_Equipment_Stats_C_SetupFromStats) == 0x000210, "Wrong size on WBP_Equipment_Stats_C_SetupFromStats");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupFromStats, DefaultStats) == 0x000000, "Member 'WBP_Equipment_Stats_C_SetupFromStats::DefaultStats' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupFromStats, ItemStats) == 0x000050, "Member 'WBP_Equipment_Stats_C_SetupFromStats::ItemStats' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupFromStats, SubtractEquipmentStats) == 0x0000A0, "Member 'WBP_Equipment_Stats_C_SetupFromStats::SubtractEquipmentStats' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupFromStats, CallFunc_CanDisplaySP_ReturnValue) == 0x0000A1, "Member 'WBP_Equipment_Stats_C_SetupFromStats::CallFunc_CanDisplaySP_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupFromStats, CallFunc_ExtendedStatsData_Subtract_ReturnValue) == 0x0000A8, "Member 'WBP_Equipment_Stats_C_SetupFromStats::CallFunc_ExtendedStatsData_Subtract_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupFromStats, CallFunc_ExtendedStatsData_Add_ReturnValue) == 0x0000F8, "Member 'WBP_Equipment_Stats_C_SetupFromStats::CallFunc_ExtendedStatsData_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupFromStats, CallFunc_Get_ReturnValue) == 0x000148, "Member 'WBP_Equipment_Stats_C_SetupFromStats::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupFromStats, CallFunc_GetPlayerMaxPossibleStats_ReturnValue) == 0x000150, "Member 'WBP_Equipment_Stats_C_SetupFromStats::CallFunc_GetPlayerMaxPossibleStats_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupFromStats, CallFunc_GetSPGaugeValue_ReturnValue) == 0x0001A0, "Member 'WBP_Equipment_Stats_C_SetupFromStats::CallFunc_GetSPGaugeValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupFromStats, CallFunc_Divide_IntInt_ReturnValue) == 0x0001A4, "Member 'WBP_Equipment_Stats_C_SetupFromStats::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupFromStats, CallFunc_Divide_IntInt_ReturnValue_1) == 0x0001A8, "Member 'WBP_Equipment_Stats_C_SetupFromStats::CallFunc_Divide_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupFromStats, CallFunc_SelectInt_ReturnValue) == 0x0001AC, "Member 'WBP_Equipment_Stats_C_SetupFromStats::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupFromStats, CallFunc_SelectInt_ReturnValue_1) == 0x0001B0, "Member 'WBP_Equipment_Stats_C_SetupFromStats::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupFromStats, Temp_bool_Variable) == 0x0001B4, "Member 'WBP_Equipment_Stats_C_SetupFromStats::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupFromStats, K2Node_Select_Default) == 0x0001B8, "Member 'WBP_Equipment_Stats_C_SetupFromStats::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupFromStats, CallFunc_Divide_IntInt_ReturnValue_2) == 0x000208, "Member 'WBP_Equipment_Stats_C_SetupFromStats::CallFunc_Divide_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupFromStats, CallFunc_SelectInt_ReturnValue_2) == 0x00020C, "Member 'WBP_Equipment_Stats_C_SetupFromStats::CallFunc_SelectInt_ReturnValue_2' has a wrong offset!");

// Function WBP_Equipment_Stats.WBP_Equipment_Stats_C.SetupStatsForAssist
// 0x0570 (0x0570 - 0x0000)
struct WBP_Equipment_Stats_C_SetupStatsForAssist final
{
public:
	class UWBP_EquipmentEntry_C*                  EquipmentEntry;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FExtendedStatsData                     K2Node_MakeStruct_ExtendedStatsData;               // 0x0008(0x0050)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInventoryItemAssistData               CallFunc_GetItemAssistData_out_ItemData;           // 0x0060(0x0208)()
	bool                                          CallFunc_GetItemAssistData_ReturnValue;            // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26A[0x6];                                      // 0x026A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInventoryItemAssistData               CallFunc_GetEquippedAssistData_ReturnValue;        // 0x0278(0x0208)(ConstParm)
	struct FExtendedStatsData                     CallFunc_GetExtendedStatsLevelDataWithBonuses_ReturnValue; // 0x0480(0x0050)()
	struct FExtendedStatsData                     CallFunc_ExtendedStatsData_Subtract_ReturnValue;   // 0x04D0(0x0050)()
	struct FExtendedStatsData                     CallFunc_ExtendedStatsData_Subtract_ReturnValue_1; // 0x0520(0x0050)()
};
static_assert(alignof(WBP_Equipment_Stats_C_SetupStatsForAssist) == 0x000008, "Wrong alignment on WBP_Equipment_Stats_C_SetupStatsForAssist");
static_assert(sizeof(WBP_Equipment_Stats_C_SetupStatsForAssist) == 0x000570, "Wrong size on WBP_Equipment_Stats_C_SetupStatsForAssist");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupStatsForAssist, EquipmentEntry) == 0x000000, "Member 'WBP_Equipment_Stats_C_SetupStatsForAssist::EquipmentEntry' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupStatsForAssist, K2Node_MakeStruct_ExtendedStatsData) == 0x000008, "Member 'WBP_Equipment_Stats_C_SetupStatsForAssist::K2Node_MakeStruct_ExtendedStatsData' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupStatsForAssist, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'WBP_Equipment_Stats_C_SetupStatsForAssist::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupStatsForAssist, CallFunc_GetItemAssistData_out_ItemData) == 0x000060, "Member 'WBP_Equipment_Stats_C_SetupStatsForAssist::CallFunc_GetItemAssistData_out_ItemData' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupStatsForAssist, CallFunc_GetItemAssistData_ReturnValue) == 0x000268, "Member 'WBP_Equipment_Stats_C_SetupStatsForAssist::CallFunc_GetItemAssistData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupStatsForAssist, CallFunc_IsValid_ReturnValue_1) == 0x000269, "Member 'WBP_Equipment_Stats_C_SetupStatsForAssist::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupStatsForAssist, CallFunc_Get_ReturnValue) == 0x000270, "Member 'WBP_Equipment_Stats_C_SetupStatsForAssist::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupStatsForAssist, CallFunc_GetEquippedAssistData_ReturnValue) == 0x000278, "Member 'WBP_Equipment_Stats_C_SetupStatsForAssist::CallFunc_GetEquippedAssistData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupStatsForAssist, CallFunc_GetExtendedStatsLevelDataWithBonuses_ReturnValue) == 0x000480, "Member 'WBP_Equipment_Stats_C_SetupStatsForAssist::CallFunc_GetExtendedStatsLevelDataWithBonuses_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupStatsForAssist, CallFunc_ExtendedStatsData_Subtract_ReturnValue) == 0x0004D0, "Member 'WBP_Equipment_Stats_C_SetupStatsForAssist::CallFunc_ExtendedStatsData_Subtract_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupStatsForAssist, CallFunc_ExtendedStatsData_Subtract_ReturnValue_1) == 0x000520, "Member 'WBP_Equipment_Stats_C_SetupStatsForAssist::CallFunc_ExtendedStatsData_Subtract_ReturnValue_1' has a wrong offset!");

// Function WBP_Equipment_Stats.WBP_Equipment_Stats_C.SetupStatsForCurrent
// 0x0058 (0x0058 - 0x0000)
struct WBP_Equipment_Stats_C_SetupStatsForCurrent final
{
public:
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FExtendedStatsData                     CallFunc_GetExtendedStatsLevelDataWithBonuses_ReturnValue; // 0x0008(0x0050)()
};
static_assert(alignof(WBP_Equipment_Stats_C_SetupStatsForCurrent) == 0x000008, "Wrong alignment on WBP_Equipment_Stats_C_SetupStatsForCurrent");
static_assert(sizeof(WBP_Equipment_Stats_C_SetupStatsForCurrent) == 0x000058, "Wrong size on WBP_Equipment_Stats_C_SetupStatsForCurrent");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupStatsForCurrent, CallFunc_Get_ReturnValue) == 0x000000, "Member 'WBP_Equipment_Stats_C_SetupStatsForCurrent::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupStatsForCurrent, CallFunc_GetExtendedStatsLevelDataWithBonuses_ReturnValue) == 0x000008, "Member 'WBP_Equipment_Stats_C_SetupStatsForCurrent::CallFunc_GetExtendedStatsLevelDataWithBonuses_ReturnValue' has a wrong offset!");

// Function WBP_Equipment_Stats.WBP_Equipment_Stats_C.SetupStatsForEquipment
// 0x0070 (0x0070 - 0x0000)
struct WBP_Equipment_Stats_C_SetupStatsForEquipment final
{
public:
	EEquipmentSlot                                EquipmentSlot;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_EquipmentEntry_C*                  EquipmentEntry;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FExtendedStatsData                     CallFunc_GetExtendedStatsLevelDataWithBonuses_ReturnValue; // 0x0020(0x0050)()
};
static_assert(alignof(WBP_Equipment_Stats_C_SetupStatsForEquipment) == 0x000008, "Wrong alignment on WBP_Equipment_Stats_C_SetupStatsForEquipment");
static_assert(sizeof(WBP_Equipment_Stats_C_SetupStatsForEquipment) == 0x000070, "Wrong size on WBP_Equipment_Stats_C_SetupStatsForEquipment");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupStatsForEquipment, EquipmentSlot) == 0x000000, "Member 'WBP_Equipment_Stats_C_SetupStatsForEquipment::EquipmentSlot' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupStatsForEquipment, EquipmentEntry) == 0x000008, "Member 'WBP_Equipment_Stats_C_SetupStatsForEquipment::EquipmentEntry' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupStatsForEquipment, CallFunc_Get_ReturnValue) == 0x000010, "Member 'WBP_Equipment_Stats_C_SetupStatsForEquipment::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupStatsForEquipment, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_Equipment_Stats_C_SetupStatsForEquipment::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupStatsForEquipment, CallFunc_GetExtendedStatsLevelDataWithBonuses_ReturnValue) == 0x000020, "Member 'WBP_Equipment_Stats_C_SetupStatsForEquipment::CallFunc_GetExtendedStatsLevelDataWithBonuses_ReturnValue' has a wrong offset!");

// Function WBP_Equipment_Stats.WBP_Equipment_Stats_C.SetupStatsForEquipmentHandle
// 0x05A0 (0x05A0 - 0x0000)
struct WBP_Equipment_Stats_C_SetupStatsForEquipmentHandle final
{
public:
	EEquipmentSlot                                EquipmentSlot;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    Handle;                                            // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	bool                                          bSimulateSlotSwitch;                               // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FExtendedStatsData                     K2Node_MakeStruct_ExtendedStatsData;               // 0x0020(0x0050)()
	bool                                          CallFunc_IsEquippedOnSameFamilySlot_ReturnValue;   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInventoryItemEquipmentData            CallFunc_GetItemEquipmentData_out_ItemData;        // 0x0078(0x01E8)()
	bool                                          CallFunc_GetItemEquipmentData_ReturnValue;         // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0262(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_263[0x5];                                      // 0x0263(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInventoryItemEquipmentData            CallFunc_GetEquipmentDataFromSlot_ReturnValue;     // 0x0268(0x01E8)(ConstParm)
	struct FExtendedStatsData                     K2Node_Select_Default;                             // 0x0450(0x0050)()
	bool                                          CallFunc_IsEquippedOnSlot_ReturnValue;             // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FExtendedStatsData                     CallFunc_ExtendedStatsData_Subtract_ReturnValue;   // 0x04A8(0x0050)()
	struct FExtendedStatsData                     CallFunc_ExtendedStatsData_Subtract_ReturnValue_1; // 0x04F8(0x0050)()
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0548(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FExtendedStatsData                     CallFunc_GetExtendedStatsLevelDataWithBonuses_ReturnValue; // 0x0550(0x0050)()
};
static_assert(alignof(WBP_Equipment_Stats_C_SetupStatsForEquipmentHandle) == 0x000008, "Wrong alignment on WBP_Equipment_Stats_C_SetupStatsForEquipmentHandle");
static_assert(sizeof(WBP_Equipment_Stats_C_SetupStatsForEquipmentHandle) == 0x0005A0, "Wrong size on WBP_Equipment_Stats_C_SetupStatsForEquipmentHandle");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupStatsForEquipmentHandle, EquipmentSlot) == 0x000000, "Member 'WBP_Equipment_Stats_C_SetupStatsForEquipmentHandle::EquipmentSlot' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupStatsForEquipmentHandle, Handle) == 0x000008, "Member 'WBP_Equipment_Stats_C_SetupStatsForEquipmentHandle::Handle' has a wrong offset!");
static_assert(offsetof(WBP_Equipment_Stats_C_SetupStatsForEquipmentHandle, bSimulateSlotSwitch) == 0x000018, "Member 'WBP_Equipment_Stats_C_SetupStatsForEquipmentHandle::bSimulateSlotSwitch' has a wrong offset!");
