#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Recollection_BossRush_BossProgression

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Recollection_BossRush_BossProgression.WBP_Recollection_BossRush_BossProgression_C
// 0x0098 (0x04F8 - 0x0460)
class UWBP_Recollection_BossRush_BossProgression_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalBox;                                     // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Recollection_BossRush_BossProgression_Entry_C* WBP_Recollection_BossRush_BossProgression_Entry; // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Recollection_BossRush_BossProgression_Entry_C* WBP_Recollection_BossRush_BossProgression_Entry_1; // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Recollection_BossRush_BossProgression_Entry_C* WBP_Recollection_BossRush_BossProgression_Entry_2; // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Recollection_BossRush_BossProgression_Entry_C* WBP_Recollection_BossRush_BossProgression_Entry_3; // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Recollection_BossRush_BossProgression_Entry_C* WBP_Recollection_BossRush_BossProgression_Entry_4; // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Recollection_BossRush_BossProgression_Entry_C* WBP_Recollection_BossRush_BossProgression_Entry_5; // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Recollection_BossRush_BossProgression_Entry_C* WBP_Recollection_BossRush_BossProgression_Entry_6; // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Recollection_BossRush_BossProgression_Entry_C* WBP_Recollection_BossRush_BossProgression_Entry_7; // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Recollection_BossRush_BossProgression_Entry_C* WBP_Recollection_BossRush_BossProgression_Entry_8; // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Recollection_BossRush_BossProgression_Entry_C* WBP_Recollection_BossRush_BossProgression_Entry_9; // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Recollection_BossRush_BossProgression_Entry_C* WBP_Recollection_BossRush_BossProgression_Entry_10; // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Recollection_BossRush_BossProgression_Entry_C* WBP_Recollection_BossRush_BossProgression_Entry_11; // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Recollection_BossRush_BossProgression_Entry_C* WBP_Recollection_BossRush_BossProgression_Entry_12; // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Recollection_BossRush_BossProgression_Entry_C* WBP_Recollection_BossRush_BossProgression_Entry_13; // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Recollection_BossRush_BossProgression_Entry_C* WBP_Recollection_BossRush_BossProgression_Entry_14; // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_Recollection_BossRush_BossProgression_Entry_C*> Entries;                       // 0x04E8(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay)

public:
	void SetDefeatedEntry(int32 Index_0);
	void SetBossesDefeatedCount(int32 Count);
	void SetActiveEntry(int32 Index_0);
	void ResetEntries();
	void ExecuteUbergraph_WBP_Recollection_BossRush_BossProgression(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Recollection_BossRush_BossProgression_C">();
	}
	static class UWBP_Recollection_BossRush_BossProgression_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Recollection_BossRush_BossProgression_C>();
	}
};
static_assert(alignof(UWBP_Recollection_BossRush_BossProgression_C) == 0x000008, "Wrong alignment on UWBP_Recollection_BossRush_BossProgression_C");
static_assert(sizeof(UWBP_Recollection_BossRush_BossProgression_C) == 0x0004F8, "Wrong size on UWBP_Recollection_BossRush_BossProgression_C");
static_assert(offsetof(UWBP_Recollection_BossRush_BossProgression_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Recollection_BossRush_BossProgression_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_BossProgression_C, HorizontalBox) == 0x000468, "Member 'UWBP_Recollection_BossRush_BossProgression_C::HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_BossProgression_C, WBP_Recollection_BossRush_BossProgression_Entry) == 0x000470, "Member 'UWBP_Recollection_BossRush_BossProgression_C::WBP_Recollection_BossRush_BossProgression_Entry' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_BossProgression_C, WBP_Recollection_BossRush_BossProgression_Entry_1) == 0x000478, "Member 'UWBP_Recollection_BossRush_BossProgression_C::WBP_Recollection_BossRush_BossProgression_Entry_1' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_BossProgression_C, WBP_Recollection_BossRush_BossProgression_Entry_2) == 0x000480, "Member 'UWBP_Recollection_BossRush_BossProgression_C::WBP_Recollection_BossRush_BossProgression_Entry_2' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_BossProgression_C, WBP_Recollection_BossRush_BossProgression_Entry_3) == 0x000488, "Member 'UWBP_Recollection_BossRush_BossProgression_C::WBP_Recollection_BossRush_BossProgression_Entry_3' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_BossProgression_C, WBP_Recollection_BossRush_BossProgression_Entry_4) == 0x000490, "Member 'UWBP_Recollection_BossRush_BossProgression_C::WBP_Recollection_BossRush_BossProgression_Entry_4' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_BossProgression_C, WBP_Recollection_BossRush_BossProgression_Entry_5) == 0x000498, "Member 'UWBP_Recollection_BossRush_BossProgression_C::WBP_Recollection_BossRush_BossProgression_Entry_5' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_BossProgression_C, WBP_Recollection_BossRush_BossProgression_Entry_6) == 0x0004A0, "Member 'UWBP_Recollection_BossRush_BossProgression_C::WBP_Recollection_BossRush_BossProgression_Entry_6' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_BossProgression_C, WBP_Recollection_BossRush_BossProgression_Entry_7) == 0x0004A8, "Member 'UWBP_Recollection_BossRush_BossProgression_C::WBP_Recollection_BossRush_BossProgression_Entry_7' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_BossProgression_C, WBP_Recollection_BossRush_BossProgression_Entry_8) == 0x0004B0, "Member 'UWBP_Recollection_BossRush_BossProgression_C::WBP_Recollection_BossRush_BossProgression_Entry_8' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_BossProgression_C, WBP_Recollection_BossRush_BossProgression_Entry_9) == 0x0004B8, "Member 'UWBP_Recollection_BossRush_BossProgression_C::WBP_Recollection_BossRush_BossProgression_Entry_9' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_BossProgression_C, WBP_Recollection_BossRush_BossProgression_Entry_10) == 0x0004C0, "Member 'UWBP_Recollection_BossRush_BossProgression_C::WBP_Recollection_BossRush_BossProgression_Entry_10' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_BossProgression_C, WBP_Recollection_BossRush_BossProgression_Entry_11) == 0x0004C8, "Member 'UWBP_Recollection_BossRush_BossProgression_C::WBP_Recollection_BossRush_BossProgression_Entry_11' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_BossProgression_C, WBP_Recollection_BossRush_BossProgression_Entry_12) == 0x0004D0, "Member 'UWBP_Recollection_BossRush_BossProgression_C::WBP_Recollection_BossRush_BossProgression_Entry_12' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_BossProgression_C, WBP_Recollection_BossRush_BossProgression_Entry_13) == 0x0004D8, "Member 'UWBP_Recollection_BossRush_BossProgression_C::WBP_Recollection_BossRush_BossProgression_Entry_13' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_BossProgression_C, WBP_Recollection_BossRush_BossProgression_Entry_14) == 0x0004E0, "Member 'UWBP_Recollection_BossRush_BossProgression_C::WBP_Recollection_BossRush_BossProgression_Entry_14' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_BossProgression_C, Entries) == 0x0004E8, "Member 'UWBP_Recollection_BossRush_BossProgression_C::Entries' has a wrong offset!");

}

