#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugMenu_Element_Choice

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DebugMenu_Element_Choice.WBP_DebugMenu_Element_Choice_C
// 0x0058 (0x04B8 - 0x0460)
class UWBP_DebugMenu_Element_Choice_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             LabelBlock;                                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             OptionSlot;                                        // 0x0470(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_FocusDisplay_C*  WBP_DebugMenu_Element_FocusDisplay;                // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Label;                                             // 0x0480(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	TMulticastInlineDelegate<void()>              OnLeft;                                            // 0x0490(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnRight;                                           // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          HandleLeftRight;                                   // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetLabel(const class FText& InText);
	void SetHandleLeftRight(bool HandleLeftRight_0);
	void PreConstruct(bool IsDesignTime);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnPressRight(const struct FKeyEvent& KeyEvent);
	struct FEventReply OnPressLeft(const struct FKeyEvent& KeyEvent);
	struct FEventReply OnPressConfirm(const struct FKeyEvent& KeyEvent);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void ExecuteUbergraph_WBP_DebugMenu_Element_Choice(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DebugMenu_Element_Choice_C">();
	}
	static class UWBP_DebugMenu_Element_Choice_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DebugMenu_Element_Choice_C>();
	}
};
static_assert(alignof(UWBP_DebugMenu_Element_Choice_C) == 0x000008, "Wrong alignment on UWBP_DebugMenu_Element_Choice_C");
static_assert(sizeof(UWBP_DebugMenu_Element_Choice_C) == 0x0004B8, "Wrong size on UWBP_DebugMenu_Element_Choice_C");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_C, UberGraphFrame) == 0x000460, "Member 'UWBP_DebugMenu_Element_Choice_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_C, LabelBlock) == 0x000468, "Member 'UWBP_DebugMenu_Element_Choice_C::LabelBlock' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_C, OptionSlot) == 0x000470, "Member 'UWBP_DebugMenu_Element_Choice_C::OptionSlot' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_C, WBP_DebugMenu_Element_FocusDisplay) == 0x000478, "Member 'UWBP_DebugMenu_Element_Choice_C::WBP_DebugMenu_Element_FocusDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_C, Label) == 0x000480, "Member 'UWBP_DebugMenu_Element_Choice_C::Label' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_C, OnLeft) == 0x000490, "Member 'UWBP_DebugMenu_Element_Choice_C::OnLeft' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_C, OnRight) == 0x0004A0, "Member 'UWBP_DebugMenu_Element_Choice_C::OnRight' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_C, HandleLeftRight) == 0x0004B0, "Member 'UWBP_DebugMenu_Element_Choice_C::HandleLeftRight' has a wrong offset!");

}

