#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PassiveUnlock_Anim_Upgrade

#include "Basic.hpp"

#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function WBP_PassiveUnlock_Anim_Upgrade.WBP_PassiveUnlock_Anim_Upgrade_C.ExecuteUbergraph_WBP_PassiveUnlock_Anim_Upgrade
// 0x02A0 (0x02A0 - 0x0000)
struct WBP_PassiveUnlock_Anim_Upgrade_C_ExecuteUbergraph_WBP_PassiveUnlock_Anim_Upgrade final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0018(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInventoryItemPassiveData              CallFunc_GetItemPassiveData_out_ItemData;          // 0x0030(0x0268)()
	bool                                          CallFunc_GetItemPassiveData_ReturnValue;           // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PassiveUnlock_Anim_Upgrade_C_ExecuteUbergraph_WBP_PassiveUnlock_Anim_Upgrade) == 0x000008, "Wrong alignment on WBP_PassiveUnlock_Anim_Upgrade_C_ExecuteUbergraph_WBP_PassiveUnlock_Anim_Upgrade");
static_assert(sizeof(WBP_PassiveUnlock_Anim_Upgrade_C_ExecuteUbergraph_WBP_PassiveUnlock_Anim_Upgrade) == 0x0002A0, "Wrong size on WBP_PassiveUnlock_Anim_Upgrade_C_ExecuteUbergraph_WBP_PassiveUnlock_Anim_Upgrade");
static_assert(offsetof(WBP_PassiveUnlock_Anim_Upgrade_C_ExecuteUbergraph_WBP_PassiveUnlock_Anim_Upgrade, EntryPoint) == 0x000000, "Member 'WBP_PassiveUnlock_Anim_Upgrade_C_ExecuteUbergraph_WBP_PassiveUnlock_Anim_Upgrade::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PassiveUnlock_Anim_Upgrade_C_ExecuteUbergraph_WBP_PassiveUnlock_Anim_Upgrade, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_PassiveUnlock_Anim_Upgrade_C_ExecuteUbergraph_WBP_PassiveUnlock_Anim_Upgrade::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PassiveUnlock_Anim_Upgrade_C_ExecuteUbergraph_WBP_PassiveUnlock_Anim_Upgrade, K2Node_Event_Animation) == 0x000018, "Member 'WBP_PassiveUnlock_Anim_Upgrade_C_ExecuteUbergraph_WBP_PassiveUnlock_Anim_Upgrade::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(WBP_PassiveUnlock_Anim_Upgrade_C_ExecuteUbergraph_WBP_PassiveUnlock_Anim_Upgrade, CallFunc_PlayUMGAnimation_ReturnValue) == 0x000020, "Member 'WBP_PassiveUnlock_Anim_Upgrade_C_ExecuteUbergraph_WBP_PassiveUnlock_Anim_Upgrade::CallFunc_PlayUMGAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PassiveUnlock_Anim_Upgrade_C_ExecuteUbergraph_WBP_PassiveUnlock_Anim_Upgrade, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WBP_PassiveUnlock_Anim_Upgrade_C_ExecuteUbergraph_WBP_PassiveUnlock_Anim_Upgrade::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PassiveUnlock_Anim_Upgrade_C_ExecuteUbergraph_WBP_PassiveUnlock_Anim_Upgrade, CallFunc_GetItemPassiveData_out_ItemData) == 0x000030, "Member 'WBP_PassiveUnlock_Anim_Upgrade_C_ExecuteUbergraph_WBP_PassiveUnlock_Anim_Upgrade::CallFunc_GetItemPassiveData_out_ItemData' has a wrong offset!");
static_assert(offsetof(WBP_PassiveUnlock_Anim_Upgrade_C_ExecuteUbergraph_WBP_PassiveUnlock_Anim_Upgrade, CallFunc_GetItemPassiveData_ReturnValue) == 0x000298, "Member 'WBP_PassiveUnlock_Anim_Upgrade_C_ExecuteUbergraph_WBP_PassiveUnlock_Anim_Upgrade::CallFunc_GetItemPassiveData_ReturnValue' has a wrong offset!");

// Function WBP_PassiveUnlock_Anim_Upgrade.WBP_PassiveUnlock_Anim_Upgrade_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_PassiveUnlock_Anim_Upgrade_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation_0;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PassiveUnlock_Anim_Upgrade_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WBP_PassiveUnlock_Anim_Upgrade_C_OnAnimationFinished");
static_assert(sizeof(WBP_PassiveUnlock_Anim_Upgrade_C_OnAnimationFinished) == 0x000008, "Wrong size on WBP_PassiveUnlock_Anim_Upgrade_C_OnAnimationFinished");
static_assert(offsetof(WBP_PassiveUnlock_Anim_Upgrade_C_OnAnimationFinished, Animation_0) == 0x000000, "Member 'WBP_PassiveUnlock_Anim_Upgrade_C_OnAnimationFinished::Animation_0' has a wrong offset!");

}

