#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Extra_Gallery_Entry

#include "Basic.hpp"

#include "Zion_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Extra_Gallery_Entry.WBP_Extra_Gallery_Entry_C.ExecuteUbergraph_WBP_Extra_Gallery_Entry
// 0x0014 (0x0014 - 0x0000)
struct WBP_Extra_Gallery_Entry_C_ExecuteUbergraph_WBP_Extra_Gallery_Entry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0004(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x000C(0x0008)(NoDestructor)
};
static_assert(alignof(WBP_Extra_Gallery_Entry_C_ExecuteUbergraph_WBP_Extra_Gallery_Entry) == 0x000004, "Wrong alignment on WBP_Extra_Gallery_Entry_C_ExecuteUbergraph_WBP_Extra_Gallery_Entry");
static_assert(sizeof(WBP_Extra_Gallery_Entry_C_ExecuteUbergraph_WBP_Extra_Gallery_Entry) == 0x000014, "Wrong size on WBP_Extra_Gallery_Entry_C_ExecuteUbergraph_WBP_Extra_Gallery_Entry");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_ExecuteUbergraph_WBP_Extra_Gallery_Entry, EntryPoint) == 0x000000, "Member 'WBP_Extra_Gallery_Entry_C_ExecuteUbergraph_WBP_Extra_Gallery_Entry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_ExecuteUbergraph_WBP_Extra_Gallery_Entry, K2Node_Event_InFocusEvent_1) == 0x000004, "Member 'WBP_Extra_Gallery_Entry_C_ExecuteUbergraph_WBP_Extra_Gallery_Entry::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_ExecuteUbergraph_WBP_Extra_Gallery_Entry, K2Node_Event_InFocusEvent) == 0x00000C, "Member 'WBP_Extra_Gallery_Entry_C_ExecuteUbergraph_WBP_Extra_Gallery_Entry::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function WBP_Extra_Gallery_Entry.WBP_Extra_Gallery_Entry_C.GetCost
// 0x0004 (0x0004 - 0x0000)
struct WBP_Extra_Gallery_Entry_C_GetCost final
{
public:
	int32                                         Cost;                                              // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Gallery_Entry_C_GetCost) == 0x000004, "Wrong alignment on WBP_Extra_Gallery_Entry_C_GetCost");
static_assert(sizeof(WBP_Extra_Gallery_Entry_C_GetCost) == 0x000004, "Wrong size on WBP_Extra_Gallery_Entry_C_GetCost");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_GetCost, Cost) == 0x000000, "Member 'WBP_Extra_Gallery_Entry_C_GetCost::Cost' has a wrong offset!");

// Function WBP_Extra_Gallery_Entry.WBP_Extra_Gallery_Entry_C.GetCurrencyValue
// 0x0008 (0x0008 - 0x0000)
struct WBP_Extra_Gallery_Entry_C_GetCurrencyValue final
{
public:
	struct FCurrencyValue                         CurrencyValue_0;                                   // 0x0000(0x0008)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(WBP_Extra_Gallery_Entry_C_GetCurrencyValue) == 0x000004, "Wrong alignment on WBP_Extra_Gallery_Entry_C_GetCurrencyValue");
static_assert(sizeof(WBP_Extra_Gallery_Entry_C_GetCurrencyValue) == 0x000008, "Wrong size on WBP_Extra_Gallery_Entry_C_GetCurrencyValue");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_GetCurrencyValue, CurrencyValue_0) == 0x000000, "Member 'WBP_Extra_Gallery_Entry_C_GetCurrencyValue::CurrencyValue_0' has a wrong offset!");

// Function WBP_Extra_Gallery_Entry.WBP_Extra_Gallery_Entry_C.GetDataHandle
// 0x0010 (0x0010 - 0x0000)
struct WBP_Extra_Gallery_Entry_C_GetDataHandle final
{
public:
	struct FDataTableRowHandle                    DataHandle_0;                                      // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(WBP_Extra_Gallery_Entry_C_GetDataHandle) == 0x000008, "Wrong alignment on WBP_Extra_Gallery_Entry_C_GetDataHandle");
static_assert(sizeof(WBP_Extra_Gallery_Entry_C_GetDataHandle) == 0x000010, "Wrong size on WBP_Extra_Gallery_Entry_C_GetDataHandle");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_GetDataHandle, DataHandle_0) == 0x000000, "Member 'WBP_Extra_Gallery_Entry_C_GetDataHandle::DataHandle_0' has a wrong offset!");

// Function WBP_Extra_Gallery_Entry.WBP_Extra_Gallery_Entry_C.GetImage
// 0x0210 (0x0210 - 0x0000)
struct WBP_Extra_Gallery_Entry_C_GetImage final
{
public:
	TSoftObjectPtr<class UTexture2D>              Display_Image;                                     // 0x0000(0x0028)(Parm, OutParm, UObjectWrapper, HasGetValueTypeHash)
	struct FInventoryItemGalleryData              CallFunc_GetItemGalleryData_out_ItemData;          // 0x0028(0x01E0)()
	bool                                          CallFunc_GetItemGalleryData_ReturnValue;           // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Gallery_Entry_C_GetImage) == 0x000008, "Wrong alignment on WBP_Extra_Gallery_Entry_C_GetImage");
static_assert(sizeof(WBP_Extra_Gallery_Entry_C_GetImage) == 0x000210, "Wrong size on WBP_Extra_Gallery_Entry_C_GetImage");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_GetImage, Display_Image) == 0x000000, "Member 'WBP_Extra_Gallery_Entry_C_GetImage::Display_Image' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_GetImage, CallFunc_GetItemGalleryData_out_ItemData) == 0x000028, "Member 'WBP_Extra_Gallery_Entry_C_GetImage::CallFunc_GetItemGalleryData_out_ItemData' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_GetImage, CallFunc_GetItemGalleryData_ReturnValue) == 0x000208, "Member 'WBP_Extra_Gallery_Entry_C_GetImage::CallFunc_GetItemGalleryData_ReturnValue' has a wrong offset!");

// Function WBP_Extra_Gallery_Entry.WBP_Extra_Gallery_Entry_C.GetImageName
// 0x01F8 (0x01F8 - 0x0000)
struct WBP_Extra_Gallery_Entry_C_GetImageName final
{
public:
	class FText                                   Name_0;                                            // 0x0000(0x0010)(Parm, OutParm)
	struct FInventoryItemGalleryData              CallFunc_GetItemGalleryData_out_ItemData;          // 0x0010(0x01E0)()
	bool                                          CallFunc_GetItemGalleryData_ReturnValue;           // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Gallery_Entry_C_GetImageName) == 0x000008, "Wrong alignment on WBP_Extra_Gallery_Entry_C_GetImageName");
static_assert(sizeof(WBP_Extra_Gallery_Entry_C_GetImageName) == 0x0001F8, "Wrong size on WBP_Extra_Gallery_Entry_C_GetImageName");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_GetImageName, Name_0) == 0x000000, "Member 'WBP_Extra_Gallery_Entry_C_GetImageName::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_GetImageName, CallFunc_GetItemGalleryData_out_ItemData) == 0x000010, "Member 'WBP_Extra_Gallery_Entry_C_GetImageName::CallFunc_GetItemGalleryData_out_ItemData' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_GetImageName, CallFunc_GetItemGalleryData_ReturnValue) == 0x0001F0, "Member 'WBP_Extra_Gallery_Entry_C_GetImageName::CallFunc_GetItemGalleryData_ReturnValue' has a wrong offset!");

// Function WBP_Extra_Gallery_Entry.WBP_Extra_Gallery_Entry_C.Initialize
// 0x01F8 (0x01F8 - 0x0000)
struct WBP_Extra_Gallery_Entry_C_Initialize final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGalleryDataAlreadyBought_IsAlreadyBought; // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInventoryItemGalleryData              CallFunc_GetItemGalleryData_out_ItemData;          // 0x0008(0x01E0)()
	bool                                          CallFunc_GetItemGalleryData_ReturnValue;           // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCurrencyValue                         CallFunc_ToCurrencyValue_ReturnValue;              // 0x01EC(0x0008)(NoDestructor)
};
static_assert(alignof(WBP_Extra_Gallery_Entry_C_Initialize) == 0x000008, "Wrong alignment on WBP_Extra_Gallery_Entry_C_Initialize");
static_assert(sizeof(WBP_Extra_Gallery_Entry_C_Initialize) == 0x0001F8, "Wrong size on WBP_Extra_Gallery_Entry_C_Initialize");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_Initialize, Temp_byte_Variable) == 0x000000, "Member 'WBP_Extra_Gallery_Entry_C_Initialize::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_Initialize, Temp_byte_Variable_1) == 0x000001, "Member 'WBP_Extra_Gallery_Entry_C_Initialize::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_Initialize, CallFunc_IsGalleryDataAlreadyBought_IsAlreadyBought) == 0x000002, "Member 'WBP_Extra_Gallery_Entry_C_Initialize::CallFunc_IsGalleryDataAlreadyBought_IsAlreadyBought' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_Initialize, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'WBP_Extra_Gallery_Entry_C_Initialize::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_Initialize, Temp_bool_Variable) == 0x000004, "Member 'WBP_Extra_Gallery_Entry_C_Initialize::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_Initialize, K2Node_Select_Default) == 0x000005, "Member 'WBP_Extra_Gallery_Entry_C_Initialize::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_Initialize, CallFunc_GetItemGalleryData_out_ItemData) == 0x000008, "Member 'WBP_Extra_Gallery_Entry_C_Initialize::CallFunc_GetItemGalleryData_out_ItemData' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_Initialize, CallFunc_GetItemGalleryData_ReturnValue) == 0x0001E8, "Member 'WBP_Extra_Gallery_Entry_C_Initialize::CallFunc_GetItemGalleryData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_Initialize, CallFunc_ToCurrencyValue_ReturnValue) == 0x0001EC, "Member 'WBP_Extra_Gallery_Entry_C_Initialize::CallFunc_ToCurrencyValue_ReturnValue' has a wrong offset!");

// Function WBP_Extra_Gallery_Entry.WBP_Extra_Gallery_Entry_C.IsGalleryDataAlreadyBought
// 0x0018 (0x0018 - 0x0000)
struct WBP_Extra_Gallery_Entry_C_IsGalleryDataAlreadyBought final
{
public:
	bool                                          IsAlreadyBought;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasItem_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Gallery_Entry_C_IsGalleryDataAlreadyBought) == 0x000008, "Wrong alignment on WBP_Extra_Gallery_Entry_C_IsGalleryDataAlreadyBought");
static_assert(sizeof(WBP_Extra_Gallery_Entry_C_IsGalleryDataAlreadyBought) == 0x000018, "Wrong size on WBP_Extra_Gallery_Entry_C_IsGalleryDataAlreadyBought");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_IsGalleryDataAlreadyBought, IsAlreadyBought) == 0x000000, "Member 'WBP_Extra_Gallery_Entry_C_IsGalleryDataAlreadyBought::IsAlreadyBought' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_IsGalleryDataAlreadyBought, CallFunc_Get_ReturnValue) == 0x000008, "Member 'WBP_Extra_Gallery_Entry_C_IsGalleryDataAlreadyBought::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_IsGalleryDataAlreadyBought, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_Extra_Gallery_Entry_C_IsGalleryDataAlreadyBought::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_IsGalleryDataAlreadyBought, CallFunc_HasItem_ReturnValue) == 0x000011, "Member 'WBP_Extra_Gallery_Entry_C_IsGalleryDataAlreadyBought::CallFunc_HasItem_ReturnValue' has a wrong offset!");

// Function WBP_Extra_Gallery_Entry.WBP_Extra_Gallery_Entry_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_Extra_Gallery_Entry_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Extra_Gallery_Entry_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on WBP_Extra_Gallery_Entry_C_OnAddedToFocusPath");
static_assert(sizeof(WBP_Extra_Gallery_Entry_C_OnAddedToFocusPath) == 0x000008, "Wrong size on WBP_Extra_Gallery_Entry_C_OnAddedToFocusPath");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_Extra_Gallery_Entry_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_Extra_Gallery_Entry.WBP_Extra_Gallery_Entry_C.OnPressConfirm
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Extra_Gallery_Entry_C_OnPressConfirm final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Extra_Gallery_Entry_C_OnPressConfirm) == 0x000008, "Wrong alignment on WBP_Extra_Gallery_Entry_C_OnPressConfirm");
static_assert(sizeof(WBP_Extra_Gallery_Entry_C_OnPressConfirm) == 0x0001B0, "Wrong size on WBP_Extra_Gallery_Entry_C_OnPressConfirm");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_OnPressConfirm, KeyEvent) == 0x000000, "Member 'WBP_Extra_Gallery_Entry_C_OnPressConfirm::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_OnPressConfirm, ReturnValue) == 0x000040, "Member 'WBP_Extra_Gallery_Entry_C_OnPressConfirm::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_OnPressConfirm, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Extra_Gallery_Entry_C_OnPressConfirm::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Extra_Gallery_Entry.WBP_Extra_Gallery_Entry_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_Extra_Gallery_Entry_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Extra_Gallery_Entry_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on WBP_Extra_Gallery_Entry_C_OnRemovedFromFocusPath");
static_assert(sizeof(WBP_Extra_Gallery_Entry_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on WBP_Extra_Gallery_Entry_C_OnRemovedFromFocusPath");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_Extra_Gallery_Entry_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_Extra_Gallery_Entry.WBP_Extra_Gallery_Entry_C.SetFocusedState
// 0x0010 (0x0010 - 0x0000)
struct WBP_Extra_Gallery_Entry_C_SetFocusedState final
{
public:
	bool                                          Focus;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Gallery_Entry_C_SetFocusedState) == 0x000008, "Wrong alignment on WBP_Extra_Gallery_Entry_C_SetFocusedState");
static_assert(sizeof(WBP_Extra_Gallery_Entry_C_SetFocusedState) == 0x000010, "Wrong size on WBP_Extra_Gallery_Entry_C_SetFocusedState");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_SetFocusedState, Focus) == 0x000000, "Member 'WBP_Extra_Gallery_Entry_C_SetFocusedState::Focus' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_SetFocusedState, Temp_byte_Variable) == 0x000001, "Member 'WBP_Extra_Gallery_Entry_C_SetFocusedState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_SetFocusedState, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_Extra_Gallery_Entry_C_SetFocusedState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_SetFocusedState, Temp_bool_Variable) == 0x000003, "Member 'WBP_Extra_Gallery_Entry_C_SetFocusedState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_SetFocusedState, K2Node_Select_Default) == 0x000004, "Member 'WBP_Extra_Gallery_Entry_C_SetFocusedState::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_SetFocusedState, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_Extra_Gallery_Entry_C_SetFocusedState::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_Extra_Gallery_Entry.WBP_Extra_Gallery_Entry_C.SetIsBought
// 0x0005 (0x0005 - 0x0000)
struct WBP_Extra_Gallery_Entry_C_SetIsBought final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGalleryDataAlreadyBought_IsAlreadyBought; // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Gallery_Entry_C_SetIsBought) == 0x000001, "Wrong alignment on WBP_Extra_Gallery_Entry_C_SetIsBought");
static_assert(sizeof(WBP_Extra_Gallery_Entry_C_SetIsBought) == 0x000005, "Wrong size on WBP_Extra_Gallery_Entry_C_SetIsBought");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_SetIsBought, Temp_bool_Variable) == 0x000000, "Member 'WBP_Extra_Gallery_Entry_C_SetIsBought::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_SetIsBought, Temp_byte_Variable) == 0x000001, "Member 'WBP_Extra_Gallery_Entry_C_SetIsBought::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_SetIsBought, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_Extra_Gallery_Entry_C_SetIsBought::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_SetIsBought, CallFunc_IsGalleryDataAlreadyBought_IsAlreadyBought) == 0x000003, "Member 'WBP_Extra_Gallery_Entry_C_SetIsBought::CallFunc_IsGalleryDataAlreadyBought_IsAlreadyBought' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Gallery_Entry_C_SetIsBought, K2Node_Select_Default) == 0x000004, "Member 'WBP_Extra_Gallery_Entry_C_SetIsBought::K2Node_Select_Default' has a wrong offset!");

}

