#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_Page

#include "Basic.hpp"

#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Settings_Page.WBP_Settings_Page_C
// 0x0020 (0x0480 - 0x0460)
class UWBP_Settings_Page_C : public UUserWidgetZion
{
public:
	class UWidgetAnimation*                       Hide;                                              // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Show;                                              // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnClose;                                           // 0x0470(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Settings_Page_C">();
	}
	static class UWBP_Settings_Page_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Settings_Page_C>();
	}
};
static_assert(alignof(UWBP_Settings_Page_C) == 0x000008, "Wrong alignment on UWBP_Settings_Page_C");
static_assert(sizeof(UWBP_Settings_Page_C) == 0x000480, "Wrong size on UWBP_Settings_Page_C");
static_assert(offsetof(UWBP_Settings_Page_C, Hide) == 0x000460, "Member 'UWBP_Settings_Page_C::Hide' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Page_C, Show) == 0x000468, "Member 'UWBP_Settings_Page_C::Show' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Page_C, OnClose) == 0x000470, "Member 'UWBP_Settings_Page_C::OnClose' has a wrong offset!");

}

