#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_Page_Video

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_Settings_Page_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Settings_Page_Video.WBP_Settings_Page_Video_C
// 0x0078 (0x04F8 - 0x0480)
class UWBP_Settings_Page_Video_C final : public UWBP_Settings_Page_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Button_Generic_C*                  WBP_Button_Generic_Apply;                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Generic_C*                  WBP_Button_Generic_Gamma;                          // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Generic_C*                  WBP_Button_Generic_RevertToDefault;                // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_Entry_Choice_AntiAliasingQuality_C* WBP_Settings_Entry_Choice_AntiAliasing;  // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_Entry_Choice_AntiAliasingType_C* WBP_Settings_Entry_Choice_AntiAliasingType; // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_Entry_Choice_AspectRatio_C* WBP_Settings_Entry_Choice_AspectRatio;           // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_Entry_Choice_EffectsQuality_C* WBP_Settings_Entry_Choice_EffectsQuality;     // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_Entry_Choice_PostProcessQuality_C* WBP_Settings_Entry_Choice_PostProcessQuality; // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_Entry_Choice_Resolution_C* WBP_Settings_Entry_Choice_Resolution;             // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_Entry_Choice_ResolutionScale_C* WBP_Settings_Entry_Choice_ResolutionScale;   // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_Entry_Choice_ScreenMode_C* WBP_Settings_Entry_Choice_ScreenMode;             // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_Entry_Choice_Toggle_C*    WBP_Settings_Entry_Choice_Toggle_ConstraintHUDAspectRatio; // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_Entry_Choice_Toggle_C*    WBP_Settings_Entry_Choice_Toggle_VSync;            // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_Entry_FPS_C*              WBP_Settings_Entry_FPS;                            // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Settings_Page_Video_WBP_Button_Generic_Apply_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void BndEvt__WBP_Settings_Page_Video_WBP_Button_Generic_Gamma_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void BndEvt__WBP_Settings_Page_Video_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void BndEvt__WBP_Settings_Page_Video_WBP_Settings_Entry_Choice_AntiAliasingType_K2Node_ComponentBoundEvent_8_OnAntiAliasingTypeChanged__DelegateSignature();
	void BndEvt__WBP_Settings_Page_Video_WBP_Settings_Entry_Choice_AspectRatio_K2Node_ComponentBoundEvent_7_OnChanged__DelegateSignature();
	void BndEvt__WBP_Settings_Page_Video_WBP_Settings_Entry_Choice_Resolution_K2Node_ComponentBoundEvent_3_OnChanged__DelegateSignature();
	void BndEvt__WBP_Settings_Page_Video_WBP_Settings_Entry_Choice_ScreenMode_K2Node_ComponentBoundEvent_2_OnChanged__DelegateSignature();
	void BndEvt__WBP_Settings_Page_Video_WBP_Settings_Entry_Choice_Toggle_ConstraintHUDAspectRatio_K2Node_ComponentBoundEvent_6_OnToggle__DelegateSignature(bool ToggleValue);
	void BndEvt__WBP_Settings_Page_Video_WBP_Settings_Entry_Choice_Toggle_VSync_K2Node_ComponentBoundEvent_4_OnToggle__DelegateSignature(bool ToggleValue);
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_Settings_Page_Video(int32 EntryPoint);
	void OnConfirmResetToDefault();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnResolutionChanged();
	void RevertGameUserSettingsToDefault();
	void SetupValues();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Settings_Page_Video_C">();
	}
	static class UWBP_Settings_Page_Video_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Settings_Page_Video_C>();
	}
};
static_assert(alignof(UWBP_Settings_Page_Video_C) == 0x000008, "Wrong alignment on UWBP_Settings_Page_Video_C");
static_assert(sizeof(UWBP_Settings_Page_Video_C) == 0x0004F8, "Wrong size on UWBP_Settings_Page_Video_C");
static_assert(offsetof(UWBP_Settings_Page_Video_C, UberGraphFrame) == 0x000480, "Member 'UWBP_Settings_Page_Video_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Page_Video_C, WBP_Button_Generic_Apply) == 0x000488, "Member 'UWBP_Settings_Page_Video_C::WBP_Button_Generic_Apply' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Page_Video_C, WBP_Button_Generic_Gamma) == 0x000490, "Member 'UWBP_Settings_Page_Video_C::WBP_Button_Generic_Gamma' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Page_Video_C, WBP_Button_Generic_RevertToDefault) == 0x000498, "Member 'UWBP_Settings_Page_Video_C::WBP_Button_Generic_RevertToDefault' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Page_Video_C, WBP_Settings_Entry_Choice_AntiAliasing) == 0x0004A0, "Member 'UWBP_Settings_Page_Video_C::WBP_Settings_Entry_Choice_AntiAliasing' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Page_Video_C, WBP_Settings_Entry_Choice_AntiAliasingType) == 0x0004A8, "Member 'UWBP_Settings_Page_Video_C::WBP_Settings_Entry_Choice_AntiAliasingType' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Page_Video_C, WBP_Settings_Entry_Choice_AspectRatio) == 0x0004B0, "Member 'UWBP_Settings_Page_Video_C::WBP_Settings_Entry_Choice_AspectRatio' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Page_Video_C, WBP_Settings_Entry_Choice_EffectsQuality) == 0x0004B8, "Member 'UWBP_Settings_Page_Video_C::WBP_Settings_Entry_Choice_EffectsQuality' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Page_Video_C, WBP_Settings_Entry_Choice_PostProcessQuality) == 0x0004C0, "Member 'UWBP_Settings_Page_Video_C::WBP_Settings_Entry_Choice_PostProcessQuality' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Page_Video_C, WBP_Settings_Entry_Choice_Resolution) == 0x0004C8, "Member 'UWBP_Settings_Page_Video_C::WBP_Settings_Entry_Choice_Resolution' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Page_Video_C, WBP_Settings_Entry_Choice_ResolutionScale) == 0x0004D0, "Member 'UWBP_Settings_Page_Video_C::WBP_Settings_Entry_Choice_ResolutionScale' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Page_Video_C, WBP_Settings_Entry_Choice_ScreenMode) == 0x0004D8, "Member 'UWBP_Settings_Page_Video_C::WBP_Settings_Entry_Choice_ScreenMode' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Page_Video_C, WBP_Settings_Entry_Choice_Toggle_ConstraintHUDAspectRatio) == 0x0004E0, "Member 'UWBP_Settings_Page_Video_C::WBP_Settings_Entry_Choice_Toggle_ConstraintHUDAspectRatio' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Page_Video_C, WBP_Settings_Entry_Choice_Toggle_VSync) == 0x0004E8, "Member 'UWBP_Settings_Page_Video_C::WBP_Settings_Entry_Choice_Toggle_VSync' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Page_Video_C, WBP_Settings_Entry_FPS) == 0x0004F0, "Member 'UWBP_Settings_Page_Video_C::WBP_Settings_Entry_FPS' has a wrong offset!");

}

