#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Button_Item

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function WBP_Button_Item.WBP_Button_Item_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_Button_Item_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Button_Item_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on WBP_Button_Item_C_OnAddedToFocusPath");
static_assert(sizeof(WBP_Button_Item_C_OnAddedToFocusPath) == 0x000008, "Wrong size on WBP_Button_Item_C_OnAddedToFocusPath");
static_assert(offsetof(WBP_Button_Item_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_Button_Item_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_Button_Item.WBP_Button_Item_C.ExecuteUbergraph_WBP_Button_Item
// 0x0020 (0x0020 - 0x0000)
struct WBP_Button_Item_C_ExecuteUbergraph_WBP_Button_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0004(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x000C(0x0008)(NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Button_Item_C_ExecuteUbergraph_WBP_Button_Item) == 0x000008, "Wrong alignment on WBP_Button_Item_C_ExecuteUbergraph_WBP_Button_Item");
static_assert(sizeof(WBP_Button_Item_C_ExecuteUbergraph_WBP_Button_Item) == 0x000020, "Wrong size on WBP_Button_Item_C_ExecuteUbergraph_WBP_Button_Item");
static_assert(offsetof(WBP_Button_Item_C_ExecuteUbergraph_WBP_Button_Item, EntryPoint) == 0x000000, "Member 'WBP_Button_Item_C_ExecuteUbergraph_WBP_Button_Item::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_ExecuteUbergraph_WBP_Button_Item, K2Node_Event_InFocusEvent_1) == 0x000004, "Member 'WBP_Button_Item_C_ExecuteUbergraph_WBP_Button_Item::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_ExecuteUbergraph_WBP_Button_Item, K2Node_Event_InFocusEvent) == 0x00000C, "Member 'WBP_Button_Item_C_ExecuteUbergraph_WBP_Button_Item::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_ExecuteUbergraph_WBP_Button_Item, CallFunc_Get_ReturnValue) == 0x000018, "Member 'WBP_Button_Item_C_ExecuteUbergraph_WBP_Button_Item::CallFunc_Get_ReturnValue' has a wrong offset!");

// Function WBP_Button_Item.WBP_Button_Item_C.OnPressConfirm
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Button_Item_C_OnPressConfirm final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Button_Item_C_OnPressConfirm) == 0x000008, "Wrong alignment on WBP_Button_Item_C_OnPressConfirm");
static_assert(sizeof(WBP_Button_Item_C_OnPressConfirm) == 0x0001B0, "Wrong size on WBP_Button_Item_C_OnPressConfirm");
static_assert(offsetof(WBP_Button_Item_C_OnPressConfirm, KeyEvent) == 0x000000, "Member 'WBP_Button_Item_C_OnPressConfirm::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_OnPressConfirm, ReturnValue) == 0x000040, "Member 'WBP_Button_Item_C_OnPressConfirm::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_OnPressConfirm, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Button_Item_C_OnPressConfirm::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Button_Item.WBP_Button_Item_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_Button_Item_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Button_Item_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on WBP_Button_Item_C_OnRemovedFromFocusPath");
static_assert(sizeof(WBP_Button_Item_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on WBP_Button_Item_C_OnRemovedFromFocusPath");
static_assert(offsetof(WBP_Button_Item_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_Button_Item_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_Button_Item.WBP_Button_Item_C.RefreshNewVisibility
// 0x0007 (0x0007 - 0x0000)
struct WBP_Button_Item_C_RefreshNewVisibility final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemChecked_ReturnValue;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Button_Item_C_RefreshNewVisibility) == 0x000001, "Wrong alignment on WBP_Button_Item_C_RefreshNewVisibility");
static_assert(sizeof(WBP_Button_Item_C_RefreshNewVisibility) == 0x000007, "Wrong size on WBP_Button_Item_C_RefreshNewVisibility");
static_assert(offsetof(WBP_Button_Item_C_RefreshNewVisibility, Temp_byte_Variable) == 0x000000, "Member 'WBP_Button_Item_C_RefreshNewVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_RefreshNewVisibility, Temp_byte_Variable_1) == 0x000001, "Member 'WBP_Button_Item_C_RefreshNewVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_RefreshNewVisibility, Temp_bool_Variable) == 0x000002, "Member 'WBP_Button_Item_C_RefreshNewVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_RefreshNewVisibility, CallFunc_IsValid_ReturnValue) == 0x000003, "Member 'WBP_Button_Item_C_RefreshNewVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_RefreshNewVisibility, CallFunc_IsItemChecked_ReturnValue) == 0x000004, "Member 'WBP_Button_Item_C_RefreshNewVisibility::CallFunc_IsItemChecked_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_RefreshNewVisibility, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'WBP_Button_Item_C_RefreshNewVisibility::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_RefreshNewVisibility, K2Node_Select_Default) == 0x000006, "Member 'WBP_Button_Item_C_RefreshNewVisibility::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Button_Item.WBP_Button_Item_C.SetColor
// 0x0010 (0x0010 - 0x0000)
struct WBP_Button_Item_C_SetColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Button_Item_C_SetColor) == 0x000004, "Wrong alignment on WBP_Button_Item_C_SetColor");
static_assert(sizeof(WBP_Button_Item_C_SetColor) == 0x000010, "Wrong size on WBP_Button_Item_C_SetColor");
static_assert(offsetof(WBP_Button_Item_C_SetColor, Color) == 0x000000, "Member 'WBP_Button_Item_C_SetColor::Color' has a wrong offset!");

// Function WBP_Button_Item.WBP_Button_Item_C.SetFocusedState
// 0x0010 (0x0010 - 0x0000)
struct WBP_Button_Item_C_SetFocusedState final
{
public:
	bool                                          Focus;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Button_Item_C_SetFocusedState) == 0x000008, "Wrong alignment on WBP_Button_Item_C_SetFocusedState");
static_assert(sizeof(WBP_Button_Item_C_SetFocusedState) == 0x000010, "Wrong size on WBP_Button_Item_C_SetFocusedState");
static_assert(offsetof(WBP_Button_Item_C_SetFocusedState, Focus) == 0x000000, "Member 'WBP_Button_Item_C_SetFocusedState::Focus' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_SetFocusedState, Temp_byte_Variable) == 0x000001, "Member 'WBP_Button_Item_C_SetFocusedState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_SetFocusedState, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_Button_Item_C_SetFocusedState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_SetFocusedState, Temp_bool_Variable) == 0x000003, "Member 'WBP_Button_Item_C_SetFocusedState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_SetFocusedState, K2Node_Select_Default) == 0x000004, "Member 'WBP_Button_Item_C_SetFocusedState::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_SetFocusedState, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_Button_Item_C_SetFocusedState::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_Button_Item.WBP_Button_Item_C.Setup
// 0x0330 (0x0330 - 0x0000)
struct WBP_Button_Item_C_Setup final
{
public:
	struct FDataTableRowHandle                    ItemHandle_0;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	int32                                         Count;                                             // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   FallbackText;                                      // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          bNew;                                              // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInventoryItemData                     ItemData;                                          // 0x0030(0x0168)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x01A0(0x0010)()
	bool                                          Temp_bool_Variable_1;                              // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x01B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x01B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x01B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x01B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_9;                              // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_10;                             // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_11;                             // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_12;                             // 0x01BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_13;                             // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_14;                             // 0x01BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BE[0x2];                                      // 0x01BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInventoryItemData                     CallFunc_GetInventoryItemData_out_ItemData;        // 0x01C0(0x0168)()
	bool                                          CallFunc_GetInventoryItemData_ReturnValue;         // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_15;                             // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_16;                             // 0x032A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_17;                             // 0x032B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInventoryItemType                            Temp_byte_Variable;                                // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x032D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x032E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Button_Item_C_Setup) == 0x000008, "Wrong alignment on WBP_Button_Item_C_Setup");
static_assert(sizeof(WBP_Button_Item_C_Setup) == 0x000330, "Wrong size on WBP_Button_Item_C_Setup");
static_assert(offsetof(WBP_Button_Item_C_Setup, ItemHandle_0) == 0x000000, "Member 'WBP_Button_Item_C_Setup::ItemHandle_0' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_Setup, Count) == 0x000010, "Member 'WBP_Button_Item_C_Setup::Count' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_Setup, FallbackText) == 0x000018, "Member 'WBP_Button_Item_C_Setup::FallbackText' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_Setup, bNew) == 0x000028, "Member 'WBP_Button_Item_C_Setup::bNew' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_Setup, ItemData) == 0x000030, "Member 'WBP_Button_Item_C_Setup::ItemData' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_Setup, Temp_bool_Variable) == 0x000198, "Member 'WBP_Button_Item_C_Setup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_Setup, CallFunc_Greater_IntInt_ReturnValue) == 0x000199, "Member 'WBP_Button_Item_C_Setup::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_Setup, CallFunc_Conv_IntToText_ReturnValue) == 0x0001A0, "Member 'WBP_Button_Item_C_Setup::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_Setup, Temp_bool_Variable_1) == 0x0001B0, "Member 'WBP_Button_Item_C_Setup::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_Setup, Temp_bool_Variable_2) == 0x0001B1, "Member 'WBP_Button_Item_C_Setup::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_Setup, Temp_bool_Variable_3) == 0x0001B2, "Member 'WBP_Button_Item_C_Setup::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_Setup, Temp_bool_Variable_4) == 0x0001B3, "Member 'WBP_Button_Item_C_Setup::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_Setup, Temp_bool_Variable_5) == 0x0001B4, "Member 'WBP_Button_Item_C_Setup::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_Setup, Temp_bool_Variable_6) == 0x0001B5, "Member 'WBP_Button_Item_C_Setup::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_Setup, Temp_bool_Variable_7) == 0x0001B6, "Member 'WBP_Button_Item_C_Setup::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_Setup, Temp_bool_Variable_8) == 0x0001B7, "Member 'WBP_Button_Item_C_Setup::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_Setup, Temp_bool_Variable_9) == 0x0001B8, "Member 'WBP_Button_Item_C_Setup::Temp_bool_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_Setup, Temp_bool_Variable_10) == 0x0001B9, "Member 'WBP_Button_Item_C_Setup::Temp_bool_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_Setup, Temp_bool_Variable_11) == 0x0001BA, "Member 'WBP_Button_Item_C_Setup::Temp_bool_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_Setup, Temp_bool_Variable_12) == 0x0001BB, "Member 'WBP_Button_Item_C_Setup::Temp_bool_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_Setup, Temp_bool_Variable_13) == 0x0001BC, "Member 'WBP_Button_Item_C_Setup::Temp_bool_Variable_13' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_Setup, Temp_bool_Variable_14) == 0x0001BD, "Member 'WBP_Button_Item_C_Setup::Temp_bool_Variable_14' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_Setup, CallFunc_GetInventoryItemData_out_ItemData) == 0x0001C0, "Member 'WBP_Button_Item_C_Setup::CallFunc_GetInventoryItemData_out_ItemData' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_Setup, CallFunc_GetInventoryItemData_ReturnValue) == 0x000328, "Member 'WBP_Button_Item_C_Setup::CallFunc_GetInventoryItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_Setup, Temp_bool_Variable_15) == 0x000329, "Member 'WBP_Button_Item_C_Setup::Temp_bool_Variable_15' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_Setup, Temp_bool_Variable_16) == 0x00032A, "Member 'WBP_Button_Item_C_Setup::Temp_bool_Variable_16' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_Setup, Temp_bool_Variable_17) == 0x00032B, "Member 'WBP_Button_Item_C_Setup::Temp_bool_Variable_17' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_Setup, Temp_byte_Variable) == 0x00032C, "Member 'WBP_Button_Item_C_Setup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_Setup, K2Node_Select_Default) == 0x00032D, "Member 'WBP_Button_Item_C_Setup::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Button_Item_C_Setup, CallFunc_BooleanOR_ReturnValue) == 0x00032E, "Member 'WBP_Button_Item_C_Setup::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_Button_Item.WBP_Button_Item_C.TryMarkItemAsChecked
// 0x0001 (0x0001 - 0x0000)
struct WBP_Button_Item_C_TryMarkItemAsChecked final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Button_Item_C_TryMarkItemAsChecked) == 0x000001, "Wrong alignment on WBP_Button_Item_C_TryMarkItemAsChecked");
static_assert(sizeof(WBP_Button_Item_C_TryMarkItemAsChecked) == 0x000001, "Wrong size on WBP_Button_Item_C_TryMarkItemAsChecked");
static_assert(offsetof(WBP_Button_Item_C_TryMarkItemAsChecked, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_Button_Item_C_TryMarkItemAsChecked::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

