#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ProfileConfirmation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ProfileConfirmation.WBP_ProfileConfirmation_C
// 0x0040 (0x04A0 - 0x0460)
class UWBP_ProfileConfirmation_C : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hide;                                              // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Show;                                              // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             ProfileName;                                       // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Title_BG_Default_C*                WBP_Title_BG;                                      // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnProfileConfirmationFinished;                     // 0x0490(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Construct();
	void ExecuteUbergraph_WBP_ProfileConfirmation(int32 EntryPoint);
	void OnFinish_72C7DC1544F90D6FD9C21884A5669BDC();
	void OnFinish_72C7DC1544F90D6FD9C21884B9702A43();
	struct FEventReply OnPressConfirm(const struct FKeyEvent& KeyEvent);
	void OnProfileConfirmed();
	void RefreshUserProfile();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ProfileConfirmation_C">();
	}
	static class UWBP_ProfileConfirmation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ProfileConfirmation_C>();
	}
};
static_assert(alignof(UWBP_ProfileConfirmation_C) == 0x000008, "Wrong alignment on UWBP_ProfileConfirmation_C");
static_assert(sizeof(UWBP_ProfileConfirmation_C) == 0x0004A0, "Wrong size on UWBP_ProfileConfirmation_C");
static_assert(offsetof(UWBP_ProfileConfirmation_C, UberGraphFrame) == 0x000460, "Member 'UWBP_ProfileConfirmation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ProfileConfirmation_C, Loop) == 0x000468, "Member 'UWBP_ProfileConfirmation_C::Loop' has a wrong offset!");
static_assert(offsetof(UWBP_ProfileConfirmation_C, Hide) == 0x000470, "Member 'UWBP_ProfileConfirmation_C::Hide' has a wrong offset!");
static_assert(offsetof(UWBP_ProfileConfirmation_C, Show) == 0x000478, "Member 'UWBP_ProfileConfirmation_C::Show' has a wrong offset!");
static_assert(offsetof(UWBP_ProfileConfirmation_C, ProfileName) == 0x000480, "Member 'UWBP_ProfileConfirmation_C::ProfileName' has a wrong offset!");
static_assert(offsetof(UWBP_ProfileConfirmation_C, WBP_Title_BG) == 0x000488, "Member 'UWBP_ProfileConfirmation_C::WBP_Title_BG' has a wrong offset!");
static_assert(offsetof(UWBP_ProfileConfirmation_C, OnProfileConfirmationFinished) == 0x000490, "Member 'UWBP_ProfileConfirmation_C::OnProfileConfirmationFinished' has a wrong offset!");

}

