#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GameMenu

#include "Basic.hpp"

#include "Zion_structs.hpp"
#include "Zion_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GameMenu.WBP_GameMenu_C
// 0x0128 (0x05B0 - 0x0488)
class UWBP_GameMenu_C final : public UUserWidgetGameMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0488(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hide;                                              // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Show;                                              // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG_Base;                                           // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Effect;                                         // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_LeftGradation;                                  // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Line;                                           // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_RightGradation;                                 // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_TopGradation;                                   // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NiagaraSystemWidget_272;                           // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URefreshableRichTextBlock*              RefreshableRichTextBlock_NextPage;                 // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URefreshableRichTextBlock*              RefreshableRichTextBlock_PrevPage;                 // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TabLine;                                           // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Footer_C*                          WBP_Footer;                                        // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GameMenu_Tab_C*                    WBP_GameMenu_Tab_Equipment;                        // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GameMenu_Tab_C*                    WBP_GameMenu_Tab_Intel;                            // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GameMenu_Tab_C*                    WBP_GameMenu_Tab_Inventory;                        // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GameMenu_Tab_C*                    WBP_GameMenu_Tab_Map;                              // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GameMenu_Tab_C*                    WBP_GameMenu_Tab_Passives;                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GameMenu_Tab_C*                    WBP_GameMenu_Tab_Profile;                          // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GameMenu_Tab_C*                    WBP_GameMenu_Tab_Skills;                           // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 PageIndex)> OnClosed;                                        // 0x0530(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UWBP_GameMenu_Tab_C*>            Tabs;                                              // 0x0540(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         InitialPageIndex;                                  // 0x0550(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_554[0x4];                                      // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFadeDescriptionData                   FastTravelFadeDescription;                         // 0x0558(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor)
	TMulticastInlineDelegate<void(class FName RestPointID, const struct FRestPointData& RestPointData)> OnFastTravelFromRestPoint; // 0x0578(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UFMODEvent*                             SE_OpenGameMenu;                                   // 0x0588(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             SE_Tab;                                            // 0x0590(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnFastTravelFromMap;                               // 0x0598(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bRHIDisabled;                                      // 0x05A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void CloseMenu();
	void ConditionalRHIDisable();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_GameMenu(int32 EntryPoint);
	void FlushCachedSpirits();
	void OnFadeFinished();
	void OnFastTravelRequested(const class FName& RestPointID, const struct FRestPointData& RestPointData);
	void OnFinish_416BA60845A3721B6CAF0E96C3311DEB();
	void OnFinish_74C2F9DE4566C129E4F5808C2FB273A4();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void OnPageChanged(int32 NewPageIndex);
	struct FEventReply OnPressCancel(const struct FKeyEvent& KeyEvent);
	void OnPressedTab(const struct FKeyEvent& KeyEvent, class UWBP_GameMenu_Tab_C* PressedButtonTab);
	struct FEventReply OnPressNext(const struct FKeyEvent& KeyEvent);
	struct FEventReply OnPressPrevious(const struct FKeyEvent& KeyEvent);
	void RefreshTabSelection();
	void RHIRevert();
	void SetupTabs();

	class UUserWidgetFooter* GetFooter() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GameMenu_C">();
	}
	static class UWBP_GameMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GameMenu_C>();
	}
};
static_assert(alignof(UWBP_GameMenu_C) == 0x000008, "Wrong alignment on UWBP_GameMenu_C");
static_assert(sizeof(UWBP_GameMenu_C) == 0x0005B0, "Wrong size on UWBP_GameMenu_C");
static_assert(offsetof(UWBP_GameMenu_C, UberGraphFrame) == 0x000488, "Member 'UWBP_GameMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_C, Hide) == 0x000490, "Member 'UWBP_GameMenu_C::Hide' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_C, Show) == 0x000498, "Member 'UWBP_GameMenu_C::Show' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_C, BG_Base) == 0x0004A0, "Member 'UWBP_GameMenu_C::BG_Base' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_C, BG_Effect) == 0x0004A8, "Member 'UWBP_GameMenu_C::BG_Effect' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_C, BG_LeftGradation) == 0x0004B0, "Member 'UWBP_GameMenu_C::BG_LeftGradation' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_C, BG_Line) == 0x0004B8, "Member 'UWBP_GameMenu_C::BG_Line' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_C, BG_RightGradation) == 0x0004C0, "Member 'UWBP_GameMenu_C::BG_RightGradation' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_C, BG_TopGradation) == 0x0004C8, "Member 'UWBP_GameMenu_C::BG_TopGradation' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_C, NiagaraSystemWidget_272) == 0x0004D0, "Member 'UWBP_GameMenu_C::NiagaraSystemWidget_272' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_C, RefreshableRichTextBlock_NextPage) == 0x0004D8, "Member 'UWBP_GameMenu_C::RefreshableRichTextBlock_NextPage' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_C, RefreshableRichTextBlock_PrevPage) == 0x0004E0, "Member 'UWBP_GameMenu_C::RefreshableRichTextBlock_PrevPage' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_C, TabLine) == 0x0004E8, "Member 'UWBP_GameMenu_C::TabLine' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_C, WBP_Footer) == 0x0004F0, "Member 'UWBP_GameMenu_C::WBP_Footer' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_C, WBP_GameMenu_Tab_Equipment) == 0x0004F8, "Member 'UWBP_GameMenu_C::WBP_GameMenu_Tab_Equipment' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_C, WBP_GameMenu_Tab_Intel) == 0x000500, "Member 'UWBP_GameMenu_C::WBP_GameMenu_Tab_Intel' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_C, WBP_GameMenu_Tab_Inventory) == 0x000508, "Member 'UWBP_GameMenu_C::WBP_GameMenu_Tab_Inventory' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_C, WBP_GameMenu_Tab_Map) == 0x000510, "Member 'UWBP_GameMenu_C::WBP_GameMenu_Tab_Map' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_C, WBP_GameMenu_Tab_Passives) == 0x000518, "Member 'UWBP_GameMenu_C::WBP_GameMenu_Tab_Passives' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_C, WBP_GameMenu_Tab_Profile) == 0x000520, "Member 'UWBP_GameMenu_C::WBP_GameMenu_Tab_Profile' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_C, WBP_GameMenu_Tab_Skills) == 0x000528, "Member 'UWBP_GameMenu_C::WBP_GameMenu_Tab_Skills' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_C, OnClosed) == 0x000530, "Member 'UWBP_GameMenu_C::OnClosed' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_C, Tabs) == 0x000540, "Member 'UWBP_GameMenu_C::Tabs' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_C, InitialPageIndex) == 0x000550, "Member 'UWBP_GameMenu_C::InitialPageIndex' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_C, FastTravelFadeDescription) == 0x000558, "Member 'UWBP_GameMenu_C::FastTravelFadeDescription' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_C, OnFastTravelFromRestPoint) == 0x000578, "Member 'UWBP_GameMenu_C::OnFastTravelFromRestPoint' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_C, SE_OpenGameMenu) == 0x000588, "Member 'UWBP_GameMenu_C::SE_OpenGameMenu' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_C, SE_Tab) == 0x000590, "Member 'UWBP_GameMenu_C::SE_Tab' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_C, OnFastTravelFromMap) == 0x000598, "Member 'UWBP_GameMenu_C::OnFastTravelFromMap' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_C, bRHIDisabled) == 0x0005A8, "Member 'UWBP_GameMenu_C::bRHIDisabled' has a wrong offset!");

}

