#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Dialog_TitleScreenSelection

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function WBP_Dialog_TitleScreenSelection.WBP_Dialog_TitleScreenSelection_C.ApplyAndClose
// 0x0001 (0x0001 - 0x0000)
struct WBP_Dialog_TitleScreenSelection_C_ApplyAndClose final
{
public:
	EGameEndingType                               TitleType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dialog_TitleScreenSelection_C_ApplyAndClose) == 0x000001, "Wrong alignment on WBP_Dialog_TitleScreenSelection_C_ApplyAndClose");
static_assert(sizeof(WBP_Dialog_TitleScreenSelection_C_ApplyAndClose) == 0x000001, "Wrong size on WBP_Dialog_TitleScreenSelection_C_ApplyAndClose");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_ApplyAndClose, TitleType) == 0x000000, "Member 'WBP_Dialog_TitleScreenSelection_C_ApplyAndClose::TitleType' has a wrong offset!");

// Function WBP_Dialog_TitleScreenSelection.WBP_Dialog_TitleScreenSelection_C.BndEvt__WBP_Dialog_TitleSelection_WBP_Button_Generic_Default_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_Dialog_TitleScreenSelection_C_BndEvt__WBP_Dialog_TitleSelection_WBP_Button_Generic_Default_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Dialog_TitleScreenSelection_C_BndEvt__WBP_Dialog_TitleSelection_WBP_Button_Generic_Default_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Dialog_TitleScreenSelection_C_BndEvt__WBP_Dialog_TitleSelection_WBP_Button_Generic_Default_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Dialog_TitleScreenSelection_C_BndEvt__WBP_Dialog_TitleSelection_WBP_Button_Generic_Default_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_Dialog_TitleScreenSelection_C_BndEvt__WBP_Dialog_TitleSelection_WBP_Button_Generic_Default_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_BndEvt__WBP_Dialog_TitleSelection_WBP_Button_Generic_Default_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_Dialog_TitleScreenSelection_C_BndEvt__WBP_Dialog_TitleSelection_WBP_Button_Generic_Default_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_Dialog_TitleScreenSelection.WBP_Dialog_TitleScreenSelection_C.BndEvt__WBP_Dialog_TitleSelection_WBP_Button_Generic_EndingA_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_Dialog_TitleScreenSelection_C_BndEvt__WBP_Dialog_TitleSelection_WBP_Button_Generic_EndingA_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Dialog_TitleScreenSelection_C_BndEvt__WBP_Dialog_TitleSelection_WBP_Button_Generic_EndingA_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Dialog_TitleScreenSelection_C_BndEvt__WBP_Dialog_TitleSelection_WBP_Button_Generic_EndingA_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Dialog_TitleScreenSelection_C_BndEvt__WBP_Dialog_TitleSelection_WBP_Button_Generic_EndingA_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_Dialog_TitleScreenSelection_C_BndEvt__WBP_Dialog_TitleSelection_WBP_Button_Generic_EndingA_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_BndEvt__WBP_Dialog_TitleSelection_WBP_Button_Generic_EndingA_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_Dialog_TitleScreenSelection_C_BndEvt__WBP_Dialog_TitleSelection_WBP_Button_Generic_EndingA_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_Dialog_TitleScreenSelection.WBP_Dialog_TitleScreenSelection_C.BndEvt__WBP_Dialog_TitleSelection_WBP_Button_Generic_EndingB_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_Dialog_TitleScreenSelection_C_BndEvt__WBP_Dialog_TitleSelection_WBP_Button_Generic_EndingB_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Dialog_TitleScreenSelection_C_BndEvt__WBP_Dialog_TitleSelection_WBP_Button_Generic_EndingB_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Dialog_TitleScreenSelection_C_BndEvt__WBP_Dialog_TitleSelection_WBP_Button_Generic_EndingB_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Dialog_TitleScreenSelection_C_BndEvt__WBP_Dialog_TitleSelection_WBP_Button_Generic_EndingB_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_Dialog_TitleScreenSelection_C_BndEvt__WBP_Dialog_TitleSelection_WBP_Button_Generic_EndingB_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_BndEvt__WBP_Dialog_TitleSelection_WBP_Button_Generic_EndingB_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_Dialog_TitleScreenSelection_C_BndEvt__WBP_Dialog_TitleSelection_WBP_Button_Generic_EndingB_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_Dialog_TitleScreenSelection.WBP_Dialog_TitleScreenSelection_C.ExecuteUbergraph_WBP_Dialog_TitleScreenSelection
// 0x0108 (0x0108 - 0x0000)
struct WBP_Dialog_TitleScreenSelection_C_ExecuteUbergraph_WBP_Dialog_TitleScreenSelection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USaveSubsystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveSettings_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_2;             // 0x0020(0x0040)()
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_1;             // 0x0060(0x0040)()
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent;               // 0x00A0(0x0040)()
	EGameEndingType                               K2Node_CustomEvent_TitleType;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00E4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue;             // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dialog_TitleScreenSelection_C_ExecuteUbergraph_WBP_Dialog_TitleScreenSelection) == 0x000008, "Wrong alignment on WBP_Dialog_TitleScreenSelection_C_ExecuteUbergraph_WBP_Dialog_TitleScreenSelection");
static_assert(sizeof(WBP_Dialog_TitleScreenSelection_C_ExecuteUbergraph_WBP_Dialog_TitleScreenSelection) == 0x000108, "Wrong size on WBP_Dialog_TitleScreenSelection_C_ExecuteUbergraph_WBP_Dialog_TitleScreenSelection");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_ExecuteUbergraph_WBP_Dialog_TitleScreenSelection, EntryPoint) == 0x000000, "Member 'WBP_Dialog_TitleScreenSelection_C_ExecuteUbergraph_WBP_Dialog_TitleScreenSelection::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_ExecuteUbergraph_WBP_Dialog_TitleScreenSelection, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_Dialog_TitleScreenSelection_C_ExecuteUbergraph_WBP_Dialog_TitleScreenSelection::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_ExecuteUbergraph_WBP_Dialog_TitleScreenSelection, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000010, "Member 'WBP_Dialog_TitleScreenSelection_C_ExecuteUbergraph_WBP_Dialog_TitleScreenSelection::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_ExecuteUbergraph_WBP_Dialog_TitleScreenSelection, CallFunc_SaveSettings_ReturnValue) == 0x000018, "Member 'WBP_Dialog_TitleScreenSelection_C_ExecuteUbergraph_WBP_Dialog_TitleScreenSelection::CallFunc_SaveSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_ExecuteUbergraph_WBP_Dialog_TitleScreenSelection, K2Node_ComponentBoundEvent_KeyEvent_2) == 0x000020, "Member 'WBP_Dialog_TitleScreenSelection_C_ExecuteUbergraph_WBP_Dialog_TitleScreenSelection::K2Node_ComponentBoundEvent_KeyEvent_2' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_ExecuteUbergraph_WBP_Dialog_TitleScreenSelection, K2Node_ComponentBoundEvent_KeyEvent_1) == 0x000060, "Member 'WBP_Dialog_TitleScreenSelection_C_ExecuteUbergraph_WBP_Dialog_TitleScreenSelection::K2Node_ComponentBoundEvent_KeyEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_ExecuteUbergraph_WBP_Dialog_TitleScreenSelection, K2Node_ComponentBoundEvent_KeyEvent) == 0x0000A0, "Member 'WBP_Dialog_TitleScreenSelection_C_ExecuteUbergraph_WBP_Dialog_TitleScreenSelection::K2Node_ComponentBoundEvent_KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_ExecuteUbergraph_WBP_Dialog_TitleScreenSelection, K2Node_CustomEvent_TitleType) == 0x0000E0, "Member 'WBP_Dialog_TitleScreenSelection_C_ExecuteUbergraph_WBP_Dialog_TitleScreenSelection::K2Node_CustomEvent_TitleType' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_ExecuteUbergraph_WBP_Dialog_TitleScreenSelection, K2Node_CreateDelegate_OutputDelegate) == 0x0000E4, "Member 'WBP_Dialog_TitleScreenSelection_C_ExecuteUbergraph_WBP_Dialog_TitleScreenSelection::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_ExecuteUbergraph_WBP_Dialog_TitleScreenSelection, CallFunc_PlayUMGAnimation_ReturnValue) == 0x0000F8, "Member 'WBP_Dialog_TitleScreenSelection_C_ExecuteUbergraph_WBP_Dialog_TitleScreenSelection::CallFunc_PlayUMGAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_ExecuteUbergraph_WBP_Dialog_TitleScreenSelection, CallFunc_IsValid_ReturnValue) == 0x000100, "Member 'WBP_Dialog_TitleScreenSelection_C_ExecuteUbergraph_WBP_Dialog_TitleScreenSelection::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_Dialog_TitleScreenSelection.WBP_Dialog_TitleScreenSelection_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Dialog_TitleScreenSelection_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Dialog_TitleScreenSelection_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Dialog_TitleScreenSelection_C_OnFocusReceived");
static_assert(sizeof(WBP_Dialog_TitleScreenSelection_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_Dialog_TitleScreenSelection_C_OnFocusReceived");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Dialog_TitleScreenSelection_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Dialog_TitleScreenSelection_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Dialog_TitleScreenSelection_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Dialog_TitleScreenSelection_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Dialog_TitleScreenSelection.WBP_Dialog_TitleScreenSelection_C.OnPressCancel
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Dialog_TitleScreenSelection_C_OnPressCancel final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Dialog_TitleScreenSelection_C_OnPressCancel) == 0x000008, "Wrong alignment on WBP_Dialog_TitleScreenSelection_C_OnPressCancel");
static_assert(sizeof(WBP_Dialog_TitleScreenSelection_C_OnPressCancel) == 0x0001B0, "Wrong size on WBP_Dialog_TitleScreenSelection_C_OnPressCancel");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_OnPressCancel, KeyEvent) == 0x000000, "Member 'WBP_Dialog_TitleScreenSelection_C_OnPressCancel::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_OnPressCancel, ReturnValue) == 0x000040, "Member 'WBP_Dialog_TitleScreenSelection_C_OnPressCancel::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_OnPressCancel, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Dialog_TitleScreenSelection_C_OnPressCancel::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Dialog_TitleScreenSelection.WBP_Dialog_TitleScreenSelection_C.SetupButtons
// 0x0018 (0x0018 - 0x0000)
struct WBP_Dialog_TitleScreenSelection_C_SetupButtons final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DidReachGameEnding_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DidReachGameEnding_ReturnValue_1;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dialog_TitleScreenSelection_C_SetupButtons) == 0x000008, "Wrong alignment on WBP_Dialog_TitleScreenSelection_C_SetupButtons");
static_assert(sizeof(WBP_Dialog_TitleScreenSelection_C_SetupButtons) == 0x000018, "Wrong size on WBP_Dialog_TitleScreenSelection_C_SetupButtons");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_SetupButtons, Temp_bool_Variable) == 0x000000, "Member 'WBP_Dialog_TitleScreenSelection_C_SetupButtons::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_SetupButtons, Temp_byte_Variable) == 0x000001, "Member 'WBP_Dialog_TitleScreenSelection_C_SetupButtons::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_SetupButtons, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_Dialog_TitleScreenSelection_C_SetupButtons::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_SetupButtons, Temp_bool_Variable_1) == 0x000003, "Member 'WBP_Dialog_TitleScreenSelection_C_SetupButtons::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_SetupButtons, Temp_byte_Variable_2) == 0x000004, "Member 'WBP_Dialog_TitleScreenSelection_C_SetupButtons::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_SetupButtons, Temp_byte_Variable_3) == 0x000005, "Member 'WBP_Dialog_TitleScreenSelection_C_SetupButtons::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_SetupButtons, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_Dialog_TitleScreenSelection_C_SetupButtons::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_SetupButtons, CallFunc_DidReachGameEnding_ReturnValue) == 0x000010, "Member 'WBP_Dialog_TitleScreenSelection_C_SetupButtons::CallFunc_DidReachGameEnding_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_SetupButtons, CallFunc_DidReachGameEnding_ReturnValue_1) == 0x000011, "Member 'WBP_Dialog_TitleScreenSelection_C_SetupButtons::CallFunc_DidReachGameEnding_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_SetupButtons, K2Node_Select_Default) == 0x000012, "Member 'WBP_Dialog_TitleScreenSelection_C_SetupButtons::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_TitleScreenSelection_C_SetupButtons, K2Node_Select_Default_1) == 0x000013, "Member 'WBP_Dialog_TitleScreenSelection_C_SetupButtons::K2Node_Select_Default_1' has a wrong offset!");

}

