#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FieldTalkHolder

#include "Basic.hpp"

#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function WBP_FieldTalkHolder.WBP_FieldTalkHolder_C.OnShowText
// 0x0028 (0x0028 - 0x0000)
struct WBP_FieldTalkHolder_C_OnShowText final
{
public:
	struct FFieldTalkEntry                        FieldTalkEntry;                                    // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_FieldTalkHolder_C_OnShowText) == 0x000008, "Wrong alignment on WBP_FieldTalkHolder_C_OnShowText");
static_assert(sizeof(WBP_FieldTalkHolder_C_OnShowText) == 0x000028, "Wrong size on WBP_FieldTalkHolder_C_OnShowText");
static_assert(offsetof(WBP_FieldTalkHolder_C_OnShowText, FieldTalkEntry) == 0x000000, "Member 'WBP_FieldTalkHolder_C_OnShowText::FieldTalkEntry' has a wrong offset!");

// Function WBP_FieldTalkHolder.WBP_FieldTalkHolder_C.OnFinishFieldTalk
// 0x0001 (0x0001 - 0x0000)
struct WBP_FieldTalkHolder_C_OnFinishFieldTalk final
{
public:
	bool                                          bSkipActiveFieldTalk;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FieldTalkHolder_C_OnFinishFieldTalk) == 0x000001, "Wrong alignment on WBP_FieldTalkHolder_C_OnFinishFieldTalk");
static_assert(sizeof(WBP_FieldTalkHolder_C_OnFinishFieldTalk) == 0x000001, "Wrong size on WBP_FieldTalkHolder_C_OnFinishFieldTalk");
static_assert(offsetof(WBP_FieldTalkHolder_C_OnFinishFieldTalk, bSkipActiveFieldTalk) == 0x000000, "Member 'WBP_FieldTalkHolder_C_OnFinishFieldTalk::bSkipActiveFieldTalk' has a wrong offset!");

// Function WBP_FieldTalkHolder.WBP_FieldTalkHolder_C.ExecuteUbergraph_WBP_FieldTalkHolder
// 0x0070 (0x0070 - 0x0000)
struct WBP_FieldTalkHolder_C_ExecuteUbergraph_WBP_FieldTalkHolder final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSkipActiveFieldTalk;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFieldTalkEntry                        K2Node_Event_FieldTalkEntry;                       // 0x0008(0x0028)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FieldTalkHolder_C_ExecuteUbergraph_WBP_FieldTalkHolder) == 0x000008, "Wrong alignment on WBP_FieldTalkHolder_C_ExecuteUbergraph_WBP_FieldTalkHolder");
static_assert(sizeof(WBP_FieldTalkHolder_C_ExecuteUbergraph_WBP_FieldTalkHolder) == 0x000070, "Wrong size on WBP_FieldTalkHolder_C_ExecuteUbergraph_WBP_FieldTalkHolder");
static_assert(offsetof(WBP_FieldTalkHolder_C_ExecuteUbergraph_WBP_FieldTalkHolder, EntryPoint) == 0x000000, "Member 'WBP_FieldTalkHolder_C_ExecuteUbergraph_WBP_FieldTalkHolder::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_FieldTalkHolder_C_ExecuteUbergraph_WBP_FieldTalkHolder, K2Node_Event_bSkipActiveFieldTalk) == 0x000004, "Member 'WBP_FieldTalkHolder_C_ExecuteUbergraph_WBP_FieldTalkHolder::K2Node_Event_bSkipActiveFieldTalk' has a wrong offset!");
static_assert(offsetof(WBP_FieldTalkHolder_C_ExecuteUbergraph_WBP_FieldTalkHolder, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'WBP_FieldTalkHolder_C_ExecuteUbergraph_WBP_FieldTalkHolder::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FieldTalkHolder_C_ExecuteUbergraph_WBP_FieldTalkHolder, K2Node_Event_FieldTalkEntry) == 0x000008, "Member 'WBP_FieldTalkHolder_C_ExecuteUbergraph_WBP_FieldTalkHolder::K2Node_Event_FieldTalkEntry' has a wrong offset!");
static_assert(offsetof(WBP_FieldTalkHolder_C_ExecuteUbergraph_WBP_FieldTalkHolder, CallFunc_PlayAnimationForward_ReturnValue) == 0x000030, "Member 'WBP_FieldTalkHolder_C_ExecuteUbergraph_WBP_FieldTalkHolder::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FieldTalkHolder_C_ExecuteUbergraph_WBP_FieldTalkHolder, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000038, "Member 'WBP_FieldTalkHolder_C_ExecuteUbergraph_WBP_FieldTalkHolder::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_FieldTalkHolder_C_ExecuteUbergraph_WBP_FieldTalkHolder, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000040, "Member 'WBP_FieldTalkHolder_C_ExecuteUbergraph_WBP_FieldTalkHolder::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FieldTalkHolder_C_ExecuteUbergraph_WBP_FieldTalkHolder, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'WBP_FieldTalkHolder_C_ExecuteUbergraph_WBP_FieldTalkHolder::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FieldTalkHolder_C_ExecuteUbergraph_WBP_FieldTalkHolder, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000050, "Member 'WBP_FieldTalkHolder_C_ExecuteUbergraph_WBP_FieldTalkHolder::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FieldTalkHolder_C_ExecuteUbergraph_WBP_FieldTalkHolder, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'WBP_FieldTalkHolder_C_ExecuteUbergraph_WBP_FieldTalkHolder::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_FieldTalkHolder_C_ExecuteUbergraph_WBP_FieldTalkHolder, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000068, "Member 'WBP_FieldTalkHolder_C_ExecuteUbergraph_WBP_FieldTalkHolder::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");

// Function WBP_FieldTalkHolder.WBP_FieldTalkHolder_C.IsUIReady
// 0x0001 (0x0001 - 0x0000)
struct WBP_FieldTalkHolder_C_IsUIReady final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FieldTalkHolder_C_IsUIReady) == 0x000001, "Wrong alignment on WBP_FieldTalkHolder_C_IsUIReady");
static_assert(sizeof(WBP_FieldTalkHolder_C_IsUIReady) == 0x000001, "Wrong size on WBP_FieldTalkHolder_C_IsUIReady");
static_assert(offsetof(WBP_FieldTalkHolder_C_IsUIReady, ReturnValue) == 0x000000, "Member 'WBP_FieldTalkHolder_C_IsUIReady::ReturnValue' has a wrong offset!");

}

