#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugMenu_ItemList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DebugMenu_ItemList.WBP_DebugMenu_ItemList_C
// 0x0030 (0x0490 - 0x0460)
class UWBP_DebugMenu_ItemList_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           VerticalBoxContainer;                              // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDataTable*                             ItemDataTable;                                     // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0478(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_47C[0x4];                                      // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CategoryLabel;                                     // 0x0480(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)

public:
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnButtonPressed(class UWBP_DebugMenu_Element_ItemButton_C* ItemButton);
	void GenerateLabel(const struct FInventoryItemData& InventoryItemData, class FText* Result);
	void ExecuteUbergraph_WBP_DebugMenu_ItemList(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DebugMenu_ItemList_C">();
	}
	static class UWBP_DebugMenu_ItemList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DebugMenu_ItemList_C>();
	}
};
static_assert(alignof(UWBP_DebugMenu_ItemList_C) == 0x000008, "Wrong alignment on UWBP_DebugMenu_ItemList_C");
static_assert(sizeof(UWBP_DebugMenu_ItemList_C) == 0x000490, "Wrong size on UWBP_DebugMenu_ItemList_C");
static_assert(offsetof(UWBP_DebugMenu_ItemList_C, UberGraphFrame) == 0x000460, "Member 'UWBP_DebugMenu_ItemList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_ItemList_C, VerticalBoxContainer) == 0x000468, "Member 'UWBP_DebugMenu_ItemList_C::VerticalBoxContainer' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_ItemList_C, ItemDataTable) == 0x000470, "Member 'UWBP_DebugMenu_ItemList_C::ItemDataTable' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_ItemList_C, Count) == 0x000478, "Member 'UWBP_DebugMenu_ItemList_C::Count' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_ItemList_C, CategoryLabel) == 0x000480, "Member 'UWBP_DebugMenu_ItemList_C::CategoryLabel' has a wrong offset!");

}

