#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_IntelInventory_List

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_IntelInventory_List.WBP_IntelInventory_List_C.BndEvt__WBP_Tips_List_TipsPageScrollBox_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_IntelInventory_List_C_BndEvt__WBP_Tips_List_TipsPageScrollBox_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature final
{
public:
	float                                         CurrentOffset;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IntelInventory_List_C_BndEvt__WBP_Tips_List_TipsPageScrollBox_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBP_IntelInventory_List_C_BndEvt__WBP_Tips_List_TipsPageScrollBox_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature");
static_assert(sizeof(WBP_IntelInventory_List_C_BndEvt__WBP_Tips_List_TipsPageScrollBox_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature) == 0x000004, "Wrong size on WBP_IntelInventory_List_C_BndEvt__WBP_Tips_List_TipsPageScrollBox_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature");
static_assert(offsetof(WBP_IntelInventory_List_C_BndEvt__WBP_Tips_List_TipsPageScrollBox_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature, CurrentOffset) == 0x000000, "Member 'WBP_IntelInventory_List_C_BndEvt__WBP_Tips_List_TipsPageScrollBox_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature::CurrentOffset' has a wrong offset!");

// Function WBP_IntelInventory_List.WBP_IntelInventory_List_C.CreatePage
// 0x0028 (0x0028 - 0x0000)
struct WBP_IntelInventory_List_C_CreatePage final
{
public:
	class UWBP_Tips_Page_C*                       NewTipsPage;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_InventoryEntry_C* Entry)> K2Node_CreateDelegate_OutputDelegate;        // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Tips_Page_C*                       CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IntelInventory_List_C_CreatePage) == 0x000008, "Wrong alignment on WBP_IntelInventory_List_C_CreatePage");
static_assert(sizeof(WBP_IntelInventory_List_C_CreatePage) == 0x000028, "Wrong size on WBP_IntelInventory_List_C_CreatePage");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePage, NewTipsPage) == 0x000000, "Member 'WBP_IntelInventory_List_C_CreatePage::NewTipsPage' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePage, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_IntelInventory_List_C_CreatePage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePage, CallFunc_Create_ReturnValue) == 0x000018, "Member 'WBP_IntelInventory_List_C_CreatePage::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePage, CallFunc_AddChild_ReturnValue) == 0x000020, "Member 'WBP_IntelInventory_List_C_CreatePage::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function WBP_IntelInventory_List.WBP_IntelInventory_List_C.CreatePages
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_IntelInventory_List_C_CreatePages final
{
public:
	class UWBP_Tips_Page_C*                       CurrPage;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, int32>                      CallFunc_GetAllItems_ReturnValue;                  // 0x0010(0x0050)(ConstParm)
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0060(0x0010)(ReferenceParm)
	struct FDataTableRowHandle                    Temp_struct_Variable;                              // 0x0070(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UDataTable*                       CallFunc_GetDataTable_ReturnValue;                 // 0x00A8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x00B0(0x0010)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasItem_ReturnValue;                      // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_Select_Default;                             // 0x00C8(0x0010)(NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Tips_Page_C*                       CallFunc_CreatePage_NewTipsPage;                   // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IntelInventory_List_C_CreatePages) == 0x000008, "Wrong alignment on WBP_IntelInventory_List_C_CreatePages");
static_assert(sizeof(WBP_IntelInventory_List_C_CreatePages) == 0x0000F0, "Wrong size on WBP_IntelInventory_List_C_CreatePages");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePages, CurrPage) == 0x000000, "Member 'WBP_IntelInventory_List_C_CreatePages::CurrPage' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePages, Temp_bool_Variable) == 0x000008, "Member 'WBP_IntelInventory_List_C_CreatePages::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePages, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'WBP_IntelInventory_List_C_CreatePages::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePages, CallFunc_GetAllItems_ReturnValue) == 0x000010, "Member 'WBP_IntelInventory_List_C_CreatePages::CallFunc_GetAllItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePages, CallFunc_Map_Keys_Keys) == 0x000060, "Member 'WBP_IntelInventory_List_C_CreatePages::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePages, Temp_struct_Variable) == 0x000070, "Member 'WBP_IntelInventory_List_C_CreatePages::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePages, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'WBP_IntelInventory_List_C_CreatePages::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePages, Temp_int_Array_Index_Variable) == 0x000084, "Member 'WBP_IntelInventory_List_C_CreatePages::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePages, Temp_int_Loop_Counter_Variable) == 0x000088, "Member 'WBP_IntelInventory_List_C_CreatePages::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePages, CallFunc_Array_Get_Item) == 0x00008C, "Member 'WBP_IntelInventory_List_C_CreatePages::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePages, CallFunc_Less_IntInt_ReturnValue) == 0x000094, "Member 'WBP_IntelInventory_List_C_CreatePages::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePages, CallFunc_Add_IntInt_ReturnValue) == 0x000098, "Member 'WBP_IntelInventory_List_C_CreatePages::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePages, CallFunc_GetChildrenCount_ReturnValue) == 0x00009C, "Member 'WBP_IntelInventory_List_C_CreatePages::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePages, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000A0, "Member 'WBP_IntelInventory_List_C_CreatePages::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePages, CallFunc_GetDataTable_ReturnValue) == 0x0000A8, "Member 'WBP_IntelInventory_List_C_CreatePages::CallFunc_GetDataTable_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePages, K2Node_MakeStruct_DataTableRowHandle) == 0x0000B0, "Member 'WBP_IntelInventory_List_C_CreatePages::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePages, CallFunc_IsValid_ReturnValue_1) == 0x0000C0, "Member 'WBP_IntelInventory_List_C_CreatePages::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePages, Temp_byte_Variable) == 0x0000C1, "Member 'WBP_IntelInventory_List_C_CreatePages::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePages, CallFunc_Not_PreBool_ReturnValue) == 0x0000C2, "Member 'WBP_IntelInventory_List_C_CreatePages::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePages, Temp_byte_Variable_1) == 0x0000C3, "Member 'WBP_IntelInventory_List_C_CreatePages::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePages, CallFunc_HasItem_ReturnValue) == 0x0000C4, "Member 'WBP_IntelInventory_List_C_CreatePages::CallFunc_HasItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePages, Temp_bool_Variable_1) == 0x0000C5, "Member 'WBP_IntelInventory_List_C_CreatePages::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePages, K2Node_Select_Default) == 0x0000C8, "Member 'WBP_IntelInventory_List_C_CreatePages::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePages, K2Node_Select_Default_1) == 0x0000D8, "Member 'WBP_IntelInventory_List_C_CreatePages::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePages, CallFunc_CreatePage_NewTipsPage) == 0x0000E0, "Member 'WBP_IntelInventory_List_C_CreatePages::CallFunc_CreatePage_NewTipsPage' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePages, CallFunc_Percent_IntInt_ReturnValue) == 0x0000E8, "Member 'WBP_IntelInventory_List_C_CreatePages::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePages, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000EC, "Member 'WBP_IntelInventory_List_C_CreatePages::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_CreatePages, CallFunc_BooleanOR_ReturnValue) == 0x0000ED, "Member 'WBP_IntelInventory_List_C_CreatePages::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_IntelInventory_List.WBP_IntelInventory_List_C.ExecuteUbergraph_WBP_IntelInventory_List
// 0x0030 (0x0030 - 0x0000)
struct WBP_IntelInventory_List_C_ExecuteUbergraph_WBP_IntelInventory_List final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventoryEntry_C*                  K2Node_CustomEvent_Entry;                          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UInventory*                             CallFunc_GetInventoryFromItemType_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_CurrentOffset;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IntelInventory_List_C_ExecuteUbergraph_WBP_IntelInventory_List) == 0x000008, "Wrong alignment on WBP_IntelInventory_List_C_ExecuteUbergraph_WBP_IntelInventory_List");
static_assert(sizeof(WBP_IntelInventory_List_C_ExecuteUbergraph_WBP_IntelInventory_List) == 0x000030, "Wrong size on WBP_IntelInventory_List_C_ExecuteUbergraph_WBP_IntelInventory_List");
static_assert(offsetof(WBP_IntelInventory_List_C_ExecuteUbergraph_WBP_IntelInventory_List, EntryPoint) == 0x000000, "Member 'WBP_IntelInventory_List_C_ExecuteUbergraph_WBP_IntelInventory_List::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_ExecuteUbergraph_WBP_IntelInventory_List, CallFunc_Get_ReturnValue) == 0x000008, "Member 'WBP_IntelInventory_List_C_ExecuteUbergraph_WBP_IntelInventory_List::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_ExecuteUbergraph_WBP_IntelInventory_List, K2Node_CustomEvent_Entry) == 0x000010, "Member 'WBP_IntelInventory_List_C_ExecuteUbergraph_WBP_IntelInventory_List::K2Node_CustomEvent_Entry' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_ExecuteUbergraph_WBP_IntelInventory_List, CallFunc_GetInventoryFromItemType_ReturnValue) == 0x000018, "Member 'WBP_IntelInventory_List_C_ExecuteUbergraph_WBP_IntelInventory_List::CallFunc_GetInventoryFromItemType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_ExecuteUbergraph_WBP_IntelInventory_List, K2Node_ComponentBoundEvent_CurrentOffset) == 0x000020, "Member 'WBP_IntelInventory_List_C_ExecuteUbergraph_WBP_IntelInventory_List::K2Node_ComponentBoundEvent_CurrentOffset' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_ExecuteUbergraph_WBP_IntelInventory_List, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'WBP_IntelInventory_List_C_ExecuteUbergraph_WBP_IntelInventory_List::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_IntelInventory_List.WBP_IntelInventory_List_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_IntelInventory_List_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IntelInventory_List_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_IntelInventory_List_C_OnFocusReceived");
static_assert(sizeof(WBP_IntelInventory_List_C_OnFocusReceived) == 0x0001B8, "Wrong size on WBP_IntelInventory_List_C_OnFocusReceived");
static_assert(offsetof(WBP_IntelInventory_List_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_IntelInventory_List_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_IntelInventory_List_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_IntelInventory_List_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_IntelInventory_List_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_OnFocusReceived, CallFunc_GetChildAt_ReturnValue) == 0x0001B0, "Member 'WBP_IntelInventory_List_C_OnFocusReceived::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");

// Function WBP_IntelInventory_List.WBP_IntelInventory_List_C.OnItemEntryFocused
// 0x0008 (0x0008 - 0x0000)
struct WBP_IntelInventory_List_C_OnItemEntryFocused final
{
public:
	class UWBP_InventoryEntry_C*                  Entry;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IntelInventory_List_C_OnItemEntryFocused) == 0x000008, "Wrong alignment on WBP_IntelInventory_List_C_OnItemEntryFocused");
static_assert(sizeof(WBP_IntelInventory_List_C_OnItemEntryFocused) == 0x000008, "Wrong size on WBP_IntelInventory_List_C_OnItemEntryFocused");
static_assert(offsetof(WBP_IntelInventory_List_C_OnItemEntryFocused, Entry) == 0x000000, "Member 'WBP_IntelInventory_List_C_OnItemEntryFocused::Entry' has a wrong offset!");

// Function WBP_IntelInventory_List.WBP_IntelInventory_List_C.RefreshCompletionPercentage
// 0x0004 (0x0004 - 0x0000)
struct WBP_IntelInventory_List_C_RefreshCompletionPercentage final
{
public:
	int32                                         CallFunc_GetCompletionPercentageForItemType_ReturnValue; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IntelInventory_List_C_RefreshCompletionPercentage) == 0x000004, "Wrong alignment on WBP_IntelInventory_List_C_RefreshCompletionPercentage");
static_assert(sizeof(WBP_IntelInventory_List_C_RefreshCompletionPercentage) == 0x000004, "Wrong size on WBP_IntelInventory_List_C_RefreshCompletionPercentage");
static_assert(offsetof(WBP_IntelInventory_List_C_RefreshCompletionPercentage, CallFunc_GetCompletionPercentageForItemType_ReturnValue) == 0x000000, "Member 'WBP_IntelInventory_List_C_RefreshCompletionPercentage::CallFunc_GetCompletionPercentageForItemType_ReturnValue' has a wrong offset!");

// Function WBP_IntelInventory_List.WBP_IntelInventory_List_C.RefreshPageDisplay
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_IntelInventory_List_C_RefreshPageDisplay final
{
public:
	float                                         CallFunc_GetViewOffsetFraction_ReturnValue;        // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0010)()
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IntelInventory_List_C_RefreshPageDisplay) == 0x000008, "Wrong alignment on WBP_IntelInventory_List_C_RefreshPageDisplay");
static_assert(sizeof(WBP_IntelInventory_List_C_RefreshPageDisplay) == 0x0000F8, "Wrong size on WBP_IntelInventory_List_C_RefreshPageDisplay");
static_assert(offsetof(WBP_IntelInventory_List_C_RefreshPageDisplay, CallFunc_GetViewOffsetFraction_ReturnValue) == 0x000000, "Member 'WBP_IntelInventory_List_C_RefreshPageDisplay::CallFunc_GetViewOffsetFraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IntelInventory_List_C_RefreshPageDisplay, CallFunc_GetChildrenCount_ReturnValue) == 0x000004, "Member 'WBP_IntelInventory_List_C_RefreshPageDisplay::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
