#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GameMenu_Page_Profile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GameMenu_Page_Profile.WBP_GameMenu_Page_Profile_C
// 0x0108 (0x0580 - 0x0478)
class UWBP_GameMenu_Page_Profile_C final : public UUserWidgetGameMenu_Page
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0478(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Base_Label;                                        // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Label_1;                                      // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Label_2;                                      // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Label_3;                                      // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CurrencyDefault;                                   // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CurrencyGrade;                                     // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CurrencyRare;                                      // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             EnvironmentLevel;                                  // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         EquipSlotNavigationBlocker;                        // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Exp;                                               // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Gold;                                         // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Gold_1;                                       // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Time;                                         // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_321;                                         // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_372;                                         // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Level;                                             // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line;                                              // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_1;                                            // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_2;                                            // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Equipment_Stats_C*                 WBP_Equipment_Stats;                               // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquippedSkillSet_C*                WBP_EquippedSkillSet;                              // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipSlot_NewAssist_C*             WBP_EquipSlot_Assist;                              // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipSlot_Equipment_C*             WBP_EquipSlot_Equipment_A;                         // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipSlot_Equipment_C*             WBP_EquipSlot_Equipment_B;                         // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquipSlot_Equipment_C*             WBP_EquipSlot_Equipment_Extra;                     // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Passive_EquippedList_C*            WBP_Passive_EquippedList;                          // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayTimeClock_C*                   WBP_PlayTimeClock;                                 // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ProfileIllustration_C*             WBP_ProfileIllustration;                           // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class APlayerControllerZion*                  CachedPlayerControllerZion;                        // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class APawn*                                  CachedPlayerPawn;                                  // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UStatsPlayerComponent*                  StatsComponent;                                    // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_GameMenu_Page_Profile(int32 EntryPoint);
	void OnPageOpened();
	void RefreshPage();
	void SetChapterText();
	void SetCurrencyTexts();
	void SetExperienceText();
	void SetLevelText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GameMenu_Page_Profile_C">();
	}
	static class UWBP_GameMenu_Page_Profile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GameMenu_Page_Profile_C>();
	}
};
static_assert(alignof(UWBP_GameMenu_Page_Profile_C) == 0x000008, "Wrong alignment on UWBP_GameMenu_Page_Profile_C");
static_assert(sizeof(UWBP_GameMenu_Page_Profile_C) == 0x000580, "Wrong size on UWBP_GameMenu_Page_Profile_C");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, UberGraphFrame) == 0x000478, "Member 'UWBP_GameMenu_Page_Profile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, Base_Label) == 0x000480, "Member 'UWBP_GameMenu_Page_Profile_C::Base_Label' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, Base_Label_1) == 0x000488, "Member 'UWBP_GameMenu_Page_Profile_C::Base_Label_1' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, Base_Label_2) == 0x000490, "Member 'UWBP_GameMenu_Page_Profile_C::Base_Label_2' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, Base_Label_3) == 0x000498, "Member 'UWBP_GameMenu_Page_Profile_C::Base_Label_3' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, BG) == 0x0004A0, "Member 'UWBP_GameMenu_Page_Profile_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, CurrencyDefault) == 0x0004A8, "Member 'UWBP_GameMenu_Page_Profile_C::CurrencyDefault' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, CurrencyGrade) == 0x0004B0, "Member 'UWBP_GameMenu_Page_Profile_C::CurrencyGrade' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, CurrencyRare) == 0x0004B8, "Member 'UWBP_GameMenu_Page_Profile_C::CurrencyRare' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, EnvironmentLevel) == 0x0004C0, "Member 'UWBP_GameMenu_Page_Profile_C::EnvironmentLevel' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, EquipSlotNavigationBlocker) == 0x0004C8, "Member 'UWBP_GameMenu_Page_Profile_C::EquipSlotNavigationBlocker' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, Exp) == 0x0004D0, "Member 'UWBP_GameMenu_Page_Profile_C::Exp' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, Icon_Gold) == 0x0004D8, "Member 'UWBP_GameMenu_Page_Profile_C::Icon_Gold' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, Icon_Gold_1) == 0x0004E0, "Member 'UWBP_GameMenu_Page_Profile_C::Icon_Gold_1' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, Icon_Time) == 0x0004E8, "Member 'UWBP_GameMenu_Page_Profile_C::Icon_Time' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, Image_321) == 0x0004F0, "Member 'UWBP_GameMenu_Page_Profile_C::Image_321' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, Image_372) == 0x0004F8, "Member 'UWBP_GameMenu_Page_Profile_C::Image_372' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, Level) == 0x000500, "Member 'UWBP_GameMenu_Page_Profile_C::Level' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, Line) == 0x000508, "Member 'UWBP_GameMenu_Page_Profile_C::Line' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, Line_1) == 0x000510, "Member 'UWBP_GameMenu_Page_Profile_C::Line_1' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, Line_2) == 0x000518, "Member 'UWBP_GameMenu_Page_Profile_C::Line_2' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, WBP_Equipment_Stats) == 0x000520, "Member 'UWBP_GameMenu_Page_Profile_C::WBP_Equipment_Stats' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, WBP_EquippedSkillSet) == 0x000528, "Member 'UWBP_GameMenu_Page_Profile_C::WBP_EquippedSkillSet' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, WBP_EquipSlot_Assist) == 0x000530, "Member 'UWBP_GameMenu_Page_Profile_C::WBP_EquipSlot_Assist' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, WBP_EquipSlot_Equipment_A) == 0x000538, "Member 'UWBP_GameMenu_Page_Profile_C::WBP_EquipSlot_Equipment_A' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, WBP_EquipSlot_Equipment_B) == 0x000540, "Member 'UWBP_GameMenu_Page_Profile_C::WBP_EquipSlot_Equipment_B' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, WBP_EquipSlot_Equipment_Extra) == 0x000548, "Member 'UWBP_GameMenu_Page_Profile_C::WBP_EquipSlot_Equipment_Extra' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, WBP_Passive_EquippedList) == 0x000550, "Member 'UWBP_GameMenu_Page_Profile_C::WBP_Passive_EquippedList' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, WBP_PlayTimeClock) == 0x000558, "Member 'UWBP_GameMenu_Page_Profile_C::WBP_PlayTimeClock' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, WBP_ProfileIllustration) == 0x000560, "Member 'UWBP_GameMenu_Page_Profile_C::WBP_ProfileIllustration' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, CachedPlayerControllerZion) == 0x000568, "Member 'UWBP_GameMenu_Page_Profile_C::CachedPlayerControllerZion' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, CachedPlayerPawn) == 0x000570, "Member 'UWBP_GameMenu_Page_Profile_C::CachedPlayerPawn' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Profile_C, StatsComponent) == 0x000578, "Member 'UWBP_GameMenu_Page_Profile_C::StatsComponent' has a wrong offset!");

}

