#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RestPointList_Entry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RestPointList_Entry.WBP_RestPointList_Entry_C
// 0x0018 (0x04A0 - 0x0488)
class UWBP_RestPointList_Entry_C final : public UUserWidgetRestPointListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0488(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Button_Generic_C*                  WBP_Button_Generic;                                // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserWidgetMapIcon_RestPoint*           CachedRestPointIcon_0;                             // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void OnInitializeEntry();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void ExecuteUbergraph_WBP_RestPointList_Entry(int32 EntryPoint);
	void BndEvt__WBP_RestPointList_Page_Entry_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RestPointList_Entry_C">();
	}
	static class UWBP_RestPointList_Entry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RestPointList_Entry_C>();
	}
};
static_assert(alignof(UWBP_RestPointList_Entry_C) == 0x000008, "Wrong alignment on UWBP_RestPointList_Entry_C");
static_assert(sizeof(UWBP_RestPointList_Entry_C) == 0x0004A0, "Wrong size on UWBP_RestPointList_Entry_C");
static_assert(offsetof(UWBP_RestPointList_Entry_C, UberGraphFrame) == 0x000488, "Member 'UWBP_RestPointList_Entry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RestPointList_Entry_C, WBP_Button_Generic) == 0x000490, "Member 'UWBP_RestPointList_Entry_C::WBP_Button_Generic' has a wrong offset!");
static_assert(offsetof(UWBP_RestPointList_Entry_C, CachedRestPointIcon_0) == 0x000498, "Member 'UWBP_RestPointList_Entry_C::CachedRestPointIcon_0' has a wrong offset!");

}

