#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Text

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Text.WBP_Text_C.ExecuteUbergraph_WBP_Text
// 0x0038 (0x0038 - 0x0000)
struct WBP_Text_C_ExecuteUbergraph_WBP_Text final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0008(0x0010)()
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_NewParam;                       // 0x0020(0x0010)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Text_C_ExecuteUbergraph_WBP_Text) == 0x000008, "Wrong alignment on WBP_Text_C_ExecuteUbergraph_WBP_Text");
static_assert(sizeof(WBP_Text_C_ExecuteUbergraph_WBP_Text) == 0x000038, "Wrong size on WBP_Text_C_ExecuteUbergraph_WBP_Text");
static_assert(offsetof(WBP_Text_C_ExecuteUbergraph_WBP_Text, EntryPoint) == 0x000000, "Member 'WBP_Text_C_ExecuteUbergraph_WBP_Text::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Text_C_ExecuteUbergraph_WBP_Text, CallFunc_GetEmptyText_ReturnValue) == 0x000008, "Member 'WBP_Text_C_ExecuteUbergraph_WBP_Text::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Text_C_ExecuteUbergraph_WBP_Text, Temp_bool_Variable) == 0x000018, "Member 'WBP_Text_C_ExecuteUbergraph_WBP_Text::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Text_C_ExecuteUbergraph_WBP_Text, Temp_byte_Variable) == 0x000019, "Member 'WBP_Text_C_ExecuteUbergraph_WBP_Text::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Text_C_ExecuteUbergraph_WBP_Text, Temp_byte_Variable_1) == 0x00001A, "Member 'WBP_Text_C_ExecuteUbergraph_WBP_Text::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Text_C_ExecuteUbergraph_WBP_Text, K2Node_Event_IsDesignTime) == 0x00001B, "Member 'WBP_Text_C_ExecuteUbergraph_WBP_Text::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Text_C_ExecuteUbergraph_WBP_Text, K2Node_CustomEvent_NewParam) == 0x000020, "Member 'WBP_Text_C_ExecuteUbergraph_WBP_Text::K2Node_CustomEvent_NewParam' has a wrong offset!");
static_assert(offsetof(WBP_Text_C_ExecuteUbergraph_WBP_Text, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000030, "Member 'WBP_Text_C_ExecuteUbergraph_WBP_Text::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Text_C_ExecuteUbergraph_WBP_Text, K2Node_Select_Default) == 0x000031, "Member 'WBP_Text_C_ExecuteUbergraph_WBP_Text::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Text.WBP_Text_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Text_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Text_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Text_C_PreConstruct");
static_assert(sizeof(WBP_Text_C_PreConstruct) == 0x000001, "Wrong size on WBP_Text_C_PreConstruct");
static_assert(offsetof(WBP_Text_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Text_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Text.WBP_Text_C.SetText
// 0x0010 (0x0010 - 0x0000)
struct WBP_Text_C_SetText final
{
public:
	class FText                                   NewParam;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Text_C_SetText) == 0x000008, "Wrong alignment on WBP_Text_C_SetText");
static_assert(sizeof(WBP_Text_C_SetText) == 0x000010, "Wrong size on WBP_Text_C_SetText");
static_assert(offsetof(WBP_Text_C_SetText, NewParam) == 0x000000, "Member 'WBP_Text_C_SetText::NewParam' has a wrong offset!");

}

