#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StoryEventDirection

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_StoryEventDirection.WBP_StoryEventDirection_C
// 0x0038 (0x0498 - 0x0460)
class UWBP_StoryEventDirection_C final : public UUserWidgetZionShowHide
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideAnim;                                          // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_26;                                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsShowed;                                         // 0x0490(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_StoryEventDirection(int32 EntryPoint);
	void Finished_B9DA4F9D44D30C3617A6D3A02CB43262();
	void Hide(bool bInstant);
	void HideAndRemoveFromParent(bool bInstant);
	void Show(bool bInstant);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_StoryEventDirection_C">();
	}
	static class UWBP_StoryEventDirection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_StoryEventDirection_C>();
	}
};
static_assert(alignof(UWBP_StoryEventDirection_C) == 0x000008, "Wrong alignment on UWBP_StoryEventDirection_C");
static_assert(sizeof(UWBP_StoryEventDirection_C) == 0x000498, "Wrong size on UWBP_StoryEventDirection_C");
static_assert(offsetof(UWBP_StoryEventDirection_C, UberGraphFrame) == 0x000460, "Member 'UWBP_StoryEventDirection_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_StoryEventDirection_C, Loop) == 0x000468, "Member 'UWBP_StoryEventDirection_C::Loop' has a wrong offset!");
static_assert(offsetof(UWBP_StoryEventDirection_C, HideAnim) == 0x000470, "Member 'UWBP_StoryEventDirection_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UWBP_StoryEventDirection_C, ShowAnim) == 0x000478, "Member 'UWBP_StoryEventDirection_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UWBP_StoryEventDirection_C, Image) == 0x000480, "Member 'UWBP_StoryEventDirection_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_StoryEventDirection_C, Image_26) == 0x000488, "Member 'UWBP_StoryEventDirection_C::Image_26' has a wrong offset!");
static_assert(offsetof(UWBP_StoryEventDirection_C, bIsShowed) == 0x000490, "Member 'UWBP_StoryEventDirection_C::bIsShowed' has a wrong offset!");

}

