#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MapIcon_CustomMarker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MapIcon_CustomMarker.WBP_MapIcon_CustomMarker_C
// 0x0058 (0x0608 - 0x05B0)
class UWBP_MapIcon_CustomMarker_C final : public UUserWidgetMapIcon_CustomMarker
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             MarkerID;                                          // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                StickyBorder;                                      // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FLinearColor>                   MarkerColors;                                      // 0x05C8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	double                                        DefaultFontSize;                                   // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	int32                                         DefaultOutlineSize;                                // 0x05E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_5E4[0x4];                                      // 0x05E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              DefaultIconSize;                                   // 0x05E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FMargin                                DefaultIconPadding;                                // 0x05F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)

public:
	void OnSetScale(float NewScale);
	void OnSetCustomMarkerData(const struct FMapCustomMarkerIconData& NewCustomMarkerData);
	void GetMarkerColor(struct FLinearColor* Color);
	void ExecuteUbergraph_WBP_MapIcon_CustomMarker(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MapIcon_CustomMarker_C">();
	}
	static class UWBP_MapIcon_CustomMarker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MapIcon_CustomMarker_C>();
	}
};
static_assert(alignof(UWBP_MapIcon_CustomMarker_C) == 0x000008, "Wrong alignment on UWBP_MapIcon_CustomMarker_C");
static_assert(sizeof(UWBP_MapIcon_CustomMarker_C) == 0x000608, "Wrong size on UWBP_MapIcon_CustomMarker_C");
static_assert(offsetof(UWBP_MapIcon_CustomMarker_C, UberGraphFrame) == 0x0005B0, "Member 'UWBP_MapIcon_CustomMarker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MapIcon_CustomMarker_C, MarkerID) == 0x0005B8, "Member 'UWBP_MapIcon_CustomMarker_C::MarkerID' has a wrong offset!");
static_assert(offsetof(UWBP_MapIcon_CustomMarker_C, StickyBorder) == 0x0005C0, "Member 'UWBP_MapIcon_CustomMarker_C::StickyBorder' has a wrong offset!");
static_assert(offsetof(UWBP_MapIcon_CustomMarker_C, MarkerColors) == 0x0005C8, "Member 'UWBP_MapIcon_CustomMarker_C::MarkerColors' has a wrong offset!");
static_assert(offsetof(UWBP_MapIcon_CustomMarker_C, DefaultFontSize) == 0x0005D8, "Member 'UWBP_MapIcon_CustomMarker_C::DefaultFontSize' has a wrong offset!");
static_assert(offsetof(UWBP_MapIcon_CustomMarker_C, DefaultOutlineSize) == 0x0005E0, "Member 'UWBP_MapIcon_CustomMarker_C::DefaultOutlineSize' has a wrong offset!");
static_assert(offsetof(UWBP_MapIcon_CustomMarker_C, DefaultIconSize) == 0x0005E8, "Member 'UWBP_MapIcon_CustomMarker_C::DefaultIconSize' has a wrong offset!");
static_assert(offsetof(UWBP_MapIcon_CustomMarker_C, DefaultIconPadding) == 0x0005F8, "Member 'UWBP_MapIcon_CustomMarker_C::DefaultIconPadding' has a wrong offset!");

}

