#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InputBuffer_Entry

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Zion_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_InputBuffer_Entry.WBP_InputBuffer_Entry_C.GetOrCreateIconWidget
// 0x0030 (0x0030 - 0x0000)
struct WBP_InputBuffer_Entry_C_GetOrCreateIconWidget final
{
public:
	int32                                         IconIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_InputBuffer_Entry_ActionIcon_C*    Output;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InputBuffer_Entry_ActionIcon_C*    CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_InputBuffer_Entry_ActionIcon_C*    CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputBuffer_Entry_C_GetOrCreateIconWidget) == 0x000008, "Wrong alignment on WBP_InputBuffer_Entry_C_GetOrCreateIconWidget");
static_assert(sizeof(WBP_InputBuffer_Entry_C_GetOrCreateIconWidget) == 0x000030, "Wrong size on WBP_InputBuffer_Entry_C_GetOrCreateIconWidget");
static_assert(offsetof(WBP_InputBuffer_Entry_C_GetOrCreateIconWidget, IconIndex) == 0x000000, "Member 'WBP_InputBuffer_Entry_C_GetOrCreateIconWidget::IconIndex' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_GetOrCreateIconWidget, Output) == 0x000008, "Member 'WBP_InputBuffer_Entry_C_GetOrCreateIconWidget::Output' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_GetOrCreateIconWidget, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_InputBuffer_Entry_C_GetOrCreateIconWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_GetOrCreateIconWidget, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_InputBuffer_Entry_C_GetOrCreateIconWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_GetOrCreateIconWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_InputBuffer_Entry_C_GetOrCreateIconWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_GetOrCreateIconWidget, CallFunc_Create_ReturnValue) == 0x000020, "Member 'WBP_InputBuffer_Entry_C_GetOrCreateIconWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_GetOrCreateIconWidget, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000028, "Member 'WBP_InputBuffer_Entry_C_GetOrCreateIconWidget::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

// Function WBP_InputBuffer_Entry.WBP_InputBuffer_Entry_C.HideAllIconWidgets
// 0x0020 (0x0020 - 0x0000)
struct WBP_InputBuffer_Entry_C_HideAllIconWidgets final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_InputBuffer_Entry_ActionIcon_C*    CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputBuffer_Entry_C_HideAllIconWidgets) == 0x000008, "Wrong alignment on WBP_InputBuffer_Entry_C_HideAllIconWidgets");
static_assert(sizeof(WBP_InputBuffer_Entry_C_HideAllIconWidgets) == 0x000020, "Wrong size on WBP_InputBuffer_Entry_C_HideAllIconWidgets");
static_assert(offsetof(WBP_InputBuffer_Entry_C_HideAllIconWidgets, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_InputBuffer_Entry_C_HideAllIconWidgets::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_HideAllIconWidgets, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_InputBuffer_Entry_C_HideAllIconWidgets::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_HideAllIconWidgets, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_InputBuffer_Entry_C_HideAllIconWidgets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_HideAllIconWidgets, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'WBP_InputBuffer_Entry_C_HideAllIconWidgets::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_HideAllIconWidgets, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_InputBuffer_Entry_C_HideAllIconWidgets::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_HideAllIconWidgets, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'WBP_InputBuffer_Entry_C_HideAllIconWidgets::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_InputBuffer_Entry.WBP_InputBuffer_Entry_C.Initialize
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_InputBuffer_Entry_C_Initialize final
{
public:
	struct FTimedInputSnapshot                    TimedInputSnapshot_0;                              // 0x0000(0x0118)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FLinearColor                           InProcessedColor;                                  // 0x0118(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           InProcessedExactlyColor;                           // 0x0128(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ProcessedExactlyColor;                             // 0x0138(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ProcessedColor;                                    // 0x0148(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         IconIndex;                                         // 0x0158(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UInputAction*>                   CallFunc_Map_Keys_Keys;                            // 0x0170(0x0010)(ReferenceParm)
	class UInputAction*                           CallFunc_Array_Get_Item;                           // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_InputBuffer_Entry_ActionIcon_C*    CallFunc_GetOrCreateIconWidget_Output;             // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A2[0x6];                                      // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Map_Find_Value;                           // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputBuffer_Entry_C_Initialize) == 0x000008, "Wrong alignment on WBP_InputBuffer_Entry_C_Initialize");
static_assert(sizeof(WBP_InputBuffer_Entry_C_Initialize) == 0x0001B8, "Wrong size on WBP_InputBuffer_Entry_C_Initialize");
static_assert(offsetof(WBP_InputBuffer_Entry_C_Initialize, TimedInputSnapshot_0) == 0x000000, "Member 'WBP_InputBuffer_Entry_C_Initialize::TimedInputSnapshot_0' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_Initialize, InProcessedColor) == 0x000118, "Member 'WBP_InputBuffer_Entry_C_Initialize::InProcessedColor' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_Initialize, InProcessedExactlyColor) == 0x000128, "Member 'WBP_InputBuffer_Entry_C_Initialize::InProcessedExactlyColor' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_Initialize, ProcessedExactlyColor) == 0x000138, "Member 'WBP_InputBuffer_Entry_C_Initialize::ProcessedExactlyColor' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_Initialize, ProcessedColor) == 0x000148, "Member 'WBP_InputBuffer_Entry_C_Initialize::ProcessedColor' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_Initialize, IconIndex) == 0x000158, "Member 'WBP_InputBuffer_Entry_C_Initialize::IconIndex' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_Initialize, Temp_int_Loop_Counter_Variable) == 0x00015C, "Member 'WBP_InputBuffer_Entry_C_Initialize::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_Initialize, CallFunc_Add_IntInt_ReturnValue) == 0x000160, "Member 'WBP_InputBuffer_Entry_C_Initialize::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_Initialize, Temp_int_Array_Index_Variable) == 0x000164, "Member 'WBP_InputBuffer_Entry_C_Initialize::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_Initialize, Temp_bool_Variable) == 0x000168, "Member 'WBP_InputBuffer_Entry_C_Initialize::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_Initialize, Temp_int_Variable) == 0x00016C, "Member 'WBP_InputBuffer_Entry_C_Initialize::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_Initialize, CallFunc_Map_Keys_Keys) == 0x000170, "Member 'WBP_InputBuffer_Entry_C_Initialize::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_Initialize, CallFunc_Array_Get_Item) == 0x000180, "Member 'WBP_InputBuffer_Entry_C_Initialize::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_Initialize, CallFunc_Array_Length_ReturnValue) == 0x000188, "Member 'WBP_InputBuffer_Entry_C_Initialize::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_Initialize, CallFunc_Less_IntInt_ReturnValue) == 0x00018C, "Member 'WBP_InputBuffer_Entry_C_Initialize::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_Initialize, CallFunc_Add_IntInt_ReturnValue_1) == 0x000190, "Member 'WBP_InputBuffer_Entry_C_Initialize::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_Initialize, CallFunc_GetOrCreateIconWidget_Output) == 0x000198, "Member 'WBP_InputBuffer_Entry_C_Initialize::CallFunc_GetOrCreateIconWidget_Output' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_Initialize, Temp_byte_Variable) == 0x0001A0, "Member 'WBP_InputBuffer_Entry_C_Initialize::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_Initialize, Temp_byte_Variable_1) == 0x0001A1, "Member 'WBP_InputBuffer_Entry_C_Initialize::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_Initialize, CallFunc_Map_Find_Value) == 0x0001A8, "Member 'WBP_InputBuffer_Entry_C_Initialize::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_Initialize, CallFunc_Map_Find_ReturnValue) == 0x0001B0, "Member 'WBP_InputBuffer_Entry_C_Initialize::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_Initialize, K2Node_Select_Default) == 0x0001B1, "Member 'WBP_InputBuffer_Entry_C_Initialize::K2Node_Select_Default' has a wrong offset!");

// Function WBP_InputBuffer_Entry.WBP_InputBuffer_Entry_C.SetupColor
// 0x0050 (0x0050 - 0x0000)
struct WBP_InputBuffer_Entry_C_SetupColor final
{
public:
	struct FLinearColor                           ProcessedExactlyColor;                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ProcessedColor;                                    // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_IsEmpty_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputBuffer_Entry_C_SetupColor) == 0x000008, "Wrong alignment on WBP_InputBuffer_Entry_C_SetupColor");
static_assert(sizeof(WBP_InputBuffer_Entry_C_SetupColor) == 0x000050, "Wrong size on WBP_InputBuffer_Entry_C_SetupColor");
static_assert(offsetof(WBP_InputBuffer_Entry_C_SetupColor, ProcessedExactlyColor) == 0x000000, "Member 'WBP_InputBuffer_Entry_C_SetupColor::ProcessedExactlyColor' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_SetupColor, ProcessedColor) == 0x000010, "Member 'WBP_InputBuffer_Entry_C_SetupColor::ProcessedColor' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_SetupColor, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_InputBuffer_Entry_C_SetupColor::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_SetupColor, CallFunc_Set_IsEmpty_ReturnValue) == 0x000021, "Member 'WBP_InputBuffer_Entry_C_SetupColor::CallFunc_Set_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_SetupColor, CallFunc_Not_PreBool_ReturnValue) == 0x000022, "Member 'WBP_InputBuffer_Entry_C_SetupColor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_SetupColor, CallFunc_BooleanOR_ReturnValue) == 0x000023, "Member 'WBP_InputBuffer_Entry_C_SetupColor::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_SetupColor, CallFunc_SelectColor_ReturnValue) == 0x000024, "Member 'WBP_InputBuffer_Entry_C_SetupColor::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_SetupColor, CallFunc_SelectColor_ReturnValue_1) == 0x000034, "Member 'WBP_InputBuffer_Entry_C_SetupColor::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_SetupColor, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000048, "Member 'WBP_InputBuffer_Entry_C_SetupColor::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_InputBuffer_Entry.WBP_InputBuffer_Entry_C.SetupInfos
// 0x0030 (0x0030 - 0x0000)
struct WBP_InputBuffer_Entry_C_SetupInfos final
{
public:
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0000(0x0010)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_1;          // 0x0010(0x0010)()
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast_1;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputBuffer_Entry_C_SetupInfos) == 0x000008, "Wrong alignment on WBP_InputBuffer_Entry_C_SetupInfos");
static_assert(sizeof(WBP_InputBuffer_Entry_C_SetupInfos) == 0x000030, "Wrong size on WBP_InputBuffer_Entry_C_SetupInfos");
static_assert(offsetof(WBP_InputBuffer_Entry_C_SetupInfos, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000000, "Member 'WBP_InputBuffer_Entry_C_SetupInfos::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_SetupInfos, CallFunc_Conv_DoubleToText_ReturnValue_1) == 0x000010, "Member 'WBP_InputBuffer_Entry_C_SetupInfos::CallFunc_Conv_DoubleToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_SetupInfos, CallFunc_Conv_DoubleToText_Value_ImplicitCast) == 0x000020, "Member 'WBP_InputBuffer_Entry_C_SetupInfos::CallFunc_Conv_DoubleToText_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Entry_C_SetupInfos, CallFunc_Conv_DoubleToText_Value_ImplicitCast_1) == 0x000028, "Member 'WBP_InputBuffer_Entry_C_SetupInfos::CallFunc_Conv_DoubleToText_Value_ImplicitCast_1' has a wrong offset!");

}

