#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Difficulty_CurrencyBonus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Difficulty_CurrencyBonus.WBP_Difficulty_CurrencyBonus_C
// 0x0028 (0x0488 - 0x0460)
class UWBP_Difficulty_CurrencyBonus_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             CurrencyBonus;                                     // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_53;                                          // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_69;                                    // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Difficulty_CurrencyBonus(int32 EntryPoint);
	void RefreshCurrency();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Difficulty_CurrencyBonus_C">();
	}
	static class UWBP_Difficulty_CurrencyBonus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Difficulty_CurrencyBonus_C>();
	}
};
static_assert(alignof(UWBP_Difficulty_CurrencyBonus_C) == 0x000008, "Wrong alignment on UWBP_Difficulty_CurrencyBonus_C");
static_assert(sizeof(UWBP_Difficulty_CurrencyBonus_C) == 0x000488, "Wrong size on UWBP_Difficulty_CurrencyBonus_C");
static_assert(offsetof(UWBP_Difficulty_CurrencyBonus_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Difficulty_CurrencyBonus_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Difficulty_CurrencyBonus_C, CurrencyBonus) == 0x000468, "Member 'UWBP_Difficulty_CurrencyBonus_C::CurrencyBonus' has a wrong offset!");
static_assert(offsetof(UWBP_Difficulty_CurrencyBonus_C, Icon) == 0x000470, "Member 'UWBP_Difficulty_CurrencyBonus_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_Difficulty_CurrencyBonus_C, Image_53) == 0x000478, "Member 'UWBP_Difficulty_CurrencyBonus_C::Image_53' has a wrong offset!");
static_assert(offsetof(UWBP_Difficulty_CurrencyBonus_C, ProgressBar_69) == 0x000480, "Member 'UWBP_Difficulty_CurrencyBonus_C::ProgressBar_69' has a wrong offset!");

}

