#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WorldSpace_Interact

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_WorldSpace_Interact.WBP_WorldSpace_Interact_C.ExecuteUbergraph_WBP_WorldSpace_Interact
// 0x0048 (0x0048 - 0x0000)
struct WBP_WorldSpace_Interact_C_ExecuteUbergraph_WBP_WorldSpace_Interact final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Text;                                 // 0x0008(0x0010)(ConstParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAvailable;                           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldSpace_Interact_C_ExecuteUbergraph_WBP_WorldSpace_Interact) == 0x000008, "Wrong alignment on WBP_WorldSpace_Interact_C_ExecuteUbergraph_WBP_WorldSpace_Interact");
static_assert(sizeof(WBP_WorldSpace_Interact_C_ExecuteUbergraph_WBP_WorldSpace_Interact) == 0x000048, "Wrong size on WBP_WorldSpace_Interact_C_ExecuteUbergraph_WBP_WorldSpace_Interact");
static_assert(offsetof(WBP_WorldSpace_Interact_C_ExecuteUbergraph_WBP_WorldSpace_Interact, EntryPoint) == 0x000000, "Member 'WBP_WorldSpace_Interact_C_ExecuteUbergraph_WBP_WorldSpace_Interact::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Interact_C_ExecuteUbergraph_WBP_WorldSpace_Interact, Temp_bool_Variable) == 0x000004, "Member 'WBP_WorldSpace_Interact_C_ExecuteUbergraph_WBP_WorldSpace_Interact::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Interact_C_ExecuteUbergraph_WBP_WorldSpace_Interact, Temp_byte_Variable) == 0x000005, "Member 'WBP_WorldSpace_Interact_C_ExecuteUbergraph_WBP_WorldSpace_Interact::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Interact_C_ExecuteUbergraph_WBP_WorldSpace_Interact, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_WorldSpace_Interact_C_ExecuteUbergraph_WBP_WorldSpace_Interact::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Interact_C_ExecuteUbergraph_WBP_WorldSpace_Interact, K2Node_Event_Text) == 0x000008, "Member 'WBP_WorldSpace_Interact_C_ExecuteUbergraph_WBP_WorldSpace_Interact::K2Node_Event_Text' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Interact_C_ExecuteUbergraph_WBP_WorldSpace_Interact, CallFunc_TextIsEmpty_ReturnValue) == 0x000018, "Member 'WBP_WorldSpace_Interact_C_ExecuteUbergraph_WBP_WorldSpace_Interact::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Interact_C_ExecuteUbergraph_WBP_WorldSpace_Interact, K2Node_Select_Default) == 0x000019, "Member 'WBP_WorldSpace_Interact_C_ExecuteUbergraph_WBP_WorldSpace_Interact::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Interact_C_ExecuteUbergraph_WBP_WorldSpace_Interact, CallFunc_PlayAnimationForward_ReturnValue) == 0x000020, "Member 'WBP_WorldSpace_Interact_C_ExecuteUbergraph_WBP_WorldSpace_Interact::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Interact_C_ExecuteUbergraph_WBP_WorldSpace_Interact, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000028, "Member 'WBP_WorldSpace_Interact_C_ExecuteUbergraph_WBP_WorldSpace_Interact::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Interact_C_ExecuteUbergraph_WBP_WorldSpace_Interact, K2Node_Event_bAvailable) == 0x000030, "Member 'WBP_WorldSpace_Interact_C_ExecuteUbergraph_WBP_WorldSpace_Interact::K2Node_Event_bAvailable' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Interact_C_ExecuteUbergraph_WBP_WorldSpace_Interact, CallFunc_SelectColor_ReturnValue) == 0x000034, "Member 'WBP_WorldSpace_Interact_C_ExecuteUbergraph_WBP_WorldSpace_Interact::CallFunc_SelectColor_ReturnValue' has a wrong offset!");

// Function WBP_WorldSpace_Interact.WBP_WorldSpace_Interact_C.SetAvailable
// 0x0001 (0x0001 - 0x0000)
struct WBP_WorldSpace_Interact_C_SetAvailable final
{
public:
	bool                                          bAvailable;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldSpace_Interact_C_SetAvailable) == 0x000001, "Wrong alignment on WBP_WorldSpace_Interact_C_SetAvailable");
static_assert(sizeof(WBP_WorldSpace_Interact_C_SetAvailable) == 0x000001, "Wrong size on WBP_WorldSpace_Interact_C_SetAvailable");
static_assert(offsetof(WBP_WorldSpace_Interact_C_SetAvailable, bAvailable) == 0x000000, "Member 'WBP_WorldSpace_Interact_C_SetAvailable::bAvailable' has a wrong offset!");

// Function WBP_WorldSpace_Interact.WBP_WorldSpace_Interact_C.SetText
// 0x0010 (0x0010 - 0x0000)
struct WBP_WorldSpace_Interact_C_SetText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_WorldSpace_Interact_C_SetText) == 0x000008, "Wrong alignment on WBP_WorldSpace_Interact_C_SetText");
static_assert(sizeof(WBP_WorldSpace_Interact_C_SetText) == 0x000010, "Wrong size on WBP_WorldSpace_Interact_C_SetText");
static_assert(offsetof(WBP_WorldSpace_Interact_C_SetText, Text) == 0x000000, "Member 'WBP_WorldSpace_Interact_C_SetText::Text' has a wrong offset!");

}

