#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Dialog_TitleScreenSelection

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Dialog_TitleScreenSelection.WBP_Dialog_TitleScreenSelection_C
// 0x0048 (0x04A8 - 0x0460)
class UWBP_Dialog_TitleScreenSelection_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideAnim;                                          // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_Button_Generic_C*                  WBP_Button_Generic_Default;                        // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Generic_C*                  WBP_Button_Generic_EndingA;                        // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Generic_C*                  WBP_Button_Generic_EndingB;                        // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Dialog_C*                          WBP_Dialog;                                        // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnTitleSelected;                                   // 0x0498(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ApplyAndClose(EGameEndingType TitleType);
	void BndEvt__WBP_Dialog_TitleSelection_WBP_Button_Generic_Default_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void BndEvt__WBP_Dialog_TitleSelection_WBP_Button_Generic_EndingA_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void BndEvt__WBP_Dialog_TitleSelection_WBP_Button_Generic_EndingB_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void Close();
	void Construct();
	void ExecuteUbergraph_WBP_Dialog_TitleScreenSelection(int32 EntryPoint);
	void OnFinish_72C7DC1544F90D6FD9C2188427626E12();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnPressCancel(const struct FKeyEvent& KeyEvent);
	void SetupButtons();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Dialog_TitleScreenSelection_C">();
	}
	static class UWBP_Dialog_TitleScreenSelection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Dialog_TitleScreenSelection_C>();
	}
};
static_assert(alignof(UWBP_Dialog_TitleScreenSelection_C) == 0x000008, "Wrong alignment on UWBP_Dialog_TitleScreenSelection_C");
static_assert(sizeof(UWBP_Dialog_TitleScreenSelection_C) == 0x0004A8, "Wrong size on UWBP_Dialog_TitleScreenSelection_C");
static_assert(offsetof(UWBP_Dialog_TitleScreenSelection_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Dialog_TitleScreenSelection_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_TitleScreenSelection_C, HideAnim) == 0x000468, "Member 'UWBP_Dialog_TitleScreenSelection_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_TitleScreenSelection_C, ShowAnim) == 0x000470, "Member 'UWBP_Dialog_TitleScreenSelection_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_TitleScreenSelection_C, WBP_Button_Generic_Default) == 0x000478, "Member 'UWBP_Dialog_TitleScreenSelection_C::WBP_Button_Generic_Default' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_TitleScreenSelection_C, WBP_Button_Generic_EndingA) == 0x000480, "Member 'UWBP_Dialog_TitleScreenSelection_C::WBP_Button_Generic_EndingA' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_TitleScreenSelection_C, WBP_Button_Generic_EndingB) == 0x000488, "Member 'UWBP_Dialog_TitleScreenSelection_C::WBP_Button_Generic_EndingB' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_TitleScreenSelection_C, WBP_Dialog) == 0x000490, "Member 'UWBP_Dialog_TitleScreenSelection_C::WBP_Dialog' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_TitleScreenSelection_C, OnTitleSelected) == 0x000498, "Member 'UWBP_Dialog_TitleScreenSelection_C::OnTitleSelected' has a wrong offset!");

}

