#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Item_Description

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Item_Description.WBP_Item_Description_C
// 0x0048 (0x04A8 - 0x0460)
class UWBP_Item_Description_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetSwitcher*                        ReinforcementTag;                                  // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AfterReinforcement_C*              WBP_AfterReinforcement;                            // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BeforeReinforcement_C*             WBP_BeforeReinforcement;                           // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Item_EquipmentData_C*              WBP_Item_EquipmentData;                            // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Item_Header_C*                     WBP_Item_Header;                                   // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Item_PassiveData_C*                WBP_Item_PassiveData;                              // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Item_SkillData_C*                  WBP_Item_SkillData;                                // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Item_Text_C*                       WBP_Item_Text;                                     // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Cleanup();
	void Clear(const struct FDataTableRowHandle& DataHandle);
	void Construct();
	void ExecuteUbergraph_WBP_Item_Description(int32 EntryPoint);
	void Setup(const struct FDataTableRowHandle& ItemHandle);
	void SetupEquipmentData(const struct FDataTableRowHandle& Handle);
	void SetupPassiveData(const struct FDataTableRowHandle& Handle);
	void SetupPassiveUpgrade(const struct FDataTableRowHandle& Handle, bool bCanBeUpgraded);
	void SetupReinforcementTag(bool bUnlocked, bool bCanReinforce);
	void SetupSkill(const struct FDataTableRowHandle& Handle, int32 Level, bool bSpecialSkill);
	void SetupSkillUnlock(const struct FDataTableRowHandle& Handle, int32 Level, bool bSpecialSkill);
	void SetupSkillUpgrade(const struct FDataTableRowHandle& Handle, int32 Level, int32 NextLevel, bool bSpecialSkill);
	void SetupTip(const struct FDataTableRowHandle& Handle);
	void SetupTutorial(const struct FDataTableRowHandle& Handle);

	void SetupTexts(const struct FInventoryItemData& InventoryItemData) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Item_Description_C">();
	}
	static class UWBP_Item_Description_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Item_Description_C>();
	}
};
static_assert(alignof(UWBP_Item_Description_C) == 0x000008, "Wrong alignment on UWBP_Item_Description_C");
static_assert(sizeof(UWBP_Item_Description_C) == 0x0004A8, "Wrong size on UWBP_Item_Description_C");
static_assert(offsetof(UWBP_Item_Description_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Item_Description_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Item_Description_C, ReinforcementTag) == 0x000468, "Member 'UWBP_Item_Description_C::ReinforcementTag' has a wrong offset!");
static_assert(offsetof(UWBP_Item_Description_C, WBP_AfterReinforcement) == 0x000470, "Member 'UWBP_Item_Description_C::WBP_AfterReinforcement' has a wrong offset!");
static_assert(offsetof(UWBP_Item_Description_C, WBP_BeforeReinforcement) == 0x000478, "Member 'UWBP_Item_Description_C::WBP_BeforeReinforcement' has a wrong offset!");
static_assert(offsetof(UWBP_Item_Description_C, WBP_Item_EquipmentData) == 0x000480, "Member 'UWBP_Item_Description_C::WBP_Item_EquipmentData' has a wrong offset!");
static_assert(offsetof(UWBP_Item_Description_C, WBP_Item_Header) == 0x000488, "Member 'UWBP_Item_Description_C::WBP_Item_Header' has a wrong offset!");
static_assert(offsetof(UWBP_Item_Description_C, WBP_Item_PassiveData) == 0x000490, "Member 'UWBP_Item_Description_C::WBP_Item_PassiveData' has a wrong offset!");
static_assert(offsetof(UWBP_Item_Description_C, WBP_Item_SkillData) == 0x000498, "Member 'UWBP_Item_Description_C::WBP_Item_SkillData' has a wrong offset!");
static_assert(offsetof(UWBP_Item_Description_C, WBP_Item_Text) == 0x0004A0, "Member 'UWBP_Item_Description_C::WBP_Item_Text' has a wrong offset!");

}

