#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Text

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Text.WBP_Text_C
// 0x0020 (0x0300 - 0x02E0)
class UWBP_Text_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TextBlock_0;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   New_Param;                                         // 0x02F0(0x0010)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_WBP_Text(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetText(const class FText& NewParam);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Text_C">();
	}
	static class UWBP_Text_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Text_C>();
	}
};
static_assert(alignof(UWBP_Text_C) == 0x000008, "Wrong alignment on UWBP_Text_C");
static_assert(sizeof(UWBP_Text_C) == 0x000300, "Wrong size on UWBP_Text_C");
static_assert(offsetof(UWBP_Text_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Text_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Text_C, TextBlock_0) == 0x0002E8, "Member 'UWBP_Text_C::TextBlock_0' has a wrong offset!");
static_assert(offsetof(UWBP_Text_C, New_Param) == 0x0002F0, "Member 'UWBP_Text_C::New_Param' has a wrong offset!");

}

