#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugMenu_Page_DebugDisplay

#include "Basic.hpp"

#include "WBP_DebugMenu_Page_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DebugMenu_Page_DebugDisplay.WBP_DebugMenu_Page_DebugDisplay_C
// 0x0080 (0x0500 - 0x0480)
class UWBP_DebugMenu_Page_DebugDisplay_C final : public UWBP_DebugMenu_Page_C
{
public:
	class UVerticalBox*                           VerticalBoxContainer;                              // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_Animation; // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_ClearID; // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_Command; // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_CommandLevel; // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_Faction; // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_FilterEnemy; // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_FilterOther; // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_FilterPlayer; // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_FilterSpirit; // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_HP; // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_MovementMode; // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_Name; // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_State; // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Level; // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_SpineTextureInfo; // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DebugMenu_Page_DebugDisplay_C">();
	}
	static class UWBP_DebugMenu_Page_DebugDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DebugMenu_Page_DebugDisplay_C>();
	}
};
static_assert(alignof(UWBP_DebugMenu_Page_DebugDisplay_C) == 0x000008, "Wrong alignment on UWBP_DebugMenu_Page_DebugDisplay_C");
static_assert(sizeof(UWBP_DebugMenu_Page_DebugDisplay_C) == 0x000500, "Wrong size on UWBP_DebugMenu_Page_DebugDisplay_C");
static_assert(offsetof(UWBP_DebugMenu_Page_DebugDisplay_C, VerticalBoxContainer) == 0x000480, "Member 'UWBP_DebugMenu_Page_DebugDisplay_C::VerticalBoxContainer' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_DebugDisplay_C, WBP_DebugMenu_Element_Choice_Toggle_Command_Animation) == 0x000488, "Member 'UWBP_DebugMenu_Page_DebugDisplay_C::WBP_DebugMenu_Element_Choice_Toggle_Command_Animation' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_DebugDisplay_C, WBP_DebugMenu_Element_Choice_Toggle_Command_ClearID) == 0x000490, "Member 'UWBP_DebugMenu_Page_DebugDisplay_C::WBP_DebugMenu_Element_Choice_Toggle_Command_ClearID' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_DebugDisplay_C, WBP_DebugMenu_Element_Choice_Toggle_Command_Command) == 0x000498, "Member 'UWBP_DebugMenu_Page_DebugDisplay_C::WBP_DebugMenu_Element_Choice_Toggle_Command_Command' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_DebugDisplay_C, WBP_DebugMenu_Element_Choice_Toggle_Command_CommandLevel) == 0x0004A0, "Member 'UWBP_DebugMenu_Page_DebugDisplay_C::WBP_DebugMenu_Element_Choice_Toggle_Command_CommandLevel' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_DebugDisplay_C, WBP_DebugMenu_Element_Choice_Toggle_Command_Faction) == 0x0004A8, "Member 'UWBP_DebugMenu_Page_DebugDisplay_C::WBP_DebugMenu_Element_Choice_Toggle_Command_Faction' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_DebugDisplay_C, WBP_DebugMenu_Element_Choice_Toggle_Command_FilterEnemy) == 0x0004B0, "Member 'UWBP_DebugMenu_Page_DebugDisplay_C::WBP_DebugMenu_Element_Choice_Toggle_Command_FilterEnemy' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_DebugDisplay_C, WBP_DebugMenu_Element_Choice_Toggle_Command_FilterOther) == 0x0004B8, "Member 'UWBP_DebugMenu_Page_DebugDisplay_C::WBP_DebugMenu_Element_Choice_Toggle_Command_FilterOther' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_DebugDisplay_C, WBP_DebugMenu_Element_Choice_Toggle_Command_FilterPlayer) == 0x0004C0, "Member 'UWBP_DebugMenu_Page_DebugDisplay_C::WBP_DebugMenu_Element_Choice_Toggle_Command_FilterPlayer' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_DebugDisplay_C, WBP_DebugMenu_Element_Choice_Toggle_Command_FilterSpirit) == 0x0004C8, "Member 'UWBP_DebugMenu_Page_DebugDisplay_C::WBP_DebugMenu_Element_Choice_Toggle_Command_FilterSpirit' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_DebugDisplay_C, WBP_DebugMenu_Element_Choice_Toggle_Command_HP) == 0x0004D0, "Member 'UWBP_DebugMenu_Page_DebugDisplay_C::WBP_DebugMenu_Element_Choice_Toggle_Command_HP' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_DebugDisplay_C, WBP_DebugMenu_Element_Choice_Toggle_Command_MovementMode) == 0x0004D8, "Member 'UWBP_DebugMenu_Page_DebugDisplay_C::WBP_DebugMenu_Element_Choice_Toggle_Command_MovementMode' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_DebugDisplay_C, WBP_DebugMenu_Element_Choice_Toggle_Command_Name) == 0x0004E0, "Member 'UWBP_DebugMenu_Page_DebugDisplay_C::WBP_DebugMenu_Element_Choice_Toggle_Command_Name' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_DebugDisplay_C, WBP_DebugMenu_Element_Choice_Toggle_Command_State) == 0x0004E8, "Member 'UWBP_DebugMenu_Page_DebugDisplay_C::WBP_DebugMenu_Element_Choice_Toggle_Command_State' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_DebugDisplay_C, WBP_DebugMenu_Element_Choice_Toggle_Level) == 0x0004F0, "Member 'UWBP_DebugMenu_Page_DebugDisplay_C::WBP_DebugMenu_Element_Choice_Toggle_Level' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_DebugDisplay_C, WBP_DebugMenu_Element_Choice_Toggle_SpineTextureInfo) == 0x0004F8, "Member 'UWBP_DebugMenu_Page_DebugDisplay_C::WBP_DebugMenu_Element_Choice_Toggle_SpineTextureInfo' has a wrong offset!");

}

