#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Slider

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Slider.WBP_Slider_C
// 0x0030 (0x0490 - 0x0460)
class UWBP_Slider_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UProgressBar*                           ProgressBar;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                Slider;                                            // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(double Value)>  OnValueChanged;                                    // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bMouseUseStep;                                     // 0x0488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Slider_Slider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void ExecuteUbergraph_WBP_Slider(int32 EntryPoint);
	void SetMinMaxValue(float Min, float Max);
	void SetMouseUseStep(bool bMouseUseStep_0);
	void SetStepSize(float Step_Size);
	void SetValue(float InValue);

	void GetMaxValue(float* Max_Value) const;
	void GetMinValue(float* Min_Value) const;
	void GetStepSize(float* Step_Size) const;
	float GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Slider_C">();
	}
	static class UWBP_Slider_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Slider_C>();
	}
};
static_assert(alignof(UWBP_Slider_C) == 0x000008, "Wrong alignment on UWBP_Slider_C");
static_assert(sizeof(UWBP_Slider_C) == 0x000490, "Wrong size on UWBP_Slider_C");
static_assert(offsetof(UWBP_Slider_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Slider_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Slider_C, ProgressBar) == 0x000468, "Member 'UWBP_Slider_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UWBP_Slider_C, Slider) == 0x000470, "Member 'UWBP_Slider_C::Slider' has a wrong offset!");
static_assert(offsetof(UWBP_Slider_C, OnValueChanged) == 0x000478, "Member 'UWBP_Slider_C::OnValueChanged' has a wrong offset!");
static_assert(offsetof(UWBP_Slider_C, bMouseUseStep) == 0x000488, "Member 'UWBP_Slider_C::bMouseUseStep' has a wrong offset!");

}

