#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GameMenu_Page_Inventory

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GameMenu_Page_Inventory.WBP_GameMenu_Page_Inventory_C
// 0x0098 (0x0510 - 0x0478)
class UWBP_GameMenu_Page_Inventory_C final : public UUserWidgetGameMenu_Page
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0478(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_InventoryViewer_C*                 WBP_InventoryViewer;                               // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Item_Description_C*                WBP_Item_Description;                              // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInventoryComponent*                    Inventory_Component;                               // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash)
	TArray<EInventoryItemType>                    ItemTypes;                                         // 0x0498(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	TMap<EInventoryItemType, class UWBP_InventoryPage_IconList_C*> InventoryPages;                   // 0x04A8(0x0050)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay)
	TArray<class UWBP_Button_Tab_C*>              Tabs;                                              // 0x04F8(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay)
	int32                                         CurrentIndex;                                      // 0x0508(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_GameMenu_Page_Inventory_WBP_InventoryViewer_K2Node_ComponentBoundEvent_0_OnEntryFocused__DelegateSignature(class UWBP_InventoryEntry_C* Entry);
	void ExecuteUbergraph_WBP_GameMenu_Page_Inventory(int32 EntryPoint);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnPageClosed();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GameMenu_Page_Inventory_C">();
	}
	static class UWBP_GameMenu_Page_Inventory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GameMenu_Page_Inventory_C>();
	}
};
static_assert(alignof(UWBP_GameMenu_Page_Inventory_C) == 0x000008, "Wrong alignment on UWBP_GameMenu_Page_Inventory_C");
static_assert(sizeof(UWBP_GameMenu_Page_Inventory_C) == 0x000510, "Wrong size on UWBP_GameMenu_Page_Inventory_C");
static_assert(offsetof(UWBP_GameMenu_Page_Inventory_C, UberGraphFrame) == 0x000478, "Member 'UWBP_GameMenu_Page_Inventory_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Inventory_C, WBP_InventoryViewer) == 0x000480, "Member 'UWBP_GameMenu_Page_Inventory_C::WBP_InventoryViewer' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Inventory_C, WBP_Item_Description) == 0x000488, "Member 'UWBP_GameMenu_Page_Inventory_C::WBP_Item_Description' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Inventory_C, Inventory_Component) == 0x000490, "Member 'UWBP_GameMenu_Page_Inventory_C::Inventory_Component' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Inventory_C, ItemTypes) == 0x000498, "Member 'UWBP_GameMenu_Page_Inventory_C::ItemTypes' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Inventory_C, InventoryPages) == 0x0004A8, "Member 'UWBP_GameMenu_Page_Inventory_C::InventoryPages' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Inventory_C, Tabs) == 0x0004F8, "Member 'UWBP_GameMenu_Page_Inventory_C::Tabs' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Inventory_C, CurrentIndex) == 0x000508, "Member 'UWBP_GameMenu_Page_Inventory_C::CurrentIndex' has a wrong offset!");

}

