#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AfterReinforcement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_AfterReinforcement.WBP_AfterReinforcement_C
// 0x0020 (0x0480 - 0x0460)
class UWBP_AfterReinforcement_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TextBlock;                                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0470(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)

public:
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_AfterReinforcement(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_AfterReinforcement_C">();
	}
	static class UWBP_AfterReinforcement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_AfterReinforcement_C>();
	}
};
static_assert(alignof(UWBP_AfterReinforcement_C) == 0x000008, "Wrong alignment on UWBP_AfterReinforcement_C");
static_assert(sizeof(UWBP_AfterReinforcement_C) == 0x000480, "Wrong size on UWBP_AfterReinforcement_C");
static_assert(offsetof(UWBP_AfterReinforcement_C, UberGraphFrame) == 0x000460, "Member 'UWBP_AfterReinforcement_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_AfterReinforcement_C, TextBlock) == 0x000468, "Member 'UWBP_AfterReinforcement_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_AfterReinforcement_C, Text) == 0x000470, "Member 'UWBP_AfterReinforcement_C::Text' has a wrong offset!");

}

