#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MapIconDetails_ItemEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MapIconDetails_ItemEntry.WBP_MapIconDetails_ItemEntry_C
// 0x0028 (0x0308 - 0x02E0)
class UWBP_MapIconDetails_ItemEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImageZion*                             ItemIcon;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemName;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    ItemHandle;                                        // 0x02F8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, ExposeOnSpawn)

public:
	void Construct();
	void ExecuteUbergraph_WBP_MapIconDetails_ItemEntry(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MapIconDetails_ItemEntry_C">();
	}
	static class UWBP_MapIconDetails_ItemEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MapIconDetails_ItemEntry_C>();
	}
};
static_assert(alignof(UWBP_MapIconDetails_ItemEntry_C) == 0x000008, "Wrong alignment on UWBP_MapIconDetails_ItemEntry_C");
static_assert(sizeof(UWBP_MapIconDetails_ItemEntry_C) == 0x000308, "Wrong size on UWBP_MapIconDetails_ItemEntry_C");
static_assert(offsetof(UWBP_MapIconDetails_ItemEntry_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_MapIconDetails_ItemEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_ItemEntry_C, ItemIcon) == 0x0002E8, "Member 'UWBP_MapIconDetails_ItemEntry_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_ItemEntry_C, ItemName) == 0x0002F0, "Member 'UWBP_MapIconDetails_ItemEntry_C::ItemName' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_ItemEntry_C, ItemHandle) == 0x0002F8, "Member 'UWBP_MapIconDetails_ItemEntry_C::ItemHandle' has a wrong offset!");

}

