#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InputBuffer_Log_Action

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InputBuffer_Log_Action.WBP_InputBuffer_Log_Action_C
// 0x0150 (0x0430 - 0x02E0)
class UWBP_InputBuffer_Log_Action_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUniformGridPanel*                      UniformGridPanel_Holder;                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         DisplayEntryCount;                                 // 0x02F0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_InputBuffer_Entry_C*>       Entries;                                           // 0x02F8(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay)
	struct FTimedInputSnapshot                    LastInputSnapshot;                                 // 0x0308(0x0118)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, AdvancedDisplay)
	int32                                         EntryIndex;                                        // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputBufferComponent*                  CachedInputBufferComponent;                        // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void AreInputSnpashotsDifferent(const struct FTimedInputSnapshot& A, const struct FTimedInputSnapshot& B, bool* bHasDifference);
	void ExecuteUbergraph_WBP_InputBuffer_Log_Action(int32 EntryPoint);
	class UInputBufferComponent* GetInputBufferComponent();
	void GetOrCreateEntry(int32 EntryIndex_0, class UWBP_InputBuffer_Entry_C** Output);
	void ShouldCreateEntryForSnapshot(const struct FTimedInputSnapshot& TimedInputSnapshot, bool* bHasDifference);
	void SlideGridElements();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void TryUpdateEntry(const struct FTimedInputSnapshot& InputPin);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_InputBuffer_Log_Action_C">();
	}
	static class UWBP_InputBuffer_Log_Action_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InputBuffer_Log_Action_C>();
	}
};
static_assert(alignof(UWBP_InputBuffer_Log_Action_C) == 0x000008, "Wrong alignment on UWBP_InputBuffer_Log_Action_C");
static_assert(sizeof(UWBP_InputBuffer_Log_Action_C) == 0x000430, "Wrong size on UWBP_InputBuffer_Log_Action_C");
static_assert(offsetof(UWBP_InputBuffer_Log_Action_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_InputBuffer_Log_Action_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_InputBuffer_Log_Action_C, UniformGridPanel_Holder) == 0x0002E8, "Member 'UWBP_InputBuffer_Log_Action_C::UniformGridPanel_Holder' has a wrong offset!");
static_assert(offsetof(UWBP_InputBuffer_Log_Action_C, DisplayEntryCount) == 0x0002F0, "Member 'UWBP_InputBuffer_Log_Action_C::DisplayEntryCount' has a wrong offset!");
static_assert(offsetof(UWBP_InputBuffer_Log_Action_C, Entries) == 0x0002F8, "Member 'UWBP_InputBuffer_Log_Action_C::Entries' has a wrong offset!");
static_assert(offsetof(UWBP_InputBuffer_Log_Action_C, LastInputSnapshot) == 0x000308, "Member 'UWBP_InputBuffer_Log_Action_C::LastInputSnapshot' has a wrong offset!");
static_assert(offsetof(UWBP_InputBuffer_Log_Action_C, EntryIndex) == 0x000420, "Member 'UWBP_InputBuffer_Log_Action_C::EntryIndex' has a wrong offset!");
static_assert(offsetof(UWBP_InputBuffer_Log_Action_C, CachedInputBufferComponent) == 0x000428, "Member 'UWBP_InputBuffer_Log_Action_C::CachedInputBufferComponent' has a wrong offset!");

}

