#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SpiritPortrait

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SpiritPortrait.WBP_SpiritPortrait_C
// 0x0040 (0x04A0 - 0x0460)
class UWBP_SpiritPortrait_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowImage;                                         // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImageZion*                             SpiritImage;                                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              LoadedImage;                                       // 0x0478(0x0028)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash)

public:
	void Setup(const struct FInventoryItemSpiritData& InventoryItemSpiritData);
	void ExecuteUbergraph_WBP_SpiritPortrait(int32 EntryPoint);
	void Construct();
	void Clear();
	void BndEvt__WBP_SpiritPortrait_SpiritImage_K2Node_ComponentBoundEvent_2_ImageZionEvent__DelegateSignature(TSoftObjectPtr<class UObject> SoftImageObject);
	void BndEvt__WBP_SpiritPortrait_SpiritImage_K2Node_ComponentBoundEvent_1_ImageZionEvent__DelegateSignature(TSoftObjectPtr<class UObject> SoftImageObject);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SpiritPortrait_C">();
	}
	static class UWBP_SpiritPortrait_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SpiritPortrait_C>();
	}
};
static_assert(alignof(UWBP_SpiritPortrait_C) == 0x000008, "Wrong alignment on UWBP_SpiritPortrait_C");
static_assert(sizeof(UWBP_SpiritPortrait_C) == 0x0004A0, "Wrong size on UWBP_SpiritPortrait_C");
static_assert(offsetof(UWBP_SpiritPortrait_C, UberGraphFrame) == 0x000460, "Member 'UWBP_SpiritPortrait_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SpiritPortrait_C, ShowImage) == 0x000468, "Member 'UWBP_SpiritPortrait_C::ShowImage' has a wrong offset!");
static_assert(offsetof(UWBP_SpiritPortrait_C, SpiritImage) == 0x000470, "Member 'UWBP_SpiritPortrait_C::SpiritImage' has a wrong offset!");
static_assert(offsetof(UWBP_SpiritPortrait_C, LoadedImage) == 0x000478, "Member 'UWBP_SpiritPortrait_C::LoadedImage' has a wrong offset!");

}

