#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Recollection_Button

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Recollection_Button.WBP_Recollection_Button_C
// 0x0098 (0x04F8 - 0x0460)
class UWBP_Recollection_Button_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Focused;                                           // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Bottom_Gra;                                        // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ButtonText;                                        // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame;                                             // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NewIcon;                                           // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_FocusedContainer;                          // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_NewContainer;                              // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWBP_Recollection_Button_C* Button, const struct FKeyEvent& KeyEvent)> OnPressed; // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnFocused;                                         // 0x04B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   Text;                                              // 0x04C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FDataTableRowHandle                    DataHandle;                                        // 0x04D8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, ExposeOnSpawn)
	ERecollectionItemType                         RecollectionItemType;                              // 0x04E8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_4E9[0x7];                                      // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  PlayerController;                                  // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Recollection_Button(int32 EntryPoint);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnPressConfirm(const struct FKeyEvent& KeyEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void PreConstruct(bool IsDesignTime);
	void RefreshNewVisibility();
	void SetFocusedState(bool Focus);
	void SetText(const class FText& InText);
	void TryMarkItemAsChecked();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Recollection_Button_C">();
	}
	static class UWBP_Recollection_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Recollection_Button_C>();
	}
};
static_assert(alignof(UWBP_Recollection_Button_C) == 0x000008, "Wrong alignment on UWBP_Recollection_Button_C");
static_assert(sizeof(UWBP_Recollection_Button_C) == 0x0004F8, "Wrong size on UWBP_Recollection_Button_C");
static_assert(offsetof(UWBP_Recollection_Button_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Recollection_Button_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Button_C, Focused) == 0x000468, "Member 'UWBP_Recollection_Button_C::Focused' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Button_C, Bottom_Gra) == 0x000470, "Member 'UWBP_Recollection_Button_C::Bottom_Gra' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Button_C, ButtonText) == 0x000478, "Member 'UWBP_Recollection_Button_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Button_C, Frame) == 0x000480, "Member 'UWBP_Recollection_Button_C::Frame' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Button_C, Icon) == 0x000488, "Member 'UWBP_Recollection_Button_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Button_C, NewIcon) == 0x000490, "Member 'UWBP_Recollection_Button_C::NewIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Button_C, Overlay_FocusedContainer) == 0x000498, "Member 'UWBP_Recollection_Button_C::Overlay_FocusedContainer' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Button_C, Overlay_NewContainer) == 0x0004A0, "Member 'UWBP_Recollection_Button_C::Overlay_NewContainer' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Button_C, OnPressed) == 0x0004A8, "Member 'UWBP_Recollection_Button_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Button_C, OnFocused) == 0x0004B8, "Member 'UWBP_Recollection_Button_C::OnFocused' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Button_C, Text) == 0x0004C8, "Member 'UWBP_Recollection_Button_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Button_C, DataHandle) == 0x0004D8, "Member 'UWBP_Recollection_Button_C::DataHandle' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Button_C, RecollectionItemType) == 0x0004E8, "Member 'UWBP_Recollection_Button_C::RecollectionItemType' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Button_C, PlayerController) == 0x0004F0, "Member 'UWBP_Recollection_Button_C::PlayerController' has a wrong offset!");

}

