#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Recollection_Page_Movies

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Recollection_Page_Movies.WBP_Recollection_Page_Movies_C
// 0x0030 (0x0490 - 0x0460)
class UWBP_Recollection_Page_Movies_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUniformGridPanelZion*                  Container;                                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Scrollbox_C*                       WBP_Scrollbox;                                     // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDataTable*                             MoviesDataTable;                                   // 0x0478(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFooterData>                    DefaultFooterEntries;                              // 0x0480(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Recollection_Page_Movies(int32 EntryPoint);
	void GenerateEntries();
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnButtonPressed(class UWBP_Recollection_Button_C* Button, const struct FKeyEvent& KeyEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnMovieClosed();
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Recollection_Page_Movies_C">();
	}
	static class UWBP_Recollection_Page_Movies_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Recollection_Page_Movies_C>();
	}
};
static_assert(alignof(UWBP_Recollection_Page_Movies_C) == 0x000008, "Wrong alignment on UWBP_Recollection_Page_Movies_C");
static_assert(sizeof(UWBP_Recollection_Page_Movies_C) == 0x000490, "Wrong size on UWBP_Recollection_Page_Movies_C");
static_assert(offsetof(UWBP_Recollection_Page_Movies_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Recollection_Page_Movies_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_Movies_C, Container) == 0x000468, "Member 'UWBP_Recollection_Page_Movies_C::Container' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_Movies_C, WBP_Scrollbox) == 0x000470, "Member 'UWBP_Recollection_Page_Movies_C::WBP_Scrollbox' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_Movies_C, MoviesDataTable) == 0x000478, "Member 'UWBP_Recollection_Page_Movies_C::MoviesDataTable' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_Movies_C, DefaultFooterEntries) == 0x000480, "Member 'UWBP_Recollection_Page_Movies_C::DefaultFooterEntries' has a wrong offset!");

}

