#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugMenu_Page_Spawn

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_DebugMenu_Page_Spawn.WBP_DebugMenu_Page_Spawn_C.SwitchPage
// 0x0038 (0x0038 - 0x0000)
struct WBP_DebugMenu_Page_Spawn_C_SwitchPage final
{
public:
	int32                                         Offset;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_DebugMenu_SpawnList_C*             K2Node_DynamicCast_AsWBP_Debug_Menu_Spawn_List;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_LoopAround_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Page_Spawn_C_SwitchPage) == 0x000008, "Wrong alignment on WBP_DebugMenu_Page_Spawn_C_SwitchPage");
static_assert(sizeof(WBP_DebugMenu_Page_Spawn_C_SwitchPage) == 0x000038, "Wrong size on WBP_DebugMenu_Page_Spawn_C_SwitchPage");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_SwitchPage, Offset) == 0x000000, "Member 'WBP_DebugMenu_Page_Spawn_C_SwitchPage::Offset' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_SwitchPage, CallFunc_GetActiveWidget_ReturnValue) == 0x000008, "Member 'WBP_DebugMenu_Page_Spawn_C_SwitchPage::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_SwitchPage, CallFunc_GetChildrenCount_ReturnValue) == 0x000010, "Member 'WBP_DebugMenu_Page_Spawn_C_SwitchPage::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_SwitchPage, K2Node_DynamicCast_AsWBP_Debug_Menu_Spawn_List) == 0x000018, "Member 'WBP_DebugMenu_Page_Spawn_C_SwitchPage::K2Node_DynamicCast_AsWBP_Debug_Menu_Spawn_List' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_SwitchPage, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_DebugMenu_Page_Spawn_C_SwitchPage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_SwitchPage, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'WBP_DebugMenu_Page_Spawn_C_SwitchPage::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_SwitchPage, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000028, "Member 'WBP_DebugMenu_Page_Spawn_C_SwitchPage::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_SwitchPage, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_DebugMenu_Page_Spawn_C_SwitchPage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_SwitchPage, CallFunc_LoopAround_ReturnValue) == 0x000030, "Member 'WBP_DebugMenu_Page_Spawn_C_SwitchPage::CallFunc_LoopAround_ReturnValue' has a wrong offset!");

// Function WBP_DebugMenu_Page_Spawn.WBP_DebugMenu_Page_Spawn_C.OnPressPreviousAlt
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_DebugMenu_Page_Spawn_C_OnPressPreviousAlt final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_DebugMenu_Page_Spawn_C_OnPressPreviousAlt) == 0x000008, "Wrong alignment on WBP_DebugMenu_Page_Spawn_C_OnPressPreviousAlt");
static_assert(sizeof(WBP_DebugMenu_Page_Spawn_C_OnPressPreviousAlt) == 0x0001B0, "Wrong size on WBP_DebugMenu_Page_Spawn_C_OnPressPreviousAlt");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_OnPressPreviousAlt, KeyEvent) == 0x000000, "Member 'WBP_DebugMenu_Page_Spawn_C_OnPressPreviousAlt::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_OnPressPreviousAlt, ReturnValue) == 0x000040, "Member 'WBP_DebugMenu_Page_Spawn_C_OnPressPreviousAlt::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_OnPressPreviousAlt, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_DebugMenu_Page_Spawn_C_OnPressPreviousAlt::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_DebugMenu_Page_Spawn.WBP_DebugMenu_Page_Spawn_C.OnPressNextAlt
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_DebugMenu_Page_Spawn_C_OnPressNextAlt final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_DebugMenu_Page_Spawn_C_OnPressNextAlt) == 0x000008, "Wrong alignment on WBP_DebugMenu_Page_Spawn_C_OnPressNextAlt");
static_assert(sizeof(WBP_DebugMenu_Page_Spawn_C_OnPressNextAlt) == 0x0001B0, "Wrong size on WBP_DebugMenu_Page_Spawn_C_OnPressNextAlt");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_OnPressNextAlt, KeyEvent) == 0x000000, "Member 'WBP_DebugMenu_Page_Spawn_C_OnPressNextAlt::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_OnPressNextAlt, ReturnValue) == 0x000040, "Member 'WBP_DebugMenu_Page_Spawn_C_OnPressNextAlt::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_OnPressNextAlt, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_DebugMenu_Page_Spawn_C_OnPressNextAlt::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_DebugMenu_Page_Spawn.WBP_DebugMenu_Page_Spawn_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_DebugMenu_Page_Spawn_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Page_Spawn_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_DebugMenu_Page_Spawn_C_OnFocusReceived");
static_assert(sizeof(WBP_DebugMenu_Page_Spawn_C_OnFocusReceived) == 0x0001B8, "Wrong size on WBP_DebugMenu_Page_Spawn_C_OnFocusReceived");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_DebugMenu_Page_Spawn_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_DebugMenu_Page_Spawn_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_DebugMenu_Page_Spawn_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_DebugMenu_Page_Spawn_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_OnFocusReceived, CallFunc_GetChildAt_ReturnValue) == 0x0001B0, "Member 'WBP_DebugMenu_Page_Spawn_C_OnFocusReceived::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");

// Function WBP_DebugMenu_Page_Spawn.WBP_DebugMenu_Page_Spawn_C.OnEnemyEntryPressed
// 0x0008 (0x0008 - 0x0000)
struct WBP_DebugMenu_Page_Spawn_C_OnEnemyEntryPressed final
{
public:
	class UWBP_DebugMenu_Element_ItemButton_C*    Entry;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Page_Spawn_C_OnEnemyEntryPressed) == 0x000008, "Wrong alignment on WBP_DebugMenu_Page_Spawn_C_OnEnemyEntryPressed");
static_assert(sizeof(WBP_DebugMenu_Page_Spawn_C_OnEnemyEntryPressed) == 0x000008, "Wrong size on WBP_DebugMenu_Page_Spawn_C_OnEnemyEntryPressed");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_OnEnemyEntryPressed, Entry) == 0x000000, "Member 'WBP_DebugMenu_Page_Spawn_C_OnEnemyEntryPressed::Entry' has a wrong offset!");

// Function WBP_DebugMenu_Page_Spawn.WBP_DebugMenu_Page_Spawn_C.ExecuteUbergraph_WBP_DebugMenu_Page_Spawn
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_DebugMenu_Page_Spawn_C_ExecuteUbergraph_WBP_DebugMenu_Page_Spawn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UZoneSystemComponent*                   CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_ItemButton_C*    K2Node_CustomEvent_Entry;                          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0xF];                                       // 0x0021(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_EnemySpawner_C*                     CallFunc_FinishSpawningActor_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Page_Spawn_C_ExecuteUbergraph_WBP_DebugMenu_Page_Spawn) == 0x000010, "Wrong alignment on WBP_DebugMenu_Page_Spawn_C_ExecuteUbergraph_WBP_DebugMenu_Page_Spawn");
static_assert(sizeof(WBP_DebugMenu_Page_Spawn_C_ExecuteUbergraph_WBP_DebugMenu_Page_Spawn) == 0x0000A0, "Wrong size on WBP_DebugMenu_Page_Spawn_C_ExecuteUbergraph_WBP_DebugMenu_Page_Spawn");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_ExecuteUbergraph_WBP_DebugMenu_Page_Spawn, EntryPoint) == 0x000000, "Member 'WBP_DebugMenu_Page_Spawn_C_ExecuteUbergraph_WBP_DebugMenu_Page_Spawn::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_ExecuteUbergraph_WBP_DebugMenu_Page_Spawn, CallFunc_Get_ReturnValue) == 0x000008, "Member 'WBP_DebugMenu_Page_Spawn_C_ExecuteUbergraph_WBP_DebugMenu_Page_Spawn::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_ExecuteUbergraph_WBP_DebugMenu_Page_Spawn, K2Node_CustomEvent_Entry) == 0x000010, "Member 'WBP_DebugMenu_Page_Spawn_C_ExecuteUbergraph_WBP_DebugMenu_Page_Spawn::K2Node_CustomEvent_Entry' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_ExecuteUbergraph_WBP_DebugMenu_Page_Spawn, CallFunc_GetPlayerPawn_ReturnValue) == 0x000018, "Member 'WBP_DebugMenu_Page_Spawn_C_ExecuteUbergraph_WBP_DebugMenu_Page_Spawn::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_ExecuteUbergraph_WBP_DebugMenu_Page_Spawn, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_DebugMenu_Page_Spawn_C_ExecuteUbergraph_WBP_DebugMenu_Page_Spawn::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_ExecuteUbergraph_WBP_DebugMenu_Page_Spawn, CallFunc_GetTransform_ReturnValue) == 0x000030, "Member 'WBP_DebugMenu_Page_Spawn_C_ExecuteUbergraph_WBP_DebugMenu_Page_Spawn::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_ExecuteUbergraph_WBP_DebugMenu_Page_Spawn, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000090, "Member 'WBP_DebugMenu_Page_Spawn_C_ExecuteUbergraph_WBP_DebugMenu_Page_Spawn::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_ExecuteUbergraph_WBP_DebugMenu_Page_Spawn, CallFunc_FinishSpawningActor_ReturnValue) == 0x000098, "Member 'WBP_DebugMenu_Page_Spawn_C_ExecuteUbergraph_WBP_DebugMenu_Page_Spawn::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function WBP_DebugMenu_Page_Spawn.WBP_DebugMenu_Page_Spawn_C.CreateLists
// 0x0010 (0x0010 - 0x0000)
struct WBP_DebugMenu_Page_Spawn_C_CreateLists final
{
public:
	TDelegate<void(class UWBP_DebugMenu_Element_ItemButton_C* Entry)> K2Node_CreateDelegate_OutputDelegate; // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Page_Spawn_C_CreateLists) == 0x000004, "Wrong alignment on WBP_DebugMenu_Page_Spawn_C_CreateLists");
static_assert(sizeof(WBP_DebugMenu_Page_Spawn_C_CreateLists) == 0x000010, "Wrong size on WBP_DebugMenu_Page_Spawn_C_CreateLists");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_CreateLists, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_DebugMenu_Page_Spawn_C_CreateLists::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_DebugMenu_Page_Spawn.WBP_DebugMenu_Page_Spawn_C.CreateListFromDataTable
// 0x0040 (0x0040 - 0x0000)
struct WBP_DebugMenu_Page_Spawn_C_CreateListFromDataTable final
{
public:
	class UDataTable*                             Table;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CategoryLabel_0;                                   // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	TDelegate<void(class UWBP_DebugMenu_Element_ItemButton_C* Entry)> Event;                         // 0x0020(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UWBP_DebugMenu_SpawnList_C*             CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Page_Spawn_C_CreateListFromDataTable) == 0x000008, "Wrong alignment on WBP_DebugMenu_Page_Spawn_C_CreateListFromDataTable");
static_assert(sizeof(WBP_DebugMenu_Page_Spawn_C_CreateListFromDataTable) == 0x000040, "Wrong size on WBP_DebugMenu_Page_Spawn_C_CreateListFromDataTable");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_CreateListFromDataTable, Table) == 0x000000, "Member 'WBP_DebugMenu_Page_Spawn_C_CreateListFromDataTable::Table' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_CreateListFromDataTable, Count) == 0x000008, "Member 'WBP_DebugMenu_Page_Spawn_C_CreateListFromDataTable::Count' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_CreateListFromDataTable, CategoryLabel_0) == 0x000010, "Member 'WBP_DebugMenu_Page_Spawn_C_CreateListFromDataTable::CategoryLabel_0' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_CreateListFromDataTable, Event) == 0x000020, "Member 'WBP_DebugMenu_Page_Spawn_C_CreateListFromDataTable::Event' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_CreateListFromDataTable, CallFunc_Create_ReturnValue) == 0x000030, "Member 'WBP_DebugMenu_Page_Spawn_C_CreateListFromDataTable::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Spawn_C_CreateListFromDataTable, CallFunc_AddChild_ReturnValue) == 0x000038, "Member 'WBP_DebugMenu_Page_Spawn_C_CreateListFromDataTable::CallFunc_AddChild_ReturnValue' has a wrong offset!");

}

