#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SaveSlotContext

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function WBP_SaveSlotContext.WBP_SaveSlotContext_C.BndEvt__WBP_SaveSlotContext_WBP_Button_Generic_Load_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_SaveSlotContext_C_BndEvt__WBP_SaveSlotContext_WBP_Button_Generic_Load_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_SaveSlotContext_C_BndEvt__WBP_SaveSlotContext_WBP_Button_Generic_Load_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SaveSlotContext_C_BndEvt__WBP_SaveSlotContext_WBP_Button_Generic_Load_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_SaveSlotContext_C_BndEvt__WBP_SaveSlotContext_WBP_Button_Generic_Load_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_SaveSlotContext_C_BndEvt__WBP_SaveSlotContext_WBP_Button_Generic_Load_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_SaveSlotContext_C_BndEvt__WBP_SaveSlotContext_WBP_Button_Generic_Load_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_SaveSlotContext_C_BndEvt__WBP_SaveSlotContext_WBP_Button_Generic_Load_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_SaveSlotContext.WBP_SaveSlotContext_C.BndEvt__WBP_SaveSlotContext_WBP_Button_Generic_NewGame_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_SaveSlotContext_C_BndEvt__WBP_SaveSlotContext_WBP_Button_Generic_NewGame_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_SaveSlotContext_C_BndEvt__WBP_SaveSlotContext_WBP_Button_Generic_NewGame_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SaveSlotContext_C_BndEvt__WBP_SaveSlotContext_WBP_Button_Generic_NewGame_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_SaveSlotContext_C_BndEvt__WBP_SaveSlotContext_WBP_Button_Generic_NewGame_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_SaveSlotContext_C_BndEvt__WBP_SaveSlotContext_WBP_Button_Generic_NewGame_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_SaveSlotContext_C_BndEvt__WBP_SaveSlotContext_WBP_Button_Generic_NewGame_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_SaveSlotContext_C_BndEvt__WBP_SaveSlotContext_WBP_Button_Generic_NewGame_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_SaveSlotContext.WBP_SaveSlotContext_C.BndEvt__WBP_SaveSlotContext_WBP_Button_Generic_NG+_K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_SaveSlotContext_C_BndEvt__WBP_SaveSlotContext_WBP_Button_Generic_NG__K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_SaveSlotContext_C_BndEvt__WBP_SaveSlotContext_WBP_Button_Generic_NG__K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SaveSlotContext_C_BndEvt__WBP_SaveSlotContext_WBP_Button_Generic_NG__K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_SaveSlotContext_C_BndEvt__WBP_SaveSlotContext_WBP_Button_Generic_NG__K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_SaveSlotContext_C_BndEvt__WBP_SaveSlotContext_WBP_Button_Generic_NG__K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_SaveSlotContext_C_BndEvt__WBP_SaveSlotContext_WBP_Button_Generic_NG__K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_SaveSlotContext_C_BndEvt__WBP_SaveSlotContext_WBP_Button_Generic_NG__K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_SaveSlotContext.WBP_SaveSlotContext_C.BndEvt__WBP_Title_WBP_Button_Generic_Settings_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_SaveSlotContext_C_BndEvt__WBP_Title_WBP_Button_Generic_Settings_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_SaveSlotContext_C_BndEvt__WBP_Title_WBP_Button_Generic_Settings_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SaveSlotContext_C_BndEvt__WBP_Title_WBP_Button_Generic_Settings_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_SaveSlotContext_C_BndEvt__WBP_Title_WBP_Button_Generic_Settings_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_SaveSlotContext_C_BndEvt__WBP_Title_WBP_Button_Generic_Settings_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_SaveSlotContext_C_BndEvt__WBP_Title_WBP_Button_Generic_Settings_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_SaveSlotContext_C_BndEvt__WBP_Title_WBP_Button_Generic_Settings_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_SaveSlotContext.WBP_SaveSlotContext_C.BndEvt__WBP_Title_WBP_Button_Generic_Start_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_SaveSlotContext_C_BndEvt__WBP_Title_WBP_Button_Generic_Start_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_SaveSlotContext_C_BndEvt__WBP_Title_WBP_Button_Generic_Start_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SaveSlotContext_C_BndEvt__WBP_Title_WBP_Button_Generic_Start_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_SaveSlotContext_C_BndEvt__WBP_Title_WBP_Button_Generic_Start_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_SaveSlotContext_C_BndEvt__WBP_Title_WBP_Button_Generic_Start_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_SaveSlotContext_C_BndEvt__WBP_Title_WBP_Button_Generic_Start_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_SaveSlotContext_C_BndEvt__WBP_Title_WBP_Button_Generic_Start_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_SaveSlotContext.WBP_SaveSlotContext_C.CanUseNGPlus
// 0x0003 (0x0003 - 0x0000)
struct WBP_SaveSlotContext_C_CanUseNGPlus final
{
public:
	bool                                          bCanUseNGPlus;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanConvertToNG__bCanConvertToNG_;         // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SaveSlotContext_C_CanUseNGPlus) == 0x000001, "Wrong alignment on WBP_SaveSlotContext_C_CanUseNGPlus");
static_assert(sizeof(WBP_SaveSlotContext_C_CanUseNGPlus) == 0x000003, "Wrong size on WBP_SaveSlotContext_C_CanUseNGPlus");
static_assert(offsetof(WBP_SaveSlotContext_C_CanUseNGPlus, bCanUseNGPlus) == 0x000000, "Member 'WBP_SaveSlotContext_C_CanUseNGPlus::bCanUseNGPlus' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_CanUseNGPlus, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'WBP_SaveSlotContext_C_CanUseNGPlus::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_CanUseNGPlus, CallFunc_CanConvertToNG__bCanConvertToNG_) == 0x000002, "Member 'WBP_SaveSlotContext_C_CanUseNGPlus::CallFunc_CanConvertToNG__bCanConvertToNG_' has a wrong offset!");

// Function WBP_SaveSlotContext.WBP_SaveSlotContext_C.ExecuteUbergraph_WBP_SaveSlotContext
// 0x01D0 (0x01D0 - 0x0000)
struct WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Dialog_YesNo_SaveSlot_C*           CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Dialog_YesNo_SaveSlot_C*           CallFunc_Create_ReturnValue_1;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSubsystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_4;             // 0x0030(0x0040)()
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanUseNGPlus_bCanUseNGPlus;               // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_1;                           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_3;             // 0x0088(0x0040)()
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_2;             // 0x00C8(0x0040)()
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_1;             // 0x0108(0x0040)()
	class FText                                   Temp_text_Variable;                                // 0x0148(0x0010)(ConstParm)
	int32                                         CallFunc_GetUMGZOrder_ReturnValue;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x015C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x016C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetUMGZOrder_ReturnValue_1;               // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_1;                              // 0x0180(0x0010)(ConstParm)
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent;               // 0x0190(0x0040)()
};
static_assert(alignof(WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext) == 0x000008, "Wrong alignment on WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext");
static_assert(sizeof(WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext) == 0x0001D0, "Wrong size on WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext");
static_assert(offsetof(WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext, EntryPoint) == 0x000000, "Member 'WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext, Temp_bool_Variable) == 0x000014, "Member 'WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext, Temp_bool_Variable_1) == 0x000015, "Member 'WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext, Temp_byte_Variable) == 0x000016, "Member 'WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext, Temp_byte_Variable_1) == 0x000017, "Member 'WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext, CallFunc_Create_ReturnValue) == 0x000018, "Member 'WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext, CallFunc_Create_ReturnValue_1) == 0x000020, "Member 'WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000028, "Member 'WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext, K2Node_ComponentBoundEvent_KeyEvent_4) == 0x000030, "Member 'WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext::K2Node_ComponentBoundEvent_KeyEvent_4' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext, CallFunc_PlayUMGAnimation_ReturnValue) == 0x000070, "Member 'WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext::CallFunc_PlayUMGAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext, CallFunc_CanUseNGPlus_bCanUseNGPlus) == 0x000079, "Member 'WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext::CallFunc_CanUseNGPlus_bCanUseNGPlus' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext, K2Node_Select_Default) == 0x00007A, "Member 'WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00007B, "Member 'WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00007C, "Member 'WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext, K2Node_Select_Default_1) == 0x000080, "Member 'WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext, K2Node_ComponentBoundEvent_KeyEvent_3) == 0x000088, "Member 'WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext::K2Node_ComponentBoundEvent_KeyEvent_3' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext, K2Node_ComponentBoundEvent_KeyEvent_2) == 0x0000C8, "Member 'WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext::K2Node_ComponentBoundEvent_KeyEvent_2' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext, K2Node_ComponentBoundEvent_KeyEvent_1) == 0x000108, "Member 'WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext::K2Node_ComponentBoundEvent_KeyEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext, Temp_text_Variable) == 0x000148, "Member 'WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext, CallFunc_GetUMGZOrder_ReturnValue) == 0x000158, "Member 'WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext::CallFunc_GetUMGZOrder_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext, K2Node_CreateDelegate_OutputDelegate_1) == 0x00015C, "Member 'WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext, K2Node_CreateDelegate_OutputDelegate_2) == 0x00016C, "Member 'WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext, CallFunc_GetUMGZOrder_ReturnValue_1) == 0x00017C, "Member 'WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext::CallFunc_GetUMGZOrder_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext, Temp_text_Variable_1) == 0x000180, "Member 'WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext, K2Node_ComponentBoundEvent_KeyEvent) == 0x000190, "Member 'WBP_SaveSlotContext_C_ExecuteUbergraph_WBP_SaveSlotContext::K2Node_ComponentBoundEvent_KeyEvent' has a wrong offset!");

// Function WBP_SaveSlotContext.WBP_SaveSlotContext_C.OnFocusReceived
// 0x01C0 (0x01C0 - 0x0000)
struct WBP_SaveSlotContext_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	ESaveExistsType                               Temp_byte_Variable;                                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0100(0x00B8)()
	class UWidget*                                K2Node_Select_Default;                             // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SaveSlotContext_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_SaveSlotContext_C_OnFocusReceived");
static_assert(sizeof(WBP_SaveSlotContext_C_OnFocusReceived) == 0x0001C0, "Wrong size on WBP_SaveSlotContext_C_OnFocusReceived");
static_assert(offsetof(WBP_SaveSlotContext_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_SaveSlotContext_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_SaveSlotContext_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_SaveSlotContext_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_OnFocusReceived, Temp_byte_Variable) == 0x0000F8, "Member 'WBP_SaveSlotContext_C_OnFocusReceived::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000100, "Member 'WBP_SaveSlotContext_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_OnFocusReceived, K2Node_Select_Default) == 0x0001B8, "Member 'WBP_SaveSlotContext_C_OnFocusReceived::K2Node_Select_Default' has a wrong offset!");

// Function WBP_SaveSlotContext.WBP_SaveSlotContext_C.OnPressCancel
// 0x0268 (0x0268 - 0x0000)
struct WBP_SaveSlotContext_C_OnPressCancel final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	struct FEventReply                            CallFunc_OnPressCancel_ReturnValue;                // 0x01B0(0x00B8)()
};
static_assert(alignof(WBP_SaveSlotContext_C_OnPressCancel) == 0x000008, "Wrong alignment on WBP_SaveSlotContext_C_OnPressCancel");
static_assert(sizeof(WBP_SaveSlotContext_C_OnPressCancel) == 0x000268, "Wrong size on WBP_SaveSlotContext_C_OnPressCancel");
static_assert(offsetof(WBP_SaveSlotContext_C_OnPressCancel, KeyEvent) == 0x000000, "Member 'WBP_SaveSlotContext_C_OnPressCancel::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_OnPressCancel, ReturnValue) == 0x000040, "Member 'WBP_SaveSlotContext_C_OnPressCancel::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_OnPressCancel, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_SaveSlotContext_C_OnPressCancel::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SaveSlotContext_C_OnPressCancel, CallFunc_OnPressCancel_ReturnValue) == 0x0001B0, "Member 'WBP_SaveSlotContext_C_OnPressCancel::CallFunc_OnPressCancel_ReturnValue' has a wrong offset!");

}

