#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SkillUnlock_MaterialEntry

#include "Basic.hpp"

#include "Zion_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_SkillUnlock_MaterialEntry.WBP_SkillUnlock_MaterialEntry_C.ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry
// 0x0268 (0x0268 - 0x0000)
struct WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
	struct FInventoryItemData                     CallFunc_GetInventoryItemData_out_ItemData;        // 0x0018(0x0168)()
	bool                                          CallFunc_GetInventoryItemData_ReturnValue;         // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0188(0x0048)(HasGetValueTypeHash)
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCountOfItem_ReturnValue;               // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01E8(0x0048)(HasGetValueTypeHash)
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0230(0x0014)()
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0248(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0258(0x0010)()
};
static_assert(alignof(WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry) == 0x000008, "Wrong alignment on WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry");
static_assert(sizeof(WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry) == 0x000268, "Wrong size on WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry");
static_assert(offsetof(WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry, EntryPoint) == 0x000000, "Member 'WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry, Temp_bool_Variable) == 0x000004, "Member 'WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry, CallFunc_GetInventoryItemData_out_ItemData) == 0x000018, "Member 'WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry::CallFunc_GetInventoryItemData_out_ItemData' has a wrong offset!");
static_assert(offsetof(WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry, CallFunc_GetInventoryItemData_ReturnValue) == 0x000180, "Member 'WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry::CallFunc_GetInventoryItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry, K2Node_MakeStruct_FormatArgumentData) == 0x000188, "Member 'WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry, CallFunc_Get_ReturnValue) == 0x0001D0, "Member 'WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry, CallFunc_GetCountOfItem_ReturnValue) == 0x0001D8, "Member 'WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry::CallFunc_GetCountOfItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0001DC, "Member 'WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0001E0, "Member 'WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001E8, "Member 'WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry, K2Node_Select_Default) == 0x000230, "Member 'WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry, K2Node_MakeArray_Array) == 0x000248, "Member 'WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry, CallFunc_Format_ReturnValue) == 0x000258, "Member 'WBP_SkillUnlock_MaterialEntry_C_ExecuteUbergraph_WBP_SkillUnlock_MaterialEntry::CallFunc_Format_ReturnValue' has a wrong offset!");

}

