#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WorldLoadingIcon

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_WorldLoadingIcon.WBP_WorldLoadingIcon_C.ExecuteUbergraph_WBP_WorldLoadingIcon
// 0x0160 (0x0160 - 0x0000)
struct WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0028(0x0020)(NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FAnchors                               K2Node_MakeStruct_Anchors_1;                       // 0x0058(0x0020)(NoDestructor)
	struct FAnchors                               K2Node_MakeStruct_Anchors_2;                       // 0x0078(0x0020)(NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInstant_2;                           // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInstant_1;                           // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInstant;                             // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConstraintHUDAspectRatio_ReturnValue;  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnchors                               K2Node_MakeStruct_Anchors_3;                       // 0x00F0(0x0020)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConstraintHUDAspectRatio_ReturnValue_1; // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_3;           // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0150(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon) == 0x000008, "Wrong alignment on WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon");
static_assert(sizeof(WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon) == 0x000160, "Wrong size on WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon");
static_assert(offsetof(WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon, EntryPoint) == 0x000000, "Member 'WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000020, "Member 'WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon, K2Node_MakeStruct_Anchors) == 0x000028, "Member 'WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon, K2Node_MakeStruct_Margin) == 0x000048, "Member 'WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon, K2Node_MakeStruct_Anchors_1) == 0x000058, "Member 'WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon::K2Node_MakeStruct_Anchors_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon, K2Node_MakeStruct_Anchors_2) == 0x000078, "Member 'WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon::K2Node_MakeStruct_Anchors_2' has a wrong offset!");
static_assert(offsetof(WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon, K2Node_MakeStruct_Margin_1) == 0x000098, "Member 'WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon, K2Node_Event_bInstant_2) == 0x0000A8, "Member 'WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon::K2Node_Event_bInstant_2' has a wrong offset!");
static_assert(offsetof(WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon, K2Node_Event_bInstant_1) == 0x0000A9, "Member 'WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon::K2Node_Event_bInstant_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000B0, "Member 'WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon, K2Node_Event_bInstant) == 0x0000B8, "Member 'WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon::K2Node_Event_bInstant' has a wrong offset!");
static_assert(offsetof(WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x0000C0, "Member 'WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon, CallFunc_GetConstraintHUDAspectRatio_ReturnValue) == 0x0000C8, "Member 'WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon::CallFunc_GetConstraintHUDAspectRatio_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x0000D0, "Member 'WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x0000D8, "Member 'WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x0000E0, "Member 'WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon, CallFunc_IsValid_ReturnValue) == 0x0000E8, "Member 'WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon, K2Node_MakeStruct_Anchors_3) == 0x0000F0, "Member 'WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon::K2Node_MakeStruct_Anchors_3' has a wrong offset!");
static_assert(offsetof(WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon, K2Node_CreateDelegate_OutputDelegate_1) == 0x000110, "Member 'WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000120, "Member 'WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000128, "Member 'WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon, CallFunc_GetConstraintHUDAspectRatio_ReturnValue_1) == 0x000130, "Member 'WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon::CallFunc_GetConstraintHUDAspectRatio_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000138, "Member 'WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon, CallFunc_SlotAsCanvasSlot_ReturnValue_2) == 0x000140, "Member 'WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon::CallFunc_SlotAsCanvasSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon, CallFunc_SlotAsCanvasSlot_ReturnValue_3) == 0x000148, "Member 'WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon::CallFunc_SlotAsCanvasSlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon, K2Node_CreateDelegate_OutputDelegate_2) == 0x000150, "Member 'WBP_WorldLoadingIcon_C_ExecuteUbergraph_WBP_WorldLoadingIcon::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function WBP_WorldLoadingIcon.WBP_WorldLoadingIcon_C.Hide
// 0x0001 (0x0001 - 0x0000)
struct WBP_WorldLoadingIcon_C_Hide final
{
public:
	bool                                          bInstant;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldLoadingIcon_C_Hide) == 0x000001, "Wrong alignment on WBP_WorldLoadingIcon_C_Hide");
static_assert(sizeof(WBP_WorldLoadingIcon_C_Hide) == 0x000001, "Wrong size on WBP_WorldLoadingIcon_C_Hide");
static_assert(offsetof(WBP_WorldLoadingIcon_C_Hide, bInstant) == 0x000000, "Member 'WBP_WorldLoadingIcon_C_Hide::bInstant' has a wrong offset!");

// Function WBP_WorldLoadingIcon.WBP_WorldLoadingIcon_C.HideAndRemoveFromParent
// 0x0001 (0x0001 - 0x0000)
struct WBP_WorldLoadingIcon_C_HideAndRemoveFromParent final
{
public:
	bool                                          bInstant;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldLoadingIcon_C_HideAndRemoveFromParent) == 0x000001, "Wrong alignment on WBP_WorldLoadingIcon_C_HideAndRemoveFromParent");
static_assert(sizeof(WBP_WorldLoadingIcon_C_HideAndRemoveFromParent) == 0x000001, "Wrong size on WBP_WorldLoadingIcon_C_HideAndRemoveFromParent");
static_assert(offsetof(WBP_WorldLoadingIcon_C_HideAndRemoveFromParent, bInstant) == 0x000000, "Member 'WBP_WorldLoadingIcon_C_HideAndRemoveFromParent::bInstant' has a wrong offset!");

// Function WBP_WorldLoadingIcon.WBP_WorldLoadingIcon_C.Show
// 0x0001 (0x0001 - 0x0000)
struct WBP_WorldLoadingIcon_C_Show final
{
public:
	bool                                          bInstant;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldLoadingIcon_C_Show) == 0x000001, "Wrong alignment on WBP_WorldLoadingIcon_C_Show");
static_assert(sizeof(WBP_WorldLoadingIcon_C_Show) == 0x000001, "Wrong size on WBP_WorldLoadingIcon_C_Show");
static_assert(offsetof(WBP_WorldLoadingIcon_C_Show, bInstant) == 0x000000, "Member 'WBP_WorldLoadingIcon_C_Show::bInstant' has a wrong offset!");

}

