#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SpiritEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SpiritEntry.WBP_SpiritEntry_C
// 0x0038 (0x0498 - 0x0460)
class UWBP_SpiritEntry_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraSystemWidget*                   NiagaraSystemWidget_165;                           // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayActiveContainer;                            // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SpiritIcon;                                        // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USkillComponent*                        SkillComponent;                                    // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FDataTableRowHandle                    Spirit_Data;                                       // 0x0488(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_SpiritEntry(int32 EntryPoint);
	void Initialize(const struct FDataTableRowHandle& SpiritData);
	void Refresh();
	void SetSpiritIcon(TSoftObjectPtr<class UPaperSprite> SpiritIcon_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SpiritEntry_C">();
	}
	static class UWBP_SpiritEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SpiritEntry_C>();
	}
};
static_assert(alignof(UWBP_SpiritEntry_C) == 0x000008, "Wrong alignment on UWBP_SpiritEntry_C");
static_assert(sizeof(UWBP_SpiritEntry_C) == 0x000498, "Wrong size on UWBP_SpiritEntry_C");
static_assert(offsetof(UWBP_SpiritEntry_C, UberGraphFrame) == 0x000460, "Member 'UWBP_SpiritEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SpiritEntry_C, NiagaraSystemWidget_165) == 0x000468, "Member 'UWBP_SpiritEntry_C::NiagaraSystemWidget_165' has a wrong offset!");
static_assert(offsetof(UWBP_SpiritEntry_C, OverlayActiveContainer) == 0x000470, "Member 'UWBP_SpiritEntry_C::OverlayActiveContainer' has a wrong offset!");
static_assert(offsetof(UWBP_SpiritEntry_C, SpiritIcon) == 0x000478, "Member 'UWBP_SpiritEntry_C::SpiritIcon' has a wrong offset!");
static_assert(offsetof(UWBP_SpiritEntry_C, SkillComponent) == 0x000480, "Member 'UWBP_SpiritEntry_C::SkillComponent' has a wrong offset!");
static_assert(offsetof(UWBP_SpiritEntry_C, Spirit_Data) == 0x000488, "Member 'UWBP_SpiritEntry_C::Spirit_Data' has a wrong offset!");

}

