#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Item_UpgradeInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Item_UpgradeInfo.WBP_Item_UpgradeInfo_C
// 0x0048 (0x04A8 - 0x0460)
class UWBP_Item_UpgradeInfo_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 base;                                              // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URefreshableRichTextBlock*              RefreshableRichTextBlock_Flavor;                   // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FInventoryItemUpgradeInfo              UpgradeInfo;                                       // 0x0478(0x0030)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Item_UpgradeInfo(int32 EntryPoint);
	void Setup(const struct FInventoryItemUpgradeInfo& UpgradeInfo_0);
	void SetupText(class URefreshableRichTextBlock* Target, const class FText& Text, const TArray<struct FRichTextInputElement>& FormatElements, const TArray<class FString>& StringElements);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Item_UpgradeInfo_C">();
	}
	static class UWBP_Item_UpgradeInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Item_UpgradeInfo_C>();
	}
};
static_assert(alignof(UWBP_Item_UpgradeInfo_C) == 0x000008, "Wrong alignment on UWBP_Item_UpgradeInfo_C");
static_assert(sizeof(UWBP_Item_UpgradeInfo_C) == 0x0004A8, "Wrong size on UWBP_Item_UpgradeInfo_C");
static_assert(offsetof(UWBP_Item_UpgradeInfo_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Item_UpgradeInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Item_UpgradeInfo_C, base) == 0x000468, "Member 'UWBP_Item_UpgradeInfo_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_Item_UpgradeInfo_C, RefreshableRichTextBlock_Flavor) == 0x000470, "Member 'UWBP_Item_UpgradeInfo_C::RefreshableRichTextBlock_Flavor' has a wrong offset!");
static_assert(offsetof(UWBP_Item_UpgradeInfo_C, UpgradeInfo) == 0x000478, "Member 'UWBP_Item_UpgradeInfo_C::UpgradeInfo' has a wrong offset!");

}

