#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Extra_EntryName

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Extra_EntryName.WBP_Extra_EntryName_C.ExecuteUbergraph_WBP_Extra_EntryName
// 0x0004 (0x0004 - 0x0000)
struct WBP_Extra_EntryName_C_ExecuteUbergraph_WBP_Extra_EntryName final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_EntryName_C_ExecuteUbergraph_WBP_Extra_EntryName) == 0x000004, "Wrong alignment on WBP_Extra_EntryName_C_ExecuteUbergraph_WBP_Extra_EntryName");
static_assert(sizeof(WBP_Extra_EntryName_C_ExecuteUbergraph_WBP_Extra_EntryName) == 0x000004, "Wrong size on WBP_Extra_EntryName_C_ExecuteUbergraph_WBP_Extra_EntryName");
static_assert(offsetof(WBP_Extra_EntryName_C_ExecuteUbergraph_WBP_Extra_EntryName, EntryPoint) == 0x000000, "Member 'WBP_Extra_EntryName_C_ExecuteUbergraph_WBP_Extra_EntryName::EntryPoint' has a wrong offset!");

// Function WBP_Extra_EntryName.WBP_Extra_EntryName_C.SetCanChangeEntry
// 0x0005 (0x0005 - 0x0000)
struct WBP_Extra_EntryName_C_SetCanChangeEntry final
{
public:
	bool                                          bCanChangeEntry_0;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_EntryName_C_SetCanChangeEntry) == 0x000001, "Wrong alignment on WBP_Extra_EntryName_C_SetCanChangeEntry");
static_assert(sizeof(WBP_Extra_EntryName_C_SetCanChangeEntry) == 0x000005, "Wrong size on WBP_Extra_EntryName_C_SetCanChangeEntry");
static_assert(offsetof(WBP_Extra_EntryName_C_SetCanChangeEntry, bCanChangeEntry_0) == 0x000000, "Member 'WBP_Extra_EntryName_C_SetCanChangeEntry::bCanChangeEntry_0' has a wrong offset!");
static_assert(offsetof(WBP_Extra_EntryName_C_SetCanChangeEntry, Temp_bool_Variable) == 0x000001, "Member 'WBP_Extra_EntryName_C_SetCanChangeEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_EntryName_C_SetCanChangeEntry, Temp_byte_Variable) == 0x000002, "Member 'WBP_Extra_EntryName_C_SetCanChangeEntry::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_EntryName_C_SetCanChangeEntry, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_Extra_EntryName_C_SetCanChangeEntry::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_EntryName_C_SetCanChangeEntry, K2Node_Select_Default) == 0x000004, "Member 'WBP_Extra_EntryName_C_SetCanChangeEntry::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Extra_EntryName.WBP_Extra_EntryName_C.SetEntryName
// 0x0010 (0x0010 - 0x0000)
struct WBP_Extra_EntryName_C_SetEntryName final
{
public:
	class FText                                   EntryName_0;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Extra_EntryName_C_SetEntryName) == 0x000008, "Wrong alignment on WBP_Extra_EntryName_C_SetEntryName");
static_assert(sizeof(WBP_Extra_EntryName_C_SetEntryName) == 0x000010, "Wrong size on WBP_Extra_EntryName_C_SetEntryName");
static_assert(offsetof(WBP_Extra_EntryName_C_SetEntryName, EntryName_0) == 0x000000, "Member 'WBP_Extra_EntryName_C_SetEntryName::EntryName_0' has a wrong offset!");

}

