#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Extra_Price

#include "Basic.hpp"

#include "Zion_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Extra_Price.WBP_Extra_Price_C
// 0x0020 (0x0480 - 0x0460)
class UWBP_Extra_Price_C final : public UUserWidgetZion
{
public:
	class UTextBlock*                             Cost_CanBuy;                                       // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Cost_CanNotBuy;                                    // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Price;                              // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FCurrencyValue                         Currency_Value;                                    // 0x0478(0x0008)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor, AdvancedDisplay)

public:
	void SetCurrencyValue(const struct FCurrencyValue& CurrencyValue);
	void Refresh();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Extra_Price_C">();
	}
	static class UWBP_Extra_Price_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Extra_Price_C>();
	}
};
static_assert(alignof(UWBP_Extra_Price_C) == 0x000008, "Wrong alignment on UWBP_Extra_Price_C");
static_assert(sizeof(UWBP_Extra_Price_C) == 0x000480, "Wrong size on UWBP_Extra_Price_C");
static_assert(offsetof(UWBP_Extra_Price_C, Cost_CanBuy) == 0x000460, "Member 'UWBP_Extra_Price_C::Cost_CanBuy' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Price_C, Cost_CanNotBuy) == 0x000468, "Member 'UWBP_Extra_Price_C::Cost_CanNotBuy' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Price_C, WidgetSwitcher_Price) == 0x000470, "Member 'UWBP_Extra_Price_C::WidgetSwitcher_Price' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Price_C, Currency_Value) == 0x000478, "Member 'UWBP_Extra_Price_C::Currency_Value' has a wrong offset!");

}

