#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_Entry_Choice_InputStyle

#include "Basic.hpp"

#include "Zion_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Settings_Entry_Choice_InputStyle.WBP_Settings_Entry_Choice_InputStyle_C.ExecuteUbergraph_WBP_Settings_Entry_Choice_InputStyle
// 0x0028 (0x0028 - 0x0000)
struct WBP_Settings_Entry_Choice_InputStyle_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_InputStyle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Wrap_ReturnValue;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Choice_InputStyle_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_InputStyle) == 0x000004, "Wrong alignment on WBP_Settings_Entry_Choice_InputStyle_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_InputStyle");
static_assert(sizeof(WBP_Settings_Entry_Choice_InputStyle_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_InputStyle) == 0x000028, "Wrong size on WBP_Settings_Entry_Choice_InputStyle_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_InputStyle");
static_assert(offsetof(WBP_Settings_Entry_Choice_InputStyle_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_InputStyle, EntryPoint) == 0x000000, "Member 'WBP_Settings_Entry_Choice_InputStyle_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_InputStyle::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_InputStyle_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_InputStyle, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'WBP_Settings_Entry_Choice_InputStyle_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_InputStyle::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_InputStyle_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_InputStyle, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Settings_Entry_Choice_InputStyle_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_InputStyle::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_InputStyle_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_InputStyle, CallFunc_Array_Length_ReturnValue_1) == 0x00000C, "Member 'WBP_Settings_Entry_Choice_InputStyle_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_InputStyle::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_InputStyle_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_InputStyle, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_Settings_Entry_Choice_InputStyle_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_InputStyle::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_InputStyle_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_InputStyle, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'WBP_Settings_Entry_Choice_InputStyle_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_InputStyle::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_InputStyle_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_InputStyle, CallFunc_Wrap_ReturnValue) == 0x000018, "Member 'WBP_Settings_Entry_Choice_InputStyle_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_InputStyle::CallFunc_Wrap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_InputStyle_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_InputStyle, CallFunc_Array_Length_ReturnValue_2) == 0x00001C, "Member 'WBP_Settings_Entry_Choice_InputStyle_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_InputStyle::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_InputStyle_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_InputStyle, CallFunc_Percent_IntInt_ReturnValue) == 0x000020, "Member 'WBP_Settings_Entry_Choice_InputStyle_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_InputStyle::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_InputStyle_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_InputStyle, K2Node_Event_IsDesignTime) == 0x000024, "Member 'WBP_Settings_Entry_Choice_InputStyle_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_InputStyle::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_Settings_Entry_Choice_InputStyle.WBP_Settings_Entry_Choice_InputStyle_C.InitializeForCurrentSettings
// 0x0010 (0x0010 - 0x0000)
struct WBP_Settings_Entry_Choice_InputStyle_C_InitializeForCurrentSettings final
{
public:
	class UZionInputDeviceSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EInputStyle                                   CallFunc_GetInputStyleGamepadOverride_ReturnValue; // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Choice_InputStyle_C_InitializeForCurrentSettings) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Choice_InputStyle_C_InitializeForCurrentSettings");
static_assert(sizeof(WBP_Settings_Entry_Choice_InputStyle_C_InitializeForCurrentSettings) == 0x000010, "Wrong size on WBP_Settings_Entry_Choice_InputStyle_C_InitializeForCurrentSettings");
static_assert(offsetof(WBP_Settings_Entry_Choice_InputStyle_C_InitializeForCurrentSettings, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'WBP_Settings_Entry_Choice_InputStyle_C_InitializeForCurrentSettings::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_InputStyle_C_InitializeForCurrentSettings, CallFunc_GetInputStyleGamepadOverride_ReturnValue) == 0x000008, "Member 'WBP_Settings_Entry_Choice_InputStyle_C_InitializeForCurrentSettings::CallFunc_GetInputStyleGamepadOverride_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_InputStyle_C_InitializeForCurrentSettings, CallFunc_Array_Find_ReturnValue) == 0x00000C, "Member 'WBP_Settings_Entry_Choice_InputStyle_C_InitializeForCurrentSettings::CallFunc_Array_Find_ReturnValue' has a wrong offset!");

// Function WBP_Settings_Entry_Choice_InputStyle.WBP_Settings_Entry_Choice_InputStyle_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Settings_Entry_Choice_InputStyle_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Settings_Entry_Choice_InputStyle_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Choice_InputStyle_C_OnFocusReceived");
static_assert(sizeof(WBP_Settings_Entry_Choice_InputStyle_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_Settings_Entry_Choice_InputStyle_C_OnFocusReceived");
static_assert(offsetof(WBP_Settings_Entry_Choice_InputStyle_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Settings_Entry_Choice_InputStyle_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_InputStyle_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Settings_Entry_Choice_InputStyle_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_InputStyle_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Settings_Entry_Choice_InputStyle_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_InputStyle_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Settings_Entry_Choice_InputStyle_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Settings_Entry_Choice_InputStyle.WBP_Settings_Entry_Choice_InputStyle_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_Entry_Choice_InputStyle_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Choice_InputStyle_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Settings_Entry_Choice_InputStyle_C_PreConstruct");
static_assert(sizeof(WBP_Settings_Entry_Choice_InputStyle_C_PreConstruct) == 0x000001, "Wrong size on WBP_Settings_Entry_Choice_InputStyle_C_PreConstruct");
static_assert(offsetof(WBP_Settings_Entry_Choice_InputStyle_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Settings_Entry_Choice_InputStyle_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Settings_Entry_Choice_InputStyle.WBP_Settings_Entry_Choice_InputStyle_C.ResetToDefault
// 0x0008 (0x0008 - 0x0000)
struct WBP_Settings_Entry_Choice_InputStyle_C_ResetToDefault final
{
public:
	class UZionInputDeviceSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Choice_InputStyle_C_ResetToDefault) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Choice_InputStyle_C_ResetToDefault");
static_assert(sizeof(WBP_Settings_Entry_Choice_InputStyle_C_ResetToDefault) == 0x000008, "Wrong size on WBP_Settings_Entry_Choice_InputStyle_C_ResetToDefault");
static_assert(offsetof(WBP_Settings_Entry_Choice_InputStyle_C_ResetToDefault, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'WBP_Settings_Entry_Choice_InputStyle_C_ResetToDefault::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function WBP_Settings_Entry_Choice_InputStyle.WBP_Settings_Entry_Choice_InputStyle_C.SetInputStyleOverrideFromIndex
// 0x0030 (0x0030 - 0x0000)
struct WBP_Settings_Entry_Choice_InputStyle_C_SetInputStyleOverrideFromIndex final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UZionInputDeviceSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputStyle                                   CallFunc_Array_Get_Item;                           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Choice_InputStyle_C_SetInputStyleOverrideFromIndex) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Choice_InputStyle_C_SetInputStyleOverrideFromIndex");
static_assert(sizeof(WBP_Settings_Entry_Choice_InputStyle_C_SetInputStyleOverrideFromIndex) == 0x000030, "Wrong size on WBP_Settings_Entry_Choice_InputStyle_C_SetInputStyleOverrideFromIndex");
static_assert(offsetof(WBP_Settings_Entry_Choice_InputStyle_C_SetInputStyleOverrideFromIndex, NewIndex) == 0x000000, "Member 'WBP_Settings_Entry_Choice_InputStyle_C_SetInputStyleOverrideFromIndex::NewIndex' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_InputStyle_C_SetInputStyleOverrideFromIndex, Temp_bool_Variable) == 0x000004, "Member 'WBP_Settings_Entry_Choice_InputStyle_C_SetInputStyleOverrideFromIndex::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_InputStyle_C_SetInputStyleOverrideFromIndex, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_Settings_Entry_Choice_InputStyle_C_SetInputStyleOverrideFromIndex::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_InputStyle_C_SetInputStyleOverrideFromIndex, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_Settings_Entry_Choice_InputStyle_C_SetInputStyleOverrideFromIndex::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_InputStyle_C_SetInputStyleOverrideFromIndex, CallFunc_Array_Get_Item) == 0x000014, "Member 'WBP_Settings_Entry_Choice_InputStyle_C_SetInputStyleOverrideFromIndex::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_InputStyle_C_SetInputStyleOverrideFromIndex, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Settings_Entry_Choice_InputStyle_C_SetInputStyleOverrideFromIndex::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_InputStyle_C_SetInputStyleOverrideFromIndex, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001C, "Member 'WBP_Settings_Entry_Choice_InputStyle_C_SetInputStyleOverrideFromIndex::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_InputStyle_C_SetInputStyleOverrideFromIndex, CallFunc_Clamp_ReturnValue) == 0x000020, "Member 'WBP_Settings_Entry_Choice_InputStyle_C_SetInputStyleOverrideFromIndex::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_InputStyle_C_SetInputStyleOverrideFromIndex, K2Node_Select_Default) == 0x000028, "Member 'WBP_Settings_Entry_Choice_InputStyle_C_SetInputStyleOverrideFromIndex::K2Node_Select_Default' has a wrong offset!");

}

