#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NewGamePlusConfirm

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_NewGamePlusConfirm.WBP_NewGamePlusConfirm_C.BndEvt__WBP_NewGamePlusConfirm_WBP_Button_Generic_BackUp_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_NewGamePlusConfirm_C_BndEvt__WBP_NewGamePlusConfirm_WBP_Button_Generic_BackUp_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_NewGamePlusConfirm_C_BndEvt__WBP_NewGamePlusConfirm_WBP_Button_Generic_BackUp_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_NewGamePlusConfirm_C_BndEvt__WBP_NewGamePlusConfirm_WBP_Button_Generic_BackUp_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_NewGamePlusConfirm_C_BndEvt__WBP_NewGamePlusConfirm_WBP_Button_Generic_BackUp_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_NewGamePlusConfirm_C_BndEvt__WBP_NewGamePlusConfirm_WBP_Button_Generic_BackUp_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_NewGamePlusConfirm_C_BndEvt__WBP_NewGamePlusConfirm_WBP_Button_Generic_BackUp_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_NewGamePlusConfirm_C_BndEvt__WBP_NewGamePlusConfirm_WBP_Button_Generic_BackUp_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_NewGamePlusConfirm.WBP_NewGamePlusConfirm_C.BndEvt__WBP_NewGamePlusConfirm_WBP_Button_Generic_Cancel_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_NewGamePlusConfirm_C_BndEvt__WBP_NewGamePlusConfirm_WBP_Button_Generic_Cancel_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_NewGamePlusConfirm_C_BndEvt__WBP_NewGamePlusConfirm_WBP_Button_Generic_Cancel_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_NewGamePlusConfirm_C_BndEvt__WBP_NewGamePlusConfirm_WBP_Button_Generic_Cancel_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_NewGamePlusConfirm_C_BndEvt__WBP_NewGamePlusConfirm_WBP_Button_Generic_Cancel_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_NewGamePlusConfirm_C_BndEvt__WBP_NewGamePlusConfirm_WBP_Button_Generic_Cancel_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_NewGamePlusConfirm_C_BndEvt__WBP_NewGamePlusConfirm_WBP_Button_Generic_Cancel_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_NewGamePlusConfirm_C_BndEvt__WBP_NewGamePlusConfirm_WBP_Button_Generic_Cancel_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_NewGamePlusConfirm.WBP_NewGamePlusConfirm_C.BndEvt__WBP_NewGamePlusConfirm_WBP_Button_Generic_Convert_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_NewGamePlusConfirm_C_BndEvt__WBP_NewGamePlusConfirm_WBP_Button_Generic_Convert_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_NewGamePlusConfirm_C_BndEvt__WBP_NewGamePlusConfirm_WBP_Button_Generic_Convert_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_NewGamePlusConfirm_C_BndEvt__WBP_NewGamePlusConfirm_WBP_Button_Generic_Convert_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_NewGamePlusConfirm_C_BndEvt__WBP_NewGamePlusConfirm_WBP_Button_Generic_Convert_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_NewGamePlusConfirm_C_BndEvt__WBP_NewGamePlusConfirm_WBP_Button_Generic_Convert_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_NewGamePlusConfirm_C_BndEvt__WBP_NewGamePlusConfirm_WBP_Button_Generic_Convert_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_NewGamePlusConfirm_C_BndEvt__WBP_NewGamePlusConfirm_WBP_Button_Generic_Convert_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_NewGamePlusConfirm.WBP_NewGamePlusConfirm_C.ExecuteUbergraph_WBP_NewGamePlusConfirm
// 0x0140 (0x0140 - 0x0000)
struct WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_2;             // 0x0038(0x0040)()
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_1;             // 0x0078(0x0040)()
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent;               // 0x00B8(0x0040)()
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue;             // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue_1;           // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue_2;           // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue_3;           // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm) == 0x000008, "Wrong alignment on WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm");
static_assert(sizeof(WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm) == 0x000140, "Wrong size on WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm");
static_assert(offsetof(WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm, EntryPoint) == 0x000000, "Member 'WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm, K2Node_ComponentBoundEvent_KeyEvent_2) == 0x000038, "Member 'WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm::K2Node_ComponentBoundEvent_KeyEvent_2' has a wrong offset!");
static_assert(offsetof(WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm, K2Node_ComponentBoundEvent_KeyEvent_1) == 0x000078, "Member 'WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm::K2Node_ComponentBoundEvent_KeyEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm, K2Node_ComponentBoundEvent_KeyEvent) == 0x0000B8, "Member 'WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm::K2Node_ComponentBoundEvent_KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm, CallFunc_PlayUMGAnimation_ReturnValue) == 0x0000F8, "Member 'WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm::CallFunc_PlayUMGAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm, K2Node_CreateDelegate_OutputDelegate_3) == 0x000100, "Member 'WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm, CallFunc_IsValid_ReturnValue) == 0x000110, "Member 'WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm, CallFunc_PlayUMGAnimation_ReturnValue_1) == 0x000118, "Member 'WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm::CallFunc_PlayUMGAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm, CallFunc_PlayUMGAnimation_ReturnValue_2) == 0x000120, "Member 'WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm::CallFunc_PlayUMGAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm, CallFunc_IsValid_ReturnValue_1) == 0x000128, "Member 'WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm, CallFunc_IsValid_ReturnValue_2) == 0x000129, "Member 'WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm, CallFunc_PlayUMGAnimation_ReturnValue_3) == 0x000130, "Member 'WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm::CallFunc_PlayUMGAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm, CallFunc_IsValid_ReturnValue_3) == 0x000138, "Member 'WBP_NewGamePlusConfirm_C_ExecuteUbergraph_WBP_NewGamePlusConfirm::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function WBP_NewGamePlusConfirm.WBP_NewGamePlusConfirm_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_NewGamePlusConfirm_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_NewGamePlusConfirm_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_NewGamePlusConfirm_C_OnFocusReceived");
static_assert(sizeof(WBP_NewGamePlusConfirm_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_NewGamePlusConfirm_C_OnFocusReceived");
static_assert(offsetof(WBP_NewGamePlusConfirm_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_NewGamePlusConfirm_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_NewGamePlusConfirm_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_NewGamePlusConfirm_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_NewGamePlusConfirm_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_NewGamePlusConfirm_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewGamePlusConfirm_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_NewGamePlusConfirm_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

}

