#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Location_Small

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Location_Small.WBP_Location_Small_C
// 0x0168 (0x05C8 - 0x0460)
class UWBP_Location_Small_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideAnim;                                          // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             MapAreaNameText;                                   // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SubLine;                                           // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGameMapData                           GameMapData;                                       // 0x0488(0x0140)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)

public:
	void WidgetAnimationEvt_ShowAnim_K2Node_WidgetAnimationEvent_0();
	void WidgetAnimationEvt_HideAnim_K2Node_WidgetAnimationEvent_1();
	void SetMapAreaName(const class FText& MapAreaName);
	void OnFinish_970677714A515757EC1305BA7ECF6A65();
	void ExecuteUbergraph_WBP_Location_Small(int32 EntryPoint);
	void Construct();
	void Close();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Location_Small_C">();
	}
	static class UWBP_Location_Small_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Location_Small_C>();
	}
};
static_assert(alignof(UWBP_Location_Small_C) == 0x000008, "Wrong alignment on UWBP_Location_Small_C");
static_assert(sizeof(UWBP_Location_Small_C) == 0x0005C8, "Wrong size on UWBP_Location_Small_C");
static_assert(offsetof(UWBP_Location_Small_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Location_Small_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Location_Small_C, HideAnim) == 0x000468, "Member 'UWBP_Location_Small_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Location_Small_C, ShowAnim) == 0x000470, "Member 'UWBP_Location_Small_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Location_Small_C, MapAreaNameText) == 0x000478, "Member 'UWBP_Location_Small_C::MapAreaNameText' has a wrong offset!");
static_assert(offsetof(UWBP_Location_Small_C, SubLine) == 0x000480, "Member 'UWBP_Location_Small_C::SubLine' has a wrong offset!");
static_assert(offsetof(UWBP_Location_Small_C, GameMapData) == 0x000488, "Member 'UWBP_Location_Small_C::GameMapData' has a wrong offset!");

}

