#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InventoryViewer_Category

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InventoryViewer_Category.WBP_InventoryViewer_Category_C
// 0x0058 (0x04B8 - 0x0460)
class UWBP_InventoryViewer_Category_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 HedderBox;                                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemTypeText;                                      // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_PageContainer;                             // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventoryPage_IconList_C*          InventoryPage;                                     // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	EInventoryItemType                            ItemType;                                          // 0x0488(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryComponent*                    InventoryComponent;                                // 0x0490(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWBP_InventoryEntry_C* Item)> OnItemFocused;                 // 0x0498(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UWBP_InventoryViewer_Category_C* InvetoryCategory, bool bEscapeFromBottom, int32 IndexInRow)> OnEscapeInventoryCategory; // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Construct();
	void ExecuteUbergraph_WBP_InventoryViewer_Category(int32 EntryPoint);
	void Focus_Entry_in_Row_at_Index(bool bFromTop, int32 IndexInRow);
	void OnEscapeInventoryPage(bool bEscapeFromBottom, int32 IndexInRow);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnInventoryItemFocused(class UWBP_InventoryEntry_C* Item);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_InventoryViewer_Category_C">();
	}
	static class UWBP_InventoryViewer_Category_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InventoryViewer_Category_C>();
	}
};
static_assert(alignof(UWBP_InventoryViewer_Category_C) == 0x000008, "Wrong alignment on UWBP_InventoryViewer_Category_C");
static_assert(sizeof(UWBP_InventoryViewer_Category_C) == 0x0004B8, "Wrong size on UWBP_InventoryViewer_Category_C");
static_assert(offsetof(UWBP_InventoryViewer_Category_C, UberGraphFrame) == 0x000460, "Member 'UWBP_InventoryViewer_Category_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryViewer_Category_C, HedderBox) == 0x000468, "Member 'UWBP_InventoryViewer_Category_C::HedderBox' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryViewer_Category_C, ItemTypeText) == 0x000470, "Member 'UWBP_InventoryViewer_Category_C::ItemTypeText' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryViewer_Category_C, Overlay_PageContainer) == 0x000478, "Member 'UWBP_InventoryViewer_Category_C::Overlay_PageContainer' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryViewer_Category_C, InventoryPage) == 0x000480, "Member 'UWBP_InventoryViewer_Category_C::InventoryPage' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryViewer_Category_C, ItemType) == 0x000488, "Member 'UWBP_InventoryViewer_Category_C::ItemType' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryViewer_Category_C, InventoryComponent) == 0x000490, "Member 'UWBP_InventoryViewer_Category_C::InventoryComponent' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryViewer_Category_C, OnItemFocused) == 0x000498, "Member 'UWBP_InventoryViewer_Category_C::OnItemFocused' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryViewer_Category_C, OnEscapeInventoryCategory) == 0x0004A8, "Member 'UWBP_InventoryViewer_Category_C::OnEscapeInventoryCategory' has a wrong offset!");

}

