#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GameMenu_Page_Intel

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_GameMenu_Page_Intel.WBP_GameMenu_Page_Intel_C.BndEvt__WBP_GameMenu_Page_Intel_WBP_Tip_List_K2Node_ComponentBoundEvent_1_OnEntryFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_GameMenu_Page_Intel_C_BndEvt__WBP_GameMenu_Page_Intel_WBP_Tip_List_K2Node_ComponentBoundEvent_1_OnEntryFocused__DelegateSignature final
{
public:
	class UWBP_InventoryEntry_C*                  Entry;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameMenu_Page_Intel_C_BndEvt__WBP_GameMenu_Page_Intel_WBP_Tip_List_K2Node_ComponentBoundEvent_1_OnEntryFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GameMenu_Page_Intel_C_BndEvt__WBP_GameMenu_Page_Intel_WBP_Tip_List_K2Node_ComponentBoundEvent_1_OnEntryFocused__DelegateSignature");
static_assert(sizeof(WBP_GameMenu_Page_Intel_C_BndEvt__WBP_GameMenu_Page_Intel_WBP_Tip_List_K2Node_ComponentBoundEvent_1_OnEntryFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_GameMenu_Page_Intel_C_BndEvt__WBP_GameMenu_Page_Intel_WBP_Tip_List_K2Node_ComponentBoundEvent_1_OnEntryFocused__DelegateSignature");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_BndEvt__WBP_GameMenu_Page_Intel_WBP_Tip_List_K2Node_ComponentBoundEvent_1_OnEntryFocused__DelegateSignature, Entry) == 0x000000, "Member 'WBP_GameMenu_Page_Intel_C_BndEvt__WBP_GameMenu_Page_Intel_WBP_Tip_List_K2Node_ComponentBoundEvent_1_OnEntryFocused__DelegateSignature::Entry' has a wrong offset!");

// Function WBP_GameMenu_Page_Intel.WBP_GameMenu_Page_Intel_C.BndEvt__WBP_GameMenu_Page_Intel_WBP_Tutorial_List_K2Node_ComponentBoundEvent_3_OnEntryFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_GameMenu_Page_Intel_C_BndEvt__WBP_GameMenu_Page_Intel_WBP_Tutorial_List_K2Node_ComponentBoundEvent_3_OnEntryFocused__DelegateSignature final
{
public:
	class UWBP_InventoryEntry_C*                  Entry;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameMenu_Page_Intel_C_BndEvt__WBP_GameMenu_Page_Intel_WBP_Tutorial_List_K2Node_ComponentBoundEvent_3_OnEntryFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GameMenu_Page_Intel_C_BndEvt__WBP_GameMenu_Page_Intel_WBP_Tutorial_List_K2Node_ComponentBoundEvent_3_OnEntryFocused__DelegateSignature");
static_assert(sizeof(WBP_GameMenu_Page_Intel_C_BndEvt__WBP_GameMenu_Page_Intel_WBP_Tutorial_List_K2Node_ComponentBoundEvent_3_OnEntryFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_GameMenu_Page_Intel_C_BndEvt__WBP_GameMenu_Page_Intel_WBP_Tutorial_List_K2Node_ComponentBoundEvent_3_OnEntryFocused__DelegateSignature");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_BndEvt__WBP_GameMenu_Page_Intel_WBP_Tutorial_List_K2Node_ComponentBoundEvent_3_OnEntryFocused__DelegateSignature, Entry) == 0x000000, "Member 'WBP_GameMenu_Page_Intel_C_BndEvt__WBP_GameMenu_Page_Intel_WBP_Tutorial_List_K2Node_ComponentBoundEvent_3_OnEntryFocused__DelegateSignature::Entry' has a wrong offset!");

// Function WBP_GameMenu_Page_Intel.WBP_GameMenu_Page_Intel_C.ExecuteUbergraph_WBP_GameMenu_Page_Intel
// 0x0068 (0x0068 - 0x0000)
struct WBP_GameMenu_Page_Intel_C_ExecuteUbergraph_WBP_GameMenu_Page_Intel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyEvent                              K2Node_CustomEvent_KeyEvent;                       // 0x0008(0x0040)()
	class UWBP_Button_Tab_C*                      K2Node_CustomEvent_PressedButtonTab;               // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventoryEntry_C*                  K2Node_ComponentBoundEvent_Entry_1;                // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventoryEntry_C*                  K2Node_ComponentBoundEvent_Entry;                  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameMenu_Page_Intel_C_ExecuteUbergraph_WBP_GameMenu_Page_Intel) == 0x000008, "Wrong alignment on WBP_GameMenu_Page_Intel_C_ExecuteUbergraph_WBP_GameMenu_Page_Intel");
static_assert(sizeof(WBP_GameMenu_Page_Intel_C_ExecuteUbergraph_WBP_GameMenu_Page_Intel) == 0x000068, "Wrong size on WBP_GameMenu_Page_Intel_C_ExecuteUbergraph_WBP_GameMenu_Page_Intel");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_ExecuteUbergraph_WBP_GameMenu_Page_Intel, EntryPoint) == 0x000000, "Member 'WBP_GameMenu_Page_Intel_C_ExecuteUbergraph_WBP_GameMenu_Page_Intel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_ExecuteUbergraph_WBP_GameMenu_Page_Intel, K2Node_CustomEvent_KeyEvent) == 0x000008, "Member 'WBP_GameMenu_Page_Intel_C_ExecuteUbergraph_WBP_GameMenu_Page_Intel::K2Node_CustomEvent_KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_ExecuteUbergraph_WBP_GameMenu_Page_Intel, K2Node_CustomEvent_PressedButtonTab) == 0x000048, "Member 'WBP_GameMenu_Page_Intel_C_ExecuteUbergraph_WBP_GameMenu_Page_Intel::K2Node_CustomEvent_PressedButtonTab' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_ExecuteUbergraph_WBP_GameMenu_Page_Intel, K2Node_ComponentBoundEvent_Entry_1) == 0x000050, "Member 'WBP_GameMenu_Page_Intel_C_ExecuteUbergraph_WBP_GameMenu_Page_Intel::K2Node_ComponentBoundEvent_Entry_1' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_ExecuteUbergraph_WBP_GameMenu_Page_Intel, K2Node_ComponentBoundEvent_Entry) == 0x000058, "Member 'WBP_GameMenu_Page_Intel_C_ExecuteUbergraph_WBP_GameMenu_Page_Intel::K2Node_ComponentBoundEvent_Entry' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_ExecuteUbergraph_WBP_GameMenu_Page_Intel, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000060, "Member 'WBP_GameMenu_Page_Intel_C_ExecuteUbergraph_WBP_GameMenu_Page_Intel::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_GameMenu_Page_Intel.WBP_GameMenu_Page_Intel_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_GameMenu_Page_Intel_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_GameMenu_Page_Intel_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_GameMenu_Page_Intel_C_OnFocusReceived");
static_assert(sizeof(WBP_GameMenu_Page_Intel_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_GameMenu_Page_Intel_C_OnFocusReceived");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_GameMenu_Page_Intel_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_GameMenu_Page_Intel_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_GameMenu_Page_Intel_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_GameMenu_Page_Intel_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_GameMenu_Page_Intel.WBP_GameMenu_Page_Intel_C.OnPressedTab
// 0x0048 (0x0048 - 0x0000)
struct WBP_GameMenu_Page_Intel_C_OnPressedTab final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UWBP_Button_Tab_C*                      PressedButtonTab;                                  // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameMenu_Page_Intel_C_OnPressedTab) == 0x000008, "Wrong alignment on WBP_GameMenu_Page_Intel_C_OnPressedTab");
static_assert(sizeof(WBP_GameMenu_Page_Intel_C_OnPressedTab) == 0x000048, "Wrong size on WBP_GameMenu_Page_Intel_C_OnPressedTab");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_OnPressedTab, KeyEvent) == 0x000000, "Member 'WBP_GameMenu_Page_Intel_C_OnPressedTab::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_OnPressedTab, PressedButtonTab) == 0x000040, "Member 'WBP_GameMenu_Page_Intel_C_OnPressedTab::PressedButtonTab' has a wrong offset!");

// Function WBP_GameMenu_Page_Intel.WBP_GameMenu_Page_Intel_C.OnPressNextAlt
// 0x01C8 (0x01C8 - 0x0000)
struct WBP_GameMenu_Page_Intel_C_OnPressNextAlt final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0108(0x00B8)()
	int32                                         CallFunc_LoopAround_ReturnValue;                   // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameMenu_Page_Intel_C_OnPressNextAlt) == 0x000008, "Wrong alignment on WBP_GameMenu_Page_Intel_C_OnPressNextAlt");
static_assert(sizeof(WBP_GameMenu_Page_Intel_C_OnPressNextAlt) == 0x0001C8, "Wrong size on WBP_GameMenu_Page_Intel_C_OnPressNextAlt");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_OnPressNextAlt, KeyEvent) == 0x000000, "Member 'WBP_GameMenu_Page_Intel_C_OnPressNextAlt::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_OnPressNextAlt, ReturnValue) == 0x000040, "Member 'WBP_GameMenu_Page_Intel_C_OnPressNextAlt::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_OnPressNextAlt, CallFunc_Array_Length_ReturnValue) == 0x0000F8, "Member 'WBP_GameMenu_Page_Intel_C_OnPressNextAlt::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_OnPressNextAlt, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000FC, "Member 'WBP_GameMenu_Page_Intel_C_OnPressNextAlt::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_OnPressNextAlt, CallFunc_Add_IntInt_ReturnValue) == 0x000100, "Member 'WBP_GameMenu_Page_Intel_C_OnPressNextAlt::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_OnPressNextAlt, CallFunc_Handled_ReturnValue) == 0x000108, "Member 'WBP_GameMenu_Page_Intel_C_OnPressNextAlt::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_OnPressNextAlt, CallFunc_LoopAround_ReturnValue) == 0x0001C0, "Member 'WBP_GameMenu_Page_Intel_C_OnPressNextAlt::CallFunc_LoopAround_ReturnValue' has a wrong offset!");

// Function WBP_GameMenu_Page_Intel.WBP_GameMenu_Page_Intel_C.OnPressPreviousAlt
// 0x01C8 (0x01C8 - 0x0000)
struct WBP_GameMenu_Page_Intel_C_OnPressPreviousAlt final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0108(0x00B8)()
	int32                                         CallFunc_LoopAround_ReturnValue;                   // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameMenu_Page_Intel_C_OnPressPreviousAlt) == 0x000008, "Wrong alignment on WBP_GameMenu_Page_Intel_C_OnPressPreviousAlt");
static_assert(sizeof(WBP_GameMenu_Page_Intel_C_OnPressPreviousAlt) == 0x0001C8, "Wrong size on WBP_GameMenu_Page_Intel_C_OnPressPreviousAlt");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_OnPressPreviousAlt, KeyEvent) == 0x000000, "Member 'WBP_GameMenu_Page_Intel_C_OnPressPreviousAlt::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_OnPressPreviousAlt, ReturnValue) == 0x000040, "Member 'WBP_GameMenu_Page_Intel_C_OnPressPreviousAlt::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_OnPressPreviousAlt, CallFunc_Array_Length_ReturnValue) == 0x0000F8, "Member 'WBP_GameMenu_Page_Intel_C_OnPressPreviousAlt::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_OnPressPreviousAlt, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000FC, "Member 'WBP_GameMenu_Page_Intel_C_OnPressPreviousAlt::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_OnPressPreviousAlt, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000100, "Member 'WBP_GameMenu_Page_Intel_C_OnPressPreviousAlt::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_OnPressPreviousAlt, CallFunc_Handled_ReturnValue) == 0x000108, "Member 'WBP_GameMenu_Page_Intel_C_OnPressPreviousAlt::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_OnPressPreviousAlt, CallFunc_LoopAround_ReturnValue) == 0x0001C0, "Member 'WBP_GameMenu_Page_Intel_C_OnPressPreviousAlt::CallFunc_LoopAround_ReturnValue' has a wrong offset!");

// Function WBP_GameMenu_Page_Intel.WBP_GameMenu_Page_Intel_C.RefreshTabSelection
// 0x0020 (0x0020 - 0x0000)
struct WBP_GameMenu_Page_Intel_C_RefreshTabSelection final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Button_Tab_C*                      CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameMenu_Page_Intel_C_RefreshTabSelection) == 0x000008, "Wrong alignment on WBP_GameMenu_Page_Intel_C_RefreshTabSelection");
static_assert(sizeof(WBP_GameMenu_Page_Intel_C_RefreshTabSelection) == 0x000020, "Wrong size on WBP_GameMenu_Page_Intel_C_RefreshTabSelection");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_RefreshTabSelection, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_GameMenu_Page_Intel_C_RefreshTabSelection::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_RefreshTabSelection, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_GameMenu_Page_Intel_C_RefreshTabSelection::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_RefreshTabSelection, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_GameMenu_Page_Intel_C_RefreshTabSelection::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_RefreshTabSelection, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_GameMenu_Page_Intel_C_RefreshTabSelection::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_RefreshTabSelection, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_GameMenu_Page_Intel_C_RefreshTabSelection::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_RefreshTabSelection, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_GameMenu_Page_Intel_C_RefreshTabSelection::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_RefreshTabSelection, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_GameMenu_Page_Intel_C_RefreshTabSelection::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_GameMenu_Page_Intel.WBP_GameMenu_Page_Intel_C.SetPage
// 0x0010 (0x0010 - 0x0000)
struct WBP_GameMenu_Page_Intel_C_SetPage final
{
public:
	int32                                         PageIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameMenu_Page_Intel_C_SetPage) == 0x000008, "Wrong alignment on WBP_GameMenu_Page_Intel_C_SetPage");
static_assert(sizeof(WBP_GameMenu_Page_Intel_C_SetPage) == 0x000010, "Wrong size on WBP_GameMenu_Page_Intel_C_SetPage");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_SetPage, PageIndex) == 0x000000, "Member 'WBP_GameMenu_Page_Intel_C_SetPage::PageIndex' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_SetPage, CallFunc_GetActiveWidget_ReturnValue) == 0x000008, "Member 'WBP_GameMenu_Page_Intel_C_SetPage::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");

// Function WBP_GameMenu_Page_Intel.WBP_GameMenu_Page_Intel_C.SetupTabs
// 0x0040 (0x0040 - 0x0000)
struct WBP_GameMenu_Page_Intel_C_SetupTabs final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Button_Tab_C*                      CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_Button_Tab_C*>              K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void(const struct FKeyEvent& KeyEvent, class UWBP_Button_Tab_C* PressedButtonTab)> K2Node_CreateDelegate_OutputDelegate; // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GameMenu_Page_Intel_C_SetupTabs) == 0x000008, "Wrong alignment on WBP_GameMenu_Page_Intel_C_SetupTabs");
static_assert(sizeof(WBP_GameMenu_Page_Intel_C_SetupTabs) == 0x000040, "Wrong size on WBP_GameMenu_Page_Intel_C_SetupTabs");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_SetupTabs, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_GameMenu_Page_Intel_C_SetupTabs::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_SetupTabs, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_GameMenu_Page_Intel_C_SetupTabs::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_SetupTabs, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_GameMenu_Page_Intel_C_SetupTabs::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_SetupTabs, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_GameMenu_Page_Intel_C_SetupTabs::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_SetupTabs, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_GameMenu_Page_Intel_C_SetupTabs::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_SetupTabs, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_GameMenu_Page_Intel_C_SetupTabs::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_SetupTabs, K2Node_MakeArray_Array) == 0x000020, "Member 'WBP_GameMenu_Page_Intel_C_SetupTabs::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_GameMenu_Page_Intel_C_SetupTabs, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'WBP_GameMenu_Page_Intel_C_SetupTabs::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

}

