#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StatusEffects

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_StatusEffects.WBP_StatusEffects_C
// 0x0018 (0x0478 - 0x0460)
class UWBP_StatusEffects_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWrapBox*                               Container;                                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStatusEffectComponent*                 StatusEffectComponent;                             // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void OnStatusEffectLaunched(class UStatusEffect* StatusEffect);
	void Initialize(class APawn* Pawn);
	void ExecuteUbergraph_WBP_StatusEffects(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_StatusEffects_C">();
	}
	static class UWBP_StatusEffects_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_StatusEffects_C>();
	}
};
static_assert(alignof(UWBP_StatusEffects_C) == 0x000008, "Wrong alignment on UWBP_StatusEffects_C");
static_assert(sizeof(UWBP_StatusEffects_C) == 0x000478, "Wrong size on UWBP_StatusEffects_C");
static_assert(offsetof(UWBP_StatusEffects_C, UberGraphFrame) == 0x000460, "Member 'UWBP_StatusEffects_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_StatusEffects_C, Container) == 0x000468, "Member 'UWBP_StatusEffects_C::Container' has a wrong offset!");
static_assert(offsetof(UWBP_StatusEffects_C, StatusEffectComponent) == 0x000470, "Member 'UWBP_StatusEffects_C::StatusEffectComponent' has a wrong offset!");

}

