#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugMenu_Element_Choice_Toggle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DebugMenu_Element_Choice_Toggle.WBP_DebugMenu_Element_Choice_Toggle_C
// 0x0038 (0x0498 - 0x0460)
class UWBP_DebugMenu_Element_Choice_Toggle_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_DebugMenu_Element_Choice_Text_C*   WBP_DebugMenu_Element_Choice_Text;                 // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Label;                                             // 0x0470(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                          HandleLeftRight;                                   // 0x0480(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ToggleValue;                                       // 0x0481(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_482[0x6];                                      // 0x0482(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool ToggleValue)> OnToggle;                                       // 0x0488(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void SetToggle(bool ToggleValue_0, bool BroadcastEvent);
	void SetLabel(const class FText& InText);
	void SetHandleLeftRight(bool HandleLeftRight_0);
	void RefreshOptionText();
	void PreConstruct(bool IsDesignTime);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Toggle(int32 EntryPoint);
	void BndEvt__WBP_DebugMenu_Element_Choice_Toggle_WBP_DebugMenu_Element_Choice_Text_K2Node_ComponentBoundEvent_1_OnRight__DelegateSignature();
	void BndEvt__WBP_DebugMenu_Element_Choice_Toggle_WBP_DebugMenu_Element_Choice_Text_K2Node_ComponentBoundEvent_0_OnLeft__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DebugMenu_Element_Choice_Toggle_C">();
	}
	static class UWBP_DebugMenu_Element_Choice_Toggle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DebugMenu_Element_Choice_Toggle_C>();
	}
};
static_assert(alignof(UWBP_DebugMenu_Element_Choice_Toggle_C) == 0x000008, "Wrong alignment on UWBP_DebugMenu_Element_Choice_Toggle_C");
static_assert(sizeof(UWBP_DebugMenu_Element_Choice_Toggle_C) == 0x000498, "Wrong size on UWBP_DebugMenu_Element_Choice_Toggle_C");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Toggle_C, UberGraphFrame) == 0x000460, "Member 'UWBP_DebugMenu_Element_Choice_Toggle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Toggle_C, WBP_DebugMenu_Element_Choice_Text) == 0x000468, "Member 'UWBP_DebugMenu_Element_Choice_Toggle_C::WBP_DebugMenu_Element_Choice_Text' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Toggle_C, Label) == 0x000470, "Member 'UWBP_DebugMenu_Element_Choice_Toggle_C::Label' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Toggle_C, HandleLeftRight) == 0x000480, "Member 'UWBP_DebugMenu_Element_Choice_Toggle_C::HandleLeftRight' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Toggle_C, ToggleValue) == 0x000481, "Member 'UWBP_DebugMenu_Element_Choice_Toggle_C::ToggleValue' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Toggle_C, OnToggle) == 0x000488, "Member 'UWBP_DebugMenu_Element_Choice_Toggle_C::OnToggle' has a wrong offset!");

}

