#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Shop

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function WBP_Shop.WBP_Shop_C.BuyItem
// 0x0050 (0x0050 - 0x0000)
struct WBP_Shop_C_BuyItem final
{
public:
	class UWBP_Shop_Entry_C*                      ShopEntry;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Shop_Entry_C*                      CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue_1;                        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FCurrencyValue                         CallFunc_GetItemCost_ReturnValue;                  // 0x0038(0x0008)(NoDestructor)
	bool                                          CallFunc_AddItem_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SpendCurrency_ReturnValue;                // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue_2;                        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Shop_C_BuyItem) == 0x000008, "Wrong alignment on WBP_Shop_C_BuyItem");
static_assert(sizeof(WBP_Shop_C_BuyItem) == 0x000050, "Wrong size on WBP_Shop_C_BuyItem");
static_assert(offsetof(WBP_Shop_C_BuyItem, ShopEntry) == 0x000000, "Member 'WBP_Shop_C_BuyItem::ShopEntry' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_BuyItem, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'WBP_Shop_C_BuyItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_BuyItem, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_Shop_C_BuyItem::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_BuyItem, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_Shop_C_BuyItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_BuyItem, CallFunc_Less_IntInt_ReturnValue) == 0x000014, "Member 'WBP_Shop_C_BuyItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_BuyItem, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Shop_C_BuyItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_BuyItem, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'WBP_Shop_C_BuyItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_BuyItem, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_Shop_C_BuyItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_BuyItem, CallFunc_Get_ReturnValue) == 0x000028, "Member 'WBP_Shop_C_BuyItem::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_BuyItem, CallFunc_Get_ReturnValue_1) == 0x000030, "Member 'WBP_Shop_C_BuyItem::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_BuyItem, CallFunc_GetItemCost_ReturnValue) == 0x000038, "Member 'WBP_Shop_C_BuyItem::CallFunc_GetItemCost_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_BuyItem, CallFunc_AddItem_ReturnValue) == 0x000040, "Member 'WBP_Shop_C_BuyItem::CallFunc_AddItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_BuyItem, CallFunc_SpendCurrency_ReturnValue) == 0x000044, "Member 'WBP_Shop_C_BuyItem::CallFunc_SpendCurrency_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_BuyItem, CallFunc_Get_ReturnValue_2) == 0x000048, "Member 'WBP_Shop_C_BuyItem::CallFunc_Get_ReturnValue_2' has a wrong offset!");

// Function WBP_Shop.WBP_Shop_C.CanBuyItemShop
// 0x0020 (0x0020 - 0x0000)
struct WBP_Shop_C_CanBuyItemShop final
{
public:
	class UWBP_Shop_Entry_C*                      ShopEntry;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanBuy;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanSpendCurrency_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Shop_C_CanBuyItemShop) == 0x000008, "Wrong alignment on WBP_Shop_C_CanBuyItemShop");
static_assert(sizeof(WBP_Shop_C_CanBuyItemShop) == 0x000020, "Wrong size on WBP_Shop_C_CanBuyItemShop");
static_assert(offsetof(WBP_Shop_C_CanBuyItemShop, ShopEntry) == 0x000000, "Member 'WBP_Shop_C_CanBuyItemShop::ShopEntry' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_CanBuyItemShop, bCanBuy) == 0x000008, "Member 'WBP_Shop_C_CanBuyItemShop::bCanBuy' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_CanBuyItemShop, CallFunc_Greater_IntInt_ReturnValue) == 0x000009, "Member 'WBP_Shop_C_CanBuyItemShop::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_CanBuyItemShop, CallFunc_Get_ReturnValue) == 0x000010, "Member 'WBP_Shop_C_CanBuyItemShop::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_CanBuyItemShop, CallFunc_CanSpendCurrency_ReturnValue) == 0x000018, "Member 'WBP_Shop_C_CanBuyItemShop::CallFunc_CanSpendCurrency_ReturnValue' has a wrong offset!");

// Function WBP_Shop.WBP_Shop_C.ExecuteUbergraph_WBP_Shop
// 0x0290 (0x0290 - 0x0000)
struct WBP_Shop_C_ExecuteUbergraph_WBP_Shop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Dialog_YesNo_C*                    CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Shop_Entry_C*                      K2Node_CustomEvent_ShopEntry_1;                    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKeyEvent                              K2Node_CustomEvent_KeyEvent_1;                     // 0x0030(0x0040)()
	class UWBP_Shop_Entry_C*                      K2Node_CustomEvent_ShopEntry;                      // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0080(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C8(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_CanBuyItemShop_bCanBuy;                   // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0118(0x0010)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0128(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKeyEvent                              K2Node_CustomEvent_KeyEvent;                       // 0x0138(0x0040)()
	class UWBP_Button_Tab_C*                      K2Node_CustomEvent_PressedButtonTab;               // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Dialog_OK_C*                       CallFunc_Create_ReturnValue_1;                     // 0x0188(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Dialog_OK_C*                       CallFunc_Create_ReturnValue_2;                     // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECurrencyType                                 Temp_byte_Variable;                                // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue;             // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue_1;           // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x01C0(0x0010)()
	class FText                                   Temp_text_Variable_2;                              // 0x01D0(0x0010)()
	class FText                                   Temp_text_Variable_3;                              // 0x01E0(0x0010)(ConstParm)
	class FText                                   K2Node_Select_Default;                             // 0x01F0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0200(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0248(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0258(0x0010)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0268(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_4;                              // 0x0278(0x0010)(ConstParm)
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop) == 0x000008, "Wrong alignment on WBP_Shop_C_ExecuteUbergraph_WBP_Shop");
static_assert(sizeof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop) == 0x000290, "Wrong size on WBP_Shop_C_ExecuteUbergraph_WBP_Shop");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, EntryPoint) == 0x000000, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, CallFunc_Create_ReturnValue) == 0x000018, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, K2Node_CustomEvent_ShopEntry_1) == 0x000028, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::K2Node_CustomEvent_ShopEntry_1' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, K2Node_CustomEvent_KeyEvent_1) == 0x000030, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::K2Node_CustomEvent_KeyEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, K2Node_CustomEvent_ShopEntry) == 0x000070, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::K2Node_CustomEvent_ShopEntry' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000078, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, K2Node_MakeStruct_FormatArgumentData) == 0x000080, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000C8, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, CallFunc_CanBuyItemShop_bCanBuy) == 0x000110, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::CallFunc_CanBuyItemShop_bCanBuy' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, Temp_text_Variable) == 0x000118, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, K2Node_CreateDelegate_OutputDelegate_1) == 0x000128, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, K2Node_CustomEvent_KeyEvent) == 0x000138, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::K2Node_CustomEvent_KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, K2Node_CustomEvent_PressedButtonTab) == 0x000178, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::K2Node_CustomEvent_PressedButtonTab' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, CallFunc_Array_Find_ReturnValue) == 0x000180, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, CallFunc_Create_ReturnValue_1) == 0x000188, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, CallFunc_Create_ReturnValue_2) == 0x000190, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, Temp_byte_Variable) == 0x000198, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, CallFunc_PlayUMGAnimation_ReturnValue) == 0x0001A0, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::CallFunc_PlayUMGAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, CallFunc_IsValid_ReturnValue_2) == 0x0001A8, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, CallFunc_PlayUMGAnimation_ReturnValue_1) == 0x0001B0, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::CallFunc_PlayUMGAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, CallFunc_IsValid_ReturnValue_3) == 0x0001B8, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, Temp_text_Variable_1) == 0x0001C0, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, Temp_text_Variable_2) == 0x0001D0, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, Temp_text_Variable_3) == 0x0001E0, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, K2Node_Select_Default) == 0x0001F0, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, K2Node_MakeStruct_FormatArgumentData_2) == 0x000200, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, K2Node_MakeArray_Array) == 0x000248, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, CallFunc_Format_ReturnValue) == 0x000258, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, K2Node_CreateDelegate_OutputDelegate_2) == 0x000268, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, Temp_text_Variable_4) == 0x000278, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_ExecuteUbergraph_WBP_Shop, CallFunc_Get_ReturnValue) == 0x000288, "Member 'WBP_Shop_C_ExecuteUbergraph_WBP_Shop::CallFunc_Get_ReturnValue' has a wrong offset!");

// Function WBP_Shop.WBP_Shop_C.GenerateShopEntries
// 0x0098 (0x0098 - 0x0000)
struct WBP_Shop_C_GenerateShopEntries final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Shop_Entry_C*                      CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FKeyEvent& KeyEvent, class UWBP_Shop_Entry_C* ShopEntry)> K2Node_CreateDelegate_OutputDelegate; // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_Shop_Entry_C* ShopEntry)> K2Node_CreateDelegate_OutputDelegate_1;      // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue_1;                        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FShopItemData>                  CallFunc_GetItemsForShop_ReturnValue;              // 0x0050(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FShopItemData                          CallFunc_Array_Get_Item;                           // 0x0068(0x0020)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCurrencyValue                         CallFunc_GetItemCost_ReturnValue;                  // 0x008C(0x0008)(NoDestructor)
};
static_assert(alignof(WBP_Shop_C_GenerateShopEntries) == 0x000008, "Wrong alignment on WBP_Shop_C_GenerateShopEntries");
static_assert(sizeof(WBP_Shop_C_GenerateShopEntries) == 0x000098, "Wrong size on WBP_Shop_C_GenerateShopEntries");
static_assert(offsetof(WBP_Shop_C_GenerateShopEntries, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_Shop_C_GenerateShopEntries::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GenerateShopEntries, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Shop_C_GenerateShopEntries::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GenerateShopEntries, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Shop_C_GenerateShopEntries::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GenerateShopEntries, CallFunc_Create_ReturnValue) == 0x000010, "Member 'WBP_Shop_C_GenerateShopEntries::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GenerateShopEntries, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_Shop_C_GenerateShopEntries::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GenerateShopEntries, CallFunc_Array_Add_ReturnValue) == 0x000028, "Member 'WBP_Shop_C_GenerateShopEntries::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GenerateShopEntries, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'WBP_Shop_C_GenerateShopEntries::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GenerateShopEntries, CallFunc_Get_ReturnValue) == 0x000040, "Member 'WBP_Shop_C_GenerateShopEntries::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GenerateShopEntries, CallFunc_Get_ReturnValue_1) == 0x000048, "Member 'WBP_Shop_C_GenerateShopEntries::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GenerateShopEntries, CallFunc_GetItemsForShop_ReturnValue) == 0x000050, "Member 'WBP_Shop_C_GenerateShopEntries::CallFunc_GetItemsForShop_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GenerateShopEntries, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'WBP_Shop_C_GenerateShopEntries::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GenerateShopEntries, CallFunc_Array_Get_Item) == 0x000068, "Member 'WBP_Shop_C_GenerateShopEntries::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GenerateShopEntries, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'WBP_Shop_C_GenerateShopEntries::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GenerateShopEntries, CallFunc_GetItemCost_ReturnValue) == 0x00008C, "Member 'WBP_Shop_C_GenerateShopEntries::CallFunc_GetItemCost_ReturnValue' has a wrong offset!");

// Function WBP_Shop.WBP_Shop_C.GoToPageIndex
// 0x0088 (0x0088 - 0x0000)
struct WBP_Shop_C_GoToPageIndex final
{
public:
	int32                                         PageIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Shop_Entry_C*                      CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldDisplayShopEntry_ReturnValue;       // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Button_Tab_C*                      CallFunc_Array_Get_Item_2;                         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Shop_C_GoToPageIndex) == 0x000008, "Wrong alignment on WBP_Shop_C_GoToPageIndex");
static_assert(sizeof(WBP_Shop_C_GoToPageIndex) == 0x000088, "Wrong size on WBP_Shop_C_GoToPageIndex");
static_assert(offsetof(WBP_Shop_C_GoToPageIndex, PageIndex) == 0x000000, "Member 'WBP_Shop_C_GoToPageIndex::PageIndex' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GoToPageIndex, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Shop_C_GoToPageIndex::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GoToPageIndex, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Shop_C_GoToPageIndex::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GoToPageIndex, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_Shop_C_GoToPageIndex::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GoToPageIndex, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'WBP_Shop_C_GoToPageIndex::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GoToPageIndex, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'WBP_Shop_C_GoToPageIndex::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GoToPageIndex, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'WBP_Shop_C_GoToPageIndex::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GoToPageIndex, Temp_int_Array_Index_Variable_2) == 0x00001C, "Member 'WBP_Shop_C_GoToPageIndex::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GoToPageIndex, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000020, "Member 'WBP_Shop_C_GoToPageIndex::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GoToPageIndex, CallFunc_GetChildAt_ReturnValue) == 0x000028, "Member 'WBP_Shop_C_GoToPageIndex::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GoToPageIndex, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000030, "Member 'WBP_Shop_C_GoToPageIndex::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GoToPageIndex, CallFunc_GetChildrenCount_ReturnValue) == 0x000034, "Member 'WBP_Shop_C_GoToPageIndex::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GoToPageIndex, CallFunc_Greater_IntInt_ReturnValue) == 0x000038, "Member 'WBP_Shop_C_GoToPageIndex::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GoToPageIndex, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_Shop_C_GoToPageIndex::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GoToPageIndex, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WBP_Shop_C_GoToPageIndex::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GoToPageIndex, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'WBP_Shop_C_GoToPageIndex::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GoToPageIndex, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'WBP_Shop_C_GoToPageIndex::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GoToPageIndex, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'WBP_Shop_C_GoToPageIndex::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GoToPageIndex, CallFunc_ShouldDisplayShopEntry_ReturnValue) == 0x00005C, "Member 'WBP_Shop_C_GoToPageIndex::CallFunc_ShouldDisplayShopEntry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GoToPageIndex, CallFunc_AddChild_ReturnValue) == 0x000060, "Member 'WBP_Shop_C_GoToPageIndex::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GoToPageIndex, Temp_int_Loop_Counter_Variable_2) == 0x000068, "Member 'WBP_Shop_C_GoToPageIndex::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GoToPageIndex, CallFunc_Less_IntInt_ReturnValue_1) == 0x00006C, "Member 'WBP_Shop_C_GoToPageIndex::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GoToPageIndex, CallFunc_Add_IntInt_ReturnValue_2) == 0x000070, "Member 'WBP_Shop_C_GoToPageIndex::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GoToPageIndex, CallFunc_Array_Length_ReturnValue_2) == 0x000074, "Member 'WBP_Shop_C_GoToPageIndex::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GoToPageIndex, CallFunc_Array_Get_Item_2) == 0x000078, "Member 'WBP_Shop_C_GoToPageIndex::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_GoToPageIndex, CallFunc_Less_IntInt_ReturnValue_2) == 0x000080, "Member 'WBP_Shop_C_GoToPageIndex::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

// Function WBP_Shop.WBP_Shop_C.OnFocusedShopEntry
// 0x0008 (0x0008 - 0x0000)
struct WBP_Shop_C_OnFocusedShopEntry final
{
public:
	class UWBP_Shop_Entry_C*                      ShopEntry;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Shop_C_OnFocusedShopEntry) == 0x000008, "Wrong alignment on WBP_Shop_C_OnFocusedShopEntry");
static_assert(sizeof(WBP_Shop_C_OnFocusedShopEntry) == 0x000008, "Wrong size on WBP_Shop_C_OnFocusedShopEntry");
static_assert(offsetof(WBP_Shop_C_OnFocusedShopEntry, ShopEntry) == 0x000000, "Member 'WBP_Shop_C_OnFocusedShopEntry::ShopEntry' has a wrong offset!");

// Function WBP_Shop.WBP_Shop_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_Shop_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Shop_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Shop_C_OnFocusReceived");
static_assert(sizeof(WBP_Shop_C_OnFocusReceived) == 0x0001B8, "Wrong size on WBP_Shop_C_OnFocusReceived");
static_assert(offsetof(WBP_Shop_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Shop_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Shop_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Shop_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Shop_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_OnFocusReceived, CallFunc_GetChildAt_ReturnValue) == 0x0001B0, "Member 'WBP_Shop_C_OnFocusReceived::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");

// Function WBP_Shop.WBP_Shop_C.OnPressCancel
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Shop_C_OnPressCancel final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Shop_C_OnPressCancel) == 0x000008, "Wrong alignment on WBP_Shop_C_OnPressCancel");
static_assert(sizeof(WBP_Shop_C_OnPressCancel) == 0x0001B0, "Wrong size on WBP_Shop_C_OnPressCancel");
static_assert(offsetof(WBP_Shop_C_OnPressCancel, KeyEvent) == 0x000000, "Member 'WBP_Shop_C_OnPressCancel::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_OnPressCancel, ReturnValue) == 0x000040, "Member 'WBP_Shop_C_OnPressCancel::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_OnPressCancel, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Shop_C_OnPressCancel::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Shop.WBP_Shop_C.OnPressContext
// 0x01C8 (0x01C8 - 0x0000)
struct WBP_Shop_C_OnPressContext final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	class UWBP_GameMenu_C*                        CallFunc_Create_ReturnValue;                       // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0100(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0110(0x00B8)()
};
static_assert(alignof(WBP_Shop_C_OnPressContext) == 0x000008, "Wrong alignment on WBP_Shop_C_OnPressContext");
static_assert(sizeof(WBP_Shop_C_OnPressContext) == 0x0001C8, "Wrong size on WBP_Shop_C_OnPressContext");
static_assert(offsetof(WBP_Shop_C_OnPressContext, KeyEvent) == 0x000000, "Member 'WBP_Shop_C_OnPressContext::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_OnPressContext, ReturnValue) == 0x000040, "Member 'WBP_Shop_C_OnPressContext::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_OnPressContext, CallFunc_Create_ReturnValue) == 0x0000F8, "Member 'WBP_Shop_C_OnPressContext::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_OnPressContext, K2Node_CreateDelegate_OutputDelegate) == 0x000100, "Member 'WBP_Shop_C_OnPressContext::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_OnPressContext, CallFunc_Handled_ReturnValue) == 0x000110, "Member 'WBP_Shop_C_OnPressContext::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Shop.WBP_Shop_C.OnPressContextAlt
// 0x01C0 (0x01C0 - 0x0000)
struct WBP_Shop_C_OnPressContextAlt final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0100(0x00B8)()
	bool                                          CallFunc_IsAnyAnimationPlaying_ReturnValue;        // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Shop_C_OnPressContextAlt) == 0x000008, "Wrong alignment on WBP_Shop_C_OnPressContextAlt");
static_assert(sizeof(WBP_Shop_C_OnPressContextAlt) == 0x0001C0, "Wrong size on WBP_Shop_C_OnPressContextAlt");
static_assert(offsetof(WBP_Shop_C_OnPressContextAlt, KeyEvent) == 0x000000, "Member 'WBP_Shop_C_OnPressContextAlt::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_OnPressContextAlt, ReturnValue) == 0x000040, "Member 'WBP_Shop_C_OnPressContextAlt::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_OnPressContextAlt, CallFunc_Not_PreBool_ReturnValue) == 0x0000F8, "Member 'WBP_Shop_C_OnPressContextAlt::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_OnPressContextAlt, CallFunc_Handled_ReturnValue) == 0x000100, "Member 'WBP_Shop_C_OnPressContextAlt::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_OnPressContextAlt, CallFunc_IsAnyAnimationPlaying_ReturnValue) == 0x0001B8, "Member 'WBP_Shop_C_OnPressContextAlt::CallFunc_IsAnyAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_OnPressContextAlt, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001B9, "Member 'WBP_Shop_C_OnPressContextAlt::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_OnPressContextAlt, CallFunc_BooleanAND_ReturnValue) == 0x0001BA, "Member 'WBP_Shop_C_OnPressContextAlt::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_Shop.WBP_Shop_C.OnPressedShopEntry
// 0x0048 (0x0048 - 0x0000)
struct WBP_Shop_C_OnPressedShopEntry final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UWBP_Shop_Entry_C*                      ShopEntry;                                         // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Shop_C_OnPressedShopEntry) == 0x000008, "Wrong alignment on WBP_Shop_C_OnPressedShopEntry");
static_assert(sizeof(WBP_Shop_C_OnPressedShopEntry) == 0x000048, "Wrong size on WBP_Shop_C_OnPressedShopEntry");
static_assert(offsetof(WBP_Shop_C_OnPressedShopEntry, KeyEvent) == 0x000000, "Member 'WBP_Shop_C_OnPressedShopEntry::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_OnPressedShopEntry, ShopEntry) == 0x000040, "Member 'WBP_Shop_C_OnPressedShopEntry::ShopEntry' has a wrong offset!");

// Function WBP_Shop.WBP_Shop_C.OnPressNext
// 0x01C0 (0x01C0 - 0x0000)
struct WBP_Shop_C_OnPressNext final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_LoopAround_ReturnValue;                   // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Shop_C_OnPressNext) == 0x000008, "Wrong alignment on WBP_Shop_C_OnPressNext");
static_assert(sizeof(WBP_Shop_C_OnPressNext) == 0x0001C0, "Wrong size on WBP_Shop_C_OnPressNext");
static_assert(offsetof(WBP_Shop_C_OnPressNext, KeyEvent) == 0x000000, "Member 'WBP_Shop_C_OnPressNext::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_OnPressNext, ReturnValue) == 0x000040, "Member 'WBP_Shop_C_OnPressNext::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_OnPressNext, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Shop_C_OnPressNext::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_OnPressNext, CallFunc_Array_Length_ReturnValue) == 0x0001B0, "Member 'WBP_Shop_C_OnPressNext::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_OnPressNext, CallFunc_Add_IntInt_ReturnValue) == 0x0001B4, "Member 'WBP_Shop_C_OnPressNext::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_OnPressNext, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001B8, "Member 'WBP_Shop_C_OnPressNext::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_OnPressNext, CallFunc_LoopAround_ReturnValue) == 0x0001BC, "Member 'WBP_Shop_C_OnPressNext::CallFunc_LoopAround_ReturnValue' has a wrong offset!");

// Function WBP_Shop.WBP_Shop_C.OnPressPrevious
// 0x01C0 (0x01C0 - 0x0000)
struct WBP_Shop_C_OnPressPrevious final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_LoopAround_ReturnValue;                   // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Shop_C_OnPressPrevious) == 0x000008, "Wrong alignment on WBP_Shop_C_OnPressPrevious");
static_assert(sizeof(WBP_Shop_C_OnPressPrevious) == 0x0001C0, "Wrong size on WBP_Shop_C_OnPressPrevious");
static_assert(offsetof(WBP_Shop_C_OnPressPrevious, KeyEvent) == 0x000000, "Member 'WBP_Shop_C_OnPressPrevious::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_OnPressPrevious, ReturnValue) == 0x000040, "Member 'WBP_Shop_C_OnPressPrevious::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_OnPressPrevious, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Shop_C_OnPressPrevious::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_OnPressPrevious, CallFunc_Array_Length_ReturnValue) == 0x0001B0, "Member 'WBP_Shop_C_OnPressPrevious::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_OnPressPrevious, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001B4, "Member 'WBP_Shop_C_OnPressPrevious::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_OnPressPrevious, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0001B8, "Member 'WBP_Shop_C_OnPressPrevious::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_OnPressPrevious, CallFunc_LoopAround_ReturnValue) == 0x0001BC, "Member 'WBP_Shop_C_OnPressPrevious::CallFunc_LoopAround_ReturnValue' has a wrong offset!");

// Function WBP_Shop.WBP_Shop_C.OnTabPressed
// 0x0048 (0x0048 - 0x0000)
struct WBP_Shop_C_OnTabPressed final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UWBP_Button_Tab_C*                      PressedButtonTab;                                  // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Shop_C_OnTabPressed) == 0x000008, "Wrong alignment on WBP_Shop_C_OnTabPressed");
static_assert(sizeof(WBP_Shop_C_OnTabPressed) == 0x000048, "Wrong size on WBP_Shop_C_OnTabPressed");
static_assert(offsetof(WBP_Shop_C_OnTabPressed, KeyEvent) == 0x000000, "Member 'WBP_Shop_C_OnTabPressed::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_OnTabPressed, PressedButtonTab) == 0x000040, "Member 'WBP_Shop_C_OnTabPressed::PressedButtonTab' has a wrong offset!");

// Function WBP_Shop.WBP_Shop_C.RefreshAllowCompare
// 0x0010 (0x0010 - 0x0000)
struct WBP_Shop_C_RefreshAllowCompare final
{
public:
	class UWBP_Shop_Entry_C*                      ShopEntry;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Shop_C_RefreshAllowCompare) == 0x000008, "Wrong alignment on WBP_Shop_C_RefreshAllowCompare");
static_assert(sizeof(WBP_Shop_C_RefreshAllowCompare) == 0x000010, "Wrong size on WBP_Shop_C_RefreshAllowCompare");
static_assert(offsetof(WBP_Shop_C_RefreshAllowCompare, ShopEntry) == 0x000000, "Member 'WBP_Shop_C_RefreshAllowCompare::ShopEntry' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_RefreshAllowCompare, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_Shop_C_RefreshAllowCompare::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_RefreshAllowCompare, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000009, "Member 'WBP_Shop_C_RefreshAllowCompare::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_RefreshAllowCompare, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00000A, "Member 'WBP_Shop_C_RefreshAllowCompare::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function WBP_Shop.WBP_Shop_C.RefreshCurrency
// 0x0010 (0x0010 - 0x0000)
struct WBP_Shop_C_RefreshCurrency final
{
public:
	class UWBP_Shop_Entry_C*                      Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         HeldCurrency;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Shop_C_RefreshCurrency) == 0x000008, "Wrong alignment on WBP_Shop_C_RefreshCurrency");
static_assert(sizeof(WBP_Shop_C_RefreshCurrency) == 0x000010, "Wrong size on WBP_Shop_C_RefreshCurrency");
static_assert(offsetof(WBP_Shop_C_RefreshCurrency, Target) == 0x000000, "Member 'WBP_Shop_C_RefreshCurrency::Target' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_RefreshCurrency, HeldCurrency) == 0x000008, "Member 'WBP_Shop_C_RefreshCurrency::HeldCurrency' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_RefreshCurrency, CallFunc_Greater_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_Shop_C_RefreshCurrency::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Shop_C_RefreshCurrency, CallFunc_IsValid_ReturnValue) == 0x00000D, "Member 'WBP_Shop_C_RefreshCurrency::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_Shop.WBP_Shop_C.RefreshFilterName
// 0x0180 (0x0180 - 0x0000)
struct WBP_Shop_C_RefreshFilterName final
{
public:
	class FText                                   Temp_text_Variable;                                // 0x0000(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0010(0x0010)()
