#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Recollection_BossRush_RecordEntry_Text

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Recollection_BossRush_RecordEntry_Text.WBP_Recollection_BossRush_RecordEntry_Text_C
// 0x0020 (0x0480 - 0x0460)
class UWBP_Recollection_BossRush_RecordEntry_Text_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UScaleBox*                              ScaleBox;                                          // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TimeText;                                          // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EHorizontalAlignment                          TextHorizontalAlignment;                           // 0x0478(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Set_Record_Text(const struct FRecollectionBossRushRecordData& RecordData);
	void PreConstruct(bool IsDesignTime);
	bool IsRecordDataValid(const struct FRecollectionBossRushRecordData& RecordData);
	void ExecuteUbergraph_WBP_Recollection_BossRush_RecordEntry_Text(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Recollection_BossRush_RecordEntry_Text_C">();
	}
	static class UWBP_Recollection_BossRush_RecordEntry_Text_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Recollection_BossRush_RecordEntry_Text_C>();
	}
};
static_assert(alignof(UWBP_Recollection_BossRush_RecordEntry_Text_C) == 0x000008, "Wrong alignment on UWBP_Recollection_BossRush_RecordEntry_Text_C");
static_assert(sizeof(UWBP_Recollection_BossRush_RecordEntry_Text_C) == 0x000480, "Wrong size on UWBP_Recollection_BossRush_RecordEntry_Text_C");
static_assert(offsetof(UWBP_Recollection_BossRush_RecordEntry_Text_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Recollection_BossRush_RecordEntry_Text_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_RecordEntry_Text_C, ScaleBox) == 0x000468, "Member 'UWBP_Recollection_BossRush_RecordEntry_Text_C::ScaleBox' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_RecordEntry_Text_C, TimeText) == 0x000470, "Member 'UWBP_Recollection_BossRush_RecordEntry_Text_C::TimeText' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_RecordEntry_Text_C, TextHorizontalAlignment) == 0x000478, "Member 'UWBP_Recollection_BossRush_RecordEntry_Text_C::TextHorizontalAlignment' has a wrong offset!");

}

