#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Recollection_Page_Bosses

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Recollection_Page_Bosses.WBP_Recollection_Page_Bosses_C
// 0x0090 (0x04F0 - 0x0460)
class UWBP_Recollection_Page_Bosses_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUniformGridPanelZion*                  Container;                                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Difficulty;                                   // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_DifficultyContainer;                   // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Recollection_Boss_NGSelection_C*   WBP_Recollection_Boss_NGSelection;                 // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Scrollbox_C*                       WBP_Scrollbox;                                     // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SeparateLine2_C*                   WBP_SeparateLine2;                                 // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDataTable*                             BossesDataTable;                                   // 0x0498(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFadeDescriptionData                   FadeDescription;                                   // 0x04A0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor)
	TMulticastInlineDelegate<void(const struct FDataTableRowHandle& RecollectionBossData)> OnRequestStartRecollectionBoss; // 0x04C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UWBP_Recollection_Button_C*>     Entries;                                           // 0x04D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FFooterData>                    DefaultFooterEntries;                              // 0x04E0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)

public:
	void BndEvt__WBP_Recollection_Page_Bosses_WBP_Recollection_Boss_NGSelection_K2Node_ComponentBoundEvent_0_OnFocused__DelegateSignature();
	void Construct();
	class UWidget* DoCustomNavigation(EUINavigation Navigation_0);
	void ExecuteUbergraph_WBP_Recollection_Page_Bosses(int32 EntryPoint);
	void FocusBossEntry(const struct FDataTableRowHandle& RecollectionBossHandle);
	void GenerateEntries();
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnButtonPressed(class UWBP_Recollection_Button_C* Button, const struct FKeyEvent& KeyEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void PreConstruct(bool IsDesignTime);
	void RequestStartRecollectionBoss();
	void SetupNavigation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Recollection_Page_Bosses_C">();
	}
	static class UWBP_Recollection_Page_Bosses_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Recollection_Page_Bosses_C>();
	}
};
static_assert(alignof(UWBP_Recollection_Page_Bosses_C) == 0x000008, "Wrong alignment on UWBP_Recollection_Page_Bosses_C");
static_assert(sizeof(UWBP_Recollection_Page_Bosses_C) == 0x0004F0, "Wrong size on UWBP_Recollection_Page_Bosses_C");
static_assert(offsetof(UWBP_Recollection_Page_Bosses_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Recollection_Page_Bosses_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_Bosses_C, Container) == 0x000468, "Member 'UWBP_Recollection_Page_Bosses_C::Container' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_Bosses_C, Text_Difficulty) == 0x000470, "Member 'UWBP_Recollection_Page_Bosses_C::Text_Difficulty' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_Bosses_C, VerticalBox_DifficultyContainer) == 0x000478, "Member 'UWBP_Recollection_Page_Bosses_C::VerticalBox_DifficultyContainer' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_Bosses_C, WBP_Recollection_Boss_NGSelection) == 0x000480, "Member 'UWBP_Recollection_Page_Bosses_C::WBP_Recollection_Boss_NGSelection' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_Bosses_C, WBP_Scrollbox) == 0x000488, "Member 'UWBP_Recollection_Page_Bosses_C::WBP_Scrollbox' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_Bosses_C, WBP_SeparateLine2) == 0x000490, "Member 'UWBP_Recollection_Page_Bosses_C::WBP_SeparateLine2' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_Bosses_C, BossesDataTable) == 0x000498, "Member 'UWBP_Recollection_Page_Bosses_C::BossesDataTable' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_Bosses_C, FadeDescription) == 0x0004A0, "Member 'UWBP_Recollection_Page_Bosses_C::FadeDescription' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_Bosses_C, OnRequestStartRecollectionBoss) == 0x0004C0, "Member 'UWBP_Recollection_Page_Bosses_C::OnRequestStartRecollectionBoss' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_Bosses_C, Entries) == 0x0004D0, "Member 'UWBP_Recollection_Page_Bosses_C::Entries' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_Bosses_C, DefaultFooterEntries) == 0x0004E0, "Member 'UWBP_Recollection_Page_Bosses_C::DefaultFooterEntries' has a wrong offset!");

}

