#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_Entry_FPS

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Settings_Entry_FPS.WBP_Settings_Entry_FPS_C
// 0x0028 (0x0488 - 0x0460)
class UWBP_Settings_Entry_FPS_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Settings_Entry_Choice_Toggle_C*    WBP_Settings_Entry_Choice_FPSLimit;                // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_Entry_Slider_C*           WBP_Settings_Entry_Slider_FPS;                     // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        DefaultFPS;                                        // 0x0478(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SavedFPS;                                          // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Settings_Entry_FPS_WBP_Settings_Entry_Choice_FPSLimit_K2Node_ComponentBoundEvent_1_OnToggle__DelegateSignature(bool ToggleValue);
	void BndEvt__WBP_Settings_Entry_FPS_WBP_Settings_Entry_Slider_FPS_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature(double Value);
	void Construct();
	void ExecuteUbergraph_WBP_Settings_Entry_FPS(int32 EntryPoint);
	void IsSliderEnabled(bool* IsSliderEnabled_0);
	void OnSetIsEnabled(bool bInIsEnabled);
	void Refresh();
	void Reset();
	void SetFPS(double FPS);
	void SetSliderEnabled();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Settings_Entry_FPS_C">();
	}
	static class UWBP_Settings_Entry_FPS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Settings_Entry_FPS_C>();
	}
};
static_assert(alignof(UWBP_Settings_Entry_FPS_C) == 0x000008, "Wrong alignment on UWBP_Settings_Entry_FPS_C");
static_assert(sizeof(UWBP_Settings_Entry_FPS_C) == 0x000488, "Wrong size on UWBP_Settings_Entry_FPS_C");
static_assert(offsetof(UWBP_Settings_Entry_FPS_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Settings_Entry_FPS_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_FPS_C, WBP_Settings_Entry_Choice_FPSLimit) == 0x000468, "Member 'UWBP_Settings_Entry_FPS_C::WBP_Settings_Entry_Choice_FPSLimit' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_FPS_C, WBP_Settings_Entry_Slider_FPS) == 0x000470, "Member 'UWBP_Settings_Entry_FPS_C::WBP_Settings_Entry_Slider_FPS' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_FPS_C, DefaultFPS) == 0x000478, "Member 'UWBP_Settings_Entry_FPS_C::DefaultFPS' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_FPS_C, SavedFPS) == 0x000480, "Member 'UWBP_Settings_Entry_FPS_C::SavedFPS' has a wrong offset!");

}

