#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Map

#include "Basic.hpp"

#include "Zion_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Map.WBP_Map_C.ExecuteUbergraph_WBP_Map
// 0x0418 (0x0418 - 0x0000)
struct WBP_Map_C_ExecuteUbergraph_WBP_Map final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0024(0x0008)(NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidgetMapIcon*                     K2Node_Event_MapIcon_1;                            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidgetMapIcon*                     K2Node_Event_MapIcon;                              // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInstant_1;                           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UUserWidgetMapIconDetails>  CallFunc_GetWidgetIconDetailsClass_ReturnValue;    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UUserWidgetMapIconDetails*              CallFunc_Create_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FMapRestPointData& MapRestPointData)> K2Node_CreateDelegate_OutputDelegate_1; // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMapRestPointData                      K2Node_CustomEvent_MapRestPointData;               // 0x006C(0x0008)(NoDestructor)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeZion*                          CallFunc_Get_ReturnValue;                          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             CallFunc_GetDataTableRestPoints_ReturnValue;       // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Dialog_OK_C*                       CallFunc_Create_ReturnValue_1;                     // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRestPointData                         CallFunc_GetDataTableRowFromName_OutRow;           // 0x0090(0x0088)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidgetMapArea*                     K2Node_Event_MapArea_1;                            // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetMapName_ReturnValue;                   // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCompletionPercentage_ReturnValue;      // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMapAreaVisited_ReturnValue;             // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_136[0x2];                                      // 0x0136(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidgetMapArea*                     K2Node_Event_MapArea;                              // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AGameModeZion*                          CallFunc_Get_ReturnValue_1;                        // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             CallFunc_GetDataTableGameMaps_ReturnValue;         // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameMapData                           CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0158(0x0140)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29A[0x6];                                      // 0x029A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x02A0(0x0010)(ConstParm)
	class UWBP_MapCursor_C*                       K2Node_DynamicCast_AsWBP_Map_Cursor;               // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MapCursor_C*                       K2Node_DynamicCast_AsWBP_Map_Cursor_1;             // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CA[0x6];                                      // 0x02CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Dialog_YesNo_C*                    CallFunc_Create_ReturnValue_2;                     // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x02D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidgetMapIcon_RestPoint*           K2Node_CustomEvent_RestPointIcon;                  // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_RestPointList_C*                   K2Node_DynamicCast_AsWBP_Rest_Point_List;          // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x3];                                      // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUserWidgetMapIcon_RestPoint* RestPointIcon)> K2Node_CreateDelegate_OutputDelegate_3; // 0x02FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRestPointListOpened_ReturnValue;        // 0x030D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x030E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRestPointListOpened_ReturnValue_1;      // 0x030F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRestPointListOpened_ReturnValue_2;      // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FMapRestPointData& RestPointData)> K2Node_CreateDelegate_OutputDelegate_4; // 0x0314(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_325[0x3];                                      // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue_2;                        // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAptitude_ReturnValue;                  // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFastTravelLocked_ReturnValue;           // 0x0332(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_333[0x1];                                      // 0x0333(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0334(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0344(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0345(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_346[0x2];                                      // 0x0346(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0358(0x0010)(ConstParm)
	int32                                         CallFunc_GetUMGZOrder_ReturnValue;                 // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bRestPointListOpened;                 // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInstant;                             // 0x036D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36E[0x2];                                      // 0x036E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidgetFooter*                      CallFunc_GetFooterWidget_FooterWidget;             // 0x0370(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanChangeMapArea_ReturnValue;             // 0x037A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRestPointListOpened_ReturnValue_3;      // 0x037B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x037C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasValidData_ReturnValue;                 // 0x037D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37E[0x2];                                      // 0x037E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0380(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38A[0x2];                                      // 0x038A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUserWidgetMapIcon_RestPoint* RestPointIcon)> K2Node_CreateDelegate_OutputDelegate_6; // 0x038C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_RestPointList_C*                   K2Node_DynamicCast_AsWBP_Rest_Point_List_1;        // 0x03A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x3];                                      // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FMapRestPointData& RestPointData)> K2Node_CreateDelegate_OutputDelegate_7; // 0x03AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x03BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Percentage;                           // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_MapIconDetails_CustomMarker_C*     K2Node_DynamicCast_AsWBP_Map_Icon_Details_Custom_Marker; // 0x03D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x03D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DA[0x6];                                      // 0x03DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MapIconDetails_RestPoint_C*        K2Node_DynamicCast_AsWBP_Map_Icon_Details_Rest_Point; // 0x03E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x03F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUserWidgetMapIcon_CustomMarker* CustomMarkerIcon)> K2Node_CreateDelegate_OutputDelegate_9; // 0x03F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_CurrentHoldingTime;                   // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_HoldingDuration;                      // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Alpha;                                // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_C_ExecuteUbergraph_WBP_Map) == 0x000008, "Wrong alignment on WBP_Map_C_ExecuteUbergraph_WBP_Map");
static_assert(sizeof(WBP_Map_C_ExecuteUbergraph_WBP_Map) == 0x000418, "Wrong size on WBP_Map_C_ExecuteUbergraph_WBP_Map");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, EntryPoint) == 0x000000, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_PlayUMGAnimation_ReturnValue) == 0x000008, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_PlayUMGAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_Event_InFocusEvent) == 0x000024, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_Event_MapIcon_1) == 0x000030, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_Event_MapIcon_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_Event_MapIcon) == 0x000038, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_Event_MapIcon' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_Event_bInstant_1) == 0x000040, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_Event_bInstant_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_GetWidgetIconDetailsClass_ReturnValue) == 0x000048, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_GetWidgetIconDetailsClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_Create_ReturnValue) == 0x000050, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_IsValidClass_ReturnValue) == 0x000058, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_CreateDelegate_OutputDelegate_1) == 0x00005C, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_CustomEvent_MapRestPointData) == 0x00006C, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_CustomEvent_MapRestPointData' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_Get_ReturnValue) == 0x000078, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_GetDataTableRestPoints_ReturnValue) == 0x000080, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_GetDataTableRestPoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_Create_ReturnValue_1) == 0x000088, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_GetDataTableRowFromName_OutRow) == 0x000090, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000118, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_Event_MapArea_1) == 0x000120, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_Event_MapArea_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_GetMapName_ReturnValue) == 0x000128, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_GetMapName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_GetCompletionPercentage_ReturnValue) == 0x000130, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_GetCompletionPercentage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_IsMapAreaVisited_ReturnValue) == 0x000134, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_IsMapAreaVisited_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_IsValid_ReturnValue_1) == 0x000135, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_Event_MapArea) == 0x000138, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_Event_MapArea' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_Get_ReturnValue_1) == 0x000140, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_IsValid_ReturnValue_2) == 0x000148, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_GetDataTableGameMaps_ReturnValue) == 0x000150, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_GetDataTableGameMaps_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000158, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000298, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_IsValid_ReturnValue_3) == 0x000299, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, Temp_text_Variable) == 0x0002A0, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_DynamicCast_AsWBP_Map_Cursor) == 0x0002B0, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_DynamicCast_AsWBP_Map_Cursor' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_DynamicCast_bSuccess) == 0x0002B8, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_DynamicCast_AsWBP_Map_Cursor_1) == 0x0002C0, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_DynamicCast_AsWBP_Map_Cursor_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_DynamicCast_bSuccess_1) == 0x0002C8, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, Temp_bool_Variable) == 0x0002C9, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_Create_ReturnValue_2) == 0x0002D0, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_CreateDelegate_OutputDelegate_2) == 0x0002D8, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_CustomEvent_RestPointIcon) == 0x0002E8, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_CustomEvent_RestPointIcon' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_DynamicCast_AsWBP_Rest_Point_List) == 0x0002F0, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_DynamicCast_AsWBP_Rest_Point_List' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_DynamicCast_bSuccess_2) == 0x0002F8, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_CreateDelegate_OutputDelegate_3) == 0x0002FC, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_IsValid_ReturnValue_4) == 0x00030C, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_IsRestPointListOpened_ReturnValue) == 0x00030D, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_IsRestPointListOpened_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_Not_PreBool_ReturnValue) == 0x00030E, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_IsRestPointListOpened_ReturnValue_1) == 0x00030F, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_IsRestPointListOpened_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_IsRestPointListOpened_ReturnValue_2) == 0x000310, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_IsRestPointListOpened_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_CreateDelegate_OutputDelegate_4) == 0x000314, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_Not_PreBool_ReturnValue_1) == 0x000324, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_Get_ReturnValue_2) == 0x000328, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_Get_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_IsValid_ReturnValue_5) == 0x000330, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_HasAptitude_ReturnValue) == 0x000331, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_HasAptitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_IsFastTravelLocked_ReturnValue) == 0x000332, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_IsFastTravelLocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_CreateDelegate_OutputDelegate_5) == 0x000334, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_Not_PreBool_ReturnValue_2) == 0x000344, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_BooleanAND_ReturnValue) == 0x000345, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_SelectFloat_ReturnValue) == 0x000348, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_BooleanOR_ReturnValue) == 0x000350, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, Temp_text_Variable_1) == 0x000358, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_GetUMGZOrder_ReturnValue) == 0x000368, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_GetUMGZOrder_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_Event_bRestPointListOpened) == 0x00036C, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_Event_bRestPointListOpened' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_Event_bInstant) == 0x00036D, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_Event_bInstant' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_GetFooterWidget_FooterWidget) == 0x000370, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_GetFooterWidget_FooterWidget' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_Not_PreBool_ReturnValue_3) == 0x000378, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_Not_PreBool_ReturnValue_4) == 0x000379, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_CanChangeMapArea_ReturnValue) == 0x00037A, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_CanChangeMapArea_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_IsRestPointListOpened_ReturnValue_3) == 0x00037B, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_IsRestPointListOpened_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_Not_PreBool_ReturnValue_5) == 0x00037C, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_HasValidData_ReturnValue) == 0x00037D, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_HasValidData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_Select_Default) == 0x000380, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_IsValid_ReturnValue_6) == 0x000388, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_IsValid_ReturnValue_7) == 0x000389, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_CreateDelegate_OutputDelegate_6) == 0x00038C, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_DynamicCast_AsWBP_Rest_Point_List_1) == 0x0003A0, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_DynamicCast_AsWBP_Rest_Point_List_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_DynamicCast_bSuccess_3) == 0x0003A8, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_CreateDelegate_OutputDelegate_7) == 0x0003AC, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_CreateDelegate_OutputDelegate_8) == 0x0003BC, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_Event_Percentage) == 0x0003CC, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_Event_Percentage' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_DynamicCast_AsWBP_Map_Icon_Details_Custom_Marker) == 0x0003D0, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_DynamicCast_AsWBP_Map_Icon_Details_Custom_Marker' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_DynamicCast_bSuccess_4) == 0x0003D8, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_BooleanAND_ReturnValue_1) == 0x0003D9, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_DynamicCast_AsWBP_Map_Icon_Details_Rest_Point) == 0x0003E0, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_DynamicCast_AsWBP_Map_Icon_Details_Rest_Point' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_DynamicCast_bSuccess_5) == 0x0003E8, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_AddChild_ReturnValue) == 0x0003F0, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_CreateDelegate_OutputDelegate_9) == 0x0003F8, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_Event_CurrentHoldingTime) == 0x000408, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_Event_CurrentHoldingTime' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_Event_HoldingDuration) == 0x00040C, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_Event_HoldingDuration' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, K2Node_Event_Alpha) == 0x000410, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::K2Node_Event_Alpha' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_ExecuteUbergraph_WBP_Map, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000414, "Member 'WBP_Map_C_ExecuteUbergraph_WBP_Map::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_Map.WBP_Map_C.GetFooterWidget
// 0x0018 (0x0018 - 0x0000)
struct WBP_Map_C_GetFooterWidget final
{
public:
	class UUserWidgetFooter*                      FooterWidget;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidgetFooter*                      K2Node_Select_Default;                             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_C_GetFooterWidget) == 0x000008, "Wrong alignment on WBP_Map_C_GetFooterWidget");
static_assert(sizeof(WBP_Map_C_GetFooterWidget) == 0x000018, "Wrong size on WBP_Map_C_GetFooterWidget");
static_assert(offsetof(WBP_Map_C_GetFooterWidget, FooterWidget) == 0x000000, "Member 'WBP_Map_C_GetFooterWidget::FooterWidget' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_GetFooterWidget, Temp_bool_Variable) == 0x000008, "Member 'WBP_Map_C_GetFooterWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_GetFooterWidget, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'WBP_Map_C_GetFooterWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_GetFooterWidget, K2Node_Select_Default) == 0x000010, "Member 'WBP_Map_C_GetFooterWidget::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Map.WBP_Map_C.OnCalculateMapCompletionPercentage
// 0x0004 (0x0004 - 0x0000)
struct WBP_Map_C_OnCalculateMapCompletionPercentage final
{
public:
	int32                                         Percentage;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_C_OnCalculateMapCompletionPercentage) == 0x000004, "Wrong alignment on WBP_Map_C_OnCalculateMapCompletionPercentage");
static_assert(sizeof(WBP_Map_C_OnCalculateMapCompletionPercentage) == 0x000004, "Wrong size on WBP_Map_C_OnCalculateMapCompletionPercentage");
static_assert(offsetof(WBP_Map_C_OnCalculateMapCompletionPercentage, Percentage) == 0x000000, "Member 'WBP_Map_C_OnCalculateMapCompletionPercentage::Percentage' has a wrong offset!");

// Function WBP_Map.WBP_Map_C.OnChangeMapAreaUnderCursor
// 0x0008 (0x0008 - 0x0000)
struct WBP_Map_C_OnChangeMapAreaUnderCursor final
{
public:
	class UUserWidgetMapArea*                     MapArea;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_C_OnChangeMapAreaUnderCursor) == 0x000008, "Wrong alignment on WBP_Map_C_OnChangeMapAreaUnderCursor");
static_assert(sizeof(WBP_Map_C_OnChangeMapAreaUnderCursor) == 0x000008, "Wrong size on WBP_Map_C_OnChangeMapAreaUnderCursor");
static_assert(offsetof(WBP_Map_C_OnChangeMapAreaUnderCursor, MapArea) == 0x000000, "Member 'WBP_Map_C_OnChangeMapAreaUnderCursor::MapArea' has a wrong offset!");

// Function WBP_Map.WBP_Map_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_Map_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Map_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_Map_C_OnFocusLost");
static_assert(sizeof(WBP_Map_C_OnFocusLost) == 0x000008, "Wrong size on WBP_Map_C_OnFocusLost");
static_assert(offsetof(WBP_Map_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_Map_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_Map.WBP_Map_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Map_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Map_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Map_C_OnFocusReceived");
static_assert(sizeof(WBP_Map_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_Map_C_OnFocusReceived");
static_assert(offsetof(WBP_Map_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Map_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Map_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Map_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Map_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Map.WBP_Map_C.OnPressCancel
// 0x0268 (0x0268 - 0x0000)
struct WBP_Map_C_OnPressCancel final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x00F8(0x00B8)()
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x01B0(0x00B8)()
};
static_assert(alignof(WBP_Map_C_OnPressCancel) == 0x000008, "Wrong alignment on WBP_Map_C_OnPressCancel");
static_assert(sizeof(WBP_Map_C_OnPressCancel) == 0x000268, "Wrong size on WBP_Map_C_OnPressCancel");
static_assert(offsetof(WBP_Map_C_OnPressCancel, KeyEvent) == 0x000000, "Member 'WBP_Map_C_OnPressCancel::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_OnPressCancel, ReturnValue) == 0x000040, "Member 'WBP_Map_C_OnPressCancel::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_OnPressCancel, CallFunc_Unhandled_ReturnValue) == 0x0000F8, "Member 'WBP_Map_C_OnPressCancel::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_OnPressCancel, CallFunc_Handled_ReturnValue) == 0x0001B0, "Member 'WBP_Map_C_OnPressCancel::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Map.WBP_Map_C.OnReachedTargetedIcon
// 0x0008 (0x0008 - 0x0000)
struct WBP_Map_C_OnReachedTargetedIcon final
{
public:
	class UUserWidgetMapIcon*                     MapIcon;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_C_OnReachedTargetedIcon) == 0x000008, "Wrong alignment on WBP_Map_C_OnReachedTargetedIcon");
static_assert(sizeof(WBP_Map_C_OnReachedTargetedIcon) == 0x000008, "Wrong size on WBP_Map_C_OnReachedTargetedIcon");
static_assert(offsetof(WBP_Map_C_OnReachedTargetedIcon, MapIcon) == 0x000000, "Member 'WBP_Map_C_OnReachedTargetedIcon::MapIcon' has a wrong offset!");

// Function WBP_Map.WBP_Map_C.OnRefreshRemoveAllCustomMarkersHoldTime
// 0x000C (0x000C - 0x0000)
struct WBP_Map_C_OnRefreshRemoveAllCustomMarkersHoldTime final
{
public:
	float                                         CurrentHoldingTime;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HoldingDuration;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Alpha;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_C_OnRefreshRemoveAllCustomMarkersHoldTime) == 0x000004, "Wrong alignment on WBP_Map_C_OnRefreshRemoveAllCustomMarkersHoldTime");
static_assert(sizeof(WBP_Map_C_OnRefreshRemoveAllCustomMarkersHoldTime) == 0x00000C, "Wrong size on WBP_Map_C_OnRefreshRemoveAllCustomMarkersHoldTime");
static_assert(offsetof(WBP_Map_C_OnRefreshRemoveAllCustomMarkersHoldTime, CurrentHoldingTime) == 0x000000, "Member 'WBP_Map_C_OnRefreshRemoveAllCustomMarkersHoldTime::CurrentHoldingTime' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_OnRefreshRemoveAllCustomMarkersHoldTime, HoldingDuration) == 0x000004, "Member 'WBP_Map_C_OnRefreshRemoveAllCustomMarkersHoldTime::HoldingDuration' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_OnRefreshRemoveAllCustomMarkersHoldTime, Alpha) == 0x000008, "Member 'WBP_Map_C_OnRefreshRemoveAllCustomMarkersHoldTime::Alpha' has a wrong offset!");

// Function WBP_Map.WBP_Map_C.OnRequestFastTravel
// 0x0008 (0x0008 - 0x0000)
struct WBP_Map_C_OnRequestFastTravel final
{
public:
	struct FMapRestPointData                      MapRestPointData;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Map_C_OnRequestFastTravel) == 0x000004, "Wrong alignment on WBP_Map_C_OnRequestFastTravel");
static_assert(sizeof(WBP_Map_C_OnRequestFastTravel) == 0x000008, "Wrong size on WBP_Map_C_OnRequestFastTravel");
static_assert(offsetof(WBP_Map_C_OnRequestFastTravel, MapRestPointData) == 0x000000, "Member 'WBP_Map_C_OnRequestFastTravel::MapRestPointData' has a wrong offset!");

// Function WBP_Map.WBP_Map_C.OnResetMapAreaUnderCursor
// 0x0008 (0x0008 - 0x0000)
struct WBP_Map_C_OnResetMapAreaUnderCursor final
{
public:
	class UUserWidgetMapArea*                     MapArea;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_C_OnResetMapAreaUnderCursor) == 0x000008, "Wrong alignment on WBP_Map_C_OnResetMapAreaUnderCursor");
static_assert(sizeof(WBP_Map_C_OnResetMapAreaUnderCursor) == 0x000008, "Wrong size on WBP_Map_C_OnResetMapAreaUnderCursor");
static_assert(offsetof(WBP_Map_C_OnResetMapAreaUnderCursor, MapArea) == 0x000000, "Member 'WBP_Map_C_OnResetMapAreaUnderCursor::MapArea' has a wrong offset!");

// Function WBP_Map.WBP_Map_C.OnResetTargetedIcon
// 0x0010 (0x0010 - 0x0000)
struct WBP_Map_C_OnResetTargetedIcon final
{
public:
	class UUserWidgetMapIcon*                     MapIcon;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bInstant;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_C_OnResetTargetedIcon) == 0x000008, "Wrong alignment on WBP_Map_C_OnResetTargetedIcon");
static_assert(sizeof(WBP_Map_C_OnResetTargetedIcon) == 0x000010, "Wrong size on WBP_Map_C_OnResetTargetedIcon");
static_assert(offsetof(WBP_Map_C_OnResetTargetedIcon, MapIcon) == 0x000000, "Member 'WBP_Map_C_OnResetTargetedIcon::MapIcon' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_OnResetTargetedIcon, bInstant) == 0x000008, "Member 'WBP_Map_C_OnResetTargetedIcon::bInstant' has a wrong offset!");

// Function WBP_Map.WBP_Map_C.OnRestPointListEntryFocused
// 0x0008 (0x0008 - 0x0000)
struct WBP_Map_C_OnRestPointListEntryFocused final
{
public:
	class UUserWidgetMapIcon_RestPoint*           RestPointIcon;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_C_OnRestPointListEntryFocused) == 0x000008, "Wrong alignment on WBP_Map_C_OnRestPointListEntryFocused");
static_assert(sizeof(WBP_Map_C_OnRestPointListEntryFocused) == 0x000008, "Wrong size on WBP_Map_C_OnRestPointListEntryFocused");
static_assert(offsetof(WBP_Map_C_OnRestPointListEntryFocused, RestPointIcon) == 0x000000, "Member 'WBP_Map_C_OnRestPointListEntryFocused::RestPointIcon' has a wrong offset!");

// Function WBP_Map.WBP_Map_C.OnToggleRestPointList
// 0x0002 (0x0002 - 0x0000)
struct WBP_Map_C_OnToggleRestPointList final
{
public:
	bool                                          bRestPointListOpened;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInstant;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_C_OnToggleRestPointList) == 0x000001, "Wrong alignment on WBP_Map_C_OnToggleRestPointList");
static_assert(sizeof(WBP_Map_C_OnToggleRestPointList) == 0x000002, "Wrong size on WBP_Map_C_OnToggleRestPointList");
static_assert(offsetof(WBP_Map_C_OnToggleRestPointList, bRestPointListOpened) == 0x000000, "Member 'WBP_Map_C_OnToggleRestPointList::bRestPointListOpened' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_OnToggleRestPointList, bInstant) == 0x000001, "Member 'WBP_Map_C_OnToggleRestPointList::bInstant' has a wrong offset!");

// Function WBP_Map.WBP_Map_C.RefreshCustomMarkerAvailableCount
// 0x0004 (0x0004 - 0x0000)
struct WBP_Map_C_RefreshCustomMarkerAvailableCount final
{
public:
	int32                                         CallFunc_GetCustomMarkerAvailableCount_ReturnValue; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_C_RefreshCustomMarkerAvailableCount) == 0x000004, "Wrong alignment on WBP_Map_C_RefreshCustomMarkerAvailableCount");
static_assert(sizeof(WBP_Map_C_RefreshCustomMarkerAvailableCount) == 0x000004, "Wrong size on WBP_Map_C_RefreshCustomMarkerAvailableCount");
static_assert(offsetof(WBP_Map_C_RefreshCustomMarkerAvailableCount, CallFunc_GetCustomMarkerAvailableCount_ReturnValue) == 0x000000, "Member 'WBP_Map_C_RefreshCustomMarkerAvailableCount::CallFunc_GetCustomMarkerAvailableCount_ReturnValue' has a wrong offset!");

// Function WBP_Map.WBP_Map_C.SetFooterWidgetOverride
// 0x0010 (0x0010 - 0x0000)
struct WBP_Map_C_SetFooterWidgetOverride final
{
public:
	class UUserWidgetFooter*                      FooterWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_C_SetFooterWidgetOverride) == 0x000008, "Wrong alignment on WBP_Map_C_SetFooterWidgetOverride");
static_assert(sizeof(WBP_Map_C_SetFooterWidgetOverride) == 0x000010, "Wrong size on WBP_Map_C_SetFooterWidgetOverride");
static_assert(offsetof(WBP_Map_C_SetFooterWidgetOverride, FooterWidget) == 0x000000, "Member 'WBP_Map_C_SetFooterWidgetOverride::FooterWidget' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_SetFooterWidgetOverride, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_Map_C_SetFooterWidgetOverride::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_Map.WBP_Map_C.SetRetainerBoxRetainRender
// 0x0001 (0x0001 - 0x0000)
struct WBP_Map_C_SetRetainerBoxRetainRender final
{
public:
	bool                                          Retain_Render;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_C_SetRetainerBoxRetainRender) == 0x000001, "Wrong alignment on WBP_Map_C_SetRetainerBoxRetainRender");
static_assert(sizeof(WBP_Map_C_SetRetainerBoxRetainRender) == 0x000001, "Wrong size on WBP_Map_C_SetRetainerBoxRetainRender");
static_assert(offsetof(WBP_Map_C_SetRetainerBoxRetainRender, Retain_Render) == 0x000000, "Member 'WBP_Map_C_SetRetainerBoxRetainRender::Retain_Render' has a wrong offset!");

// Function WBP_Map.WBP_Map_C.SetupFooter
// 0x0040 (0x0040 - 0x0000)
struct WBP_Map_C_SetupFooter final
{
public:
	class UUserWidgetFooter*                      CallFunc_GetFooterWidget_FooterWidget;             // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasValidData_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidgetFooter*                      CallFunc_GetFooterWidget_FooterWidget_1;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidgetFooter*                      CallFunc_GetFooterWidget_FooterWidget_2;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidgetFooter*                      CallFunc_GetFooterWidget_FooterWidget_3;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidgetFooter*                      CallFunc_GetFooterWidget_FooterWidget_4;           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidgetFooter*                      CallFunc_GetFooterWidget_FooterWidget_5;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanChangeMapArea_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanBeOpened_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_C_SetupFooter) == 0x000008, "Wrong alignment on WBP_Map_C_SetupFooter");
static_assert(sizeof(WBP_Map_C_SetupFooter) == 0x000040, "Wrong size on WBP_Map_C_SetupFooter");
static_assert(offsetof(WBP_Map_C_SetupFooter, CallFunc_GetFooterWidget_FooterWidget) == 0x000000, "Member 'WBP_Map_C_SetupFooter::CallFunc_GetFooterWidget_FooterWidget' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_SetupFooter, CallFunc_HasValidData_ReturnValue) == 0x000008, "Member 'WBP_Map_C_SetupFooter::CallFunc_HasValidData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_SetupFooter, CallFunc_GetFooterWidget_FooterWidget_1) == 0x000010, "Member 'WBP_Map_C_SetupFooter::CallFunc_GetFooterWidget_FooterWidget_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_SetupFooter, CallFunc_GetFooterWidget_FooterWidget_2) == 0x000018, "Member 'WBP_Map_C_SetupFooter::CallFunc_GetFooterWidget_FooterWidget_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_C_SetupFooter, CallFunc_GetFooterWidget_FooterWidget_3) == 0x000020, "Member 'WBP_Map_C_SetupFooter::CallFunc_GetFooterWidget_FooterWidget_3' has a wrong offset!");
