#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Tips_Page

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Tips_Page.WBP_Tips_Page_C
// 0x0020 (0x0480 - 0x0460)
class UWBP_Tips_Page_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           TipsVerticalBox;                                   // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWBP_InventoryEntry_C* Entry)> OnTipsEntryFocused;           // 0x0470(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void AddTips(const struct FDataTableRowHandle& TipItemHandle, bool bOwned, bool bNew);
	void ExecuteUbergraph_WBP_Tips_Page(int32 EntryPoint);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnTipsFocused(class UWBP_InventoryEntry_C* Entry);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Tips_Page_C">();
	}
	static class UWBP_Tips_Page_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Tips_Page_C>();
	}
};
static_assert(alignof(UWBP_Tips_Page_C) == 0x000008, "Wrong alignment on UWBP_Tips_Page_C");
static_assert(sizeof(UWBP_Tips_Page_C) == 0x000480, "Wrong size on UWBP_Tips_Page_C");
static_assert(offsetof(UWBP_Tips_Page_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Tips_Page_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Tips_Page_C, TipsVerticalBox) == 0x000468, "Member 'UWBP_Tips_Page_C::TipsVerticalBox' has a wrong offset!");
static_assert(offsetof(UWBP_Tips_Page_C, OnTipsEntryFocused) == 0x000470, "Member 'UWBP_Tips_Page_C::OnTipsEntryFocused' has a wrong offset!");

}

