#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugMenu_Element_FocusDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DebugMenu_Element_FocusDisplay.WBP_DebugMenu_Element_FocusDisplay_C
// 0x0028 (0x0488 - 0x0460)
class UWBP_DebugMenu_Element_FocusDisplay_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNamedSlot*                             ContentSlot;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocusedBG;                                         // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_FocusContainerLeft;                        // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_FocusContainerRight;                       // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetFocusDisplay(bool Focused);
	void ExecuteUbergraph_WBP_DebugMenu_Element_FocusDisplay(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DebugMenu_Element_FocusDisplay_C">();
	}
	static class UWBP_DebugMenu_Element_FocusDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DebugMenu_Element_FocusDisplay_C>();
	}
};
static_assert(alignof(UWBP_DebugMenu_Element_FocusDisplay_C) == 0x000008, "Wrong alignment on UWBP_DebugMenu_Element_FocusDisplay_C");
static_assert(sizeof(UWBP_DebugMenu_Element_FocusDisplay_C) == 0x000488, "Wrong size on UWBP_DebugMenu_Element_FocusDisplay_C");
static_assert(offsetof(UWBP_DebugMenu_Element_FocusDisplay_C, UberGraphFrame) == 0x000460, "Member 'UWBP_DebugMenu_Element_FocusDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_FocusDisplay_C, ContentSlot) == 0x000468, "Member 'UWBP_DebugMenu_Element_FocusDisplay_C::ContentSlot' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_FocusDisplay_C, FocusedBG) == 0x000470, "Member 'UWBP_DebugMenu_Element_FocusDisplay_C::FocusedBG' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_FocusDisplay_C, Overlay_FocusContainerLeft) == 0x000478, "Member 'UWBP_DebugMenu_Element_FocusDisplay_C::Overlay_FocusContainerLeft' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_FocusDisplay_C, Overlay_FocusContainerRight) == 0x000480, "Member 'UWBP_DebugMenu_Element_FocusDisplay_C::Overlay_FocusContainerRight' has a wrong offset!");

}

