#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Recollection_BossRush_RecordEntry_Text

#include "Basic.hpp"

#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function WBP_Recollection_BossRush_RecordEntry_Text.WBP_Recollection_BossRush_RecordEntry_Text_C.Set Record Text
// 0x0050 (0x0050 - 0x0000)
struct WBP_Recollection_BossRush_RecordEntry_Text_C_Set_Record_Text final
{
public:
	struct FRecollectionBossRushRecordData        RecordData;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0010)()
	bool                                          CallFunc_IsRecordDataValid_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_BossRushRecordTimeSecondsToString_ReturnValue; // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x0040(0x0010)()
};
static_assert(alignof(WBP_Recollection_BossRush_RecordEntry_Text_C_Set_Record_Text) == 0x000008, "Wrong alignment on WBP_Recollection_BossRush_RecordEntry_Text_C_Set_Record_Text");
static_assert(sizeof(WBP_Recollection_BossRush_RecordEntry_Text_C_Set_Record_Text) == 0x000050, "Wrong size on WBP_Recollection_BossRush_RecordEntry_Text_C_Set_Record_Text");
static_assert(offsetof(WBP_Recollection_BossRush_RecordEntry_Text_C_Set_Record_Text, RecordData) == 0x000000, "Member 'WBP_Recollection_BossRush_RecordEntry_Text_C_Set_Record_Text::RecordData' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_RecordEntry_Text_C_Set_Record_Text, Temp_text_Variable) == 0x000008, "Member 'WBP_Recollection_BossRush_RecordEntry_Text_C_Set_Record_Text::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_RecordEntry_Text_C_Set_Record_Text, CallFunc_IsRecordDataValid_ReturnValue) == 0x000018, "Member 'WBP_Recollection_BossRush_RecordEntry_Text_C_Set_Record_Text::CallFunc_IsRecordDataValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_RecordEntry_Text_C_Set_Record_Text, Temp_bool_Variable) == 0x000019, "Member 'WBP_Recollection_BossRush_RecordEntry_Text_C_Set_Record_Text::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_RecordEntry_Text_C_Set_Record_Text, CallFunc_BossRushRecordTimeSecondsToString_ReturnValue) == 0x000020, "Member 'WBP_Recollection_BossRush_RecordEntry_Text_C_Set_Record_Text::CallFunc_BossRushRecordTimeSecondsToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_RecordEntry_Text_C_Set_Record_Text, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'WBP_Recollection_BossRush_RecordEntry_Text_C_Set_Record_Text::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_RecordEntry_Text_C_Set_Record_Text, K2Node_Select_Default) == 0x000040, "Member 'WBP_Recollection_BossRush_RecordEntry_Text_C_Set_Record_Text::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Recollection_BossRush_RecordEntry_Text.WBP_Recollection_BossRush_RecordEntry_Text_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Recollection_BossRush_RecordEntry_Text_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_BossRush_RecordEntry_Text_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Recollection_BossRush_RecordEntry_Text_C_PreConstruct");
static_assert(sizeof(WBP_Recollection_BossRush_RecordEntry_Text_C_PreConstruct) == 0x000001, "Wrong size on WBP_Recollection_BossRush_RecordEntry_Text_C_PreConstruct");
static_assert(offsetof(WBP_Recollection_BossRush_RecordEntry_Text_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Recollection_BossRush_RecordEntry_Text_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Recollection_BossRush_RecordEntry_Text.WBP_Recollection_BossRush_RecordEntry_Text_C.IsRecordDataValid
// 0x0010 (0x0010 - 0x0000)
struct WBP_Recollection_BossRush_RecordEntry_Text_C_IsRecordDataValid final
{
public:
	struct FRecollectionBossRushRecordData        RecordData;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_BossRush_RecordEntry_Text_C_IsRecordDataValid) == 0x000008, "Wrong alignment on WBP_Recollection_BossRush_RecordEntry_Text_C_IsRecordDataValid");
static_assert(sizeof(WBP_Recollection_BossRush_RecordEntry_Text_C_IsRecordDataValid) == 0x000010, "Wrong size on WBP_Recollection_BossRush_RecordEntry_Text_C_IsRecordDataValid");
static_assert(offsetof(WBP_Recollection_BossRush_RecordEntry_Text_C_IsRecordDataValid, RecordData) == 0x000000, "Member 'WBP_Recollection_BossRush_RecordEntry_Text_C_IsRecordDataValid::RecordData' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_RecordEntry_Text_C_IsRecordDataValid, ReturnValue) == 0x000004, "Member 'WBP_Recollection_BossRush_RecordEntry_Text_C_IsRecordDataValid::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_RecordEntry_Text_C_IsRecordDataValid, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000005, "Member 'WBP_Recollection_BossRush_RecordEntry_Text_C_IsRecordDataValid::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_RecordEntry_Text_C_IsRecordDataValid, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000008, "Member 'WBP_Recollection_BossRush_RecordEntry_Text_C_IsRecordDataValid::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_Recollection_BossRush_RecordEntry_Text.WBP_Recollection_BossRush_RecordEntry_Text_C.ExecuteUbergraph_WBP_Recollection_BossRush_RecordEntry_Text
// 0x0018 (0x0018 - 0x0000)
struct WBP_Recollection_BossRush_RecordEntry_Text_C_ExecuteUbergraph_WBP_Recollection_BossRush_RecordEntry_Text final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USizeBoxSlot*                           CallFunc_SlotAsSizeBoxSlot_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_BossRush_RecordEntry_Text_C_ExecuteUbergraph_WBP_Recollection_BossRush_RecordEntry_Text) == 0x000008, "Wrong alignment on WBP_Recollection_BossRush_RecordEntry_Text_C_ExecuteUbergraph_WBP_Recollection_BossRush_RecordEntry_Text");
static_assert(sizeof(WBP_Recollection_BossRush_RecordEntry_Text_C_ExecuteUbergraph_WBP_Recollection_BossRush_RecordEntry_Text) == 0x000018, "Wrong size on WBP_Recollection_BossRush_RecordEntry_Text_C_ExecuteUbergraph_WBP_Recollection_BossRush_RecordEntry_Text");
static_assert(offsetof(WBP_Recollection_BossRush_RecordEntry_Text_C_ExecuteUbergraph_WBP_Recollection_BossRush_RecordEntry_Text, EntryPoint) == 0x000000, "Member 'WBP_Recollection_BossRush_RecordEntry_Text_C_ExecuteUbergraph_WBP_Recollection_BossRush_RecordEntry_Text::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_RecordEntry_Text_C_ExecuteUbergraph_WBP_Recollection_BossRush_RecordEntry_Text, CallFunc_SlotAsSizeBoxSlot_ReturnValue) == 0x000008, "Member 'WBP_Recollection_BossRush_RecordEntry_Text_C_ExecuteUbergraph_WBP_Recollection_BossRush_RecordEntry_Text::CallFunc_SlotAsSizeBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_RecordEntry_Text_C_ExecuteUbergraph_WBP_Recollection_BossRush_RecordEntry_Text, K2Node_Event_IsDesignTime) == 0x000010, "Member 'WBP_Recollection_BossRush_RecordEntry_Text_C_ExecuteUbergraph_WBP_Recollection_BossRush_RecordEntry_Text::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_RecordEntry_Text_C_ExecuteUbergraph_WBP_Recollection_BossRush_RecordEntry_Text, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'WBP_Recollection_BossRush_RecordEntry_Text_C_ExecuteUbergraph_WBP_Recollection_BossRush_RecordEntry_Text::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

