#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_Entry_Slider_DeadZone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Settings_Entry_Slider_DeadZone.WBP_Settings_Entry_Slider_DeadZone_C
// 0x0028 (0x0488 - 0x0460)
class UWBP_Settings_Entry_Slider_DeadZone_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Settings_Entry_Slider_C*           WBP_Settings_Entry_Slider;                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Label;                                             // 0x0470(0x0010)(Edit, BlueprintVisible)
	EInputStick                                   InputStick;                                        // 0x0480(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Settings_Entry_Sound_WBP_Settings_Entry_Slider_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature(double Value);
	void Construct();
	void ExecuteUbergraph_WBP_Settings_Entry_Slider_DeadZone(int32 EntryPoint);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void PreConstruct(bool IsDesignTime);
	void Refresh();
	void SetLabel(const class FText& Label_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Settings_Entry_Slider_DeadZone_C">();
	}
	static class UWBP_Settings_Entry_Slider_DeadZone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Settings_Entry_Slider_DeadZone_C>();
	}
};
static_assert(alignof(UWBP_Settings_Entry_Slider_DeadZone_C) == 0x000008, "Wrong alignment on UWBP_Settings_Entry_Slider_DeadZone_C");
static_assert(sizeof(UWBP_Settings_Entry_Slider_DeadZone_C) == 0x000488, "Wrong size on UWBP_Settings_Entry_Slider_DeadZone_C");
static_assert(offsetof(UWBP_Settings_Entry_Slider_DeadZone_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Settings_Entry_Slider_DeadZone_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_Slider_DeadZone_C, WBP_Settings_Entry_Slider) == 0x000468, "Member 'UWBP_Settings_Entry_Slider_DeadZone_C::WBP_Settings_Entry_Slider' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_Slider_DeadZone_C, Label) == 0x000470, "Member 'UWBP_Settings_Entry_Slider_DeadZone_C::Label' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_Slider_DeadZone_C, InputStick) == 0x000480, "Member 'UWBP_Settings_Entry_Slider_DeadZone_C::InputStick' has a wrong offset!");

}

