#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Achievement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Achievement.WBP_Achievement_C
// 0x0028 (0x0488 - 0x0460)
class UWBP_Achievement_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hide;                                              // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Show;                                              // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           EntryContainer;                                    // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Title;                                             // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void AddAchievementEntry(const struct FAchievementData& AchievementData);
	void Close();
	void Construct();
	void CreateAchievementList();
	void ExecuteUbergraph_WBP_Achievement(int32 EntryPoint);
	void OnFinish_90A86242494273FF6AE128B8DCD8F300();
	void OnFinish_F6A74918425BBF1818F22397A3DF87AE();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnPressCancel(const struct FKeyEvent& KeyEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Achievement_C">();
	}
	static class UWBP_Achievement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Achievement_C>();
	}
};
static_assert(alignof(UWBP_Achievement_C) == 0x000008, "Wrong alignment on UWBP_Achievement_C");
static_assert(sizeof(UWBP_Achievement_C) == 0x000488, "Wrong size on UWBP_Achievement_C");
static_assert(offsetof(UWBP_Achievement_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Achievement_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Achievement_C, Hide) == 0x000468, "Member 'UWBP_Achievement_C::Hide' has a wrong offset!");
static_assert(offsetof(UWBP_Achievement_C, Show) == 0x000470, "Member 'UWBP_Achievement_C::Show' has a wrong offset!");
static_assert(offsetof(UWBP_Achievement_C, EntryContainer) == 0x000478, "Member 'UWBP_Achievement_C::EntryContainer' has a wrong offset!");
static_assert(offsetof(UWBP_Achievement_C, Title) == 0x000480, "Member 'UWBP_Achievement_C::Title' has a wrong offset!");

}

