#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_Entry_Choice_Resolution

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Settings_Entry_Choice_Resolution.WBP_Settings_Entry_Choice_Resolution_C
// 0x0038 (0x0498 - 0x0460)
class UWBP_Settings_Entry_Choice_Resolution_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Settings_Entry_Choice_Text_C*      WBP_Settings_Entry_Choice_Text;                    // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FIntPoint>                      Resolutions;                                       // 0x0470(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, AdvancedDisplay)
	int32                                         CurrentResolutionIndex;                            // 0x0480(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_484[0x4];                                      // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnChanged;                                         // 0x0488(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_Settings_Entry_Choice_Resolution_WBP_Settings_Entry_Choice_Text_K2Node_ComponentBoundEvent_2_OnLeft__DelegateSignature();
	void BndEvt__WBP_Settings_Entry_Choice_Resolution_WBP_Settings_Entry_Choice_Text_K2Node_ComponentBoundEvent_3_OnRight__DelegateSignature();
	void ComputeCurrentResolutionIndex();
	void Construct();
	void ExecuteUbergraph_WBP_Settings_Entry_Choice_Resolution(int32 EntryPoint);
	void GenerateResolutions();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnSetIsEnabled(bool bInIsEnabled);
	void RefreshResolutionChoices();
	void RefreshText();
	void SetResolution(int32 ResolutionIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Settings_Entry_Choice_Resolution_C">();
	}
	static class UWBP_Settings_Entry_Choice_Resolution_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Settings_Entry_Choice_Resolution_C>();
	}
};
static_assert(alignof(UWBP_Settings_Entry_Choice_Resolution_C) == 0x000008, "Wrong alignment on UWBP_Settings_Entry_Choice_Resolution_C");
static_assert(sizeof(UWBP_Settings_Entry_Choice_Resolution_C) == 0x000498, "Wrong size on UWBP_Settings_Entry_Choice_Resolution_C");
static_assert(offsetof(UWBP_Settings_Entry_Choice_Resolution_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Settings_Entry_Choice_Resolution_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_Choice_Resolution_C, WBP_Settings_Entry_Choice_Text) == 0x000468, "Member 'UWBP_Settings_Entry_Choice_Resolution_C::WBP_Settings_Entry_Choice_Text' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_Choice_Resolution_C, Resolutions) == 0x000470, "Member 'UWBP_Settings_Entry_Choice_Resolution_C::Resolutions' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_Choice_Resolution_C, CurrentResolutionIndex) == 0x000480, "Member 'UWBP_Settings_Entry_Choice_Resolution_C::CurrentResolutionIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_Choice_Resolution_C, OnChanged) == 0x000488, "Member 'UWBP_Settings_Entry_Choice_Resolution_C::OnChanged' has a wrong offset!");

}

