#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Recollection_BossRush_Leaderboard

#include "Basic.hpp"

#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function WBP_Recollection_BossRush_Leaderboard.WBP_Recollection_BossRush_Leaderboard_C.SetNewFlagAtIndex
// 0x0018 (0x0018 - 0x0000)
struct WBP_Recollection_BossRush_Leaderboard_C_SetNewFlagAtIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowNewFlag;                                       // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Recollection_BossRush_RecordEntry_C* CallFunc_Array_Get_Item;                         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_BossRush_Leaderboard_C_SetNewFlagAtIndex) == 0x000008, "Wrong alignment on WBP_Recollection_BossRush_Leaderboard_C_SetNewFlagAtIndex");
static_assert(sizeof(WBP_Recollection_BossRush_Leaderboard_C_SetNewFlagAtIndex) == 0x000018, "Wrong size on WBP_Recollection_BossRush_Leaderboard_C_SetNewFlagAtIndex");
static_assert(offsetof(WBP_Recollection_BossRush_Leaderboard_C_SetNewFlagAtIndex, Index_0) == 0x000000, "Member 'WBP_Recollection_BossRush_Leaderboard_C_SetNewFlagAtIndex::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Leaderboard_C_SetNewFlagAtIndex, ShowNewFlag) == 0x000004, "Member 'WBP_Recollection_BossRush_Leaderboard_C_SetNewFlagAtIndex::ShowNewFlag' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Leaderboard_C_SetNewFlagAtIndex, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000005, "Member 'WBP_Recollection_BossRush_Leaderboard_C_SetNewFlagAtIndex::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Leaderboard_C_SetNewFlagAtIndex, CallFunc_Array_Get_Item) == 0x000008, "Member 'WBP_Recollection_BossRush_Leaderboard_C_SetNewFlagAtIndex::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Leaderboard_C_SetNewFlagAtIndex, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_Recollection_BossRush_Leaderboard_C_SetNewFlagAtIndex::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Leaderboard_C_SetNewFlagAtIndex, CallFunc_Greater_IntInt_ReturnValue) == 0x000014, "Member 'WBP_Recollection_BossRush_Leaderboard_C_SetNewFlagAtIndex::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Leaderboard_C_SetNewFlagAtIndex, CallFunc_BooleanAND_ReturnValue) == 0x000015, "Member 'WBP_Recollection_BossRush_Leaderboard_C_SetNewFlagAtIndex::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_Recollection_BossRush_Leaderboard.WBP_Recollection_BossRush_Leaderboard_C.SetLeaderboardTexts
// 0x0020 (0x0020 - 0x0000)
struct WBP_Recollection_BossRush_Leaderboard_C_SetLeaderboardTexts final
{
public:
	class AGameModeZion*                          CallFunc_Get_ReturnValue;                          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRecollectionBossRushRecordData        CallFunc_GetRecordData_ReturnValue;                // 0x000C(0x0004)(NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_BossRush_Leaderboard_C_SetLeaderboardTexts) == 0x000008, "Wrong alignment on WBP_Recollection_BossRush_Leaderboard_C_SetLeaderboardTexts");
static_assert(sizeof(WBP_Recollection_BossRush_Leaderboard_C_SetLeaderboardTexts) == 0x000020, "Wrong size on WBP_Recollection_BossRush_Leaderboard_C_SetLeaderboardTexts");
static_assert(offsetof(WBP_Recollection_BossRush_Leaderboard_C_SetLeaderboardTexts, CallFunc_Get_ReturnValue) == 0x000000, "Member 'WBP_Recollection_BossRush_Leaderboard_C_SetLeaderboardTexts::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Leaderboard_C_SetLeaderboardTexts, Temp_int_Variable) == 0x000008, "Member 'WBP_Recollection_BossRush_Leaderboard_C_SetLeaderboardTexts::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Leaderboard_C_SetLeaderboardTexts, CallFunc_GetRecordData_ReturnValue) == 0x00000C, "Member 'WBP_Recollection_BossRush_Leaderboard_C_SetLeaderboardTexts::CallFunc_GetRecordData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Leaderboard_C_SetLeaderboardTexts, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_Recollection_BossRush_Leaderboard_C_SetLeaderboardTexts::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Leaderboard_C_SetLeaderboardTexts, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'WBP_Recollection_BossRush_Leaderboard_C_SetLeaderboardTexts::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Leaderboard_C_SetLeaderboardTexts, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Recollection_BossRush_Leaderboard_C_SetLeaderboardTexts::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Leaderboard_C_SetLeaderboardTexts, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_Recollection_BossRush_Leaderboard_C_SetLeaderboardTexts::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Recollection_BossRush_Leaderboard.WBP_Recollection_BossRush_Leaderboard_C.Set Text at Index
// 0x0020 (0x0020 - 0x0000)
struct WBP_Recollection_BossRush_Leaderboard_C_Set_Text_at_Index final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRecollectionBossRushRecordData        RecordData;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Recollection_BossRush_RecordEntry_C* CallFunc_Array_Get_Item;                         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_BossRush_Leaderboard_C_Set_Text_at_Index) == 0x000008, "Wrong alignment on WBP_Recollection_BossRush_Leaderboard_C_Set_Text_at_Index");
static_assert(sizeof(WBP_Recollection_BossRush_Leaderboard_C_Set_Text_at_Index) == 0x000020, "Wrong size on WBP_Recollection_BossRush_Leaderboard_C_Set_Text_at_Index");
static_assert(offsetof(WBP_Recollection_BossRush_Leaderboard_C_Set_Text_at_Index, Index_0) == 0x000000, "Member 'WBP_Recollection_BossRush_Leaderboard_C_Set_Text_at_Index::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Leaderboard_C_Set_Text_at_Index, RecordData) == 0x000004, "Member 'WBP_Recollection_BossRush_Leaderboard_C_Set_Text_at_Index::RecordData' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Leaderboard_C_Set_Text_at_Index, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Recollection_BossRush_Leaderboard_C_Set_Text_at_Index::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Leaderboard_C_Set_Text_at_Index, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_Recollection_BossRush_Leaderboard_C_Set_Text_at_Index::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Leaderboard_C_Set_Text_at_Index, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_Recollection_BossRush_Leaderboard_C_Set_Text_at_Index::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Leaderboard_C_Set_Text_at_Index, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_Recollection_BossRush_Leaderboard_C_Set_Text_at_Index::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Leaderboard_C_Set_Text_at_Index, CallFunc_BooleanAND_ReturnValue) == 0x00001D, "Member 'WBP_Recollection_BossRush_Leaderboard_C_Set_Text_at_Index::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_Recollection_BossRush_Leaderboard.WBP_Recollection_BossRush_Leaderboard_C.ExecuteUbergraph_WBP_Recollection_BossRush_Leaderboard
// 0x0018 (0x0018 - 0x0000)
struct WBP_Recollection_BossRush_Leaderboard_C_ExecuteUbergraph_WBP_Recollection_BossRush_Leaderboard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_Recollection_BossRush_RecordEntry_C*> K2Node_MakeArray_Array;                  // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_Recollection_BossRush_Leaderboard_C_ExecuteUbergraph_WBP_Recollection_BossRush_Leaderboard) == 0x000008, "Wrong alignment on WBP_Recollection_BossRush_Leaderboard_C_ExecuteUbergraph_WBP_Recollection_BossRush_Leaderboard");
static_assert(sizeof(WBP_Recollection_BossRush_Leaderboard_C_ExecuteUbergraph_WBP_Recollection_BossRush_Leaderboard) == 0x000018, "Wrong size on WBP_Recollection_BossRush_Leaderboard_C_ExecuteUbergraph_WBP_Recollection_BossRush_Leaderboard");
static_assert(offsetof(WBP_Recollection_BossRush_Leaderboard_C_ExecuteUbergraph_WBP_Recollection_BossRush_Leaderboard, EntryPoint) == 0x000000, "Member 'WBP_Recollection_BossRush_Leaderboard_C_ExecuteUbergraph_WBP_Recollection_BossRush_Leaderboard::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Leaderboard_C_ExecuteUbergraph_WBP_Recollection_BossRush_Leaderboard, K2Node_MakeArray_Array) == 0x000008, "Member 'WBP_Recollection_BossRush_Leaderboard_C_ExecuteUbergraph_WBP_Recollection_BossRush_Leaderboard::K2Node_MakeArray_Array' has a wrong offset!");

}

