#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Shop_Entry

#include "Basic.hpp"

#include "Zion_structs.hpp"
#include "Zion_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Shop_Entry.WBP_Shop_Entry_C
// 0x01F8 (0x0658 - 0x0460)
class UWBP_Shop_Entry_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Focused;                                           // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             Cost_CanBuy;                                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Cost_CanNotBuy;                                    // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemName;                                          // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_FocusedContainer;                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_NewContainer;                              // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             StockCount;                                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Price;                              // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FShopItemData                          ShopItemData;                                      // 0x04A8(0x0020)(Edit, BlueprintVisible, Transient, NoDestructor, AdvancedDisplay, ExposeOnSpawn)
	TMulticastInlineDelegate<void(class UWBP_Shop_Entry_C* ShopEntry)> OnFocused;                    // 0x04C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(const struct FKeyEvent& KeyEvent, class UWBP_Shop_Entry_C* ShopEntry)> OnPressed; // 0x04D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FCurrencyValue                         CurrencyValue;                                     // 0x04E8(0x0008)(Edit, BlueprintVisible, Transient, NoDestructor, AdvancedDisplay, ExposeOnSpawn)
	struct FInventoryItemData                     ItemData;                                          // 0x04F0(0x0168)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, AdvancedDisplay)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Shop_Entry(int32 EntryPoint);
	void Initialize();
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnPressConfirm(const struct FKeyEvent& KeyEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void Refresh(const struct FCurrencyValue& CurrencyValue_0, int32 NewStockCount);
	void RefreshPrice();
	void SetFocusedState(bool Focus);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Shop_Entry_C">();
	}
	static class UWBP_Shop_Entry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Shop_Entry_C>();
	}
};
static_assert(alignof(UWBP_Shop_Entry_C) == 0x000008, "Wrong alignment on UWBP_Shop_Entry_C");
static_assert(sizeof(UWBP_Shop_Entry_C) == 0x000658, "Wrong size on UWBP_Shop_Entry_C");
static_assert(offsetof(UWBP_Shop_Entry_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Shop_Entry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Shop_Entry_C, Focused) == 0x000468, "Member 'UWBP_Shop_Entry_C::Focused' has a wrong offset!");
static_assert(offsetof(UWBP_Shop_Entry_C, Cost_CanBuy) == 0x000470, "Member 'UWBP_Shop_Entry_C::Cost_CanBuy' has a wrong offset!");
static_assert(offsetof(UWBP_Shop_Entry_C, Cost_CanNotBuy) == 0x000478, "Member 'UWBP_Shop_Entry_C::Cost_CanNotBuy' has a wrong offset!");
static_assert(offsetof(UWBP_Shop_Entry_C, ItemName) == 0x000480, "Member 'UWBP_Shop_Entry_C::ItemName' has a wrong offset!");
static_assert(offsetof(UWBP_Shop_Entry_C, Overlay_FocusedContainer) == 0x000488, "Member 'UWBP_Shop_Entry_C::Overlay_FocusedContainer' has a wrong offset!");
static_assert(offsetof(UWBP_Shop_Entry_C, Overlay_NewContainer) == 0x000490, "Member 'UWBP_Shop_Entry_C::Overlay_NewContainer' has a wrong offset!");
static_assert(offsetof(UWBP_Shop_Entry_C, StockCount) == 0x000498, "Member 'UWBP_Shop_Entry_C::StockCount' has a wrong offset!");
static_assert(offsetof(UWBP_Shop_Entry_C, WidgetSwitcher_Price) == 0x0004A0, "Member 'UWBP_Shop_Entry_C::WidgetSwitcher_Price' has a wrong offset!");
static_assert(offsetof(UWBP_Shop_Entry_C, ShopItemData) == 0x0004A8, "Member 'UWBP_Shop_Entry_C::ShopItemData' has a wrong offset!");
static_assert(offsetof(UWBP_Shop_Entry_C, OnFocused) == 0x0004C8, "Member 'UWBP_Shop_Entry_C::OnFocused' has a wrong offset!");
static_assert(offsetof(UWBP_Shop_Entry_C, OnPressed) == 0x0004D8, "Member 'UWBP_Shop_Entry_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UWBP_Shop_Entry_C, CurrencyValue) == 0x0004E8, "Member 'UWBP_Shop_Entry_C::CurrencyValue' has a wrong offset!");
static_assert(offsetof(UWBP_Shop_Entry_C, ItemData) == 0x0004F0, "Member 'UWBP_Shop_Entry_C::ItemData' has a wrong offset!");

}

