#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Recollection_Page_Bosses

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function WBP_Recollection_Page_Bosses.WBP_Recollection_Page_Bosses_C.DoCustomNavigation
// 0x0010 (0x0010 - 0x0000)
struct WBP_Recollection_Page_Bosses_C_DoCustomNavigation final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_Page_Bosses_C_DoCustomNavigation) == 0x000008, "Wrong alignment on WBP_Recollection_Page_Bosses_C_DoCustomNavigation");
static_assert(sizeof(WBP_Recollection_Page_Bosses_C_DoCustomNavigation) == 0x000010, "Wrong size on WBP_Recollection_Page_Bosses_C_DoCustomNavigation");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_DoCustomNavigation, Navigation_0) == 0x000000, "Member 'WBP_Recollection_Page_Bosses_C_DoCustomNavigation::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_DoCustomNavigation, ReturnValue) == 0x000008, "Member 'WBP_Recollection_Page_Bosses_C_DoCustomNavigation::ReturnValue' has a wrong offset!");

// Function WBP_Recollection_Page_Bosses.WBP_Recollection_Page_Bosses_C.ExecuteUbergraph_WBP_Recollection_Page_Bosses
// 0x01C8 (0x01C8 - 0x0000)
struct WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Dialog_YesNo_C*                    CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Recollection_Button_C*             K2Node_CustomEvent_Button;                         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKeyEvent                              K2Node_CustomEvent_KeyEvent;                       // 0x0018(0x0040)()
	class UUMGSubsystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRecollectionBossData                  CallFunc_GetDataTableRowFromName_OutRow;           // 0x0060(0x0090)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidgetFooter*                      CallFunc_GetActiveFooter_ReturnValue;              // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0108(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0158(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0168(0x0010)()
	int32                                         CallFunc_GetUMGZOrder_ReturnValue;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSubsystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidgetFooter*                      CallFunc_GetActiveFooter_ReturnValue_1;            // 0x0188(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0190(0x0008)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x019C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x01AC(0x0008)(NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeZion*                          CallFunc_Get_ReturnValue;                          // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInNewGamePlus_ReturnValue;              // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses) == 0x000008, "Wrong alignment on WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses");
static_assert(sizeof(WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses) == 0x0001C8, "Wrong size on WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses, EntryPoint) == 0x000000, "Member 'WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses, Temp_bool_Variable) == 0x000004, "Member 'WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses, Temp_byte_Variable) == 0x000005, "Member 'WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses, K2Node_CustomEvent_Button) == 0x000010, "Member 'WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses, K2Node_CustomEvent_KeyEvent) == 0x000018, "Member 'WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses::K2Node_CustomEvent_KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000058, "Member 'WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses, CallFunc_GetDataTableRowFromName_OutRow) == 0x000060, "Member 'WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000F0, "Member 'WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses, CallFunc_GetActiveFooter_ReturnValue) == 0x0000F8, "Member 'WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses::CallFunc_GetActiveFooter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses, CallFunc_IsValid_ReturnValue) == 0x000100, "Member 'WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses, K2Node_MakeStruct_FormatArgumentData) == 0x000108, "Member 'WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses, CallFunc_IsValid_ReturnValue_1) == 0x000150, "Member 'WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses, K2Node_MakeArray_Array) == 0x000158, "Member 'WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses, CallFunc_Format_ReturnValue) == 0x000168, "Member 'WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses, CallFunc_GetUMGZOrder_ReturnValue) == 0x000178, "Member 'WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses::CallFunc_GetUMGZOrder_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000180, "Member 'WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses, CallFunc_GetActiveFooter_ReturnValue_1) == 0x000188, "Member 'WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses::CallFunc_GetActiveFooter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses, K2Node_Event_InFocusEvent_1) == 0x000190, "Member 'WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses, CallFunc_IsValid_ReturnValue_2) == 0x000198, "Member 'WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses, K2Node_CreateDelegate_OutputDelegate) == 0x00019C, "Member 'WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses, K2Node_Event_InFocusEvent) == 0x0001AC, "Member 'WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses, K2Node_Event_IsDesignTime) == 0x0001B4, "Member 'WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses, CallFunc_Get_ReturnValue) == 0x0001B8, "Member 'WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses, CallFunc_IsInNewGamePlus_ReturnValue) == 0x0001C0, "Member 'WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses::CallFunc_IsInNewGamePlus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses, K2Node_Select_Default) == 0x0001C1, "Member 'WBP_Recollection_Page_Bosses_C_ExecuteUbergraph_WBP_Recollection_Page_Bosses::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Recollection_Page_Bosses.WBP_Recollection_Page_Bosses_C.FocusBossEntry
// 0x0030 (0x0030 - 0x0000)
struct WBP_Recollection_Page_Bosses_C_FocusBossEntry final
{
public:
	struct FDataTableRowHandle                    RecollectionBossHandle;                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Recollection_Button_C*             CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEqual_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_Page_Bosses_C_FocusBossEntry) == 0x000008, "Wrong alignment on WBP_Recollection_Page_Bosses_C_FocusBossEntry");
static_assert(sizeof(WBP_Recollection_Page_Bosses_C_FocusBossEntry) == 0x000030, "Wrong size on WBP_Recollection_Page_Bosses_C_FocusBossEntry");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_FocusBossEntry, RecollectionBossHandle) == 0x000000, "Member 'WBP_Recollection_Page_Bosses_C_FocusBossEntry::RecollectionBossHandle' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_FocusBossEntry, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_Recollection_Page_Bosses_C_FocusBossEntry::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_FocusBossEntry, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_Recollection_Page_Bosses_C_FocusBossEntry::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_FocusBossEntry, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Recollection_Page_Bosses_C_FocusBossEntry::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_FocusBossEntry, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'WBP_Recollection_Page_Bosses_C_FocusBossEntry::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_FocusBossEntry, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_Recollection_Page_Bosses_C_FocusBossEntry::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_FocusBossEntry, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'WBP_Recollection_Page_Bosses_C_FocusBossEntry::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_FocusBossEntry, CallFunc_IsEqual_ReturnValue) == 0x000029, "Member 'WBP_Recollection_Page_Bosses_C_FocusBossEntry::CallFunc_IsEqual_ReturnValue' has a wrong offset!");

// Function WBP_Recollection_Page_Bosses.WBP_Recollection_Page_Bosses_C.GenerateEntries
// 0x0078 (0x0078 - 0x0000)
struct WBP_Recollection_Page_Bosses_C_GenerateEntries final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Recollection_Button_C*             CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0020(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0040(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRecollectionItemVisible_ReturnValue;    // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_Recollection_Button_C* Button, const struct FKeyEvent& KeyEvent)> K2Node_CreateDelegate_OutputDelegate; // 0x0064(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_Page_Bosses_C_GenerateEntries) == 0x000008, "Wrong alignment on WBP_Recollection_Page_Bosses_C_GenerateEntries");
static_assert(sizeof(WBP_Recollection_Page_Bosses_C_GenerateEntries) == 0x000078, "Wrong size on WBP_Recollection_Page_Bosses_C_GenerateEntries");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_GenerateEntries, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_Recollection_Page_Bosses_C_GenerateEntries::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_GenerateEntries, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_Recollection_Page_Bosses_C_GenerateEntries::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_GenerateEntries, CallFunc_Array_Add_ReturnValue) == 0x000010, "Member 'WBP_Recollection_Page_Bosses_C_GenerateEntries::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_GenerateEntries, CallFunc_Get_ReturnValue) == 0x000018, "Member 'WBP_Recollection_Page_Bosses_C_GenerateEntries::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_GenerateEntries, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000020, "Member 'WBP_Recollection_Page_Bosses_C_GenerateEntries::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_GenerateEntries, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_Recollection_Page_Bosses_C_GenerateEntries::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_GenerateEntries, CallFunc_Array_Get_Item) == 0x000034, "Member 'WBP_Recollection_Page_Bosses_C_GenerateEntries::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_GenerateEntries, K2Node_MakeStruct_DataTableRowHandle) == 0x000040, "Member 'WBP_Recollection_Page_Bosses_C_GenerateEntries::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_GenerateEntries, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'WBP_Recollection_Page_Bosses_C_GenerateEntries::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_GenerateEntries, CallFunc_IsRecollectionItemVisible_ReturnValue) == 0x000054, "Member 'WBP_Recollection_Page_Bosses_C_GenerateEntries::CallFunc_IsRecollectionItemVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_GenerateEntries, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'WBP_Recollection_Page_Bosses_C_GenerateEntries::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_GenerateEntries, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'WBP_Recollection_Page_Bosses_C_GenerateEntries::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_GenerateEntries, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'WBP_Recollection_Page_Bosses_C_GenerateEntries::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_GenerateEntries, K2Node_CreateDelegate_OutputDelegate) == 0x000064, "Member 'WBP_Recollection_Page_Bosses_C_GenerateEntries::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_Recollection_Page_Bosses.WBP_Recollection_Page_Bosses_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_Recollection_Page_Bosses_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Recollection_Page_Bosses_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on WBP_Recollection_Page_Bosses_C_OnAddedToFocusPath");
static_assert(sizeof(WBP_Recollection_Page_Bosses_C_OnAddedToFocusPath) == 0x000008, "Wrong size on WBP_Recollection_Page_Bosses_C_OnAddedToFocusPath");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_Recollection_Page_Bosses_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_Recollection_Page_Bosses.WBP_Recollection_Page_Bosses_C.OnButtonPressed
// 0x0048 (0x0048 - 0x0000)
struct WBP_Recollection_Page_Bosses_C_OnButtonPressed final
{
public:
	class UWBP_Recollection_Button_C*             Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKeyEvent                              KeyEvent;                                          // 0x0008(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Recollection_Page_Bosses_C_OnButtonPressed) == 0x000008, "Wrong alignment on WBP_Recollection_Page_Bosses_C_OnButtonPressed");
static_assert(sizeof(WBP_Recollection_Page_Bosses_C_OnButtonPressed) == 0x000048, "Wrong size on WBP_Recollection_Page_Bosses_C_OnButtonPressed");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_OnButtonPressed, Button) == 0x000000, "Member 'WBP_Recollection_Page_Bosses_C_OnButtonPressed::Button' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_OnButtonPressed, KeyEvent) == 0x000008, "Member 'WBP_Recollection_Page_Bosses_C_OnButtonPressed::KeyEvent' has a wrong offset!");

// Function WBP_Recollection_Page_Bosses.WBP_Recollection_Page_Bosses_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_Recollection_Page_Bosses_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_Page_Bosses_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Recollection_Page_Bosses_C_OnFocusReceived");
static_assert(sizeof(WBP_Recollection_Page_Bosses_C_OnFocusReceived) == 0x0001B8, "Wrong size on WBP_Recollection_Page_Bosses_C_OnFocusReceived");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Recollection_Page_Bosses_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Recollection_Page_Bosses_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Recollection_Page_Bosses_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Recollection_Page_Bosses_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_OnFocusReceived, CallFunc_GetChildAt_ReturnValue) == 0x0001B0, "Member 'WBP_Recollection_Page_Bosses_C_OnFocusReceived::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");

// Function WBP_Recollection_Page_Bosses.WBP_Recollection_Page_Bosses_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_Recollection_Page_Bosses_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Recollection_Page_Bosses_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on WBP_Recollection_Page_Bosses_C_OnRemovedFromFocusPath");
static_assert(sizeof(WBP_Recollection_Page_Bosses_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on WBP_Recollection_Page_Bosses_C_OnRemovedFromFocusPath");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_Recollection_Page_Bosses_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_Recollection_Page_Bosses.WBP_Recollection_Page_Bosses_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Recollection_Page_Bosses_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_Page_Bosses_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Recollection_Page_Bosses_C_PreConstruct");
static_assert(sizeof(WBP_Recollection_Page_Bosses_C_PreConstruct) == 0x000001, "Wrong size on WBP_Recollection_Page_Bosses_C_PreConstruct");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Recollection_Page_Bosses_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Recollection_Page_Bosses.WBP_Recollection_Page_Bosses_C.SetupNavigation
// 0x0028 (0x0028 - 0x0000)
struct WBP_Recollection_Page_Bosses_C_SetupNavigation final
{
public:
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Recollection_Button_C*             CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Recollection_Button_C*             CallFunc_Array_Get_Item_1;                         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_Page_Bosses_C_SetupNavigation) == 0x000008, "Wrong alignment on WBP_Recollection_Page_Bosses_C_SetupNavigation");
static_assert(sizeof(WBP_Recollection_Page_Bosses_C_SetupNavigation) == 0x000028, "Wrong size on WBP_Recollection_Page_Bosses_C_SetupNavigation");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_SetupNavigation, CallFunc_GetVisibility_ReturnValue) == 0x000000, "Member 'WBP_Recollection_Page_Bosses_C_SetupNavigation::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_Page_Bosses_C_SetupNavigation, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000001, "Member 'WBP_Recollection_Page_Bosses_C_SetupNavigation::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
