#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Shop_Comparator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Shop_Comparator.WBP_Shop_Comparator_C
// 0x0058 (0x04B8 - 0x0460)
class UWBP_Shop_Comparator_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AnimHide;                                          // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimShow;                                          // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_189;                                         // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Equipment_Stats_C*                 WBP_Equipment_Stats;                               // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Equipment_Stats_C*                 WBP_Equipment_Stats_SlotA;                         // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Equipment_Stats_C*                 WBP_Equipment_Stats_SlotB;                         // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_41;                                 // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bShown;                                            // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Shop_Comparator(int32 EntryPoint);
	void Hide();
	void Setup(const struct FDataTableRowHandle& ItemHandle);
	void Show();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Shop_Comparator_C">();
	}
	static class UWBP_Shop_Comparator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Shop_Comparator_C>();
	}
};
static_assert(alignof(UWBP_Shop_Comparator_C) == 0x000008, "Wrong alignment on UWBP_Shop_Comparator_C");
static_assert(sizeof(UWBP_Shop_Comparator_C) == 0x0004B8, "Wrong size on UWBP_Shop_Comparator_C");
static_assert(offsetof(UWBP_Shop_Comparator_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Shop_Comparator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Shop_Comparator_C, AnimHide) == 0x000468, "Member 'UWBP_Shop_Comparator_C::AnimHide' has a wrong offset!");
static_assert(offsetof(UWBP_Shop_Comparator_C, AnimShow) == 0x000470, "Member 'UWBP_Shop_Comparator_C::AnimShow' has a wrong offset!");
static_assert(offsetof(UWBP_Shop_Comparator_C, BG) == 0x000478, "Member 'UWBP_Shop_Comparator_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_Shop_Comparator_C, Image) == 0x000480, "Member 'UWBP_Shop_Comparator_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_Shop_Comparator_C, Image_189) == 0x000488, "Member 'UWBP_Shop_Comparator_C::Image_189' has a wrong offset!");
static_assert(offsetof(UWBP_Shop_Comparator_C, WBP_Equipment_Stats) == 0x000490, "Member 'UWBP_Shop_Comparator_C::WBP_Equipment_Stats' has a wrong offset!");
static_assert(offsetof(UWBP_Shop_Comparator_C, WBP_Equipment_Stats_SlotA) == 0x000498, "Member 'UWBP_Shop_Comparator_C::WBP_Equipment_Stats_SlotA' has a wrong offset!");
static_assert(offsetof(UWBP_Shop_Comparator_C, WBP_Equipment_Stats_SlotB) == 0x0004A0, "Member 'UWBP_Shop_Comparator_C::WBP_Equipment_Stats_SlotB' has a wrong offset!");
static_assert(offsetof(UWBP_Shop_Comparator_C, WidgetSwitcher_41) == 0x0004A8, "Member 'UWBP_Shop_Comparator_C::WidgetSwitcher_41' has a wrong offset!");
static_assert(offsetof(UWBP_Shop_Comparator_C, bShown) == 0x0004B0, "Member 'UWBP_Shop_Comparator_C::bShown' has a wrong offset!");

}

