#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Item_EquipmentData

#include "Basic.hpp"

#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Item_EquipmentData.WBP_Item_EquipmentData_C
// 0x0030 (0x0490 - 0x0460)
class UWBP_Item_EquipmentData_C final : public UUserWidgetZion
{
public:
	class UWBP_Item_EquipmentData_Stat_C*         WBP_Item_EquipmentData_Stat_Attack;                // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Item_EquipmentData_Stat_C*         WBP_Item_EquipmentData_Stat_Defense;               // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Item_EquipmentData_Stat_C*         WBP_Item_EquipmentData_Stat_HealCount;             // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Item_EquipmentData_Stat_C*         WBP_Item_EquipmentData_Stat_HealPower;             // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Item_EquipmentData_Stat_C*         WBP_Item_EquipmentData_Stat_HP;                    // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Item_EquipmentData_Stat_C*         WBP_Item_EquipmentData_Stat_SP;                    // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Setup(const struct FExtendedStatsData& ExtendedStatsData);
	void SetupStat(class UWBP_Item_EquipmentData_Stat_C* Stat, int32 Value, int32 MaxValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Item_EquipmentData_C">();
	}
	static class UWBP_Item_EquipmentData_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Item_EquipmentData_C>();
	}
};
static_assert(alignof(UWBP_Item_EquipmentData_C) == 0x000008, "Wrong alignment on UWBP_Item_EquipmentData_C");
static_assert(sizeof(UWBP_Item_EquipmentData_C) == 0x000490, "Wrong size on UWBP_Item_EquipmentData_C");
static_assert(offsetof(UWBP_Item_EquipmentData_C, WBP_Item_EquipmentData_Stat_Attack) == 0x000460, "Member 'UWBP_Item_EquipmentData_C::WBP_Item_EquipmentData_Stat_Attack' has a wrong offset!");
static_assert(offsetof(UWBP_Item_EquipmentData_C, WBP_Item_EquipmentData_Stat_Defense) == 0x000468, "Member 'UWBP_Item_EquipmentData_C::WBP_Item_EquipmentData_Stat_Defense' has a wrong offset!");
static_assert(offsetof(UWBP_Item_EquipmentData_C, WBP_Item_EquipmentData_Stat_HealCount) == 0x000470, "Member 'UWBP_Item_EquipmentData_C::WBP_Item_EquipmentData_Stat_HealCount' has a wrong offset!");
static_assert(offsetof(UWBP_Item_EquipmentData_C, WBP_Item_EquipmentData_Stat_HealPower) == 0x000478, "Member 'UWBP_Item_EquipmentData_C::WBP_Item_EquipmentData_Stat_HealPower' has a wrong offset!");
static_assert(offsetof(UWBP_Item_EquipmentData_C, WBP_Item_EquipmentData_Stat_HP) == 0x000480, "Member 'UWBP_Item_EquipmentData_C::WBP_Item_EquipmentData_Stat_HP' has a wrong offset!");
static_assert(offsetof(UWBP_Item_EquipmentData_C, WBP_Item_EquipmentData_Stat_SP) == 0x000488, "Member 'UWBP_Item_EquipmentData_C::WBP_Item_EquipmentData_Stat_SP' has a wrong offset!");

}

