#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GameMenu_Page_Skill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GameMenu_Page_Skill.WBP_GameMenu_Page_Skill_C
// 0x0308 (0x0780 - 0x0478)
class UWBP_GameMenu_Page_Skill_C final : public UUserWidgetGameMenu_Page
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0478(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_EquipLock_C*                       WBP_EquipLock;                                     // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquippedSkillSet_C*                WBP_EquippedSkillSet;                              // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Item_Description_C*                WBP_Item_Description;                              // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Loadout_C*                         WBP_Loadout;                                       // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SeparateLine2_C*                   WBP_SeparateLine2;                                 // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SpiritPortrait_C*                  WBP_SpiritPortrait;                                // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SpiritSkillList_C*                 WBP_SpiritSkillList;                               // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EquippedSkillEntry_C*              SelectedEquippedSkillEntry;                        // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SpiritSkillSet_C*                  SelectedSpiritSkillSet;                            // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SpiritSkillEntry_C*                SelectedSpiritSkillEntry;                          // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CurrentBGSpiritImage;                              // 0x04D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	class UWBP_SpiritSkillSet_C*                  Focused;                                           // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    Skill_Data;                                        // 0x0500(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    DisplayedSkillDataHandle;                          // 0x0510(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    DisplayedSpiritDataHandle;                         // 0x0520(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UWBP_SpiritSkillEntry_C*                FocusedSkillEntry;                                 // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_EquippedSkillEntry_C*              FocusedEquippedSkillEntry;                         // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bDisplaySpecialSkill;                              // 0x0540(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFooterData>                    FooterEntries_EquippedEntry;                       // 0x0548(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	TArray<struct FFooterData>                    FooterEntries_EquippedEntry_Invalid;               // 0x0558(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	TArray<struct FFooterData>                    FooterEntries_EquippedEntry_Selecting;             // 0x0568(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	TArray<struct FFooterData>                    FooterEntries_SkillEntry;                          // 0x0578(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	TArray<struct FFooterData>                    FooterEntries_SkillEntry_Selecting;                // 0x0588(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FFooterData                            FooterEntry_Unequip;                               // 0x0598(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FFooterData                            FooterEntry_Special;                               // 0x05F0(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FFooterData                            FooterEntry_Cancel;                                // 0x0648(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FFooterData                            FooterEntry_Equip;                                 // 0x06A0(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FFooterData                            FooterEntry_Select;                                // 0x06F8(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly)
	class UFMODEvent*                             SE_Equip;                                          // 0x0750(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             SE_Confirm;                                        // 0x0758(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             SE_Cancel;                                         // 0x0760(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             SE_Unequip;                                        // 0x0768(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             SE_ToggleSP;                                       // 0x0770(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             SE_LoadoutChange;                                  // 0x0778(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_GameMenu_Page_Skill_WBP_SpiritSkillList_K2Node_ComponentBoundEvent_0_OnSkillEntryFocused__DelegateSignature(class UWBP_SpiritSkillSet_C* SpiritSkilSet, class UWBP_SpiritSkillEntry_C* SpiritSkillEntry);
	void BndEvt__WBP_GameMenu_Page_Skill_WBP_SpiritSkillList_K2Node_ComponentBoundEvent_1_OnSkillEntryPressed__DelegateSignature(class UWBP_SpiritSkillSet_C* SpiritSkillSet, class UWBP_SpiritSkillEntry_C* SpiritSkillEntry);
	void CancelSkillSelection();
	void CanChangeLoadout(bool* bCanChange);
	void ChangeEquippedLoadout(int32 NewLoadoutIndex);
	void ClearCache();
	void Construct();
	void Destruct();
	void DisplayDescriptionAndBG(struct FDataTableRowHandle& SkillDataHandle, const struct FDataTableRowHandle& SpiritDataHandle, bool bSpecialSkill);
	void EquipSelectedSkill();
	void ExecuteUbergraph_WBP_GameMenu_Page_Skill(int32 EntryPoint);
	bool HasSPAptitude();
	bool IsSelectingSkill();
	class UWidget* Nav_ToEquippedSet(EUINavigation Navigation_0);
	class UWidget* Nav_ToList(EUINavigation Navigation_0);
	void OnEquippedSkillEntryFocused(class UWBP_EquippedSkillEntry_C* EquippedSkillEntry);
	void OnEquippedSkillEntryPressed(class UWBP_EquippedSkillEntry_C* EquippedSkillEntry);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnPageClosed();
	struct FEventReply OnPressCancel(const struct FKeyEvent& KeyEvent);
	struct FEventReply OnPressContext(const struct FKeyEvent& KeyEvent);
	struct FEventReply OnPressContextAlt(const struct FKeyEvent& KeyEvent);
	struct FEventReply OnPressNextAlt(const struct FKeyEvent& KeyEvent);
	struct FEventReply OnPressPreviousAlt(const struct FKeyEvent& KeyEvent);
	void OverrideFirstRowSkillListNavigation();
	void RefreshLoadoutVisibility();
	void RefreshSkillPage();
	void SaveFocusedEntry(class UWBP_SpiritSkillEntry_C* FocusedSkillEntry_0, class UWBP_EquippedSkillEntry_C* FocusedEquippedSkillEntry_0);
	void SetLockVisibility();
	void SetupFooter();
	void SetupSpiritBGImage(const struct FDataTableRowHandle& Handle);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GameMenu_Page_Skill_C">();
	}
	static class UWBP_GameMenu_Page_Skill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GameMenu_Page_Skill_C>();
	}
};
static_assert(alignof(UWBP_GameMenu_Page_Skill_C) == 0x000008, "Wrong alignment on UWBP_GameMenu_Page_Skill_C");
static_assert(sizeof(UWBP_GameMenu_Page_Skill_C) == 0x000780, "Wrong size on UWBP_GameMenu_Page_Skill_C");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, UberGraphFrame) == 0x000478, "Member 'UWBP_GameMenu_Page_Skill_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, WBP_EquipLock) == 0x000480, "Member 'UWBP_GameMenu_Page_Skill_C::WBP_EquipLock' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, WBP_EquippedSkillSet) == 0x000488, "Member 'UWBP_GameMenu_Page_Skill_C::WBP_EquippedSkillSet' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, WBP_Item_Description) == 0x000490, "Member 'UWBP_GameMenu_Page_Skill_C::WBP_Item_Description' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, WBP_Loadout) == 0x000498, "Member 'UWBP_GameMenu_Page_Skill_C::WBP_Loadout' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, WBP_SeparateLine2) == 0x0004A0, "Member 'UWBP_GameMenu_Page_Skill_C::WBP_SeparateLine2' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, WBP_SpiritPortrait) == 0x0004A8, "Member 'UWBP_GameMenu_Page_Skill_C::WBP_SpiritPortrait' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, WBP_SpiritSkillList) == 0x0004B0, "Member 'UWBP_GameMenu_Page_Skill_C::WBP_SpiritSkillList' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, SelectedEquippedSkillEntry) == 0x0004B8, "Member 'UWBP_GameMenu_Page_Skill_C::SelectedEquippedSkillEntry' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, SelectedSpiritSkillSet) == 0x0004C0, "Member 'UWBP_GameMenu_Page_Skill_C::SelectedSpiritSkillSet' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, SelectedSpiritSkillEntry) == 0x0004C8, "Member 'UWBP_GameMenu_Page_Skill_C::SelectedSpiritSkillEntry' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, CurrentBGSpiritImage) == 0x0004D0, "Member 'UWBP_GameMenu_Page_Skill_C::CurrentBGSpiritImage' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, Focused) == 0x0004F8, "Member 'UWBP_GameMenu_Page_Skill_C::Focused' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, Skill_Data) == 0x000500, "Member 'UWBP_GameMenu_Page_Skill_C::Skill_Data' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, DisplayedSkillDataHandle) == 0x000510, "Member 'UWBP_GameMenu_Page_Skill_C::DisplayedSkillDataHandle' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, DisplayedSpiritDataHandle) == 0x000520, "Member 'UWBP_GameMenu_Page_Skill_C::DisplayedSpiritDataHandle' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, FocusedSkillEntry) == 0x000530, "Member 'UWBP_GameMenu_Page_Skill_C::FocusedSkillEntry' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, FocusedEquippedSkillEntry) == 0x000538, "Member 'UWBP_GameMenu_Page_Skill_C::FocusedEquippedSkillEntry' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, bDisplaySpecialSkill) == 0x000540, "Member 'UWBP_GameMenu_Page_Skill_C::bDisplaySpecialSkill' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, FooterEntries_EquippedEntry) == 0x000548, "Member 'UWBP_GameMenu_Page_Skill_C::FooterEntries_EquippedEntry' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, FooterEntries_EquippedEntry_Invalid) == 0x000558, "Member 'UWBP_GameMenu_Page_Skill_C::FooterEntries_EquippedEntry_Invalid' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, FooterEntries_EquippedEntry_Selecting) == 0x000568, "Member 'UWBP_GameMenu_Page_Skill_C::FooterEntries_EquippedEntry_Selecting' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, FooterEntries_SkillEntry) == 0x000578, "Member 'UWBP_GameMenu_Page_Skill_C::FooterEntries_SkillEntry' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, FooterEntries_SkillEntry_Selecting) == 0x000588, "Member 'UWBP_GameMenu_Page_Skill_C::FooterEntries_SkillEntry_Selecting' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, FooterEntry_Unequip) == 0x000598, "Member 'UWBP_GameMenu_Page_Skill_C::FooterEntry_Unequip' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, FooterEntry_Special) == 0x0005F0, "Member 'UWBP_GameMenu_Page_Skill_C::FooterEntry_Special' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, FooterEntry_Cancel) == 0x000648, "Member 'UWBP_GameMenu_Page_Skill_C::FooterEntry_Cancel' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, FooterEntry_Equip) == 0x0006A0, "Member 'UWBP_GameMenu_Page_Skill_C::FooterEntry_Equip' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, FooterEntry_Select) == 0x0006F8, "Member 'UWBP_GameMenu_Page_Skill_C::FooterEntry_Select' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, SE_Equip) == 0x000750, "Member 'UWBP_GameMenu_Page_Skill_C::SE_Equip' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, SE_Confirm) == 0x000758, "Member 'UWBP_GameMenu_Page_Skill_C::SE_Confirm' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, SE_Cancel) == 0x000760, "Member 'UWBP_GameMenu_Page_Skill_C::SE_Cancel' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, SE_Unequip) == 0x000768, "Member 'UWBP_GameMenu_Page_Skill_C::SE_Unequip' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, SE_ToggleSP) == 0x000770, "Member 'UWBP_GameMenu_Page_Skill_C::SE_ToggleSP' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Page_Skill_C, SE_LoadoutChange) == 0x000778, "Member 'UWBP_GameMenu_Page_Skill_C::SE_LoadoutChange' has a wrong offset!");

}

