#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SkillUnlock_Anim_Unlock

#include "Basic.hpp"

#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function WBP_SkillUnlock_Anim_Unlock.WBP_SkillUnlock_Anim_Unlock_C.ExecuteUbergraph_WBP_SkillUnlock_Anim_Unlock
// 0x03A8 (0x03A8 - 0x0000)
struct WBP_SkillUnlock_Anim_Unlock_C_ExecuteUbergraph_WBP_SkillUnlock_Anim_Unlock final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInventoryItemSkillData                CallFunc_GetItemSkillData_out_ItemData;            // 0x0018(0x0288)()
	bool                                          CallFunc_GetItemSkillData_ReturnValue;             // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A2[0x6];                                      // 0x02A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSkillLevelData                        CallFunc_GetSkillLevelDataFromItemSkillData_out_SkillData; // 0x02A8(0x00E8)()
	bool                                          CallFunc_GetSkillLevelDataFromItemSkillData_ReturnValue; // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x3];                                      // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0394(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SkillUnlock_Anim_Unlock_C_ExecuteUbergraph_WBP_SkillUnlock_Anim_Unlock) == 0x000008, "Wrong alignment on WBP_SkillUnlock_Anim_Unlock_C_ExecuteUbergraph_WBP_SkillUnlock_Anim_Unlock");
static_assert(sizeof(WBP_SkillUnlock_Anim_Unlock_C_ExecuteUbergraph_WBP_SkillUnlock_Anim_Unlock) == 0x0003A8, "Wrong size on WBP_SkillUnlock_Anim_Unlock_C_ExecuteUbergraph_WBP_SkillUnlock_Anim_Unlock");
static_assert(offsetof(WBP_SkillUnlock_Anim_Unlock_C_ExecuteUbergraph_WBP_SkillUnlock_Anim_Unlock, EntryPoint) == 0x000000, "Member 'WBP_SkillUnlock_Anim_Unlock_C_ExecuteUbergraph_WBP_SkillUnlock_Anim_Unlock::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SkillUnlock_Anim_Unlock_C_ExecuteUbergraph_WBP_SkillUnlock_Anim_Unlock, K2Node_Event_Animation) == 0x000008, "Member 'WBP_SkillUnlock_Anim_Unlock_C_ExecuteUbergraph_WBP_SkillUnlock_Anim_Unlock::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(WBP_SkillUnlock_Anim_Unlock_C_ExecuteUbergraph_WBP_SkillUnlock_Anim_Unlock, CallFunc_PlayUMGAnimation_ReturnValue) == 0x000010, "Member 'WBP_SkillUnlock_Anim_Unlock_C_ExecuteUbergraph_WBP_SkillUnlock_Anim_Unlock::CallFunc_PlayUMGAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillUnlock_Anim_Unlock_C_ExecuteUbergraph_WBP_SkillUnlock_Anim_Unlock, CallFunc_GetItemSkillData_out_ItemData) == 0x000018, "Member 'WBP_SkillUnlock_Anim_Unlock_C_ExecuteUbergraph_WBP_SkillUnlock_Anim_Unlock::CallFunc_GetItemSkillData_out_ItemData' has a wrong offset!");
static_assert(offsetof(WBP_SkillUnlock_Anim_Unlock_C_ExecuteUbergraph_WBP_SkillUnlock_Anim_Unlock, CallFunc_GetItemSkillData_ReturnValue) == 0x0002A0, "Member 'WBP_SkillUnlock_Anim_Unlock_C_ExecuteUbergraph_WBP_SkillUnlock_Anim_Unlock::CallFunc_GetItemSkillData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillUnlock_Anim_Unlock_C_ExecuteUbergraph_WBP_SkillUnlock_Anim_Unlock, CallFunc_IsValid_ReturnValue) == 0x0002A1, "Member 'WBP_SkillUnlock_Anim_Unlock_C_ExecuteUbergraph_WBP_SkillUnlock_Anim_Unlock::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillUnlock_Anim_Unlock_C_ExecuteUbergraph_WBP_SkillUnlock_Anim_Unlock, CallFunc_GetSkillLevelDataFromItemSkillData_out_SkillData) == 0x0002A8, "Member 'WBP_SkillUnlock_Anim_Unlock_C_ExecuteUbergraph_WBP_SkillUnlock_Anim_Unlock::CallFunc_GetSkillLevelDataFromItemSkillData_out_SkillData' has a wrong offset!");
static_assert(offsetof(WBP_SkillUnlock_Anim_Unlock_C_ExecuteUbergraph_WBP_SkillUnlock_Anim_Unlock, CallFunc_GetSkillLevelDataFromItemSkillData_ReturnValue) == 0x000390, "Member 'WBP_SkillUnlock_Anim_Unlock_C_ExecuteUbergraph_WBP_SkillUnlock_Anim_Unlock::CallFunc_GetSkillLevelDataFromItemSkillData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillUnlock_Anim_Unlock_C_ExecuteUbergraph_WBP_SkillUnlock_Anim_Unlock, K2Node_CreateDelegate_OutputDelegate) == 0x000394, "Member 'WBP_SkillUnlock_Anim_Unlock_C_ExecuteUbergraph_WBP_SkillUnlock_Anim_Unlock::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_SkillUnlock_Anim_Unlock.WBP_SkillUnlock_Anim_Unlock_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_SkillUnlock_Anim_Unlock_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation_0;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SkillUnlock_Anim_Unlock_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WBP_SkillUnlock_Anim_Unlock_C_OnAnimationFinished");
static_assert(sizeof(WBP_SkillUnlock_Anim_Unlock_C_OnAnimationFinished) == 0x000008, "Wrong size on WBP_SkillUnlock_Anim_Unlock_C_OnAnimationFinished");
static_assert(offsetof(WBP_SkillUnlock_Anim_Unlock_C_OnAnimationFinished, Animation_0) == 0x000000, "Member 'WBP_SkillUnlock_Anim_Unlock_C_OnAnimationFinished::Animation_0' has a wrong offset!");

}

