#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SkillUnlock_MaterialList

#include "Basic.hpp"

#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SkillUnlock_MaterialList.WBP_SkillUnlock_MaterialList_C
// 0x0020 (0x0480 - 0x0460)
class UWBP_SkillUnlock_MaterialList_C final : public UUserWidgetZion
{
public:
	class UImage*                                 BG;                                                // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         VerticalBox_Container;                             // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_SkillUnlock_MaterialEntry_C*> MaterialEntries;                                 // 0x0470(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay)

public:
	void Clear();
	void ClearEntries();
	void Setup(struct FSkillLevelData& SkillLevelData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SkillUnlock_MaterialList_C">();
	}
	static class UWBP_SkillUnlock_MaterialList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SkillUnlock_MaterialList_C>();
	}
};
static_assert(alignof(UWBP_SkillUnlock_MaterialList_C) == 0x000008, "Wrong alignment on UWBP_SkillUnlock_MaterialList_C");
static_assert(sizeof(UWBP_SkillUnlock_MaterialList_C) == 0x000480, "Wrong size on UWBP_SkillUnlock_MaterialList_C");
static_assert(offsetof(UWBP_SkillUnlock_MaterialList_C, BG) == 0x000460, "Member 'UWBP_SkillUnlock_MaterialList_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_SkillUnlock_MaterialList_C, VerticalBox_Container) == 0x000468, "Member 'UWBP_SkillUnlock_MaterialList_C::VerticalBox_Container' has a wrong offset!");
static_assert(offsetof(UWBP_SkillUnlock_MaterialList_C, MaterialEntries) == 0x000470, "Member 'UWBP_SkillUnlock_MaterialList_C::MaterialEntries' has a wrong offset!");

}

