#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Item_UpgradeInfo

#include "Basic.hpp"

#include "Zion_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Item_UpgradeInfo.WBP_Item_UpgradeInfo_C.ExecuteUbergraph_WBP_Item_UpgradeInfo
// 0x0004 (0x0004 - 0x0000)
struct WBP_Item_UpgradeInfo_C_ExecuteUbergraph_WBP_Item_UpgradeInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Item_UpgradeInfo_C_ExecuteUbergraph_WBP_Item_UpgradeInfo) == 0x000004, "Wrong alignment on WBP_Item_UpgradeInfo_C_ExecuteUbergraph_WBP_Item_UpgradeInfo");
static_assert(sizeof(WBP_Item_UpgradeInfo_C_ExecuteUbergraph_WBP_Item_UpgradeInfo) == 0x000004, "Wrong size on WBP_Item_UpgradeInfo_C_ExecuteUbergraph_WBP_Item_UpgradeInfo");
static_assert(offsetof(WBP_Item_UpgradeInfo_C_ExecuteUbergraph_WBP_Item_UpgradeInfo, EntryPoint) == 0x000000, "Member 'WBP_Item_UpgradeInfo_C_ExecuteUbergraph_WBP_Item_UpgradeInfo::EntryPoint' has a wrong offset!");

// Function WBP_Item_UpgradeInfo.WBP_Item_UpgradeInfo_C.Setup
// 0x0030 (0x0030 - 0x0000)
struct WBP_Item_UpgradeInfo_C_Setup final
{
public:
	struct FInventoryItemUpgradeInfo              UpgradeInfo_0;                                     // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Item_UpgradeInfo_C_Setup) == 0x000008, "Wrong alignment on WBP_Item_UpgradeInfo_C_Setup");
static_assert(sizeof(WBP_Item_UpgradeInfo_C_Setup) == 0x000030, "Wrong size on WBP_Item_UpgradeInfo_C_Setup");
static_assert(offsetof(WBP_Item_UpgradeInfo_C_Setup, UpgradeInfo_0) == 0x000000, "Member 'WBP_Item_UpgradeInfo_C_Setup::UpgradeInfo_0' has a wrong offset!");

// Function WBP_Item_UpgradeInfo.WBP_Item_UpgradeInfo_C.SetupText
// 0x0040 (0x0040 - 0x0000)
struct WBP_Item_UpgradeInfo_C_SetupText final
{
public:
	class URefreshableRichTextBlock*              Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FRichTextInputElement>          FormatElements;                                    // 0x0018(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class FString>                         StringElements;                                    // 0x0028(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Item_UpgradeInfo_C_SetupText) == 0x000008, "Wrong alignment on WBP_Item_UpgradeInfo_C_SetupText");
static_assert(sizeof(WBP_Item_UpgradeInfo_C_SetupText) == 0x000040, "Wrong size on WBP_Item_UpgradeInfo_C_SetupText");
static_assert(offsetof(WBP_Item_UpgradeInfo_C_SetupText, Target) == 0x000000, "Member 'WBP_Item_UpgradeInfo_C_SetupText::Target' has a wrong offset!");
static_assert(offsetof(WBP_Item_UpgradeInfo_C_SetupText, Text) == 0x000008, "Member 'WBP_Item_UpgradeInfo_C_SetupText::Text' has a wrong offset!");
static_assert(offsetof(WBP_Item_UpgradeInfo_C_SetupText, FormatElements) == 0x000018, "Member 'WBP_Item_UpgradeInfo_C_SetupText::FormatElements' has a wrong offset!");
static_assert(offsetof(WBP_Item_UpgradeInfo_C_SetupText, StringElements) == 0x000028, "Member 'WBP_Item_UpgradeInfo_C_SetupText::StringElements' has a wrong offset!");
static_assert(offsetof(WBP_Item_UpgradeInfo_C_SetupText, Temp_bool_Variable) == 0x000038, "Member 'WBP_Item_UpgradeInfo_C_SetupText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Item_UpgradeInfo_C_SetupText, CallFunc_TextIsEmpty_ReturnValue) == 0x000039, "Member 'WBP_Item_UpgradeInfo_C_SetupText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_UpgradeInfo_C_SetupText, Temp_byte_Variable) == 0x00003A, "Member 'WBP_Item_UpgradeInfo_C_SetupText::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Item_UpgradeInfo_C_SetupText, Temp_byte_Variable_1) == 0x00003B, "Member 'WBP_Item_UpgradeInfo_C_SetupText::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Item_UpgradeInfo_C_SetupText, K2Node_Select_Default) == 0x00003C, "Member 'WBP_Item_UpgradeInfo_C_SetupText::K2Node_Select_Default' has a wrong offset!");

}

