#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InventoryViewer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InventoryViewer.WBP_InventoryViewer_C
// 0x0050 (0x04C8 - 0x0478)
class UWBP_InventoryViewer_C final : public UUserWidgetGameMenu_Page
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0478(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           Container;                                         // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Scrollbox_C*                       WBP_Scrollbox;                                     // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInventoryComponent*                    Inventory_Component;                               // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash)
	TArray<EInventoryItemType>                    ItemTypes;                                         // 0x0498(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	TMulticastInlineDelegate<void(class UWBP_InventoryEntry_C* Entry)> OnEntryFocused;               // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UWBP_InventoryViewer_Category_C*> InventoryCategories;                              // 0x04B8(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay)

public:
	void Construct();
	void CreateInventoryPage(EInventoryItemType ItemType);
	void ExecuteUbergraph_WBP_InventoryViewer(int32 EntryPoint);
	void OnEscapeInventoryCategory(class UWBP_InventoryViewer_Category_C* InvetoryCategory, bool bEscapeFromBottom, int32 IndexInRow);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnInventoryItemFocused(class UWBP_InventoryEntry_C* Item);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_InventoryViewer_C">();
	}
	static class UWBP_InventoryViewer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InventoryViewer_C>();
	}
};
static_assert(alignof(UWBP_InventoryViewer_C) == 0x000008, "Wrong alignment on UWBP_InventoryViewer_C");
static_assert(sizeof(UWBP_InventoryViewer_C) == 0x0004C8, "Wrong size on UWBP_InventoryViewer_C");
static_assert(offsetof(UWBP_InventoryViewer_C, UberGraphFrame) == 0x000478, "Member 'UWBP_InventoryViewer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryViewer_C, Container) == 0x000480, "Member 'UWBP_InventoryViewer_C::Container' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryViewer_C, WBP_Scrollbox) == 0x000488, "Member 'UWBP_InventoryViewer_C::WBP_Scrollbox' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryViewer_C, Inventory_Component) == 0x000490, "Member 'UWBP_InventoryViewer_C::Inventory_Component' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryViewer_C, ItemTypes) == 0x000498, "Member 'UWBP_InventoryViewer_C::ItemTypes' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryViewer_C, OnEntryFocused) == 0x0004A8, "Member 'UWBP_InventoryViewer_C::OnEntryFocused' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryViewer_C, InventoryCategories) == 0x0004B8, "Member 'UWBP_InventoryViewer_C::InventoryCategories' has a wrong offset!");

}

