#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Difficulty_CurrencyBonus

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Difficulty_CurrencyBonus.WBP_Difficulty_CurrencyBonus_C.ExecuteUbergraph_WBP_Difficulty_CurrencyBonus
// 0x0004 (0x0004 - 0x0000)
struct WBP_Difficulty_CurrencyBonus_C_ExecuteUbergraph_WBP_Difficulty_CurrencyBonus final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Difficulty_CurrencyBonus_C_ExecuteUbergraph_WBP_Difficulty_CurrencyBonus) == 0x000004, "Wrong alignment on WBP_Difficulty_CurrencyBonus_C_ExecuteUbergraph_WBP_Difficulty_CurrencyBonus");
static_assert(sizeof(WBP_Difficulty_CurrencyBonus_C_ExecuteUbergraph_WBP_Difficulty_CurrencyBonus) == 0x000004, "Wrong size on WBP_Difficulty_CurrencyBonus_C_ExecuteUbergraph_WBP_Difficulty_CurrencyBonus");
static_assert(offsetof(WBP_Difficulty_CurrencyBonus_C_ExecuteUbergraph_WBP_Difficulty_CurrencyBonus, EntryPoint) == 0x000000, "Member 'WBP_Difficulty_CurrencyBonus_C_ExecuteUbergraph_WBP_Difficulty_CurrencyBonus::EntryPoint' has a wrong offset!");

// Function WBP_Difficulty_CurrencyBonus.WBP_Difficulty_CurrencyBonus_C.RefreshCurrency
// 0x0028 (0x0028 - 0x0000)
struct WBP_Difficulty_CurrencyBonus_C_RefreshCurrency final
{
public:
	class UDifficultySystemComponent*             CallFunc_Get_ReturnValue;                          // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrencyFactorRatio_ReturnValue;       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrencyFactor_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0010(0x0010)()
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Difficulty_CurrencyBonus_C_RefreshCurrency) == 0x000008, "Wrong alignment on WBP_Difficulty_CurrencyBonus_C_RefreshCurrency");
static_assert(sizeof(WBP_Difficulty_CurrencyBonus_C_RefreshCurrency) == 0x000028, "Wrong size on WBP_Difficulty_CurrencyBonus_C_RefreshCurrency");
static_assert(offsetof(WBP_Difficulty_CurrencyBonus_C_RefreshCurrency, CallFunc_Get_ReturnValue) == 0x000000, "Member 'WBP_Difficulty_CurrencyBonus_C_RefreshCurrency::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Difficulty_CurrencyBonus_C_RefreshCurrency, CallFunc_GetCurrencyFactorRatio_ReturnValue) == 0x000008, "Member 'WBP_Difficulty_CurrencyBonus_C_RefreshCurrency::CallFunc_GetCurrencyFactorRatio_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Difficulty_CurrencyBonus_C_RefreshCurrency, CallFunc_GetCurrencyFactor_ReturnValue) == 0x00000C, "Member 'WBP_Difficulty_CurrencyBonus_C_RefreshCurrency::CallFunc_GetCurrencyFactor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Difficulty_CurrencyBonus_C_RefreshCurrency, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000010, "Member 'WBP_Difficulty_CurrencyBonus_C_RefreshCurrency::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Difficulty_CurrencyBonus_C_RefreshCurrency, CallFunc_Conv_DoubleToText_Value_ImplicitCast) == 0x000020, "Member 'WBP_Difficulty_CurrencyBonus_C_RefreshCurrency::CallFunc_Conv_DoubleToText_Value_ImplicitCast' has a wrong offset!");

}

