#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Event

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Event.WBP_Event_C.CreateChoices
// 0x0058 (0x0058 - 0x0000)
struct WBP_Event_C_CreateChoices final
{
public:
	TArray<class FText>                           InputPin;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0020(0x0010)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Event_Choice_C*                    CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_Event_Choice_C* EventChoice)> K2Node_CreateDelegate_OutputDelegate;    // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Event_C_CreateChoices) == 0x000008, "Wrong alignment on WBP_Event_C_CreateChoices");
static_assert(sizeof(WBP_Event_C_CreateChoices) == 0x000058, "Wrong size on WBP_Event_C_CreateChoices");
static_assert(offsetof(WBP_Event_C_CreateChoices, InputPin) == 0x000000, "Member 'WBP_Event_C_CreateChoices::InputPin' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_CreateChoices, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_Event_C_CreateChoices::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_CreateChoices, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WBP_Event_C_CreateChoices::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_CreateChoices, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'WBP_Event_C_CreateChoices::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_CreateChoices, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_Event_C_CreateChoices::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_CreateChoices, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_Event_C_CreateChoices::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_CreateChoices, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'WBP_Event_C_CreateChoices::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_CreateChoices, CallFunc_Create_ReturnValue) == 0x000038, "Member 'WBP_Event_C_CreateChoices::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_CreateChoices, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'WBP_Event_C_CreateChoices::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_CreateChoices, CallFunc_AddChild_ReturnValue) == 0x000050, "Member 'WBP_Event_C_CreateChoices::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function WBP_Event.WBP_Event_C.ExecuteUbergraph_WBP_Event
// 0x0168 (0x0168 - 0x0000)
struct WBP_Event_C_ExecuteUbergraph_WBP_Event final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFadeSubsystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFadeSubsystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             Temp_delegate_Variable;                            // 0x0018(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Pause_C*                           CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAutoSkipAlreadySeenEvents_ReturnValue; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_SpeakerName_1;                        // 0x0060(0x0010)(ConstParm)
	class FText                                   K2Node_Event_Text_1;                               // 0x0070(0x0010)(ConstParm)
	TArray<class FText>                           K2Node_Event_Choices;                              // 0x0080(0x0010)(ConstParm, ReferenceParm)
	class UWBP_Dialog_YesNo_C*                    CallFunc_Create_ReturnValue_1;                     // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Event_Choice_C*                    K2Node_CustomEvent_EventChoice;                    // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue;             // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_SpeakerName;                          // 0x00B0(0x0010)(ConstParm)
	class FText                                   K2Node_Event_Text;                                 // 0x00C0(0x0010)(ConstParm)
	float                                         K2Node_Event_Duration;                             // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D6[0x2];                                       // 0x00D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanSkipEvent_ReturnValue;                 // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEventPlayer*                           CallFunc_GetEventPlayer_ReturnValue;               // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue_1;              // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue_2;              // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0120(0x0010)(ConstParm)
	bool                                          CallFunc_ShouldUsePreSkipFadeOut_ReturnValue;      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0134(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldUsePostSkipFadeIn_ReturnValue;      // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanSkipEvent_ReturnValue_1;               // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEventAlreadySeen_ReturnValue;           // 0x0146(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_147[0x1];                                      // 0x0147(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanAutoSkipEvent_ReturnValue;             // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_153[0x5];                                      // 0x0153(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue_1;           // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Event_C_ExecuteUbergraph_WBP_Event) == 0x000008, "Wrong alignment on WBP_Event_C_ExecuteUbergraph_WBP_Event");
static_assert(sizeof(WBP_Event_C_ExecuteUbergraph_WBP_Event) == 0x000168, "Wrong size on WBP_Event_C_ExecuteUbergraph_WBP_Event");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, EntryPoint) == 0x000000, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000010, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, Temp_delegate_Variable) == 0x000018, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000028, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, CallFunc_Create_ReturnValue) == 0x000030, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, CallFunc_GetAutoSkipAlreadySeenEvents_ReturnValue) == 0x000038, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::CallFunc_GetAutoSkipAlreadySeenEvents_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, CallFunc_PlayAnimationForward_ReturnValue) == 0x000050, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000058, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, K2Node_Event_SpeakerName_1) == 0x000060, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::K2Node_Event_SpeakerName_1' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, K2Node_Event_Text_1) == 0x000070, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::K2Node_Event_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, K2Node_Event_Choices) == 0x000080, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::K2Node_Event_Choices' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, CallFunc_Create_ReturnValue_1) == 0x000090, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, K2Node_CustomEvent_EventChoice) == 0x000098, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::K2Node_CustomEvent_EventChoice' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, CallFunc_GetChildAt_ReturnValue) == 0x0000A0, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, CallFunc_PlayUMGAnimation_ReturnValue) == 0x0000A8, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::CallFunc_PlayUMGAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, K2Node_Event_SpeakerName) == 0x0000B0, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::K2Node_Event_SpeakerName' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, K2Node_Event_Text) == 0x0000C0, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::K2Node_Event_Text' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, K2Node_Event_Duration) == 0x0000D0, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::K2Node_Event_Duration' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, CallFunc_IsValid_ReturnValue) == 0x0000D4, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, CallFunc_SetGamePaused_ReturnValue) == 0x0000D5, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000D8, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000E8, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, CallFunc_CanSkipEvent_ReturnValue) == 0x0000F8, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::CallFunc_CanSkipEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000FC, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, CallFunc_GetEventPlayer_ReturnValue) == 0x000110, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::CallFunc_GetEventPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, CallFunc_SetGamePaused_ReturnValue_1) == 0x000118, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::CallFunc_SetGamePaused_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, CallFunc_SetGamePaused_ReturnValue_2) == 0x000119, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::CallFunc_SetGamePaused_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, Temp_text_Variable) == 0x000120, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, CallFunc_ShouldUsePreSkipFadeOut_ReturnValue) == 0x000130, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::CallFunc_ShouldUsePreSkipFadeOut_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, K2Node_CreateDelegate_OutputDelegate_4) == 0x000134, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, CallFunc_ShouldUsePostSkipFadeIn_ReturnValue) == 0x000144, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::CallFunc_ShouldUsePostSkipFadeIn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, CallFunc_CanSkipEvent_ReturnValue_1) == 0x000145, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::CallFunc_CanSkipEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, CallFunc_IsEventAlreadySeen_ReturnValue) == 0x000146, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::CallFunc_IsEventAlreadySeen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000148, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, CallFunc_BooleanAND_ReturnValue) == 0x000150, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, CallFunc_CanAutoSkipEvent_ReturnValue) == 0x000151, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::CallFunc_CanAutoSkipEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, CallFunc_BooleanAND_ReturnValue_1) == 0x000152, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, CallFunc_PlayUMGAnimation_ReturnValue_1) == 0x000158, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::CallFunc_PlayUMGAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_ExecuteUbergraph_WBP_Event, CallFunc_IsValid_ReturnValue_1) == 0x000160, "Member 'WBP_Event_C_ExecuteUbergraph_WBP_Event::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_Event.WBP_Event_C.OnChoiceConfirmed
// 0x0008 (0x0008 - 0x0000)
struct WBP_Event_C_OnChoiceConfirmed final
{
public:
	class UWBP_Event_Choice_C*                    EventChoice;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Event_C_OnChoiceConfirmed) == 0x000008, "Wrong alignment on WBP_Event_C_OnChoiceConfirmed");
static_assert(sizeof(WBP_Event_C_OnChoiceConfirmed) == 0x000008, "Wrong size on WBP_Event_C_OnChoiceConfirmed");
static_assert(offsetof(WBP_Event_C_OnChoiceConfirmed, EventChoice) == 0x000000, "Member 'WBP_Event_C_OnChoiceConfirmed::EventChoice' has a wrong offset!");

// Function WBP_Event.WBP_Event_C.OnFocusReceived
// 0x0278 (0x0278 - 0x0000)
struct WBP_Event_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue_1;                    // 0x01C0(0x00B8)()
};
static_assert(alignof(WBP_Event_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Event_C_OnFocusReceived");
static_assert(sizeof(WBP_Event_C_OnFocusReceived) == 0x000278, "Wrong size on WBP_Event_C_OnFocusReceived");
static_assert(offsetof(WBP_Event_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Event_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Event_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Event_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Event_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_OnFocusReceived, CallFunc_GetChildAt_ReturnValue) == 0x0001B0, "Member 'WBP_Event_C_OnFocusReceived::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_OnFocusReceived, CallFunc_GetChildrenCount_ReturnValue) == 0x0001B8, "Member 'WBP_Event_C_OnFocusReceived::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_OnFocusReceived, CallFunc_Greater_IntInt_ReturnValue) == 0x0001BC, "Member 'WBP_Event_C_OnFocusReceived::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_OnFocusReceived, CallFunc_Handled_ReturnValue_1) == 0x0001C0, "Member 'WBP_Event_C_OnFocusReceived::CallFunc_Handled_ReturnValue_1' has a wrong offset!");

// Function WBP_Event.WBP_Event_C.OnKeyDown
// 0x0310 (0x0310 - 0x0000)
struct WBP_Event_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0130(0x0018)(HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnhancedInputLocalPlayerSubsystem*     CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0160(0x00B8)()
	TScriptInterface<class IEnhancedInputSubsystemInterface> CallFunc_QueryKeysMappedToAction_self_CastInput; // 0x0218(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FKey>                           CallFunc_QueryKeysMappedToAction_ReturnValue;      // 0x0228(0x0010)(ReferenceParm)
	struct FKey                                   CallFunc_Array_Get_Item;                           // 0x0238(0x0018)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0255(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_256[0x2];                                      // 0x0256(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0258(0x00B8)()
};
static_assert(alignof(WBP_Event_C_OnKeyDown) == 0x000008, "Wrong alignment on WBP_Event_C_OnKeyDown");
static_assert(sizeof(WBP_Event_C_OnKeyDown) == 0x000310, "Wrong size on WBP_Event_C_OnKeyDown");
static_assert(offsetof(WBP_Event_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'WBP_Event_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'WBP_Event_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_OnKeyDown, ReturnValue) == 0x000078, "Member 'WBP_Event_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_OnKeyDown, CallFunc_GetKey_ReturnValue) == 0x000130, "Member 'WBP_Event_C_OnKeyDown::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_OnKeyDown, Temp_int_Array_Index_Variable) == 0x000148, "Member 'WBP_Event_C_OnKeyDown::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_OnKeyDown, Temp_int_Loop_Counter_Variable) == 0x00014C, "Member 'WBP_Event_C_OnKeyDown::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_OnKeyDown, CallFunc_Add_IntInt_ReturnValue) == 0x000150, "Member 'WBP_Event_C_OnKeyDown::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_OnKeyDown, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000158, "Member 'WBP_Event_C_OnKeyDown::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_OnKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000160, "Member 'WBP_Event_C_OnKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_OnKeyDown, CallFunc_QueryKeysMappedToAction_self_CastInput) == 0x000218, "Member 'WBP_Event_C_OnKeyDown::CallFunc_QueryKeysMappedToAction_self_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_OnKeyDown, CallFunc_QueryKeysMappedToAction_ReturnValue) == 0x000228, "Member 'WBP_Event_C_OnKeyDown::CallFunc_QueryKeysMappedToAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_OnKeyDown, CallFunc_Array_Get_Item) == 0x000238, "Member 'WBP_Event_C_OnKeyDown::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_OnKeyDown, CallFunc_Array_Length_ReturnValue) == 0x000250, "Member 'WBP_Event_C_OnKeyDown::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_OnKeyDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000254, "Member 'WBP_Event_C_OnKeyDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_OnKeyDown, CallFunc_Less_IntInt_ReturnValue) == 0x000255, "Member 'WBP_Event_C_OnKeyDown::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x000258, "Member 'WBP_Event_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Event.WBP_Event_C.OnPlayChoices
// 0x0030 (0x0030 - 0x0000)
struct WBP_Event_C_OnPlayChoices final
{
public:
	class FText                                   SpeakerName_0;                                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   Text;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class FText>                           Choices;                                           // 0x0020(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Event_C_OnPlayChoices) == 0x000008, "Wrong alignment on WBP_Event_C_OnPlayChoices");
static_assert(sizeof(WBP_Event_C_OnPlayChoices) == 0x000030, "Wrong size on WBP_Event_C_OnPlayChoices");
static_assert(offsetof(WBP_Event_C_OnPlayChoices, SpeakerName_0) == 0x000000, "Member 'WBP_Event_C_OnPlayChoices::SpeakerName_0' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_OnPlayChoices, Text) == 0x000010, "Member 'WBP_Event_C_OnPlayChoices::Text' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_OnPlayChoices, Choices) == 0x000020, "Member 'WBP_Event_C_OnPlayChoices::Choices' has a wrong offset!");

// Function WBP_Event.WBP_Event_C.OnPressCancel
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Event_C_OnPressCancel final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Event_C_OnPressCancel) == 0x000008, "Wrong alignment on WBP_Event_C_OnPressCancel");
static_assert(sizeof(WBP_Event_C_OnPressCancel) == 0x0001B0, "Wrong size on WBP_Event_C_OnPressCancel");
static_assert(offsetof(WBP_Event_C_OnPressCancel, KeyEvent) == 0x000000, "Member 'WBP_Event_C_OnPressCancel::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_OnPressCancel, ReturnValue) == 0x000040, "Member 'WBP_Event_C_OnPressCancel::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_OnPressCancel, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Event_C_OnPressCancel::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Event.WBP_Event_C.OnTalk
// 0x0028 (0x0028 - 0x0000)
struct WBP_Event_C_OnTalk final
{
public:
	class FText                                   SpeakerName_0;                                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   Text;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         Duration;                                          // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Event_C_OnTalk) == 0x000008, "Wrong alignment on WBP_Event_C_OnTalk");
static_assert(sizeof(WBP_Event_C_OnTalk) == 0x000028, "Wrong size on WBP_Event_C_OnTalk");
static_assert(offsetof(WBP_Event_C_OnTalk, SpeakerName_0) == 0x000000, "Member 'WBP_Event_C_OnTalk::SpeakerName_0' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_OnTalk, Text) == 0x000010, "Member 'WBP_Event_C_OnTalk::Text' has a wrong offset!");
static_assert(offsetof(WBP_Event_C_OnTalk, Duration) == 0x000020, "Member 'WBP_Event_C_OnTalk::Duration' has a wrong offset!");

}

