#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MapIconDetails_Default

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MapIconDetails_Default.WBP_MapIconDetails_Default_C
// 0x0050 (0x04C0 - 0x0470)
class UWBP_MapIconDetails_Default_C final : public UUserWidgetMapIconDetails
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideAnim;                                          // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImageZion*                             AptitudeIcon;                                      // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             AptitudeRequired;                                  // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MapIconName;                                       // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_1;                                         // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Aptitude;                                  // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Item;                                      // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_ItemContainer;                         // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_MapIconDetails_Default(int32 EntryPoint);
	void OnFinish_83512B1A43BE04F1C2933DB0E6278976();
	void OnFinish_90525EB9443409BE5780DCB434001197();
	void OnRemoveIconDetails(bool bInstant);
	void UpdateAptitudeOverlay();
	void UpdateItemOverlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MapIconDetails_Default_C">();
	}
	static class UWBP_MapIconDetails_Default_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MapIconDetails_Default_C>();
	}
};
static_assert(alignof(UWBP_MapIconDetails_Default_C) == 0x000008, "Wrong alignment on UWBP_MapIconDetails_Default_C");
static_assert(sizeof(UWBP_MapIconDetails_Default_C) == 0x0004C0, "Wrong size on UWBP_MapIconDetails_Default_C");
static_assert(offsetof(UWBP_MapIconDetails_Default_C, UberGraphFrame) == 0x000470, "Member 'UWBP_MapIconDetails_Default_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_Default_C, HideAnim) == 0x000478, "Member 'UWBP_MapIconDetails_Default_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_Default_C, ShowAnim) == 0x000480, "Member 'UWBP_MapIconDetails_Default_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_Default_C, AptitudeIcon) == 0x000488, "Member 'UWBP_MapIconDetails_Default_C::AptitudeIcon' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_Default_C, AptitudeRequired) == 0x000490, "Member 'UWBP_MapIconDetails_Default_C::AptitudeRequired' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_Default_C, MapIconName) == 0x000498, "Member 'UWBP_MapIconDetails_Default_C::MapIconName' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_Default_C, Overlay_1) == 0x0004A0, "Member 'UWBP_MapIconDetails_Default_C::Overlay_1' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_Default_C, Overlay_Aptitude) == 0x0004A8, "Member 'UWBP_MapIconDetails_Default_C::Overlay_Aptitude' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_Default_C, Overlay_Item) == 0x0004B0, "Member 'UWBP_MapIconDetails_Default_C::Overlay_Item' has a wrong offset!");
static_assert(offsetof(UWBP_MapIconDetails_Default_C, VerticalBox_ItemContainer) == 0x0004B8, "Member 'UWBP_MapIconDetails_Default_C::VerticalBox_ItemContainer' has a wrong offset!");

}

