#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WorldLoadingIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_WorldLoadingIcon.WBP_WorldLoadingIcon_C
// 0x0048 (0x04A8 - 0x0460)
class UWBP_WorldLoadingIcon_C final : public UUserWidgetZionShowHide
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideAnim;                                          // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           Canvas_Anchor;                                     // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox;                                       // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_0;                                     // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsShowed;                                         // 0x04A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_WorldLoadingIcon(int32 EntryPoint);
	void Finished_FC1864D249C35D818E8B2A82661CB5D4();
	void Hide(bool bInstant);
	void HideAndRemoveFromParent(bool bInstant);
	void OnConstraintHUDAspectRatioChanged();
	void Show(bool bInstant);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_WorldLoadingIcon_C">();
	}
	static class UWBP_WorldLoadingIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_WorldLoadingIcon_C>();
	}
};
static_assert(alignof(UWBP_WorldLoadingIcon_C) == 0x000008, "Wrong alignment on UWBP_WorldLoadingIcon_C");
static_assert(sizeof(UWBP_WorldLoadingIcon_C) == 0x0004A8, "Wrong size on UWBP_WorldLoadingIcon_C");
static_assert(offsetof(UWBP_WorldLoadingIcon_C, UberGraphFrame) == 0x000460, "Member 'UWBP_WorldLoadingIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_WorldLoadingIcon_C, HideAnim) == 0x000468, "Member 'UWBP_WorldLoadingIcon_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UWBP_WorldLoadingIcon_C, ShowAnim) == 0x000470, "Member 'UWBP_WorldLoadingIcon_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UWBP_WorldLoadingIcon_C, Canvas_Anchor) == 0x000478, "Member 'UWBP_WorldLoadingIcon_C::Canvas_Anchor' has a wrong offset!");
static_assert(offsetof(UWBP_WorldLoadingIcon_C, Image) == 0x000480, "Member 'UWBP_WorldLoadingIcon_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_WorldLoadingIcon_C, Image_0) == 0x000488, "Member 'UWBP_WorldLoadingIcon_C::Image_0' has a wrong offset!");
static_assert(offsetof(UWBP_WorldLoadingIcon_C, RetainerBox) == 0x000490, "Member 'UWBP_WorldLoadingIcon_C::RetainerBox' has a wrong offset!");
static_assert(offsetof(UWBP_WorldLoadingIcon_C, RetainerBox_0) == 0x000498, "Member 'UWBP_WorldLoadingIcon_C::RetainerBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_WorldLoadingIcon_C, bIsShowed) == 0x0004A0, "Member 'UWBP_WorldLoadingIcon_C::bIsShowed' has a wrong offset!");

}

