#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SkillUnlock_Anim_Unlock

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SkillUnlock_Anim_Unlock.WBP_SkillUnlock_Anim_Unlock_C
// 0x00A8 (0x0508 - 0x0460)
class UWBP_SkillUnlock_Anim_Unlock_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Animation;                                         // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base_Lank;                                         // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Light;                                          // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bottom_Square;                                     // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Center_Block;                                      // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Center_Square;                                     // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Effect;                                            // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Left_Block;                                        // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Left_Square;                                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Right_Block;                                       // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Right_Square;                                      // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SkillIcon;                                         // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SkillName;                                         // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Top_Square;                                        // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SkillRank_C*                       WBP_SkillRank_After;                               // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    SkillHandle;                                       // 0x04E0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, ExposeOnSpawn)
	int32                                         NewLevel;                                          // 0x04F0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_4F4[0x4];                                      // 0x04F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnFinished;                                        // 0x04F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Construct();
	void ExecuteUbergraph_WBP_SkillUnlock_Anim_Unlock(int32 EntryPoint);
	void OnAnimationFinished(const class UWidgetAnimation* Animation_0);
	void OnFinish_5C98E1D948761BED0250DEA804D63B4B();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SkillUnlock_Anim_Unlock_C">();
	}
	static class UWBP_SkillUnlock_Anim_Unlock_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SkillUnlock_Anim_Unlock_C>();
	}
};
static_assert(alignof(UWBP_SkillUnlock_Anim_Unlock_C) == 0x000008, "Wrong alignment on UWBP_SkillUnlock_Anim_Unlock_C");
static_assert(sizeof(UWBP_SkillUnlock_Anim_Unlock_C) == 0x000508, "Wrong size on UWBP_SkillUnlock_Anim_Unlock_C");
static_assert(offsetof(UWBP_SkillUnlock_Anim_Unlock_C, UberGraphFrame) == 0x000460, "Member 'UWBP_SkillUnlock_Anim_Unlock_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SkillUnlock_Anim_Unlock_C, Animation) == 0x000468, "Member 'UWBP_SkillUnlock_Anim_Unlock_C::Animation' has a wrong offset!");
static_assert(offsetof(UWBP_SkillUnlock_Anim_Unlock_C, Base_Lank) == 0x000470, "Member 'UWBP_SkillUnlock_Anim_Unlock_C::Base_Lank' has a wrong offset!");
static_assert(offsetof(UWBP_SkillUnlock_Anim_Unlock_C, BG_Light) == 0x000478, "Member 'UWBP_SkillUnlock_Anim_Unlock_C::BG_Light' has a wrong offset!");
static_assert(offsetof(UWBP_SkillUnlock_Anim_Unlock_C, Bottom_Square) == 0x000480, "Member 'UWBP_SkillUnlock_Anim_Unlock_C::Bottom_Square' has a wrong offset!");
static_assert(offsetof(UWBP_SkillUnlock_Anim_Unlock_C, Center_Block) == 0x000488, "Member 'UWBP_SkillUnlock_Anim_Unlock_C::Center_Block' has a wrong offset!");
static_assert(offsetof(UWBP_SkillUnlock_Anim_Unlock_C, Center_Square) == 0x000490, "Member 'UWBP_SkillUnlock_Anim_Unlock_C::Center_Square' has a wrong offset!");
static_assert(offsetof(UWBP_SkillUnlock_Anim_Unlock_C, Effect) == 0x000498, "Member 'UWBP_SkillUnlock_Anim_Unlock_C::Effect' has a wrong offset!");
static_assert(offsetof(UWBP_SkillUnlock_Anim_Unlock_C, Left_Block) == 0x0004A0, "Member 'UWBP_SkillUnlock_Anim_Unlock_C::Left_Block' has a wrong offset!");
static_assert(offsetof(UWBP_SkillUnlock_Anim_Unlock_C, Left_Square) == 0x0004A8, "Member 'UWBP_SkillUnlock_Anim_Unlock_C::Left_Square' has a wrong offset!");
static_assert(offsetof(UWBP_SkillUnlock_Anim_Unlock_C, Right_Block) == 0x0004B0, "Member 'UWBP_SkillUnlock_Anim_Unlock_C::Right_Block' has a wrong offset!");
static_assert(offsetof(UWBP_SkillUnlock_Anim_Unlock_C, Right_Square) == 0x0004B8, "Member 'UWBP_SkillUnlock_Anim_Unlock_C::Right_Square' has a wrong offset!");
static_assert(offsetof(UWBP_SkillUnlock_Anim_Unlock_C, SkillIcon) == 0x0004C0, "Member 'UWBP_SkillUnlock_Anim_Unlock_C::SkillIcon' has a wrong offset!");
static_assert(offsetof(UWBP_SkillUnlock_Anim_Unlock_C, SkillName) == 0x0004C8, "Member 'UWBP_SkillUnlock_Anim_Unlock_C::SkillName' has a wrong offset!");
static_assert(offsetof(UWBP_SkillUnlock_Anim_Unlock_C, Top_Square) == 0x0004D0, "Member 'UWBP_SkillUnlock_Anim_Unlock_C::Top_Square' has a wrong offset!");
static_assert(offsetof(UWBP_SkillUnlock_Anim_Unlock_C, WBP_SkillRank_After) == 0x0004D8, "Member 'UWBP_SkillUnlock_Anim_Unlock_C::WBP_SkillRank_After' has a wrong offset!");
static_assert(offsetof(UWBP_SkillUnlock_Anim_Unlock_C, SkillHandle) == 0x0004E0, "Member 'UWBP_SkillUnlock_Anim_Unlock_C::SkillHandle' has a wrong offset!");
static_assert(offsetof(UWBP_SkillUnlock_Anim_Unlock_C, NewLevel) == 0x0004F0, "Member 'UWBP_SkillUnlock_Anim_Unlock_C::NewLevel' has a wrong offset!");
static_assert(offsetof(UWBP_SkillUnlock_Anim_Unlock_C, OnFinished) == 0x0004F8, "Member 'UWBP_SkillUnlock_Anim_Unlock_C::OnFinished' has a wrong offset!");

}

