#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Loadout

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Loadout.WBP_Loadout_C.ExecuteUbergraph_WBP_Loadout
// 0x0040 (0x0040 - 0x0000)
struct WBP_Loadout_C_ExecuteUbergraph_WBP_Loadout final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEntryCount_Count;                      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetEntryCount_Count_1;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Loadout_EntrySlot_C*               CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Loadout_C_ExecuteUbergraph_WBP_Loadout) == 0x000008, "Wrong alignment on WBP_Loadout_C_ExecuteUbergraph_WBP_Loadout");
static_assert(sizeof(WBP_Loadout_C_ExecuteUbergraph_WBP_Loadout) == 0x000040, "Wrong size on WBP_Loadout_C_ExecuteUbergraph_WBP_Loadout");
static_assert(offsetof(WBP_Loadout_C_ExecuteUbergraph_WBP_Loadout, EntryPoint) == 0x000000, "Member 'WBP_Loadout_C_ExecuteUbergraph_WBP_Loadout::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_ExecuteUbergraph_WBP_Loadout, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_Loadout_C_ExecuteUbergraph_WBP_Loadout::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_ExecuteUbergraph_WBP_Loadout, Temp_int_Variable) == 0x000008, "Member 'WBP_Loadout_C_ExecuteUbergraph_WBP_Loadout::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_ExecuteUbergraph_WBP_Loadout, CallFunc_GetChildrenCount_ReturnValue) == 0x00000C, "Member 'WBP_Loadout_C_ExecuteUbergraph_WBP_Loadout::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_ExecuteUbergraph_WBP_Loadout, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_Loadout_C_ExecuteUbergraph_WBP_Loadout::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_ExecuteUbergraph_WBP_Loadout, CallFunc_GetEntryCount_Count) == 0x000014, "Member 'WBP_Loadout_C_ExecuteUbergraph_WBP_Loadout::CallFunc_GetEntryCount_Count' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_ExecuteUbergraph_WBP_Loadout, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Loadout_C_ExecuteUbergraph_WBP_Loadout::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_ExecuteUbergraph_WBP_Loadout, CallFunc_GetEntryCount_Count_1) == 0x00001C, "Member 'WBP_Loadout_C_ExecuteUbergraph_WBP_Loadout::CallFunc_GetEntryCount_Count_1' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_ExecuteUbergraph_WBP_Loadout, CallFunc_Create_ReturnValue) == 0x000020, "Member 'WBP_Loadout_C_ExecuteUbergraph_WBP_Loadout::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_ExecuteUbergraph_WBP_Loadout, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'WBP_Loadout_C_ExecuteUbergraph_WBP_Loadout::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_ExecuteUbergraph_WBP_Loadout, CallFunc_AddChild_ReturnValue) == 0x000030, "Member 'WBP_Loadout_C_ExecuteUbergraph_WBP_Loadout::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_ExecuteUbergraph_WBP_Loadout, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000038, "Member 'WBP_Loadout_C_ExecuteUbergraph_WBP_Loadout::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Loadout.WBP_Loadout_C.GetEntryCount
// 0x0008 (0x0008 - 0x0000)
struct WBP_Loadout_C_GetEntryCount final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEquipLoadoutCount_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Loadout_C_GetEntryCount) == 0x000004, "Wrong alignment on WBP_Loadout_C_GetEntryCount");
static_assert(sizeof(WBP_Loadout_C_GetEntryCount) == 0x000008, "Wrong size on WBP_Loadout_C_GetEntryCount");
static_assert(offsetof(WBP_Loadout_C_GetEntryCount, Count) == 0x000000, "Member 'WBP_Loadout_C_GetEntryCount::Count' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_GetEntryCount, CallFunc_GetEquipLoadoutCount_ReturnValue) == 0x000004, "Member 'WBP_Loadout_C_GetEntryCount::CallFunc_GetEquipLoadoutCount_ReturnValue' has a wrong offset!");

// Function WBP_Loadout.WBP_Loadout_C.GetNextEntryIndex
// 0x0014 (0x0014 - 0x0000)
struct WBP_Loadout_C_GetNextEntryIndex final
{
public:
	int32                                         NextIndex;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEntryCount_Count;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_LoopAround_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Loadout_C_GetNextEntryIndex) == 0x000004, "Wrong alignment on WBP_Loadout_C_GetNextEntryIndex");
static_assert(sizeof(WBP_Loadout_C_GetNextEntryIndex) == 0x000014, "Wrong size on WBP_Loadout_C_GetNextEntryIndex");
static_assert(offsetof(WBP_Loadout_C_GetNextEntryIndex, NextIndex) == 0x000000, "Member 'WBP_Loadout_C_GetNextEntryIndex::NextIndex' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_GetNextEntryIndex, CallFunc_GetEntryCount_Count) == 0x000004, "Member 'WBP_Loadout_C_GetNextEntryIndex::CallFunc_GetEntryCount_Count' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_GetNextEntryIndex, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Loadout_C_GetNextEntryIndex::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_GetNextEntryIndex, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_Loadout_C_GetNextEntryIndex::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_GetNextEntryIndex, CallFunc_LoopAround_ReturnValue) == 0x000010, "Member 'WBP_Loadout_C_GetNextEntryIndex::CallFunc_LoopAround_ReturnValue' has a wrong offset!");

// Function WBP_Loadout.WBP_Loadout_C.GetPreviousEntryIndex
// 0x0014 (0x0014 - 0x0000)
struct WBP_Loadout_C_GetPreviousEntryIndex final
{
public:
	int32                                         NextIndex;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEntryCount_Count;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_LoopAround_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Loadout_C_GetPreviousEntryIndex) == 0x000004, "Wrong alignment on WBP_Loadout_C_GetPreviousEntryIndex");
static_assert(sizeof(WBP_Loadout_C_GetPreviousEntryIndex) == 0x000014, "Wrong size on WBP_Loadout_C_GetPreviousEntryIndex");
static_assert(offsetof(WBP_Loadout_C_GetPreviousEntryIndex, NextIndex) == 0x000000, "Member 'WBP_Loadout_C_GetPreviousEntryIndex::NextIndex' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_GetPreviousEntryIndex, CallFunc_GetEntryCount_Count) == 0x000004, "Member 'WBP_Loadout_C_GetPreviousEntryIndex::CallFunc_GetEntryCount_Count' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_GetPreviousEntryIndex, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Loadout_C_GetPreviousEntryIndex::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_GetPreviousEntryIndex, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00000C, "Member 'WBP_Loadout_C_GetPreviousEntryIndex::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_GetPreviousEntryIndex, CallFunc_LoopAround_ReturnValue) == 0x000010, "Member 'WBP_Loadout_C_GetPreviousEntryIndex::CallFunc_LoopAround_ReturnValue' has a wrong offset!");

// Function WBP_Loadout.WBP_Loadout_C.GetSelectedEntryIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_Loadout_C_GetSelectedEntryIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Loadout_C_GetSelectedEntryIndex) == 0x000004, "Wrong alignment on WBP_Loadout_C_GetSelectedEntryIndex");
static_assert(sizeof(WBP_Loadout_C_GetSelectedEntryIndex) == 0x000004, "Wrong size on WBP_Loadout_C_GetSelectedEntryIndex");
static_assert(offsetof(WBP_Loadout_C_GetSelectedEntryIndex, Index_0) == 0x000000, "Member 'WBP_Loadout_C_GetSelectedEntryIndex::Index_0' has a wrong offset!");

// Function WBP_Loadout.WBP_Loadout_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Loadout_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Loadout_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Loadout_C_PreConstruct");
static_assert(sizeof(WBP_Loadout_C_PreConstruct) == 0x000001, "Wrong size on WBP_Loadout_C_PreConstruct");
static_assert(offsetof(WBP_Loadout_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Loadout_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Loadout.WBP_Loadout_C.RefreshEntrySelectedState
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_Loadout_C_RefreshEntrySelectedState final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0048)(HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0060(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0010)()
	class UWBP_Loadout_EntrySlot_C*               K2Node_DynamicCast_AsWBP_Loadout_Entry_Slot;       // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Loadout_C_RefreshEntrySelectedState) == 0x000008, "Wrong alignment on WBP_Loadout_C_RefreshEntrySelectedState");
static_assert(sizeof(WBP_Loadout_C_RefreshEntrySelectedState) == 0x0000B0, "Wrong size on WBP_Loadout_C_RefreshEntrySelectedState");
static_assert(offsetof(WBP_Loadout_C_RefreshEntrySelectedState, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_Loadout_C_RefreshEntrySelectedState::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_RefreshEntrySelectedState, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Loadout_C_RefreshEntrySelectedState::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_RefreshEntrySelectedState, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Loadout_C_RefreshEntrySelectedState::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_RefreshEntrySelectedState, CallFunc_Add_IntInt_ReturnValue_1) == 0x00000C, "Member 'WBP_Loadout_C_RefreshEntrySelectedState::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_RefreshEntrySelectedState, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000010, "Member 'WBP_Loadout_C_RefreshEntrySelectedState::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_RefreshEntrySelectedState, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'WBP_Loadout_C_RefreshEntrySelectedState::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_RefreshEntrySelectedState, CallFunc_GetAllChildren_ReturnValue) == 0x000060, "Member 'WBP_Loadout_C_RefreshEntrySelectedState::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_RefreshEntrySelectedState, K2Node_MakeArray_Array) == 0x000070, "Member 'WBP_Loadout_C_RefreshEntrySelectedState::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_RefreshEntrySelectedState, CallFunc_Array_Get_Item) == 0x000080, "Member 'WBP_Loadout_C_RefreshEntrySelectedState::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_RefreshEntrySelectedState, CallFunc_Format_ReturnValue) == 0x000088, "Member 'WBP_Loadout_C_RefreshEntrySelectedState::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_RefreshEntrySelectedState, K2Node_DynamicCast_AsWBP_Loadout_Entry_Slot) == 0x000098, "Member 'WBP_Loadout_C_RefreshEntrySelectedState::K2Node_DynamicCast_AsWBP_Loadout_Entry_Slot' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_RefreshEntrySelectedState, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'WBP_Loadout_C_RefreshEntrySelectedState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_RefreshEntrySelectedState, CallFunc_Array_Length_ReturnValue) == 0x0000A4, "Member 'WBP_Loadout_C_RefreshEntrySelectedState::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_RefreshEntrySelectedState, CallFunc_Less_IntInt_ReturnValue) == 0x0000A8, "Member 'WBP_Loadout_C_RefreshEntrySelectedState::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_RefreshEntrySelectedState, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000A9, "Member 'WBP_Loadout_C_RefreshEntrySelectedState::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Loadout.WBP_Loadout_C.SetSelectedEntry
// 0x000C (0x000C - 0x0000)
struct WBP_Loadout_C_SetSelectedEntry final
{
public:
	int32                                         EntryIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEntryCount_Count;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Loadout_C_SetSelectedEntry) == 0x000004, "Wrong alignment on WBP_Loadout_C_SetSelectedEntry");
static_assert(sizeof(WBP_Loadout_C_SetSelectedEntry) == 0x00000C, "Wrong size on WBP_Loadout_C_SetSelectedEntry");
static_assert(offsetof(WBP_Loadout_C_SetSelectedEntry, EntryIndex) == 0x000000, "Member 'WBP_Loadout_C_SetSelectedEntry::EntryIndex' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_SetSelectedEntry, CallFunc_GetEntryCount_Count) == 0x000004, "Member 'WBP_Loadout_C_SetSelectedEntry::CallFunc_GetEntryCount_Count' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_SetSelectedEntry, CallFunc_Clamp_ReturnValue) == 0x000008, "Member 'WBP_Loadout_C_SetSelectedEntry::CallFunc_Clamp_ReturnValue' has a wrong offset!");

// Function WBP_Loadout.WBP_Loadout_C.ShowInputs
// 0x0005 (0x0005 - 0x0000)
struct WBP_Loadout_C_ShowInputs final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Loadout_C_ShowInputs) == 0x000001, "Wrong alignment on WBP_Loadout_C_ShowInputs");
static_assert(sizeof(WBP_Loadout_C_ShowInputs) == 0x000005, "Wrong size on WBP_Loadout_C_ShowInputs");
static_assert(offsetof(WBP_Loadout_C_ShowInputs, bShow) == 0x000000, "Member 'WBP_Loadout_C_ShowInputs::bShow' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_ShowInputs, Temp_bool_Variable) == 0x000001, "Member 'WBP_Loadout_C_ShowInputs::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_ShowInputs, Temp_byte_Variable) == 0x000002, "Member 'WBP_Loadout_C_ShowInputs::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_ShowInputs, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_Loadout_C_ShowInputs::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_C_ShowInputs, K2Node_Select_Default) == 0x000004, "Member 'WBP_Loadout_C_ShowInputs::K2Node_Select_Default' has a wrong offset!");

}

