#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Recollection_BossRush_BossProgression_Entry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Recollection_BossRush_BossProgression_Entry.WBP_Recollection_BossRush_BossProgression_Entry_C
// 0x0028 (0x0488 - 0x0460)
class UWBP_Recollection_BossRush_BossProgression_Entry_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ActiveBossIcon;                                    // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DefaultIcon;                                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DefeatedBossIcon;                                  // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Recollection_BossRush_BossProgression_Entry(int32 EntryPoint);
	void ResetEntry();
	void SetActive();
	void SetDefeated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Recollection_BossRush_BossProgression_Entry_C">();
	}
	static class UWBP_Recollection_BossRush_BossProgression_Entry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Recollection_BossRush_BossProgression_Entry_C>();
	}
};
static_assert(alignof(UWBP_Recollection_BossRush_BossProgression_Entry_C) == 0x000008, "Wrong alignment on UWBP_Recollection_BossRush_BossProgression_Entry_C");
static_assert(sizeof(UWBP_Recollection_BossRush_BossProgression_Entry_C) == 0x000488, "Wrong size on UWBP_Recollection_BossRush_BossProgression_Entry_C");
static_assert(offsetof(UWBP_Recollection_BossRush_BossProgression_Entry_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Recollection_BossRush_BossProgression_Entry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_BossProgression_Entry_C, ActiveBossIcon) == 0x000468, "Member 'UWBP_Recollection_BossRush_BossProgression_Entry_C::ActiveBossIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_BossProgression_Entry_C, DefaultIcon) == 0x000470, "Member 'UWBP_Recollection_BossRush_BossProgression_Entry_C::DefaultIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_BossProgression_Entry_C, DefeatedBossIcon) == 0x000478, "Member 'UWBP_Recollection_BossRush_BossProgression_Entry_C::DefeatedBossIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_BossProgression_Entry_C, WidgetSwitcher) == 0x000480, "Member 'UWBP_Recollection_BossRush_BossProgression_Entry_C::WidgetSwitcher' has a wrong offset!");

}

