#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_Entry_Choice_InputStyle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Settings_Entry_Choice_InputStyle.WBP_Settings_Entry_Choice_InputStyle_C
// 0x0040 (0x04A0 - 0x0460)
class UWBP_Settings_Entry_Choice_InputStyle_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TextAuto;                                          // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URefreshableRichTextBlock*              TextStyle;                                         // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_Entry_Choice_C*           WBP_Settings_Entry_Choice;                         // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitches;                                    // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<EInputStyle>                           InputStyles;                                       // 0x0488(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	int32                                         CurrentIndex;                                      // 0x0498(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Settings_Entry_Choice_InputStyle_WBP_Settings_Entry_Choice_K2Node_ComponentBoundEvent_2_OnLeft__DelegateSignature();
	void BndEvt__WBP_Settings_Entry_Choice_InputStyle_WBP_Settings_Entry_Choice_K2Node_ComponentBoundEvent_3_OnRight__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_Settings_Entry_Choice_InputStyle(int32 EntryPoint);
	void InitializeForCurrentSettings();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void PreConstruct(bool IsDesignTime);
	void RefreshChoiceIndex();
	void ResetToDefault();
	void SetInputStyleOverrideFromIndex(int32 NewIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Settings_Entry_Choice_InputStyle_C">();
	}
	static class UWBP_Settings_Entry_Choice_InputStyle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Settings_Entry_Choice_InputStyle_C>();
	}
};
static_assert(alignof(UWBP_Settings_Entry_Choice_InputStyle_C) == 0x000008, "Wrong alignment on UWBP_Settings_Entry_Choice_InputStyle_C");
static_assert(sizeof(UWBP_Settings_Entry_Choice_InputStyle_C) == 0x0004A0, "Wrong size on UWBP_Settings_Entry_Choice_InputStyle_C");
static_assert(offsetof(UWBP_Settings_Entry_Choice_InputStyle_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Settings_Entry_Choice_InputStyle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_Choice_InputStyle_C, TextAuto) == 0x000468, "Member 'UWBP_Settings_Entry_Choice_InputStyle_C::TextAuto' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_Choice_InputStyle_C, TextStyle) == 0x000470, "Member 'UWBP_Settings_Entry_Choice_InputStyle_C::TextStyle' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_Choice_InputStyle_C, WBP_Settings_Entry_Choice) == 0x000478, "Member 'UWBP_Settings_Entry_Choice_InputStyle_C::WBP_Settings_Entry_Choice' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_Choice_InputStyle_C, WidgetSwitches) == 0x000480, "Member 'UWBP_Settings_Entry_Choice_InputStyle_C::WidgetSwitches' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_Choice_InputStyle_C, InputStyles) == 0x000488, "Member 'UWBP_Settings_Entry_Choice_InputStyle_C::InputStyles' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_Choice_InputStyle_C, CurrentIndex) == 0x000498, "Member 'UWBP_Settings_Entry_Choice_InputStyle_C::CurrentIndex' has a wrong offset!");

}

