#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugMenu_Element_Choice_Text_TextureGroup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DebugMenu_Element_Choice_Text_TextureGroup.WBP_DebugMenu_Element_Choice_Text_TextureGroup_C
// 0x0050 (0x04B0 - 0x0460)
class UWBP_DebugMenu_Element_Choice_Text_TextureGroup_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_DebugMenu_Element_Choice_Text_C*   WBP_DebugMenu_Element_Choice_Text;                 // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Label;                                             // 0x0470(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	TMulticastInlineDelegate<void()>              OnConsoleVariableChanged;                          // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          ShouldLoopOptions;                                 // 0x0490(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_TextureChecker_Holder_C*           CachedTextureCheckerHolder;                        // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	TArray<ETextureGroup>                         TextureGroupOptions;                               // 0x04A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)

public:
	void RefreshOptionText();
	void PreConstruct(bool IsDesignTime);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void GetTextureGroupIndex(int32* Index_0);
	void ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup(int32 EntryPoint);
	void Construct();
	void BndEvt__WBP_DebugMenu_Element_Choice_Text_Command_WBP_DebugMenu_Element_Choice_Text_K2Node_ComponentBoundEvent_1_OnRight__DelegateSignature();
	void BndEvt__WBP_DebugMenu_Element_Choice_Text_Command_WBP_DebugMenu_Element_Choice_Text_K2Node_ComponentBoundEvent_0_OnLeft__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DebugMenu_Element_Choice_Text_TextureGroup_C">();
	}
	static class UWBP_DebugMenu_Element_Choice_Text_TextureGroup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DebugMenu_Element_Choice_Text_TextureGroup_C>();
	}
};
static_assert(alignof(UWBP_DebugMenu_Element_Choice_Text_TextureGroup_C) == 0x000008, "Wrong alignment on UWBP_DebugMenu_Element_Choice_Text_TextureGroup_C");
static_assert(sizeof(UWBP_DebugMenu_Element_Choice_Text_TextureGroup_C) == 0x0004B0, "Wrong size on UWBP_DebugMenu_Element_Choice_Text_TextureGroup_C");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Text_TextureGroup_C, UberGraphFrame) == 0x000460, "Member 'UWBP_DebugMenu_Element_Choice_Text_TextureGroup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Text_TextureGroup_C, WBP_DebugMenu_Element_Choice_Text) == 0x000468, "Member 'UWBP_DebugMenu_Element_Choice_Text_TextureGroup_C::WBP_DebugMenu_Element_Choice_Text' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Text_TextureGroup_C, Label) == 0x000470, "Member 'UWBP_DebugMenu_Element_Choice_Text_TextureGroup_C::Label' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Text_TextureGroup_C, OnConsoleVariableChanged) == 0x000480, "Member 'UWBP_DebugMenu_Element_Choice_Text_TextureGroup_C::OnConsoleVariableChanged' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Text_TextureGroup_C, ShouldLoopOptions) == 0x000490, "Member 'UWBP_DebugMenu_Element_Choice_Text_TextureGroup_C::ShouldLoopOptions' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Text_TextureGroup_C, CachedTextureCheckerHolder) == 0x000498, "Member 'UWBP_DebugMenu_Element_Choice_Text_TextureGroup_C::CachedTextureCheckerHolder' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Text_TextureGroup_C, TextureGroupOptions) == 0x0004A0, "Member 'UWBP_DebugMenu_Element_Choice_Text_TextureGroup_C::TextureGroupOptions' has a wrong offset!");

}

