#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StoryEventDirection

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_StoryEventDirection.WBP_StoryEventDirection_C.ExecuteUbergraph_WBP_StoryEventDirection
// 0x0050 (0x0050 - 0x0000)
struct WBP_StoryEventDirection_C_ExecuteUbergraph_WBP_StoryEventDirection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInstant_2;                           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInstant_1;                           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInstant;                             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StoryEventDirection_C_ExecuteUbergraph_WBP_StoryEventDirection) == 0x000008, "Wrong alignment on WBP_StoryEventDirection_C_ExecuteUbergraph_WBP_StoryEventDirection");
static_assert(sizeof(WBP_StoryEventDirection_C_ExecuteUbergraph_WBP_StoryEventDirection) == 0x000050, "Wrong size on WBP_StoryEventDirection_C_ExecuteUbergraph_WBP_StoryEventDirection");
static_assert(offsetof(WBP_StoryEventDirection_C_ExecuteUbergraph_WBP_StoryEventDirection, EntryPoint) == 0x000000, "Member 'WBP_StoryEventDirection_C_ExecuteUbergraph_WBP_StoryEventDirection::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_StoryEventDirection_C_ExecuteUbergraph_WBP_StoryEventDirection, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_StoryEventDirection_C_ExecuteUbergraph_WBP_StoryEventDirection::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StoryEventDirection_C_ExecuteUbergraph_WBP_StoryEventDirection, K2Node_Event_bInstant_2) == 0x000010, "Member 'WBP_StoryEventDirection_C_ExecuteUbergraph_WBP_StoryEventDirection::K2Node_Event_bInstant_2' has a wrong offset!");
static_assert(offsetof(WBP_StoryEventDirection_C_ExecuteUbergraph_WBP_StoryEventDirection, K2Node_Event_bInstant_1) == 0x000011, "Member 'WBP_StoryEventDirection_C_ExecuteUbergraph_WBP_StoryEventDirection::K2Node_Event_bInstant_1' has a wrong offset!");
static_assert(offsetof(WBP_StoryEventDirection_C_ExecuteUbergraph_WBP_StoryEventDirection, K2Node_Event_bInstant) == 0x000012, "Member 'WBP_StoryEventDirection_C_ExecuteUbergraph_WBP_StoryEventDirection::K2Node_Event_bInstant' has a wrong offset!");
static_assert(offsetof(WBP_StoryEventDirection_C_ExecuteUbergraph_WBP_StoryEventDirection, CallFunc_PlayAnimationForward_ReturnValue) == 0x000018, "Member 'WBP_StoryEventDirection_C_ExecuteUbergraph_WBP_StoryEventDirection::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StoryEventDirection_C_ExecuteUbergraph_WBP_StoryEventDirection, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000020, "Member 'WBP_StoryEventDirection_C_ExecuteUbergraph_WBP_StoryEventDirection::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_StoryEventDirection_C_ExecuteUbergraph_WBP_StoryEventDirection, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000028, "Member 'WBP_StoryEventDirection_C_ExecuteUbergraph_WBP_StoryEventDirection::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_StoryEventDirection_C_ExecuteUbergraph_WBP_StoryEventDirection, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000030, "Member 'WBP_StoryEventDirection_C_ExecuteUbergraph_WBP_StoryEventDirection::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StoryEventDirection_C_ExecuteUbergraph_WBP_StoryEventDirection, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_StoryEventDirection_C_ExecuteUbergraph_WBP_StoryEventDirection::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StoryEventDirection_C_ExecuteUbergraph_WBP_StoryEventDirection, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'WBP_StoryEventDirection_C_ExecuteUbergraph_WBP_StoryEventDirection::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StoryEventDirection_C_ExecuteUbergraph_WBP_StoryEventDirection, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'WBP_StoryEventDirection_C_ExecuteUbergraph_WBP_StoryEventDirection::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_StoryEventDirection.WBP_StoryEventDirection_C.Hide
// 0x0001 (0x0001 - 0x0000)
struct WBP_StoryEventDirection_C_Hide final
{
public:
	bool                                          bInstant;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StoryEventDirection_C_Hide) == 0x000001, "Wrong alignment on WBP_StoryEventDirection_C_Hide");
static_assert(sizeof(WBP_StoryEventDirection_C_Hide) == 0x000001, "Wrong size on WBP_StoryEventDirection_C_Hide");
static_assert(offsetof(WBP_StoryEventDirection_C_Hide, bInstant) == 0x000000, "Member 'WBP_StoryEventDirection_C_Hide::bInstant' has a wrong offset!");

// Function WBP_StoryEventDirection.WBP_StoryEventDirection_C.HideAndRemoveFromParent
// 0x0001 (0x0001 - 0x0000)
struct WBP_StoryEventDirection_C_HideAndRemoveFromParent final
{
public:
	bool                                          bInstant;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StoryEventDirection_C_HideAndRemoveFromParent) == 0x000001, "Wrong alignment on WBP_StoryEventDirection_C_HideAndRemoveFromParent");
static_assert(sizeof(WBP_StoryEventDirection_C_HideAndRemoveFromParent) == 0x000001, "Wrong size on WBP_StoryEventDirection_C_HideAndRemoveFromParent");
static_assert(offsetof(WBP_StoryEventDirection_C_HideAndRemoveFromParent, bInstant) == 0x000000, "Member 'WBP_StoryEventDirection_C_HideAndRemoveFromParent::bInstant' has a wrong offset!");

// Function WBP_StoryEventDirection.WBP_StoryEventDirection_C.Show
// 0x0001 (0x0001 - 0x0000)
struct WBP_StoryEventDirection_C_Show final
{
public:
	bool                                          bInstant;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StoryEventDirection_C_Show) == 0x000001, "Wrong alignment on WBP_StoryEventDirection_C_Show");
static_assert(sizeof(WBP_StoryEventDirection_C_Show) == 0x000001, "Wrong size on WBP_StoryEventDirection_C_Show");
static_assert(offsetof(WBP_StoryEventDirection_C_Show, bInstant) == 0x000000, "Member 'WBP_StoryEventDirection_C_Show::bInstant' has a wrong offset!");

}

