#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_Entry_Slider_DeadZone

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Settings_Entry_Slider_DeadZone.WBP_Settings_Entry_Slider_DeadZone_C.BndEvt__WBP_Settings_Entry_Sound_WBP_Settings_Entry_Slider_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Settings_Entry_Slider_DeadZone_C_BndEvt__WBP_Settings_Entry_Sound_WBP_Settings_Entry_Slider_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Slider_DeadZone_C_BndEvt__WBP_Settings_Entry_Sound_WBP_Settings_Entry_Slider_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Slider_DeadZone_C_BndEvt__WBP_Settings_Entry_Sound_WBP_Settings_Entry_Slider_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_Entry_Slider_DeadZone_C_BndEvt__WBP_Settings_Entry_Sound_WBP_Settings_Entry_Slider_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong size on WBP_Settings_Entry_Slider_DeadZone_C_BndEvt__WBP_Settings_Entry_Sound_WBP_Settings_Entry_Slider_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_Entry_Slider_DeadZone_C_BndEvt__WBP_Settings_Entry_Sound_WBP_Settings_Entry_Slider_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_Entry_Slider_DeadZone_C_BndEvt__WBP_Settings_Entry_Sound_WBP_Settings_Entry_Slider_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function WBP_Settings_Entry_Slider_DeadZone.WBP_Settings_Entry_Slider_DeadZone_C.ExecuteUbergraph_WBP_Settings_Entry_Slider_DeadZone
// 0x0030 (0x0030 - 0x0000)
struct WBP_Settings_Entry_Slider_DeadZone_C_ExecuteUbergraph_WBP_Settings_Entry_Slider_DeadZone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_Value;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetStickDeadZone_ReturnValue;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetStickDeadZone_NewDeadZone_ImplicitCast; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Slider_DeadZone_C_ExecuteUbergraph_WBP_Settings_Entry_Slider_DeadZone) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Slider_DeadZone_C_ExecuteUbergraph_WBP_Settings_Entry_Slider_DeadZone");
static_assert(sizeof(WBP_Settings_Entry_Slider_DeadZone_C_ExecuteUbergraph_WBP_Settings_Entry_Slider_DeadZone) == 0x000030, "Wrong size on WBP_Settings_Entry_Slider_DeadZone_C_ExecuteUbergraph_WBP_Settings_Entry_Slider_DeadZone");
static_assert(offsetof(WBP_Settings_Entry_Slider_DeadZone_C_ExecuteUbergraph_WBP_Settings_Entry_Slider_DeadZone, EntryPoint) == 0x000000, "Member 'WBP_Settings_Entry_Slider_DeadZone_C_ExecuteUbergraph_WBP_Settings_Entry_Slider_DeadZone::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Slider_DeadZone_C_ExecuteUbergraph_WBP_Settings_Entry_Slider_DeadZone, K2Node_ComponentBoundEvent_Value) == 0x000008, "Member 'WBP_Settings_Entry_Slider_DeadZone_C_ExecuteUbergraph_WBP_Settings_Entry_Slider_DeadZone::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Slider_DeadZone_C_ExecuteUbergraph_WBP_Settings_Entry_Slider_DeadZone, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_Settings_Entry_Slider_DeadZone_C_ExecuteUbergraph_WBP_Settings_Entry_Slider_DeadZone::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Slider_DeadZone_C_ExecuteUbergraph_WBP_Settings_Entry_Slider_DeadZone, K2Node_Event_IsDesignTime) == 0x000018, "Member 'WBP_Settings_Entry_Slider_DeadZone_C_ExecuteUbergraph_WBP_Settings_Entry_Slider_DeadZone::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Slider_DeadZone_C_ExecuteUbergraph_WBP_Settings_Entry_Slider_DeadZone, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000020, "Member 'WBP_Settings_Entry_Slider_DeadZone_C_ExecuteUbergraph_WBP_Settings_Entry_Slider_DeadZone::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Slider_DeadZone_C_ExecuteUbergraph_WBP_Settings_Entry_Slider_DeadZone, CallFunc_SetStickDeadZone_ReturnValue) == 0x000028, "Member 'WBP_Settings_Entry_Slider_DeadZone_C_ExecuteUbergraph_WBP_Settings_Entry_Slider_DeadZone::CallFunc_SetStickDeadZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Slider_DeadZone_C_ExecuteUbergraph_WBP_Settings_Entry_Slider_DeadZone, CallFunc_SetStickDeadZone_NewDeadZone_ImplicitCast) == 0x00002C, "Member 'WBP_Settings_Entry_Slider_DeadZone_C_ExecuteUbergraph_WBP_Settings_Entry_Slider_DeadZone::CallFunc_SetStickDeadZone_NewDeadZone_ImplicitCast' has a wrong offset!");

// Function WBP_Settings_Entry_Slider_DeadZone.WBP_Settings_Entry_Slider_DeadZone_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Settings_Entry_Slider_DeadZone_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Settings_Entry_Slider_DeadZone_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Slider_DeadZone_C_OnFocusReceived");
static_assert(sizeof(WBP_Settings_Entry_Slider_DeadZone_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_Settings_Entry_Slider_DeadZone_C_OnFocusReceived");
static_assert(offsetof(WBP_Settings_Entry_Slider_DeadZone_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Settings_Entry_Slider_DeadZone_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Slider_DeadZone_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Settings_Entry_Slider_DeadZone_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Slider_DeadZone_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Settings_Entry_Slider_DeadZone_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Slider_DeadZone_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Settings_Entry_Slider_DeadZone_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Settings_Entry_Slider_DeadZone.WBP_Settings_Entry_Slider_DeadZone_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_Entry_Slider_DeadZone_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Slider_DeadZone_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Settings_Entry_Slider_DeadZone_C_PreConstruct");
static_assert(sizeof(WBP_Settings_Entry_Slider_DeadZone_C_PreConstruct) == 0x000001, "Wrong size on WBP_Settings_Entry_Slider_DeadZone_C_PreConstruct");
static_assert(offsetof(WBP_Settings_Entry_Slider_DeadZone_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Settings_Entry_Slider_DeadZone_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Settings_Entry_Slider_DeadZone.WBP_Settings_Entry_Slider_DeadZone_C.Refresh
// 0x0030 (0x0030 - 0x0000)
struct WBP_Settings_Entry_Slider_DeadZone_C_Refresh final
{
public:
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStickDeadZone_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Slider_DeadZone_C_Refresh) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Slider_DeadZone_C_Refresh");
static_assert(sizeof(WBP_Settings_Entry_Slider_DeadZone_C_Refresh) == 0x000030, "Wrong size on WBP_Settings_Entry_Slider_DeadZone_C_Refresh");
static_assert(offsetof(WBP_Settings_Entry_Slider_DeadZone_C_Refresh, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'WBP_Settings_Entry_Slider_DeadZone_C_Refresh::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Slider_DeadZone_C_Refresh, CallFunc_GetStickDeadZone_ReturnValue) == 0x000008, "Member 'WBP_Settings_Entry_Slider_DeadZone_C_Refresh::CallFunc_GetStickDeadZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Slider_DeadZone_C_Refresh, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_Settings_Entry_Slider_DeadZone_C_Refresh::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Slider_DeadZone_C_Refresh, CallFunc_Round_ReturnValue) == 0x000018, "Member 'WBP_Settings_Entry_Slider_DeadZone_C_Refresh::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Slider_DeadZone_C_Refresh, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000020, "Member 'WBP_Settings_Entry_Slider_DeadZone_C_Refresh::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Slider_DeadZone_C_Refresh, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000028, "Member 'WBP_Settings_Entry_Slider_DeadZone_C_Refresh::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_Settings_Entry_Slider_DeadZone.WBP_Settings_Entry_Slider_DeadZone_C.SetLabel
// 0x0010 (0x0010 - 0x0000)
struct WBP_Settings_Entry_Slider_DeadZone_C_SetLabel final
{
public:
	class FText                                   Label_0;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Settings_Entry_Slider_DeadZone_C_SetLabel) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Slider_DeadZone_C_SetLabel");
static_assert(sizeof(WBP_Settings_Entry_Slider_DeadZone_C_SetLabel) == 0x000010, "Wrong size on WBP_Settings_Entry_Slider_DeadZone_C_SetLabel");
static_assert(offsetof(WBP_Settings_Entry_Slider_DeadZone_C_SetLabel, Label_0) == 0x000000, "Member 'WBP_Settings_Entry_Slider_DeadZone_C_SetLabel::Label_0' has a wrong offset!");

}

