#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerSPGauge

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_PlayerSPGauge.WBP_PlayerSPGauge_C.ExecuteUbergraph_WBP_PlayerSPGauge
// 0x0150 (0x0150 - 0x0000)
struct WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_3;     // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_3;     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_3;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_3;    // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_2;     // 0x0038(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_2;     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_2;   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_2;    // 0x0060(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0070(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0098(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x00A0(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x00C8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_2; // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_3; // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable;                              // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1_0;                            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_1;                            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_2;                            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_3;                            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge) == 0x000008, "Wrong alignment on WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge");
static_assert(sizeof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge) == 0x000150, "Wrong size on WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, EntryPoint) == 0x000000, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, K2Node_EnhancedInputActionEvent_ActionValue_3) == 0x000008, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::K2Node_EnhancedInputActionEvent_ActionValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, K2Node_EnhancedInputActionEvent_ElapsedTime_3) == 0x000028, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::K2Node_EnhancedInputActionEvent_ElapsedTime_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, K2Node_EnhancedInputActionEvent_TriggeredTime_3) == 0x00002C, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::K2Node_EnhancedInputActionEvent_TriggeredTime_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, K2Node_EnhancedInputActionEvent_SourceAction_3) == 0x000030, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::K2Node_EnhancedInputActionEvent_SourceAction_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, K2Node_EnhancedInputActionEvent_ActionValue_2) == 0x000038, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::K2Node_EnhancedInputActionEvent_ActionValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, K2Node_EnhancedInputActionEvent_ElapsedTime_2) == 0x000058, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::K2Node_EnhancedInputActionEvent_ElapsedTime_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, K2Node_EnhancedInputActionEvent_TriggeredTime_2) == 0x00005C, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::K2Node_EnhancedInputActionEvent_TriggeredTime_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, K2Node_EnhancedInputActionEvent_SourceAction_2) == 0x000060, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::K2Node_EnhancedInputActionEvent_SourceAction_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000068, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, CallFunc_Conv_InputActionValueToBool_ReturnValue_1) == 0x000069, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::CallFunc_Conv_InputActionValueToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x000070, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000090, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x000094, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000098, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, K2Node_EnhancedInputActionEvent_ActionValue) == 0x0000A0, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x0000C0, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x0000C4, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, K2Node_EnhancedInputActionEvent_SourceAction) == 0x0000C8, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, CallFunc_Conv_InputActionValueToBool_ReturnValue_2) == 0x0000D0, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::CallFunc_Conv_InputActionValueToBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, CallFunc_Conv_InputActionValueToBool_ReturnValue_3) == 0x0000D1, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::CallFunc_Conv_InputActionValueToBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, Temp_object_Variable) == 0x0000D8, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, Temp_real_Variable) == 0x0000E0, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, Temp_real_Variable_0) == 0x0000E8, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, Temp_real_Variable_1) == 0x0000F0, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, Temp_real_Variable_2) == 0x0000F8, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, Temp_real_Variable_3) == 0x000100, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, Temp_real_Variable_1) == 0x000108, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, Temp_bool_Variable) == 0x000110, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, Temp_real_Variable_1_0) == 0x000118, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, Temp_real_Variable_1_1) == 0x000120, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::Temp_real_Variable_1_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, Temp_real_Variable_1_2) == 0x000128, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::Temp_real_Variable_1_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, Temp_real_Variable_1_3) == 0x000130, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::Temp_real_Variable_1_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, CallFunc_PlayAnimation_ReturnValue) == 0x000138, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, CallFunc_PlayAnimation_ReturnValue_1) == 0x000140, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge, CallFunc_PlayAnimation_ReturnValue_2) == 0x000148, "Member 'WBP_PlayerSPGauge_C_ExecuteUbergraph_WBP_PlayerSPGauge::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");

// Function WBP_PlayerSPGauge.WBP_PlayerSPGauge_C.GetSPRatio
// 0x0018 (0x0018 - 0x0000)
struct WBP_PlayerSPGauge_C_GetSPRatio final
{
public:
	double                                        SPRatio;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrRatio_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_SPRatio_ImplicitCast;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerSPGauge_C_GetSPRatio) == 0x000008, "Wrong alignment on WBP_PlayerSPGauge_C_GetSPRatio");
static_assert(sizeof(WBP_PlayerSPGauge_C_GetSPRatio) == 0x000018, "Wrong size on WBP_PlayerSPGauge_C_GetSPRatio");
static_assert(offsetof(WBP_PlayerSPGauge_C_GetSPRatio, SPRatio) == 0x000000, "Member 'WBP_PlayerSPGauge_C_GetSPRatio::SPRatio' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_GetSPRatio, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_PlayerSPGauge_C_GetSPRatio::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_GetSPRatio, CallFunc_GetCurrRatio_ReturnValue) == 0x00000C, "Member 'WBP_PlayerSPGauge_C_GetSPRatio::CallFunc_GetCurrRatio_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_GetSPRatio, K2Node_FunctionResult_SPRatio_ImplicitCast) == 0x000010, "Member 'WBP_PlayerSPGauge_C_GetSPRatio::K2Node_FunctionResult_SPRatio_ImplicitCast' has a wrong offset!");

// Function WBP_PlayerSPGauge.WBP_PlayerSPGauge_C.GetSPValue
// 0x000C (0x000C - 0x0000)
struct WBP_PlayerSPGauge_C_GetSPValue final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrValue_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerSPGauge_C_GetSPValue) == 0x000004, "Wrong alignment on WBP_PlayerSPGauge_C_GetSPValue");
static_assert(sizeof(WBP_PlayerSPGauge_C_GetSPValue) == 0x00000C, "Wrong size on WBP_PlayerSPGauge_C_GetSPValue");
static_assert(offsetof(WBP_PlayerSPGauge_C_GetSPValue, ReturnValue) == 0x000000, "Member 'WBP_PlayerSPGauge_C_GetSPValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_GetSPValue, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_PlayerSPGauge_C_GetSPValue::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_GetSPValue, CallFunc_GetCurrValue_ReturnValue) == 0x000008, "Member 'WBP_PlayerSPGauge_C_GetSPValue::CallFunc_GetCurrValue_ReturnValue' has a wrong offset!");

// Function WBP_PlayerSPGauge.WBP_PlayerSPGauge_C.Initialize
// 0x0058 (0x0058 - 0x0000)
struct WBP_PlayerSPGauge_C_Initialize final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      Controller;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkillComponent*                        CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStatSPComponent*                       CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerSPGauge_C_Initialize) == 0x000008, "Wrong alignment on WBP_PlayerSPGauge_C_Initialize");
static_assert(sizeof(WBP_PlayerSPGauge_C_Initialize) == 0x000058, "Wrong size on WBP_PlayerSPGauge_C_Initialize");
static_assert(offsetof(WBP_PlayerSPGauge_C_Initialize, Pawn) == 0x000000, "Member 'WBP_PlayerSPGauge_C_Initialize::Pawn' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_Initialize, Controller) == 0x000008, "Member 'WBP_PlayerSPGauge_C_Initialize::Controller' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_Initialize, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_PlayerSPGauge_C_Initialize::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_Initialize, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'WBP_PlayerSPGauge_C_Initialize::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_Initialize, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000028, "Member 'WBP_PlayerSPGauge_C_Initialize::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_Initialize, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_PlayerSPGauge_C_Initialize::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_Initialize, K2Node_CreateDelegate_OutputDelegate_1) == 0x000034, "Member 'WBP_PlayerSPGauge_C_Initialize::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_Initialize, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'WBP_PlayerSPGauge_C_Initialize::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function WBP_PlayerSPGauge.WBP_PlayerSPGauge_C.InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WBP_PlayerSPGauge.WBP_PlayerSPGauge_C.InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_1
// 0x0030 (0x0030 - 0x0000)
struct WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_1 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_1) == 0x000008, "Wrong alignment on WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_1");
static_assert(sizeof(WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_1) == 0x000030, "Wrong size on WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_1");
static_assert(offsetof(WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_1, ActionValue) == 0x000000, "Member 'WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_1::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_1, ElapsedTime) == 0x000020, "Member 'WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_1::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_1, TriggeredTime) == 0x000024, "Member 'WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_1::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_1, SourceAction) == 0x000028, "Member 'WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_1::SourceAction' has a wrong offset!");

// Function WBP_PlayerSPGauge.WBP_PlayerSPGauge_C.InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_2
// 0x0030 (0x0030 - 0x0000)
struct WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_2 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_2) == 0x000008, "Wrong alignment on WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_2");
static_assert(sizeof(WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_2) == 0x000030, "Wrong size on WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_2");
static_assert(offsetof(WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_2, ActionValue) == 0x000000, "Member 'WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_2::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_2, ElapsedTime) == 0x000020, "Member 'WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_2::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_2, TriggeredTime) == 0x000024, "Member 'WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_2::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_2, SourceAction) == 0x000028, "Member 'WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_2::SourceAction' has a wrong offset!");

// Function WBP_PlayerSPGauge.WBP_PlayerSPGauge_C.InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_3
// 0x0030 (0x0030 - 0x0000)
struct WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_3 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_3) == 0x000008, "Wrong alignment on WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_3");
static_assert(sizeof(WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_3) == 0x000030, "Wrong size on WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_3");
static_assert(offsetof(WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_3, ActionValue) == 0x000000, "Member 'WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_3::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_3, ElapsedTime) == 0x000020, "Member 'WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_3::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_3, TriggeredTime) == 0x000024, "Member 'WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_3::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_3, SourceAction) == 0x000028, "Member 'WBP_PlayerSPGauge_C_InpActEvt_IA_Special_Modifier_K2Node_EnhancedInputActionEvent_3::SourceAction' has a wrong offset!");

// Function WBP_PlayerSPGauge.WBP_PlayerSPGauge_C.RefreshAnimation
// 0x0020 (0x0020 - 0x0000)
struct WBP_PlayerSPGauge_C_RefreshAnimation final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMinimumEquippedSPCost_ReturnValue;     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSPValue_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerSPGauge_C_RefreshAnimation) == 0x000008, "Wrong alignment on WBP_PlayerSPGauge_C_RefreshAnimation");
static_assert(sizeof(WBP_PlayerSPGauge_C_RefreshAnimation) == 0x000020, "Wrong size on WBP_PlayerSPGauge_C_RefreshAnimation");
static_assert(offsetof(WBP_PlayerSPGauge_C_RefreshAnimation, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_PlayerSPGauge_C_RefreshAnimation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_RefreshAnimation, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000001, "Member 'WBP_PlayerSPGauge_C_RefreshAnimation::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_RefreshAnimation, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WBP_PlayerSPGauge_C_RefreshAnimation::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_RefreshAnimation, CallFunc_GetMinimumEquippedSPCost_ReturnValue) == 0x000004, "Member 'WBP_PlayerSPGauge_C_RefreshAnimation::CallFunc_GetMinimumEquippedSPCost_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_RefreshAnimation, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'WBP_PlayerSPGauge_C_RefreshAnimation::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_RefreshAnimation, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x000009, "Member 'WBP_PlayerSPGauge_C_RefreshAnimation::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_RefreshAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'WBP_PlayerSPGauge_C_RefreshAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_RefreshAnimation, CallFunc_GetSPValue_ReturnValue) == 0x000018, "Member 'WBP_PlayerSPGauge_C_RefreshAnimation::CallFunc_GetSPValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_RefreshAnimation, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_PlayerSPGauge_C_RefreshAnimation::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_RefreshAnimation, CallFunc_BooleanAND_ReturnValue) == 0x00001D, "Member 'WBP_PlayerSPGauge_C_RefreshAnimation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_PlayerSPGauge.WBP_PlayerSPGauge_C.RefreshSPGauge
// 0x0050 (0x0050 - 0x0000)
struct WBP_PlayerSPGauge_C_RefreshSPGauge final
{
public:
	int32                                         CallFunc_GetSPGaugeValue_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSPValue_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue_1;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRatio_InPercent_ImplicitCast;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRatio_InPercent_ImplicitCast_1;        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerSPGauge_C_RefreshSPGauge) == 0x000008, "Wrong alignment on WBP_PlayerSPGauge_C_RefreshSPGauge");
static_assert(sizeof(WBP_PlayerSPGauge_C_RefreshSPGauge) == 0x000050, "Wrong size on WBP_PlayerSPGauge_C_RefreshSPGauge");
static_assert(offsetof(WBP_PlayerSPGauge_C_RefreshSPGauge, CallFunc_GetSPGaugeValue_ReturnValue) == 0x000000, "Member 'WBP_PlayerSPGauge_C_RefreshSPGauge::CallFunc_GetSPGaugeValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_RefreshSPGauge, CallFunc_GetSPValue_ReturnValue) == 0x000004, "Member 'WBP_PlayerSPGauge_C_RefreshSPGauge::CallFunc_GetSPValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_RefreshSPGauge, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'WBP_PlayerSPGauge_C_RefreshSPGauge::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_RefreshSPGauge, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'WBP_PlayerSPGauge_C_RefreshSPGauge::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_RefreshSPGauge, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000018, "Member 'WBP_PlayerSPGauge_C_RefreshSPGauge::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_RefreshSPGauge, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000020, "Member 'WBP_PlayerSPGauge_C_RefreshSPGauge::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_RefreshSPGauge, CallFunc_SafeDivide_ReturnValue) == 0x000028, "Member 'WBP_PlayerSPGauge_C_RefreshSPGauge::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_RefreshSPGauge, CallFunc_SafeDivide_ReturnValue_1) == 0x000030, "Member 'WBP_PlayerSPGauge_C_RefreshSPGauge::CallFunc_SafeDivide_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_RefreshSPGauge, CallFunc_FClamp_ReturnValue) == 0x000038, "Member 'WBP_PlayerSPGauge_C_RefreshSPGauge::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_RefreshSPGauge, CallFunc_FClamp_ReturnValue_1) == 0x000040, "Member 'WBP_PlayerSPGauge_C_RefreshSPGauge::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_RefreshSPGauge, CallFunc_SetRatio_InPercent_ImplicitCast) == 0x000048, "Member 'WBP_PlayerSPGauge_C_RefreshSPGauge::CallFunc_SetRatio_InPercent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_RefreshSPGauge, CallFunc_SetRatio_InPercent_ImplicitCast_1) == 0x00004C, "Member 'WBP_PlayerSPGauge_C_RefreshSPGauge::CallFunc_SetRatio_InPercent_ImplicitCast_1' has a wrong offset!");

// Function WBP_PlayerSPGauge.WBP_PlayerSPGauge_C.RefreshSubGauges
// 0x0010 (0x0010 - 0x0000)
struct WBP_PlayerSPGauge_C_RefreshSubGauges final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSPGaugeValue_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxValue_ReturnValue;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerSPGauge_C_RefreshSubGauges) == 0x000004, "Wrong alignment on WBP_PlayerSPGauge_C_RefreshSubGauges");
static_assert(sizeof(WBP_PlayerSPGauge_C_RefreshSubGauges) == 0x000010, "Wrong size on WBP_PlayerSPGauge_C_RefreshSubGauges");
static_assert(offsetof(WBP_PlayerSPGauge_C_RefreshSubGauges, Temp_bool_Variable) == 0x000000, "Member 'WBP_PlayerSPGauge_C_RefreshSubGauges::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_RefreshSubGauges, Temp_byte_Variable) == 0x000001, "Member 'WBP_PlayerSPGauge_C_RefreshSubGauges::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlayerSPGauge_C_RefreshSubGauges, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_PlayerSPGauge_C_RefreshSubGauges::Temp_byte_Variable_1' has a wrong offset!");
