#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DisplayAreaName

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DisplayAreaName.WBP_DisplayAreaName_C
// 0x0178 (0x05D8 - 0x0460)
class UWBP_DisplayAreaName_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideAnim;                                          // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 base;                                              // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_110;                                         // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MapAreaNameText;                                   // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGameMapData                           GameMapData;                                       // 0x0498(0x0140)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)

public:
	void Close();
	void Construct();
	void ExecuteUbergraph_WBP_DisplayAreaName(int32 EntryPoint);
	void OnFinish_DCFC293D421962534CEB32897FCADFD0();
	void SetMapAreaName(const class FText& MapAreaName);
	void WidgetAnimationEvt_HideAnim_K2Node_WidgetAnimationEvent_1();
	void WidgetAnimationEvt_ShowAnim_K2Node_WidgetAnimationEvent_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DisplayAreaName_C">();
	}
	static class UWBP_DisplayAreaName_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DisplayAreaName_C>();
	}
};
static_assert(alignof(UWBP_DisplayAreaName_C) == 0x000008, "Wrong alignment on UWBP_DisplayAreaName_C");
static_assert(sizeof(UWBP_DisplayAreaName_C) == 0x0005D8, "Wrong size on UWBP_DisplayAreaName_C");
static_assert(offsetof(UWBP_DisplayAreaName_C, UberGraphFrame) == 0x000460, "Member 'UWBP_DisplayAreaName_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DisplayAreaName_C, HideAnim) == 0x000468, "Member 'UWBP_DisplayAreaName_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UWBP_DisplayAreaName_C, ShowAnim) == 0x000470, "Member 'UWBP_DisplayAreaName_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UWBP_DisplayAreaName_C, base) == 0x000478, "Member 'UWBP_DisplayAreaName_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_DisplayAreaName_C, Image) == 0x000480, "Member 'UWBP_DisplayAreaName_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_DisplayAreaName_C, Image_110) == 0x000488, "Member 'UWBP_DisplayAreaName_C::Image_110' has a wrong offset!");
static_assert(offsetof(UWBP_DisplayAreaName_C, MapAreaNameText) == 0x000490, "Member 'UWBP_DisplayAreaName_C::MapAreaNameText' has a wrong offset!");
static_assert(offsetof(UWBP_DisplayAreaName_C, GameMapData) == 0x000498, "Member 'UWBP_DisplayAreaName_C::GameMapData' has a wrong offset!");

}

