#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Extra_CharacterItem_Description

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Extra_CharacterItem_Description.WBP_Extra_CharacterItem_Description_C.SetCharacterName
// 0x0010 (0x0010 - 0x0000)
struct WBP_Extra_CharacterItem_Description_C_SetCharacterName final
{
public:
	class FText                                   Name_0;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Extra_CharacterItem_Description_C_SetCharacterName) == 0x000008, "Wrong alignment on WBP_Extra_CharacterItem_Description_C_SetCharacterName");
static_assert(sizeof(WBP_Extra_CharacterItem_Description_C_SetCharacterName) == 0x000010, "Wrong size on WBP_Extra_CharacterItem_Description_C_SetCharacterName");
static_assert(offsetof(WBP_Extra_CharacterItem_Description_C_SetCharacterName, Name_0) == 0x000000, "Member 'WBP_Extra_CharacterItem_Description_C_SetCharacterName::Name_0' has a wrong offset!");

// Function WBP_Extra_CharacterItem_Description.WBP_Extra_CharacterItem_Description_C.SetCharacterDescription
// 0x0010 (0x0010 - 0x0000)
struct WBP_Extra_CharacterItem_Description_C_SetCharacterDescription final
{
public:
	class FText                                   Description_0;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Extra_CharacterItem_Description_C_SetCharacterDescription) == 0x000008, "Wrong alignment on WBP_Extra_CharacterItem_Description_C_SetCharacterDescription");
static_assert(sizeof(WBP_Extra_CharacterItem_Description_C_SetCharacterDescription) == 0x000010, "Wrong size on WBP_Extra_CharacterItem_Description_C_SetCharacterDescription");
static_assert(offsetof(WBP_Extra_CharacterItem_Description_C_SetCharacterDescription, Description_0) == 0x000000, "Member 'WBP_Extra_CharacterItem_Description_C_SetCharacterDescription::Description_0' has a wrong offset!");

}

