#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InputBuffer_Log_Raw

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InputBuffer_Log_Raw.WBP_InputBuffer_Log_Raw_C
// 0x0028 (0x0308 - 0x02E0)
class UWBP_InputBuffer_Log_Raw_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUniformGridPanel*                      UniformGridPanel_Holder;                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_InputBuffer_Entry_C*>       Entries;                                           // 0x02F0(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay)
	int32                                         DisplayEntryCount;                                 // 0x0300(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_InputBuffer_Log_Raw(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_InputBuffer_Log_Raw_C">();
	}
	static class UWBP_InputBuffer_Log_Raw_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InputBuffer_Log_Raw_C>();
	}
};
static_assert(alignof(UWBP_InputBuffer_Log_Raw_C) == 0x000008, "Wrong alignment on UWBP_InputBuffer_Log_Raw_C");
static_assert(sizeof(UWBP_InputBuffer_Log_Raw_C) == 0x000308, "Wrong size on UWBP_InputBuffer_Log_Raw_C");
static_assert(offsetof(UWBP_InputBuffer_Log_Raw_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_InputBuffer_Log_Raw_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_InputBuffer_Log_Raw_C, UniformGridPanel_Holder) == 0x0002E8, "Member 'UWBP_InputBuffer_Log_Raw_C::UniformGridPanel_Holder' has a wrong offset!");
static_assert(offsetof(UWBP_InputBuffer_Log_Raw_C, Entries) == 0x0002F0, "Member 'UWBP_InputBuffer_Log_Raw_C::Entries' has a wrong offset!");
static_assert(offsetof(UWBP_InputBuffer_Log_Raw_C, DisplayEntryCount) == 0x000300, "Member 'UWBP_InputBuffer_Log_Raw_C::DisplayEntryCount' has a wrong offset!");

}

