#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugMenu_Element_Choice_Text_Command

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_DebugMenu_Element_Choice_Text_Command.WBP_DebugMenu_Element_Choice_Text_Command_C.RefreshOptionText
// 0x0004 (0x0004 - 0x0000)
struct WBP_DebugMenu_Element_Choice_Text_Command_C_RefreshOptionText final
{
public:
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Element_Choice_Text_Command_C_RefreshOptionText) == 0x000004, "Wrong alignment on WBP_DebugMenu_Element_Choice_Text_Command_C_RefreshOptionText");
static_assert(sizeof(WBP_DebugMenu_Element_Choice_Text_Command_C_RefreshOptionText) == 0x000004, "Wrong size on WBP_DebugMenu_Element_Choice_Text_Command_C_RefreshOptionText");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Command_C_RefreshOptionText, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000000, "Member 'WBP_DebugMenu_Element_Choice_Text_Command_C_RefreshOptionText::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");

// Function WBP_DebugMenu_Element_Choice_Text_Command.WBP_DebugMenu_Element_Choice_Text_Command_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_DebugMenu_Element_Choice_Text_Command_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Element_Choice_Text_Command_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_DebugMenu_Element_Choice_Text_Command_C_PreConstruct");
static_assert(sizeof(WBP_DebugMenu_Element_Choice_Text_Command_C_PreConstruct) == 0x000001, "Wrong size on WBP_DebugMenu_Element_Choice_Text_Command_C_PreConstruct");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Command_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_DebugMenu_Element_Choice_Text_Command_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_DebugMenu_Element_Choice_Text_Command.WBP_DebugMenu_Element_Choice_Text_Command_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_DebugMenu_Element_Choice_Text_Command_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_DebugMenu_Element_Choice_Text_Command_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_DebugMenu_Element_Choice_Text_Command_C_OnFocusReceived");
static_assert(sizeof(WBP_DebugMenu_Element_Choice_Text_Command_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_DebugMenu_Element_Choice_Text_Command_C_OnFocusReceived");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Command_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_DebugMenu_Element_Choice_Text_Command_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Command_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_DebugMenu_Element_Choice_Text_Command_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Command_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_DebugMenu_Element_Choice_Text_Command_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Command_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_DebugMenu_Element_Choice_Text_Command_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_DebugMenu_Element_Choice_Text_Command.WBP_DebugMenu_Element_Choice_Text_Command_C.ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue_1; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_2;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_3;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command) == 0x000008, "Wrong alignment on WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command");
static_assert(sizeof(WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command) == 0x0000A8, "Wrong size on WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command, EntryPoint) == 0x000000, "Member 'WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command, CallFunc_Concat_StrStr_ReturnValue) == 0x000008, "Member 'WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x00001C, "Member 'WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000024, "Member 'WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000030, "Member 'WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command, CallFunc_GetConsoleVariableIntValue_ReturnValue_1) == 0x000040, "Member 'WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command::CallFunc_GetConsoleVariableIntValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command, CallFunc_Array_Length_ReturnValue_1) == 0x000048, "Member 'WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x00004C, "Member 'WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command, CallFunc_SelectInt_ReturnValue) == 0x000050, "Member 'WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command, CallFunc_Less_IntInt_ReturnValue_1) == 0x000054, "Member 'WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command, CallFunc_SelectInt_ReturnValue_1) == 0x000058, "Member 'WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command, CallFunc_Conv_IntToString_ReturnValue) == 0x000060, "Member 'WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000070, "Member 'WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command, CallFunc_SelectInt_ReturnValue_2) == 0x000080, "Member 'WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command::CallFunc_SelectInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command, CallFunc_SelectInt_ReturnValue_3) == 0x000084, "Member 'WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command::CallFunc_SelectInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000088, "Member 'WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000098, "Member 'WBP_DebugMenu_Element_Choice_Text_Command_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Command::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");

}

