#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Title

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Title.WBP_Title_C
// 0x0178 (0x05D8 - 0x0460)
class UWBP_Title_C : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Show;                                              // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UNamedSlot*                             BGHolder;                                          // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BuildNumberText;                                   // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DemoLabel;                                         // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             EarlyAccessLabel;                                  // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             InvalidVersionText;                                // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ProfileName;                                       // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             VersionText;                                       // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Generic_C*                  WBP_Button_Generic_Exit;                           // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Generic_C*                  WBP_Button_Generic_Settings;                       // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Generic_C*                  WBP_Button_Generic_Start;                          // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Footer_C*                          WBP_Footer;                                        // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<EGameEndingType, TSoftClassPtr<class UClass>> Titles;                                       // 0x04C8(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly)
	TMap<EGameEndingType, TSoftObjectPtr<class UWorld>> TitleLevels;                                 // 0x0518(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FFooterData                            Footer_TitleChange;                                // 0x0568(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly)
	class ULevelStreamingDynamic*                 LoadedLevel;                                       // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	EGameEndingType                               LoadedTitleType;                                   // 0x05C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_5C9[0x7];                                      // 0x05C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFMODEvent*                             SE_TitleScreenSelection;                           // 0x05D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Title_WBP_Button_Generic_Exit_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void BndEvt__WBP_Title_WBP_Button_Generic_Settings_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void BndEvt__WBP_Title_WBP_Button_Generic_Start_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	bool CanChangeTitleScreen();
	void Construct();
	void ExecuteUbergraph_WBP_Title(int32 EntryPoint);
	void OnFinish_556333D643709F6C35D0529662EAA011();
	void OnFinish_F0089B36441A327D70DEC9A83EAD86A7();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnPressContext(const struct FKeyEvent& KeyEvent);
	void OnRequestTitleChange();
	void OnTitleSelected();
	void RefreshUserProfile();
	void SetupBG(bool bForce);
	void SetupFooter();
	void SetupMenuButtons();
	void SetupVersion();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Title_C">();
	}
	static class UWBP_Title_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Title_C>();
	}
};
static_assert(alignof(UWBP_Title_C) == 0x000008, "Wrong alignment on UWBP_Title_C");
static_assert(sizeof(UWBP_Title_C) == 0x0005D8, "Wrong size on UWBP_Title_C");
static_assert(offsetof(UWBP_Title_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Title_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Title_C, Show) == 0x000468, "Member 'UWBP_Title_C::Show' has a wrong offset!");
static_assert(offsetof(UWBP_Title_C, BGHolder) == 0x000470, "Member 'UWBP_Title_C::BGHolder' has a wrong offset!");
static_assert(offsetof(UWBP_Title_C, BuildNumberText) == 0x000478, "Member 'UWBP_Title_C::BuildNumberText' has a wrong offset!");
static_assert(offsetof(UWBP_Title_C, DemoLabel) == 0x000480, "Member 'UWBP_Title_C::DemoLabel' has a wrong offset!");
static_assert(offsetof(UWBP_Title_C, EarlyAccessLabel) == 0x000488, "Member 'UWBP_Title_C::EarlyAccessLabel' has a wrong offset!");
static_assert(offsetof(UWBP_Title_C, InvalidVersionText) == 0x000490, "Member 'UWBP_Title_C::InvalidVersionText' has a wrong offset!");
static_assert(offsetof(UWBP_Title_C, ProfileName) == 0x000498, "Member 'UWBP_Title_C::ProfileName' has a wrong offset!");
static_assert(offsetof(UWBP_Title_C, VersionText) == 0x0004A0, "Member 'UWBP_Title_C::VersionText' has a wrong offset!");
static_assert(offsetof(UWBP_Title_C, WBP_Button_Generic_Exit) == 0x0004A8, "Member 'UWBP_Title_C::WBP_Button_Generic_Exit' has a wrong offset!");
static_assert(offsetof(UWBP_Title_C, WBP_Button_Generic_Settings) == 0x0004B0, "Member 'UWBP_Title_C::WBP_Button_Generic_Settings' has a wrong offset!");
static_assert(offsetof(UWBP_Title_C, WBP_Button_Generic_Start) == 0x0004B8, "Member 'UWBP_Title_C::WBP_Button_Generic_Start' has a wrong offset!");
static_assert(offsetof(UWBP_Title_C, WBP_Footer) == 0x0004C0, "Member 'UWBP_Title_C::WBP_Footer' has a wrong offset!");
static_assert(offsetof(UWBP_Title_C, Titles) == 0x0004C8, "Member 'UWBP_Title_C::Titles' has a wrong offset!");
static_assert(offsetof(UWBP_Title_C, TitleLevels) == 0x000518, "Member 'UWBP_Title_C::TitleLevels' has a wrong offset!");
static_assert(offsetof(UWBP_Title_C, Footer_TitleChange) == 0x000568, "Member 'UWBP_Title_C::Footer_TitleChange' has a wrong offset!");
static_assert(offsetof(UWBP_Title_C, LoadedLevel) == 0x0005C0, "Member 'UWBP_Title_C::LoadedLevel' has a wrong offset!");
static_assert(offsetof(UWBP_Title_C, LoadedTitleType) == 0x0005C8, "Member 'UWBP_Title_C::LoadedTitleType' has a wrong offset!");
static_assert(offsetof(UWBP_Title_C, SE_TitleScreenSelection) == 0x0005D0, "Member 'UWBP_Title_C::SE_TitleScreenSelection' has a wrong offset!");

}

