#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Footer_Entry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Footer_Entry.WBP_Footer_Entry_C
// 0x0070 (0x04D0 - 0x0460)
class UWBP_Footer_Entry_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URefreshableRichTextBlock*              InputRichText;                                     // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LabelText;                                         // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFooterData                            FooterData;                                        // 0x0478(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)

public:
	void ExecuteUbergraph_WBP_Footer_Entry(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Footer_Entry_C">();
	}
	static class UWBP_Footer_Entry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Footer_Entry_C>();
	}
};
static_assert(alignof(UWBP_Footer_Entry_C) == 0x000008, "Wrong alignment on UWBP_Footer_Entry_C");
static_assert(sizeof(UWBP_Footer_Entry_C) == 0x0004D0, "Wrong size on UWBP_Footer_Entry_C");
static_assert(offsetof(UWBP_Footer_Entry_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Footer_Entry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Footer_Entry_C, InputRichText) == 0x000468, "Member 'UWBP_Footer_Entry_C::InputRichText' has a wrong offset!");
static_assert(offsetof(UWBP_Footer_Entry_C, LabelText) == 0x000470, "Member 'UWBP_Footer_Entry_C::LabelText' has a wrong offset!");
static_assert(offsetof(UWBP_Footer_Entry_C, FooterData) == 0x000478, "Member 'UWBP_Footer_Entry_C::FooterData' has a wrong offset!");

}

