#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SpiritSkillList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SpiritSkillList.WBP_SpiritSkillList_C
// 0x0040 (0x04A0 - 0x0460)
class UWBP_SpiritSkillList_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWrapBox*                               SkillListHolder;                                   // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWBP_SpiritSkillSet_C* SpiritSkilSet, class UWBP_SpiritSkillEntry_C* SpiritSkillEntry)> OnSkillEntryFocused; // 0x0470(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UWBP_SpiritSkillSet_C* SpiritSkillSet, class UWBP_SpiritSkillEntry_C* SpiritSkillEntry)> OnSkillEntryPressed; // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bDisplayUnlockStatus;                              // 0x0490(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_491[0x3];                                      // 0x0491(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SkillSetColumnCount;                               // 0x0494(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_SpiritSkillSet_C*                  FocusedSpiritSet;                                  // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void Construct();
	void CreateSkillList();
	void ExecuteUbergraph_WBP_SpiritSkillList(int32 EntryPoint);
	void Get_Skill_Entry_to_Focus_from_Navigation(EUINavigation Direction, int32 SkillSetIndex, int32 SkillEntryIndex, class UWBP_SpiritSkillEntry_C** SkillEntry);
	int32 GetFirstRowCount();
	void GetFirstSpiritSetOfLastRow(class UWBP_SpiritSkillSet_C** AsWBP_Spirit_Skill_Set);
	void GetSkillEntryToFocusFromFocusedSpiritSet(EUINavigation Direction, class UWBP_SpiritSkillEntry_C** SkillEntry);
	void GetSkillSpiritSet(int32 Index_0, class UWBP_SpiritSkillSet_C** AsWBP_Spirit_Skill_Set);
	bool IsEmpty();
	void IsFirstRow(int32 SkillSetIndex, bool* bIsFocused);
	void IsLastRow(int32 SkillSetIndex, bool* bIsFocused);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnSpiritSkillEntryFocused(class UWBP_SpiritSkillSet_C* SpiritSkilSet, class UWBP_SpiritSkillEntry_C* SpiritSkillEntry);
	void OnSpiritSkillEntryPressed(class UWBP_SpiritSkillSet_C* SpiritSkillSet, class UWBP_SpiritSkillEntry_C* SpiritSkillEntry);
	void Refresh();
	void SetupListNavigation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SpiritSkillList_C">();
	}
	static class UWBP_SpiritSkillList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SpiritSkillList_C>();
	}
};
static_assert(alignof(UWBP_SpiritSkillList_C) == 0x000008, "Wrong alignment on UWBP_SpiritSkillList_C");
static_assert(sizeof(UWBP_SpiritSkillList_C) == 0x0004A0, "Wrong size on UWBP_SpiritSkillList_C");
static_assert(offsetof(UWBP_SpiritSkillList_C, UberGraphFrame) == 0x000460, "Member 'UWBP_SpiritSkillList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SpiritSkillList_C, SkillListHolder) == 0x000468, "Member 'UWBP_SpiritSkillList_C::SkillListHolder' has a wrong offset!");
static_assert(offsetof(UWBP_SpiritSkillList_C, OnSkillEntryFocused) == 0x000470, "Member 'UWBP_SpiritSkillList_C::OnSkillEntryFocused' has a wrong offset!");
static_assert(offsetof(UWBP_SpiritSkillList_C, OnSkillEntryPressed) == 0x000480, "Member 'UWBP_SpiritSkillList_C::OnSkillEntryPressed' has a wrong offset!");
static_assert(offsetof(UWBP_SpiritSkillList_C, bDisplayUnlockStatus) == 0x000490, "Member 'UWBP_SpiritSkillList_C::bDisplayUnlockStatus' has a wrong offset!");
static_assert(offsetof(UWBP_SpiritSkillList_C, SkillSetColumnCount) == 0x000494, "Member 'UWBP_SpiritSkillList_C::SkillSetColumnCount' has a wrong offset!");
static_assert(offsetof(UWBP_SpiritSkillList_C, FocusedSpiritSet) == 0x000498, "Member 'UWBP_SpiritSkillList_C::FocusedSpiritSet' has a wrong offset!");

}

