#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Event

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Event.WBP_Event_C
// 0x00A0 (0x0550 - 0x04B0)
class UWBP_Event_C final : public UUserWidgetEvent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowHelp;                                          // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideChoice;                                        // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowChoice;                                        // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideLine;                                          // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowLine;                                          // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Choice;                                         // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ChoiceSpeakerName;                                 // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ChoiceText;                                        // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LineText;                                          // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_ChoiceDisplay;                             // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_LineDisplay;                               // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URefreshableRichTextBlock*              SkipTextLabel;                                     // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SpeakerName;                                       // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_ChoiceContainer;                       // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFadeDescriptionData                   SkipFadeDescription;                               // 0x0530(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor)

public:
	void CleanUpChoices();
	void Construct();
	void CreateChoices(const TArray<class FText>& InputPin);
	void ExecuteUbergraph_WBP_Event(int32 EntryPoint);
	void OnChoiceConfirmed(class UWBP_Event_Choice_C* EventChoice);
	void OnFinish_72C7DC1544F90D6FD9C218846DE402DD();
	void OnFinish_72C7DC1544F90D6FD9C2188473B016F7();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void OnNotifyEventStartPlaying();
	void OnPause();
	void OnPlayChoices(const class FText& SpeakerName_0, const class FText& Text, const TArray<class FText>& Choices);
	struct FEventReply OnPressCancel(const struct FKeyEvent& KeyEvent);
	void OnRequestRemoveFromParent();
	void OnSkipEvent_No();
	void OnSkipEvent_Yes();
	void OnSkipFadeOutFinished();
	void OnTalk(const class FText& SpeakerName_0, const class FText& Text, float Duration);
	void Pause();
	void WidgetAnimationEvt_HideLine_K2Node_WidgetAnimationEvent_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Event_C">();
	}
	static class UWBP_Event_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Event_C>();
	}
};
static_assert(alignof(UWBP_Event_C) == 0x000008, "Wrong alignment on UWBP_Event_C");
static_assert(sizeof(UWBP_Event_C) == 0x000550, "Wrong size on UWBP_Event_C");
static_assert(offsetof(UWBP_Event_C, UberGraphFrame) == 0x0004B0, "Member 'UWBP_Event_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Event_C, ShowHelp) == 0x0004B8, "Member 'UWBP_Event_C::ShowHelp' has a wrong offset!");
static_assert(offsetof(UWBP_Event_C, HideChoice) == 0x0004C0, "Member 'UWBP_Event_C::HideChoice' has a wrong offset!");
static_assert(offsetof(UWBP_Event_C, ShowChoice) == 0x0004C8, "Member 'UWBP_Event_C::ShowChoice' has a wrong offset!");
static_assert(offsetof(UWBP_Event_C, HideLine) == 0x0004D0, "Member 'UWBP_Event_C::HideLine' has a wrong offset!");
static_assert(offsetof(UWBP_Event_C, ShowLine) == 0x0004D8, "Member 'UWBP_Event_C::ShowLine' has a wrong offset!");
static_assert(offsetof(UWBP_Event_C, BG) == 0x0004E0, "Member 'UWBP_Event_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_Event_C, BG_Choice) == 0x0004E8, "Member 'UWBP_Event_C::BG_Choice' has a wrong offset!");
static_assert(offsetof(UWBP_Event_C, ChoiceSpeakerName) == 0x0004F0, "Member 'UWBP_Event_C::ChoiceSpeakerName' has a wrong offset!");
static_assert(offsetof(UWBP_Event_C, ChoiceText) == 0x0004F8, "Member 'UWBP_Event_C::ChoiceText' has a wrong offset!");
static_assert(offsetof(UWBP_Event_C, LineText) == 0x000500, "Member 'UWBP_Event_C::LineText' has a wrong offset!");
static_assert(offsetof(UWBP_Event_C, Overlay_ChoiceDisplay) == 0x000508, "Member 'UWBP_Event_C::Overlay_ChoiceDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_Event_C, Overlay_LineDisplay) == 0x000510, "Member 'UWBP_Event_C::Overlay_LineDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_Event_C, SkipTextLabel) == 0x000518, "Member 'UWBP_Event_C::SkipTextLabel' has a wrong offset!");
static_assert(offsetof(UWBP_Event_C, SpeakerName) == 0x000520, "Member 'UWBP_Event_C::SpeakerName' has a wrong offset!");
static_assert(offsetof(UWBP_Event_C, VerticalBox_ChoiceContainer) == 0x000528, "Member 'UWBP_Event_C::VerticalBox_ChoiceContainer' has a wrong offset!");
static_assert(offsetof(UWBP_Event_C, SkipFadeDescription) == 0x000530, "Member 'UWBP_Event_C::SkipFadeDescription' has a wrong offset!");

}

