#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RestPointList_Entry

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function WBP_RestPointList_Entry.WBP_RestPointList_Entry_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_RestPointList_Entry_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_RestPointList_Entry_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_RestPointList_Entry_C_OnFocusReceived");
static_assert(sizeof(WBP_RestPointList_Entry_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_RestPointList_Entry_C_OnFocusReceived");
static_assert(offsetof(WBP_RestPointList_Entry_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_RestPointList_Entry_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_Entry_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_RestPointList_Entry_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_Entry_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_RestPointList_Entry_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_Entry_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_RestPointList_Entry_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_RestPointList_Entry.WBP_RestPointList_Entry_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_RestPointList_Entry_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_RestPointList_Entry_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on WBP_RestPointList_Entry_C_OnAddedToFocusPath");
static_assert(sizeof(WBP_RestPointList_Entry_C_OnAddedToFocusPath) == 0x000008, "Wrong size on WBP_RestPointList_Entry_C_OnAddedToFocusPath");
static_assert(offsetof(WBP_RestPointList_Entry_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_RestPointList_Entry_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_RestPointList_Entry.WBP_RestPointList_Entry_C.ExecuteUbergraph_WBP_RestPointList_Entry
// 0x0110 (0x0110 - 0x0000)
struct WBP_RestPointList_Entry_C_ExecuteUbergraph_WBP_RestPointList_Entry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMapRestPointData                      CallFunc_GetRestPointData_ReturnValue;             // 0x0008(0x0008)(NoDestructor)
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent;               // 0x0010(0x0040)()
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0050(0x0008)(NoDestructor)
	class AGameModeZion*                          CallFunc_Get_ReturnValue;                          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMapRestPointData                      CallFunc_GetRestPointData_ReturnValue_1;           // 0x0064(0x0008)(NoDestructor)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             CallFunc_GetDataTableRestPoints_ReturnValue;       // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRestPointData                         CallFunc_GetDataTableRowFromName_OutRow;           // 0x0080(0x0088)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RestPointList_Entry_C_ExecuteUbergraph_WBP_RestPointList_Entry) == 0x000008, "Wrong alignment on WBP_RestPointList_Entry_C_ExecuteUbergraph_WBP_RestPointList_Entry");
static_assert(sizeof(WBP_RestPointList_Entry_C_ExecuteUbergraph_WBP_RestPointList_Entry) == 0x000110, "Wrong size on WBP_RestPointList_Entry_C_ExecuteUbergraph_WBP_RestPointList_Entry");
static_assert(offsetof(WBP_RestPointList_Entry_C_ExecuteUbergraph_WBP_RestPointList_Entry, EntryPoint) == 0x000000, "Member 'WBP_RestPointList_Entry_C_ExecuteUbergraph_WBP_RestPointList_Entry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_Entry_C_ExecuteUbergraph_WBP_RestPointList_Entry, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_RestPointList_Entry_C_ExecuteUbergraph_WBP_RestPointList_Entry::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_Entry_C_ExecuteUbergraph_WBP_RestPointList_Entry, CallFunc_GetRestPointData_ReturnValue) == 0x000008, "Member 'WBP_RestPointList_Entry_C_ExecuteUbergraph_WBP_RestPointList_Entry::CallFunc_GetRestPointData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_Entry_C_ExecuteUbergraph_WBP_RestPointList_Entry, K2Node_ComponentBoundEvent_KeyEvent) == 0x000010, "Member 'WBP_RestPointList_Entry_C_ExecuteUbergraph_WBP_RestPointList_Entry::K2Node_ComponentBoundEvent_KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_Entry_C_ExecuteUbergraph_WBP_RestPointList_Entry, K2Node_Event_InFocusEvent) == 0x000050, "Member 'WBP_RestPointList_Entry_C_ExecuteUbergraph_WBP_RestPointList_Entry::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_Entry_C_ExecuteUbergraph_WBP_RestPointList_Entry, CallFunc_Get_ReturnValue) == 0x000058, "Member 'WBP_RestPointList_Entry_C_ExecuteUbergraph_WBP_RestPointList_Entry::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_Entry_C_ExecuteUbergraph_WBP_RestPointList_Entry, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'WBP_RestPointList_Entry_C_ExecuteUbergraph_WBP_RestPointList_Entry::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_Entry_C_ExecuteUbergraph_WBP_RestPointList_Entry, CallFunc_IsValid_ReturnValue_2) == 0x000061, "Member 'WBP_RestPointList_Entry_C_ExecuteUbergraph_WBP_RestPointList_Entry::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_Entry_C_ExecuteUbergraph_WBP_RestPointList_Entry, CallFunc_GetRestPointData_ReturnValue_1) == 0x000064, "Member 'WBP_RestPointList_Entry_C_ExecuteUbergraph_WBP_RestPointList_Entry::CallFunc_GetRestPointData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_Entry_C_ExecuteUbergraph_WBP_RestPointList_Entry, CallFunc_GetDataTableRestPoints_ReturnValue) == 0x000070, "Member 'WBP_RestPointList_Entry_C_ExecuteUbergraph_WBP_RestPointList_Entry::CallFunc_GetDataTableRestPoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_Entry_C_ExecuteUbergraph_WBP_RestPointList_Entry, CallFunc_IsValid_ReturnValue_3) == 0x000078, "Member 'WBP_RestPointList_Entry_C_ExecuteUbergraph_WBP_RestPointList_Entry::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_Entry_C_ExecuteUbergraph_WBP_RestPointList_Entry, CallFunc_GetDataTableRowFromName_OutRow) == 0x000080, "Member 'WBP_RestPointList_Entry_C_ExecuteUbergraph_WBP_RestPointList_Entry::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_Entry_C_ExecuteUbergraph_WBP_RestPointList_Entry, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000108, "Member 'WBP_RestPointList_Entry_C_ExecuteUbergraph_WBP_RestPointList_Entry::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function WBP_RestPointList_Entry.WBP_RestPointList_Entry_C.BndEvt__WBP_RestPointList_Page_Entry_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_RestPointList_Entry_C_BndEvt__WBP_RestPointList_Page_Entry_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_RestPointList_Entry_C_BndEvt__WBP_RestPointList_Page_Entry_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_RestPointList_Entry_C_BndEvt__WBP_RestPointList_Page_Entry_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_RestPointList_Entry_C_BndEvt__WBP_RestPointList_Page_Entry_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_RestPointList_Entry_C_BndEvt__WBP_RestPointList_Page_Entry_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_RestPointList_Entry_C_BndEvt__WBP_RestPointList_Page_Entry_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_RestPointList_Entry_C_BndEvt__WBP_RestPointList_Page_Entry_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

}

