#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DemoStart

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function WBP_DemoStart.WBP_DemoStart_C.ExecuteUbergraph_WBP_DemoStart
// 0x0060 (0x0060 - 0x0000)
struct WBP_DemoStart_C_ExecuteUbergraph_WBP_DemoStart final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveSubsystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFadeDescriptionData                   Temp_struct_Variable;                              // 0x0010(0x0020)(ConstParm, NoDestructor)
	struct FFadeDescriptionData                   K2Node_MakeStruct_FadeDescriptionData;             // 0x0030(0x0020)(NoDestructor)
	class UGameInstanceZion*                      CallFunc_Get_ReturnValue;                          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWorldLoaderSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DemoStart_C_ExecuteUbergraph_WBP_DemoStart) == 0x000008, "Wrong alignment on WBP_DemoStart_C_ExecuteUbergraph_WBP_DemoStart");
static_assert(sizeof(WBP_DemoStart_C_ExecuteUbergraph_WBP_DemoStart) == 0x000060, "Wrong size on WBP_DemoStart_C_ExecuteUbergraph_WBP_DemoStart");
static_assert(offsetof(WBP_DemoStart_C_ExecuteUbergraph_WBP_DemoStart, EntryPoint) == 0x000000, "Member 'WBP_DemoStart_C_ExecuteUbergraph_WBP_DemoStart::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DemoStart_C_ExecuteUbergraph_WBP_DemoStart, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_DemoStart_C_ExecuteUbergraph_WBP_DemoStart::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DemoStart_C_ExecuteUbergraph_WBP_DemoStart, Temp_struct_Variable) == 0x000010, "Member 'WBP_DemoStart_C_ExecuteUbergraph_WBP_DemoStart::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DemoStart_C_ExecuteUbergraph_WBP_DemoStart, K2Node_MakeStruct_FadeDescriptionData) == 0x000030, "Member 'WBP_DemoStart_C_ExecuteUbergraph_WBP_DemoStart::K2Node_MakeStruct_FadeDescriptionData' has a wrong offset!");
static_assert(offsetof(WBP_DemoStart_C_ExecuteUbergraph_WBP_DemoStart, CallFunc_Get_ReturnValue) == 0x000050, "Member 'WBP_DemoStart_C_ExecuteUbergraph_WBP_DemoStart::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DemoStart_C_ExecuteUbergraph_WBP_DemoStart, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000058, "Member 'WBP_DemoStart_C_ExecuteUbergraph_WBP_DemoStart::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");

// Function WBP_DemoStart.WBP_DemoStart_C.OnPressConfirm
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_DemoStart_C_OnPressConfirm final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_DemoStart_C_OnPressConfirm) == 0x000008, "Wrong alignment on WBP_DemoStart_C_OnPressConfirm");
static_assert(sizeof(WBP_DemoStart_C_OnPressConfirm) == 0x0001B0, "Wrong size on WBP_DemoStart_C_OnPressConfirm");
static_assert(offsetof(WBP_DemoStart_C_OnPressConfirm, KeyEvent) == 0x000000, "Member 'WBP_DemoStart_C_OnPressConfirm::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_DemoStart_C_OnPressConfirm, ReturnValue) == 0x000040, "Member 'WBP_DemoStart_C_OnPressConfirm::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DemoStart_C_OnPressConfirm, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_DemoStart_C_OnPressConfirm::CallFunc_Handled_ReturnValue' has a wrong offset!");

}

