#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RestMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RestMenu.WBP_RestMenu_C
// 0x0290 (0x06F0 - 0x0460)
class UWBP_RestMenu_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HighlightRestEvent;                                // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideAllUI;                                         // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideAnim;                                          // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             AreaName;                                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Light;                                          // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line;                                              // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RestPointName;                                     // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TabDeco_Left;                                      // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TabDeco_Right;                                     // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Footer_C*                          WBP_Footer;                                        // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RestMenu_Button_C*                 WBP_RestMenu_Button_Difficulty;                    // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RestMenu_Button_C*                 WBP_RestMenu_Button_Exit;                          // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RestMenu_Button_C*                 WBP_RestMenu_Button_Extra;                         // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RestMenu_Button_C*                 WBP_RestMenu_Button_FastTravel;                    // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RestMenu_Button_C*                 WBP_RestMenu_Button_Recollection;                  // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RestMenu_Button_C*                 WBP_RestMenu_Button_Save;                          // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RestMenu_Button_C*                 WBP_RestMenu_Button_SetEquipment;                  // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RestMenu_Button_C*                 WBP_RestMenu_Button_SetPassive;                    // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RestMenu_Button_C*                 WBP_RestMenu_Button_SetSkill;                      // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RestMenu_Button_C*                 WBP_RestMenu_Button_SkillUpgrade;                  // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RestMenu_EventBanner_C*            WBP_RestMenu_EventBanner;                          // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventContext*                          EventContext;                                      // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FRestPointData                         RestPointData;                                     // 0x0520(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UWBP_Map_C*                             FastTravelMenu;                                    // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_GameMenu_C*                        gamemenu;                                          // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	TSoftObjectPtr<class UEventAsset>             In_Next_Event_Asset;                               // 0x05B8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	struct FDataTableRowHandle                    RestPointEventDataHandle;                          // 0x05E0(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor, AdvancedDisplay)
	struct FRestPointEventData                    RestPointEventData;                                // 0x05F0(0x0090)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, AdvancedDisplay)
	bool                                          bHasRestPointEventData;                            // 0x0680(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          IsUIVisible;                                       // 0x0681(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_682[0x6];                                      // 0x0682(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UUserWidget*, ESlateVisibility>    CachedWidgetVisibilities;                          // 0x0688(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UFMODEvent*                             SE_OpenRestMenu;                                   // 0x06D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             SE_ToggleUIVisibility;                             // 0x06E0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             SE_StartRestPointEvent;                            // 0x06E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_RestMenu_WBP_RestMenu_Button_DifficultyA_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Exit_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Extra_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Extra_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void BndEvt__WBP_RestMenu_WBP_RestMenu_Button_FastTravelqa_K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Save_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SetEquipment_K2Node_ComponentBoundEvent_7_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SetPassive_K2Node_ComponentBoundEvent_8_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SetSkill_K2Node_ComponentBoundEvent_6_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SkillUpgrade_K2Node_ComponentBoundEvent_9_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void CloseMenu();
	void Construct();
	void ExecuteUbergraph_WBP_RestMenu(int32 EntryPoint);
	void LoadRestPointData();
	void LoadRestPointEventData();
	void OnDifficultyClosed();
	void OnEventRequested();
	void OnFastTravelRequested(class FName RestPointID, const struct FRestPointData& RestPointData_0);
	void OnFinish_2D2F80EB415553CBBF663CB2519181A7();
	void OnFinish_72C7DC1544F90D6FD9C21884F9C3388C();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnHideAllUIAnimEvaluate();
	struct FEventReply OnPressCancel(const struct FKeyEvent& KeyEvent);
	struct FEventReply OnPressContext(const struct FKeyEvent& KeyEvent);
	struct FEventReply OnPressContextAlt(const struct FKeyEvent& KeyEvent);
	struct FEventReply OnPreviewKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnPreviewMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnRecollectionRequestStartBoss(const struct FDataTableRowHandle& RecollectionBossDataHandle);
	void OnRecollectionRequestStartBossRush();
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnSaveFinished(bool Result);
	void OpenGameMenu(int32 InitialPageIndex);
	void OpenRecollectionMenu(ERecollectionPageType PageType, const struct FDataTableRowHandle& DefaultRecollectionBossHandle, bool bSkipOpenAnimation);
	void RefreshNewIcons();
	void SequenceEvent__ENTRYPOINTWBP_RestMenu();
	void SetEventContext(class UEventContext* InEventContext);
	void SetupMenu();
	void ToggleUIVisibility();
	void TryAutoOpenRecollection(bool* bOpened);
	void WidgetAnimationEvt_HideAllUI_K2Node_WidgetAnimationEvent_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RestMenu_C">();
	}
	static class UWBP_RestMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RestMenu_C>();
	}
};
static_assert(alignof(UWBP_RestMenu_C) == 0x000008, "Wrong alignment on UWBP_RestMenu_C");
static_assert(sizeof(UWBP_RestMenu_C) == 0x0006F0, "Wrong size on UWBP_RestMenu_C");
static_assert(offsetof(UWBP_RestMenu_C, UberGraphFrame) == 0x000460, "Member 'UWBP_RestMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, HighlightRestEvent) == 0x000468, "Member 'UWBP_RestMenu_C::HighlightRestEvent' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, HideAllUI) == 0x000470, "Member 'UWBP_RestMenu_C::HideAllUI' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, HideAnim) == 0x000478, "Member 'UWBP_RestMenu_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, ShowAnim) == 0x000480, "Member 'UWBP_RestMenu_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, AreaName) == 0x000488, "Member 'UWBP_RestMenu_C::AreaName' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, BG_Light) == 0x000490, "Member 'UWBP_RestMenu_C::BG_Light' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, Line) == 0x000498, "Member 'UWBP_RestMenu_C::Line' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, RestPointName) == 0x0004A0, "Member 'UWBP_RestMenu_C::RestPointName' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, TabDeco_Left) == 0x0004A8, "Member 'UWBP_RestMenu_C::TabDeco_Left' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, TabDeco_Right) == 0x0004B0, "Member 'UWBP_RestMenu_C::TabDeco_Right' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, WBP_Footer) == 0x0004B8, "Member 'UWBP_RestMenu_C::WBP_Footer' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, WBP_RestMenu_Button_Difficulty) == 0x0004C0, "Member 'UWBP_RestMenu_C::WBP_RestMenu_Button_Difficulty' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, WBP_RestMenu_Button_Exit) == 0x0004C8, "Member 'UWBP_RestMenu_C::WBP_RestMenu_Button_Exit' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, WBP_RestMenu_Button_Extra) == 0x0004D0, "Member 'UWBP_RestMenu_C::WBP_RestMenu_Button_Extra' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, WBP_RestMenu_Button_FastTravel) == 0x0004D8, "Member 'UWBP_RestMenu_C::WBP_RestMenu_Button_FastTravel' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, WBP_RestMenu_Button_Recollection) == 0x0004E0, "Member 'UWBP_RestMenu_C::WBP_RestMenu_Button_Recollection' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, WBP_RestMenu_Button_Save) == 0x0004E8, "Member 'UWBP_RestMenu_C::WBP_RestMenu_Button_Save' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, WBP_RestMenu_Button_SetEquipment) == 0x0004F0, "Member 'UWBP_RestMenu_C::WBP_RestMenu_Button_SetEquipment' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, WBP_RestMenu_Button_SetPassive) == 0x0004F8, "Member 'UWBP_RestMenu_C::WBP_RestMenu_Button_SetPassive' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, WBP_RestMenu_Button_SetSkill) == 0x000500, "Member 'UWBP_RestMenu_C::WBP_RestMenu_Button_SetSkill' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, WBP_RestMenu_Button_SkillUpgrade) == 0x000508, "Member 'UWBP_RestMenu_C::WBP_RestMenu_Button_SkillUpgrade' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, WBP_RestMenu_EventBanner) == 0x000510, "Member 'UWBP_RestMenu_C::WBP_RestMenu_EventBanner' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, EventContext) == 0x000518, "Member 'UWBP_RestMenu_C::EventContext' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, RestPointData) == 0x000520, "Member 'UWBP_RestMenu_C::RestPointData' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, FastTravelMenu) == 0x0005A8, "Member 'UWBP_RestMenu_C::FastTravelMenu' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, gamemenu) == 0x0005B0, "Member 'UWBP_RestMenu_C::gamemenu' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, In_Next_Event_Asset) == 0x0005B8, "Member 'UWBP_RestMenu_C::In_Next_Event_Asset' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, RestPointEventDataHandle) == 0x0005E0, "Member 'UWBP_RestMenu_C::RestPointEventDataHandle' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, RestPointEventData) == 0x0005F0, "Member 'UWBP_RestMenu_C::RestPointEventData' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, bHasRestPointEventData) == 0x000680, "Member 'UWBP_RestMenu_C::bHasRestPointEventData' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, IsUIVisible) == 0x000681, "Member 'UWBP_RestMenu_C::IsUIVisible' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, CachedWidgetVisibilities) == 0x000688, "Member 'UWBP_RestMenu_C::CachedWidgetVisibilities' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, SE_OpenRestMenu) == 0x0006D8, "Member 'UWBP_RestMenu_C::SE_OpenRestMenu' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, SE_ToggleUIVisibility) == 0x0006E0, "Member 'UWBP_RestMenu_C::SE_ToggleUIVisibility' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_C, SE_StartRestPointEvent) == 0x0006E8, "Member 'UWBP_RestMenu_C::SE_StartRestPointEvent' has a wrong offset!");

}

