#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugMenu_Element_Choice_Toggle_Aptitude

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function WBP_DebugMenu_Element_Choice_Toggle_Aptitude.WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_OnFocusReceived");
static_assert(sizeof(WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_OnFocusReceived");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_DebugMenu_Element_Choice_Toggle_Aptitude.WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C.ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Toggle_Aptitude
// 0x01A0 (0x01A0 - 0x0000)
struct WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Toggle_Aptitude final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_ToggleValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue_1;                        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasItem_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveItem_ReturnValue;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddItem_ReturnValue;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInventoryItemAptitudeData             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0020(0x0178)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Toggle_Aptitude) == 0x000008, "Wrong alignment on WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Toggle_Aptitude");
static_assert(sizeof(WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Toggle_Aptitude) == 0x0001A0, "Wrong size on WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Toggle_Aptitude");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Toggle_Aptitude, EntryPoint) == 0x000000, "Member 'WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Toggle_Aptitude::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Toggle_Aptitude, K2Node_ComponentBoundEvent_ToggleValue) == 0x000004, "Member 'WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Toggle_Aptitude::K2Node_ComponentBoundEvent_ToggleValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Toggle_Aptitude, CallFunc_Get_ReturnValue) == 0x000008, "Member 'WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Toggle_Aptitude::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Toggle_Aptitude, CallFunc_Get_ReturnValue_1) == 0x000010, "Member 'WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Toggle_Aptitude::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Toggle_Aptitude, CallFunc_HasItem_ReturnValue) == 0x000018, "Member 'WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Toggle_Aptitude::CallFunc_HasItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Toggle_Aptitude, CallFunc_RemoveItem_ReturnValue) == 0x000019, "Member 'WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Toggle_Aptitude::CallFunc_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Toggle_Aptitude, CallFunc_AddItem_ReturnValue) == 0x00001A, "Member 'WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Toggle_Aptitude::CallFunc_AddItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Toggle_Aptitude, CallFunc_GetDataTableRowFromName_OutRow) == 0x000020, "Member 'WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Toggle_Aptitude::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Toggle_Aptitude, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000198, "Member 'WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Toggle_Aptitude::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function WBP_DebugMenu_Element_Choice_Toggle_Aptitude.WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C.BndEvt__WBP_DebugMenu_Element_Choice_Toggle_Command_WBP_DebugMenu_Element_Choice_Toggle_K2Node_ComponentBoundEvent_0_OnToggle__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_BndEvt__WBP_DebugMenu_Element_Choice_Toggle_Command_WBP_DebugMenu_Element_Choice_Toggle_K2Node_ComponentBoundEvent_0_OnToggle__DelegateSignature final
{
public:
	bool                                          ToggleValue;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_BndEvt__WBP_DebugMenu_Element_Choice_Toggle_Command_WBP_DebugMenu_Element_Choice_Toggle_K2Node_ComponentBoundEvent_0_OnToggle__DelegateSignature) == 0x000001, "Wrong alignment on WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_BndEvt__WBP_DebugMenu_Element_Choice_Toggle_Command_WBP_DebugMenu_Element_Choice_Toggle_K2Node_ComponentBoundEvent_0_OnToggle__DelegateSignature");
static_assert(sizeof(WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_BndEvt__WBP_DebugMenu_Element_Choice_Toggle_Command_WBP_DebugMenu_Element_Choice_Toggle_K2Node_ComponentBoundEvent_0_OnToggle__DelegateSignature) == 0x000001, "Wrong size on WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_BndEvt__WBP_DebugMenu_Element_Choice_Toggle_Command_WBP_DebugMenu_Element_Choice_Toggle_K2Node_ComponentBoundEvent_0_OnToggle__DelegateSignature");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_BndEvt__WBP_DebugMenu_Element_Choice_Toggle_Command_WBP_DebugMenu_Element_Choice_Toggle_K2Node_ComponentBoundEvent_0_OnToggle__DelegateSignature, ToggleValue) == 0x000000, "Member 'WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C_BndEvt__WBP_DebugMenu_Element_Choice_Toggle_Command_WBP_DebugMenu_Element_Choice_Toggle_K2Node_ComponentBoundEvent_0_OnToggle__DelegateSignature::ToggleValue' has a wrong offset!");

}

