#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_Page_Keyboard

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Settings_Page_Keyboard.WBP_Settings_Page_Keyboard_C.BndEvt__WBP_Settings_Page_Keyboard_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_Settings_Page_Keyboard_C_BndEvt__WBP_Settings_Page_Keyboard_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Settings_Page_Keyboard_C_BndEvt__WBP_Settings_Page_Keyboard_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_Page_Keyboard_C_BndEvt__WBP_Settings_Page_Keyboard_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Settings_Page_Keyboard_C_BndEvt__WBP_Settings_Page_Keyboard_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_Settings_Page_Keyboard_C_BndEvt__WBP_Settings_Page_Keyboard_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_BndEvt__WBP_Settings_Page_Keyboard_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_Settings_Page_Keyboard_C_BndEvt__WBP_Settings_Page_Keyboard_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_Settings_Page_Keyboard.WBP_Settings_Page_Keyboard_C.ExecuteUbergraph_WBP_Settings_Page_Keyboard
// 0x0088 (0x0088 - 0x0000)
struct WBP_Settings_Page_Keyboard_C_ExecuteUbergraph_WBP_Settings_Page_Keyboard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Dialog_YesNo_C*                    CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent;               // 0x0020(0x0040)()
	class UUMGSubsystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputSettingsSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0070(0x0010)(ConstParm)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Page_Keyboard_C_ExecuteUbergraph_WBP_Settings_Page_Keyboard) == 0x000008, "Wrong alignment on WBP_Settings_Page_Keyboard_C_ExecuteUbergraph_WBP_Settings_Page_Keyboard");
static_assert(sizeof(WBP_Settings_Page_Keyboard_C_ExecuteUbergraph_WBP_Settings_Page_Keyboard) == 0x000088, "Wrong size on WBP_Settings_Page_Keyboard_C_ExecuteUbergraph_WBP_Settings_Page_Keyboard");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_ExecuteUbergraph_WBP_Settings_Page_Keyboard, EntryPoint) == 0x000000, "Member 'WBP_Settings_Page_Keyboard_C_ExecuteUbergraph_WBP_Settings_Page_Keyboard::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_ExecuteUbergraph_WBP_Settings_Page_Keyboard, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Settings_Page_Keyboard_C_ExecuteUbergraph_WBP_Settings_Page_Keyboard::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_ExecuteUbergraph_WBP_Settings_Page_Keyboard, CallFunc_Create_ReturnValue) == 0x000018, "Member 'WBP_Settings_Page_Keyboard_C_ExecuteUbergraph_WBP_Settings_Page_Keyboard::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_ExecuteUbergraph_WBP_Settings_Page_Keyboard, K2Node_ComponentBoundEvent_KeyEvent) == 0x000020, "Member 'WBP_Settings_Page_Keyboard_C_ExecuteUbergraph_WBP_Settings_Page_Keyboard::K2Node_ComponentBoundEvent_KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_ExecuteUbergraph_WBP_Settings_Page_Keyboard, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000060, "Member 'WBP_Settings_Page_Keyboard_C_ExecuteUbergraph_WBP_Settings_Page_Keyboard::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_ExecuteUbergraph_WBP_Settings_Page_Keyboard, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000068, "Member 'WBP_Settings_Page_Keyboard_C_ExecuteUbergraph_WBP_Settings_Page_Keyboard::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_ExecuteUbergraph_WBP_Settings_Page_Keyboard, Temp_text_Variable) == 0x000070, "Member 'WBP_Settings_Page_Keyboard_C_ExecuteUbergraph_WBP_Settings_Page_Keyboard::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_ExecuteUbergraph_WBP_Settings_Page_Keyboard, K2Node_Event_IsDesignTime) == 0x000080, "Member 'WBP_Settings_Page_Keyboard_C_ExecuteUbergraph_WBP_Settings_Page_Keyboard::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_Settings_Page_Keyboard.WBP_Settings_Page_Keyboard_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Settings_Page_Keyboard_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Settings_Page_Keyboard_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Settings_Page_Keyboard_C_OnFocusReceived");
static_assert(sizeof(WBP_Settings_Page_Keyboard_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_Settings_Page_Keyboard_C_OnFocusReceived");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Settings_Page_Keyboard_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Settings_Page_Keyboard_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Settings_Page_Keyboard_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Settings_Page_Keyboard_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Settings_Page_Keyboard.WBP_Settings_Page_Keyboard_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_Page_Keyboard_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Page_Keyboard_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Settings_Page_Keyboard_C_PreConstruct");
static_assert(sizeof(WBP_Settings_Page_Keyboard_C_PreConstruct) == 0x000001, "Wrong size on WBP_Settings_Page_Keyboard_C_PreConstruct");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Settings_Page_Keyboard_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Settings_Page_Keyboard.WBP_Settings_Page_Keyboard_C.SetupCustomNavigation
// 0x0080 (0x0080 - 0x0000)
struct WBP_Settings_Page_Keyboard_C_SetupCustomNavigation final
{
public:
	class UPanelWidget*                           Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         ElementPerLine;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Child;                                             // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        Children;                                          // 0x0018(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_2;                         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Page_Keyboard_C_SetupCustomNavigation) == 0x000008, "Wrong alignment on WBP_Settings_Page_Keyboard_C_SetupCustomNavigation");
static_assert(sizeof(WBP_Settings_Page_Keyboard_C_SetupCustomNavigation) == 0x000080, "Wrong size on WBP_Settings_Page_Keyboard_C_SetupCustomNavigation");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_SetupCustomNavigation, Target) == 0x000000, "Member 'WBP_Settings_Page_Keyboard_C_SetupCustomNavigation::Target' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_SetupCustomNavigation, ElementPerLine) == 0x000008, "Member 'WBP_Settings_Page_Keyboard_C_SetupCustomNavigation::ElementPerLine' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_SetupCustomNavigation, Child) == 0x000010, "Member 'WBP_Settings_Page_Keyboard_C_SetupCustomNavigation::Child' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_SetupCustomNavigation, Children) == 0x000018, "Member 'WBP_Settings_Page_Keyboard_C_SetupCustomNavigation::Children' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_SetupCustomNavigation, Temp_int_Array_Index_Variable) == 0x000028, "Member 'WBP_Settings_Page_Keyboard_C_SetupCustomNavigation::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_SetupCustomNavigation, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'WBP_Settings_Page_Keyboard_C_SetupCustomNavigation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_SetupCustomNavigation, CallFunc_Subtract_IntInt_ReturnValue) == 0x000030, "Member 'WBP_Settings_Page_Keyboard_C_SetupCustomNavigation::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_SetupCustomNavigation, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'WBP_Settings_Page_Keyboard_C_SetupCustomNavigation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_SetupCustomNavigation, CallFunc_GetAllChildren_ReturnValue) == 0x000038, "Member 'WBP_Settings_Page_Keyboard_C_SetupCustomNavigation::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_SetupCustomNavigation, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'WBP_Settings_Page_Keyboard_C_SetupCustomNavigation::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_SetupCustomNavigation, CallFunc_Array_Get_Item) == 0x000050, "Member 'WBP_Settings_Page_Keyboard_C_SetupCustomNavigation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_SetupCustomNavigation, CallFunc_Add_IntInt_ReturnValue_1) == 0x000058, "Member 'WBP_Settings_Page_Keyboard_C_SetupCustomNavigation::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_SetupCustomNavigation, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00005C, "Member 'WBP_Settings_Page_Keyboard_C_SetupCustomNavigation::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_SetupCustomNavigation, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'WBP_Settings_Page_Keyboard_C_SetupCustomNavigation::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_SetupCustomNavigation, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x000068, "Member 'WBP_Settings_Page_Keyboard_C_SetupCustomNavigation::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_SetupCustomNavigation, CallFunc_Array_Get_Item_2) == 0x000070, "Member 'WBP_Settings_Page_Keyboard_C_SetupCustomNavigation::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_SetupCustomNavigation, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'WBP_Settings_Page_Keyboard_C_SetupCustomNavigation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Keyboard_C_SetupCustomNavigation, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'WBP_Settings_Page_Keyboard_C_SetupCustomNavigation::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

