#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Dialog_OK

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Dialog_OK.WBP_Dialog_OK_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Dialog_OK_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dialog_OK_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Dialog_OK_C_PreConstruct");
static_assert(sizeof(WBP_Dialog_OK_C_PreConstruct) == 0x000001, "Wrong size on WBP_Dialog_OK_C_PreConstruct");
static_assert(offsetof(WBP_Dialog_OK_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Dialog_OK_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Dialog_OK.WBP_Dialog_OK_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Dialog_OK_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Dialog_OK_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Dialog_OK_C_OnFocusReceived");
static_assert(sizeof(WBP_Dialog_OK_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_Dialog_OK_C_OnFocusReceived");
static_assert(offsetof(WBP_Dialog_OK_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Dialog_OK_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_OK_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Dialog_OK_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_OK_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Dialog_OK_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_OK_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Dialog_OK_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Dialog_OK.WBP_Dialog_OK_C.ExecuteUbergraph_WBP_Dialog_OK
// 0x0088 (0x0088 - 0x0000)
struct WBP_Dialog_OK_C_ExecuteUbergraph_WBP_Dialog_OK final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent;               // 0x0028(0x0040)()
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue_1;           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dialog_OK_C_ExecuteUbergraph_WBP_Dialog_OK) == 0x000008, "Wrong alignment on WBP_Dialog_OK_C_ExecuteUbergraph_WBP_Dialog_OK");
static_assert(sizeof(WBP_Dialog_OK_C_ExecuteUbergraph_WBP_Dialog_OK) == 0x000088, "Wrong size on WBP_Dialog_OK_C_ExecuteUbergraph_WBP_Dialog_OK");
static_assert(offsetof(WBP_Dialog_OK_C_ExecuteUbergraph_WBP_Dialog_OK, EntryPoint) == 0x000000, "Member 'WBP_Dialog_OK_C_ExecuteUbergraph_WBP_Dialog_OK::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_OK_C_ExecuteUbergraph_WBP_Dialog_OK, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Dialog_OK_C_ExecuteUbergraph_WBP_Dialog_OK::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_OK_C_ExecuteUbergraph_WBP_Dialog_OK, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_Dialog_OK_C_ExecuteUbergraph_WBP_Dialog_OK::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_OK_C_ExecuteUbergraph_WBP_Dialog_OK, K2Node_Event_IsDesignTime) == 0x000024, "Member 'WBP_Dialog_OK_C_ExecuteUbergraph_WBP_Dialog_OK::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_OK_C_ExecuteUbergraph_WBP_Dialog_OK, K2Node_ComponentBoundEvent_KeyEvent) == 0x000028, "Member 'WBP_Dialog_OK_C_ExecuteUbergraph_WBP_Dialog_OK::K2Node_ComponentBoundEvent_KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_OK_C_ExecuteUbergraph_WBP_Dialog_OK, CallFunc_PlayUMGAnimation_ReturnValue) == 0x000068, "Member 'WBP_Dialog_OK_C_ExecuteUbergraph_WBP_Dialog_OK::CallFunc_PlayUMGAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_OK_C_ExecuteUbergraph_WBP_Dialog_OK, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'WBP_Dialog_OK_C_ExecuteUbergraph_WBP_Dialog_OK::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_OK_C_ExecuteUbergraph_WBP_Dialog_OK, CallFunc_PlayUMGAnimation_ReturnValue_1) == 0x000078, "Member 'WBP_Dialog_OK_C_ExecuteUbergraph_WBP_Dialog_OK::CallFunc_PlayUMGAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_OK_C_ExecuteUbergraph_WBP_Dialog_OK, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'WBP_Dialog_OK_C_ExecuteUbergraph_WBP_Dialog_OK::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_Dialog_OK.WBP_Dialog_OK_C.BndEvt__WBP_Dialog_OK_WBP_Button_Generic_OK_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_Dialog_OK_C_BndEvt__WBP_Dialog_OK_WBP_Button_Generic_OK_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Dialog_OK_C_BndEvt__WBP_Dialog_OK_WBP_Button_Generic_OK_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Dialog_OK_C_BndEvt__WBP_Dialog_OK_WBP_Button_Generic_OK_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Dialog_OK_C_BndEvt__WBP_Dialog_OK_WBP_Button_Generic_OK_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_Dialog_OK_C_BndEvt__WBP_Dialog_OK_WBP_Button_Generic_OK_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Dialog_OK_C_BndEvt__WBP_Dialog_OK_WBP_Button_Generic_OK_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_Dialog_OK_C_BndEvt__WBP_Dialog_OK_WBP_Button_Generic_OK_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

}

