#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Map

#include "Basic.hpp"

#include "Zion_structs.hpp"
#include "Zion_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Map.WBP_Map_C
// 0x0120 (0x07F8 - 0x06D8)
class UWBP_Map_C final : public UUserWidgetMap
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hide;                                              // 0x06E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_NextStep;                                     // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               IconDetailHolder;                                  // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MainHolder;                                        // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MapAreaName_C*                     MapAreaName;                                       // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           NoDataHolder;                                      // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             StoryGoal;                                         // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               StoryGoalOverlay;                                  // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Completion_C*                      WBP_Completion_Map;                                // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Footer_C*                          WBP_Footer;                                        // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Map_CustomMarkerCount_C*           WBP_Map_CustomMarkerCount;                         // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MapArea_Center_C*                  WBP_MapArea_Center;                                // 0x0740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MapArea_Summit_C*                  WBP_MapArea_Summit;                                // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x0750(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          CanBeClosed;                                       // 0x0758(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_759[0x7];                                      // 0x0759(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidgetMapIconDetails*              IconDetailWidget;                                  // 0x0760(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class FName RestPointID, const struct FRestPointData& RestPointData)> OnRequestedFastTravel; // 0x0768(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          Ignore_Can_Fast_Travel_Check;                      // 0x0778(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EAptitudeType                                 FastTravelAptitude;                                // 0x0779(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          ShowBlackBackground;                               // 0x077A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_77B[0x1];                                      // 0x077B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MapAreaVisitedCount;                               // 0x077C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UUserWidgetFooter*                      FooterWidgetOverride;                              // 0x0780(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFooterData>                    DefaultFooterEntries;                              // 0x0788(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	TArray<struct FFooterData>                    ToggleRestPointListFooterEntries;                  // 0x0798(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	TArray<struct FFooterData>                    ChangeMapAreaFooterEntries;                        // 0x07A8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	TArray<struct FFooterData>                    CenterToPlayerFooterEntries;                       // 0x07B8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	TArray<struct FFooterData>                    NoDataFooterEntries;                               // 0x07C8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	class UFMODEvent*                             SE_ToggleRestPointList;                            // 0x07D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             SE_RequestFastTravel;                              // 0x07E0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             SE_OpenIconDetails;                                // 0x07E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             SE_NoMarkerAvailable;                              // 0x07F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void Close();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_Map(int32 EntryPoint);
	void GetFooterWidget(class UUserWidgetFooter** FooterWidget);
	void OnCalculateMapCompletionPercentage(int32 Percentage);
	void OnChangeMapAreaUnderCursor(class UUserWidgetMapArea* MapArea);
	void OnConfirmFastTravel();
	void OnFinish_FAE4371A436D6B74EE63518F9AFB0B9E();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnNoCustomMarkerAvailable();
	struct FEventReply OnPressCancel(const struct FKeyEvent& KeyEvent);
	void OnReachedTargetedIcon(class UUserWidgetMapIcon* MapIcon);
	void OnRefreshCustomMarkerAvailableCount();
	void OnRefreshRemoveAllCustomMarkersHoldTime(float CurrentHoldingTime, float HoldingDuration, float Alpha);
	void OnRequestFastTravel(const struct FMapRestPointData& MapRestPointData);
	void OnResetMapAreaUnderCursor(class UUserWidgetMapArea* MapArea);
	void OnResetTargetedIcon(class UUserWidgetMapIcon* MapIcon, bool bInstant);
	void OnRestPointListClosed();
	void OnRestPointListEntryFocused(class UUserWidgetMapIcon_RestPoint* RestPointIcon);
	void OnRestPointListInitialized();
	void OnToggleRestPointList(bool bRestPointListOpened, bool bInstant);
	void RefreshCustomMarkerAvailableCount();
	void SetFooterWidgetOverride(class UUserWidgetFooter* FooterWidget);
	void SetRetainerBoxRetainRender(bool Retain_Render);
	void SetupFooter();
	void SetupStoryGoal();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Map_C">();
	}
	static class UWBP_Map_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Map_C>();
	}
};
static_assert(alignof(UWBP_Map_C) == 0x000008, "Wrong alignment on UWBP_Map_C");
static_assert(sizeof(UWBP_Map_C) == 0x0007F8, "Wrong size on UWBP_Map_C");
static_assert(offsetof(UWBP_Map_C, UberGraphFrame) == 0x0006D8, "Member 'UWBP_Map_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, Hide) == 0x0006E0, "Member 'UWBP_Map_C::Hide' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, BG) == 0x0006E8, "Member 'UWBP_Map_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, Icon_NextStep) == 0x0006F0, "Member 'UWBP_Map_C::Icon_NextStep' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, IconDetailHolder) == 0x0006F8, "Member 'UWBP_Map_C::IconDetailHolder' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, MainHolder) == 0x000700, "Member 'UWBP_Map_C::MainHolder' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, MapAreaName) == 0x000708, "Member 'UWBP_Map_C::MapAreaName' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, NoDataHolder) == 0x000710, "Member 'UWBP_Map_C::NoDataHolder' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, StoryGoal) == 0x000718, "Member 'UWBP_Map_C::StoryGoal' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, StoryGoalOverlay) == 0x000720, "Member 'UWBP_Map_C::StoryGoalOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, WBP_Completion_Map) == 0x000728, "Member 'UWBP_Map_C::WBP_Completion_Map' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, WBP_Footer) == 0x000730, "Member 'UWBP_Map_C::WBP_Footer' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, WBP_Map_CustomMarkerCount) == 0x000738, "Member 'UWBP_Map_C::WBP_Map_CustomMarkerCount' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, WBP_MapArea_Center) == 0x000740, "Member 'UWBP_Map_C::WBP_MapArea_Center' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, WBP_MapArea_Summit) == 0x000748, "Member 'UWBP_Map_C::WBP_MapArea_Summit' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, WidgetSwitcher) == 0x000750, "Member 'UWBP_Map_C::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, CanBeClosed) == 0x000758, "Member 'UWBP_Map_C::CanBeClosed' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, IconDetailWidget) == 0x000760, "Member 'UWBP_Map_C::IconDetailWidget' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, OnRequestedFastTravel) == 0x000768, "Member 'UWBP_Map_C::OnRequestedFastTravel' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, Ignore_Can_Fast_Travel_Check) == 0x000778, "Member 'UWBP_Map_C::Ignore_Can_Fast_Travel_Check' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, FastTravelAptitude) == 0x000779, "Member 'UWBP_Map_C::FastTravelAptitude' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, ShowBlackBackground) == 0x00077A, "Member 'UWBP_Map_C::ShowBlackBackground' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, MapAreaVisitedCount) == 0x00077C, "Member 'UWBP_Map_C::MapAreaVisitedCount' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, FooterWidgetOverride) == 0x000780, "Member 'UWBP_Map_C::FooterWidgetOverride' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, DefaultFooterEntries) == 0x000788, "Member 'UWBP_Map_C::DefaultFooterEntries' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, ToggleRestPointListFooterEntries) == 0x000798, "Member 'UWBP_Map_C::ToggleRestPointListFooterEntries' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, ChangeMapAreaFooterEntries) == 0x0007A8, "Member 'UWBP_Map_C::ChangeMapAreaFooterEntries' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, CenterToPlayerFooterEntries) == 0x0007B8, "Member 'UWBP_Map_C::CenterToPlayerFooterEntries' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, NoDataFooterEntries) == 0x0007C8, "Member 'UWBP_Map_C::NoDataFooterEntries' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, SE_ToggleRestPointList) == 0x0007D8, "Member 'UWBP_Map_C::SE_ToggleRestPointList' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, SE_RequestFastTravel) == 0x0007E0, "Member 'UWBP_Map_C::SE_RequestFastTravel' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, SE_OpenIconDetails) == 0x0007E8, "Member 'UWBP_Map_C::SE_OpenIconDetails' has a wrong offset!");
static_assert(offsetof(UWBP_Map_C, SE_NoMarkerAvailable) == 0x0007F0, "Member 'UWBP_Map_C::SE_NoMarkerAvailable' has a wrong offset!");

}

