#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Extra_CostumeEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Extra_CostumeEntry.WBP_Extra_CostumeEntry_C
// 0x0048 (0x04A8 - 0x0460)
class UWBP_Extra_CostumeEntry_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Focused;                                           // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_Extra_Item_Entry_C*                WBP_Extra_Item_Entry;                              // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    CostumeHandle;                                     // 0x0478(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, ExposeOnSpawn)
	TMulticastInlineDelegate<void(class UWBP_Extra_CostumeEntry_C* CostumeEntry)> OnPressed;         // 0x0488(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UWBP_Extra_CostumeEntry_C* CostumeEntry)> OnFocused;         // 0x0498(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Extra_CostumeEntry(int32 EntryPoint);
	void Initialize();
	void IsCostumeOwned(bool* IsCostumeOwned_0);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnPressConfirm(const struct FKeyEvent& KeyEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void RefreshPrice();
	void SetEquipped(bool bEquipped);
	void SetFocusedState(bool Focus);
	void SetIsBought();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Extra_CostumeEntry_C">();
	}
	static class UWBP_Extra_CostumeEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Extra_CostumeEntry_C>();
	}
};
static_assert(alignof(UWBP_Extra_CostumeEntry_C) == 0x000008, "Wrong alignment on UWBP_Extra_CostumeEntry_C");
static_assert(sizeof(UWBP_Extra_CostumeEntry_C) == 0x0004A8, "Wrong size on UWBP_Extra_CostumeEntry_C");
static_assert(offsetof(UWBP_Extra_CostumeEntry_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Extra_CostumeEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_CostumeEntry_C, Focused) == 0x000468, "Member 'UWBP_Extra_CostumeEntry_C::Focused' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_CostumeEntry_C, WBP_Extra_Item_Entry) == 0x000470, "Member 'UWBP_Extra_CostumeEntry_C::WBP_Extra_Item_Entry' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_CostumeEntry_C, CostumeHandle) == 0x000478, "Member 'UWBP_Extra_CostumeEntry_C::CostumeHandle' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_CostumeEntry_C, OnPressed) == 0x000488, "Member 'UWBP_Extra_CostumeEntry_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_CostumeEntry_C, OnFocused) == 0x000498, "Member 'UWBP_Extra_CostumeEntry_C::OnFocused' has a wrong offset!");

}

