#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Loadout_EntrySlot

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Loadout_EntrySlot.WBP_Loadout_EntrySlot_C.SetSelected
// 0x0010 (0x0010 - 0x0000)
struct WBP_Loadout_EntrySlot_C_SetSelected final
{
public:
	bool                                          bSelected;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Loadout_EntrySlot_C_SetSelected) == 0x000008, "Wrong alignment on WBP_Loadout_EntrySlot_C_SetSelected");
static_assert(sizeof(WBP_Loadout_EntrySlot_C_SetSelected) == 0x000010, "Wrong size on WBP_Loadout_EntrySlot_C_SetSelected");
static_assert(offsetof(WBP_Loadout_EntrySlot_C_SetSelected, bSelected) == 0x000000, "Member 'WBP_Loadout_EntrySlot_C_SetSelected::bSelected' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_EntrySlot_C_SetSelected, Temp_bool_Variable) == 0x000001, "Member 'WBP_Loadout_EntrySlot_C_SetSelected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_EntrySlot_C_SetSelected, K2Node_Select_Default) == 0x000008, "Member 'WBP_Loadout_EntrySlot_C_SetSelected::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Loadout_EntrySlot.WBP_Loadout_EntrySlot_C.ExecuteUbergraph_WBP_Loadout_EntrySlot
// 0x0004 (0x0004 - 0x0000)
struct WBP_Loadout_EntrySlot_C_ExecuteUbergraph_WBP_Loadout_EntrySlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Loadout_EntrySlot_C_ExecuteUbergraph_WBP_Loadout_EntrySlot) == 0x000004, "Wrong alignment on WBP_Loadout_EntrySlot_C_ExecuteUbergraph_WBP_Loadout_EntrySlot");
static_assert(sizeof(WBP_Loadout_EntrySlot_C_ExecuteUbergraph_WBP_Loadout_EntrySlot) == 0x000004, "Wrong size on WBP_Loadout_EntrySlot_C_ExecuteUbergraph_WBP_Loadout_EntrySlot");
static_assert(offsetof(WBP_Loadout_EntrySlot_C_ExecuteUbergraph_WBP_Loadout_EntrySlot, EntryPoint) == 0x000000, "Member 'WBP_Loadout_EntrySlot_C_ExecuteUbergraph_WBP_Loadout_EntrySlot::EntryPoint' has a wrong offset!");

}

