#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Extra_Dialog_SpineViewer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Extra_Dialog_SpineViewer.WBP_Extra_Dialog_SpineViewer_C
// 0x0220 (0x09F8 - 0x07D8)
class UWBP_Extra_Dialog_SpineViewer_C final : public UUserWidgetExtraDialogSpineViewer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowUIAnim;                                        // 0x07E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideUIAnim;                                        // 0x07E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideAnim;                                          // 0x07F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x07F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           AnimationList;                                     // 0x0800(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Grid;                                              // 0x0808(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              Grid_Holder;                                       // 0x0810(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               HideUI_Overlay;                                    // 0x0818(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox;                                          // 0x0820(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SpineFG;                                           // 0x0828(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             SpineWidgetPivot;                                  // 0x0830(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FocusHandler_C*                    UIHiddenFocusHandler;                              // 0x0838(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Debug_Extra_SpineOverlay_C*        WBP_Debug_Extra_SpineOverlay;                      // 0x0840(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Extra_CharacterItem_Description_C* WBP_Extra_CharacterItem_Description;               // 0x0848(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Extra_EntryName_C*                 WBP_Extra_EntryName;                               // 0x0850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Extra_ZoomWidget_C*                WBP_Extra_ZoomWidget;                              // 0x0858(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Footer_C*                          WBP_Footer;                                        // 0x0860(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Scrollbox_C*                       WBP_Scrollbox;                                     // 0x0868(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x0870(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class USpineAtlasAsset>        CachedAtlasAsset;                                  // 0x0878(0x0028)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, AdvancedDisplay, HasGetValueTypeHash)
	TSoftObjectPtr<class USpineSkeletonDataAsset> CachedSkeletonData;                                // 0x08A0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsUIVisible;                                       // 0x08C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_8C9[0x7];                                      // 0x08C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnRequestPreviousCharacter;                        // 0x08D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnRequestNextCharacter;                            // 0x08E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnClosed;                                          // 0x08F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UWBP_Extra_SpineAnimation_Entry_C*> AnimationEntries;                               // 0x0900(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay)
	TMap<EExtraInfoLocomotionMode, class UTexture2D*> LoadedBGs;                                     // 0x0910(0x0050)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, AdvancedDisplay)
	TMap<EExtraInfoLocomotionMode, class UTexture2D*> LoadedFGs;                                     // 0x0960(0x0050)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, AdvancedDisplay)
	TArray<class FString>                         DefaultSkins;                                      // 0x09B0(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, AdvancedDisplay)
	float                                         Resolution4KGridScale;                             // 0x09C0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C4[0x4];                                      // 0x09C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Resolution4KGridTranslation;                       // 0x09C8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                LastSelectedAnimation;                             // 0x09D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             SE_ToggleUIVisibility;                             // 0x09E0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             SE_Close;                                          // 0x09E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             SE_ChangeSpineData;                                // 0x09F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Extra_Dialog_SpineViewer_WBP_Debug_Extra_SpineOverlay_K2Node_ComponentBoundEvent_0_OnSceneOffsetChanged__DelegateSignature(const struct FVector2D& PreviousOffset, const struct FVector2D& NewOffset);
	void ClearSpineWidget();
	void CloseDialog();
	void Construct();
	void ExecuteUbergraph_WBP_Extra_Dialog_SpineViewer(int32 EntryPoint);
	void GetOrLoadSceneTexture(const TMap<EExtraInfoLocomotionMode, class UTexture2D*>& TextureForLocomotionModes, const EExtraInfoLocomotionMode& LocomotionMode, TSoftObjectPtr<class UTexture2D> SoftTexture, class UTexture2D** Value);
	void GetPlayerCostumeSpineData(TSoftObjectPtr<class USpineAtlasAsset>* Atlas_Asset, TSoftObjectPtr<class USpineSkeletonDataAsset>* Skeleton_Data_Asset);
	int32 GetSpineAnimationCount();
	void HandleFocusAfterMouseClick();
	void Initialize();
	void LoadSpineData(TSoftObjectPtr<class USpineAtlasAsset> SoftAtlasAsset, TSoftObjectPtr<class USpineSkeletonDataAsset> SoftSkeletonData);
	struct FEventReply OnAnalogValueChanged(const struct FGeometry& MyGeometry, const struct FAnalogInputEvent& InAnalogInputEvent);
	void OnAnimationEntryFocused(class UWBP_Extra_SpineAnimation_Entry_C* AnimationEntry);
	void OnAnimationEntryPressed(class UWBP_Extra_SpineAnimation_Entry_C* AnimationEntry);
	void OnDebugOffsetChanged(const struct FVector2D& PreviousOffset, const struct FVector2D& NewOffset);
	void OnDebugZoomMaxChanged(double NewZoomMax);
	void OnDebugZoomMinChanged(double NewZoomMin);
	struct FEventReply OnDownNext(const struct FKeyEvent& KeyEvent);
	struct FEventReply OnDownPrevious(const struct FKeyEvent& KeyEvent);
	void OnFinish_72C7DC1544F90D6FD9C218848E18CA24();
	void OnFinish_72C7DC1544F90D6FD9C21884D5278BD9();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnLoaded_0BCF34DE4DF7207B7D71B7A8A444C2C3(class UObject* Loaded);
	void OnLoaded_471A1CA1431310FA1C93FBB2A318B37E(class UObject* Loaded);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseWheel(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnPressCancel(const struct FKeyEvent& KeyEvent);
	struct FEventReply OnPressContext(const struct FKeyEvent& KeyEvent);
	struct FEventReply OnPressNext(const struct FKeyEvent& KeyEvent);
	struct FEventReply OnPressPrevious(const struct FKeyEvent& KeyEvent);
	void OnZoomChanged(double NewZoomValue);
	void PlaySpineAnimationAtIndex(int32 Index_0);
	void RefreshSpineWidget();
	void RequestNextCharacter();
	void RequestPreviousCharacter();
	void SetCharacterItemData(const struct FInventoryItemGenericInfoData& CharacterItemData_0);
	void SetCharacterName(const class FText& Name_0);
	void SetLocationMode(EExtraInfoLocomotionMode LocationMode);
	void SetSceneOffset(const struct FVector2D& Translation);
	void SetSpineWidgetOffset(const struct FVector2D& Offset);
	void Setup_Debug_Spine_Overlay();
	void SetupCanChangeCharacter();
	void SetupGrid();
	void SetupScene();
	void ToggleUIVisibility();
	void WidgetAnimationEvt_HideUIAnim_K2Node_WidgetAnimationEvent_1();
	void WidgetAnimationEvt_ShowUIAnim_K2Node_WidgetAnimationEvent_0();

	bool CanMoveSpineViewer() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Extra_Dialog_SpineViewer_C">();
	}
	static class UWBP_Extra_Dialog_SpineViewer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Extra_Dialog_SpineViewer_C>();
	}
};
static_assert(alignof(UWBP_Extra_Dialog_SpineViewer_C) == 0x000008, "Wrong alignment on UWBP_Extra_Dialog_SpineViewer_C");
static_assert(sizeof(UWBP_Extra_Dialog_SpineViewer_C) == 0x0009F8, "Wrong size on UWBP_Extra_Dialog_SpineViewer_C");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, UberGraphFrame) == 0x0007D8, "Member 'UWBP_Extra_Dialog_SpineViewer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, ShowUIAnim) == 0x0007E0, "Member 'UWBP_Extra_Dialog_SpineViewer_C::ShowUIAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, HideUIAnim) == 0x0007E8, "Member 'UWBP_Extra_Dialog_SpineViewer_C::HideUIAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, HideAnim) == 0x0007F0, "Member 'UWBP_Extra_Dialog_SpineViewer_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, ShowAnim) == 0x0007F8, "Member 'UWBP_Extra_Dialog_SpineViewer_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, AnimationList) == 0x000800, "Member 'UWBP_Extra_Dialog_SpineViewer_C::AnimationList' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, Grid) == 0x000808, "Member 'UWBP_Extra_Dialog_SpineViewer_C::Grid' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, Grid_Holder) == 0x000810, "Member 'UWBP_Extra_Dialog_SpineViewer_C::Grid_Holder' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, HideUI_Overlay) == 0x000818, "Member 'UWBP_Extra_Dialog_SpineViewer_C::HideUI_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, ScaleBox) == 0x000820, "Member 'UWBP_Extra_Dialog_SpineViewer_C::ScaleBox' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, SpineFG) == 0x000828, "Member 'UWBP_Extra_Dialog_SpineViewer_C::SpineFG' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, SpineWidgetPivot) == 0x000830, "Member 'UWBP_Extra_Dialog_SpineViewer_C::SpineWidgetPivot' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, UIHiddenFocusHandler) == 0x000838, "Member 'UWBP_Extra_Dialog_SpineViewer_C::UIHiddenFocusHandler' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, WBP_Debug_Extra_SpineOverlay) == 0x000840, "Member 'UWBP_Extra_Dialog_SpineViewer_C::WBP_Debug_Extra_SpineOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, WBP_Extra_CharacterItem_Description) == 0x000848, "Member 'UWBP_Extra_Dialog_SpineViewer_C::WBP_Extra_CharacterItem_Description' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, WBP_Extra_EntryName) == 0x000850, "Member 'UWBP_Extra_Dialog_SpineViewer_C::WBP_Extra_EntryName' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, WBP_Extra_ZoomWidget) == 0x000858, "Member 'UWBP_Extra_Dialog_SpineViewer_C::WBP_Extra_ZoomWidget' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, WBP_Footer) == 0x000860, "Member 'UWBP_Extra_Dialog_SpineViewer_C::WBP_Footer' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, WBP_Scrollbox) == 0x000868, "Member 'UWBP_Extra_Dialog_SpineViewer_C::WBP_Scrollbox' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, WidgetSwitcher) == 0x000870, "Member 'UWBP_Extra_Dialog_SpineViewer_C::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, CachedAtlasAsset) == 0x000878, "Member 'UWBP_Extra_Dialog_SpineViewer_C::CachedAtlasAsset' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, CachedSkeletonData) == 0x0008A0, "Member 'UWBP_Extra_Dialog_SpineViewer_C::CachedSkeletonData' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, IsUIVisible) == 0x0008C8, "Member 'UWBP_Extra_Dialog_SpineViewer_C::IsUIVisible' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, OnRequestPreviousCharacter) == 0x0008D0, "Member 'UWBP_Extra_Dialog_SpineViewer_C::OnRequestPreviousCharacter' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, OnRequestNextCharacter) == 0x0008E0, "Member 'UWBP_Extra_Dialog_SpineViewer_C::OnRequestNextCharacter' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, OnClosed) == 0x0008F0, "Member 'UWBP_Extra_Dialog_SpineViewer_C::OnClosed' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, AnimationEntries) == 0x000900, "Member 'UWBP_Extra_Dialog_SpineViewer_C::AnimationEntries' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, LoadedBGs) == 0x000910, "Member 'UWBP_Extra_Dialog_SpineViewer_C::LoadedBGs' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, LoadedFGs) == 0x000960, "Member 'UWBP_Extra_Dialog_SpineViewer_C::LoadedFGs' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, DefaultSkins) == 0x0009B0, "Member 'UWBP_Extra_Dialog_SpineViewer_C::DefaultSkins' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, Resolution4KGridScale) == 0x0009C0, "Member 'UWBP_Extra_Dialog_SpineViewer_C::Resolution4KGridScale' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, Resolution4KGridTranslation) == 0x0009C8, "Member 'UWBP_Extra_Dialog_SpineViewer_C::Resolution4KGridTranslation' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, LastSelectedAnimation) == 0x0009D8, "Member 'UWBP_Extra_Dialog_SpineViewer_C::LastSelectedAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, SE_ToggleUIVisibility) == 0x0009E0, "Member 'UWBP_Extra_Dialog_SpineViewer_C::SE_ToggleUIVisibility' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, SE_Close) == 0x0009E8, "Member 'UWBP_Extra_Dialog_SpineViewer_C::SE_Close' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Dialog_SpineViewer_C, SE_ChangeSpineData) == 0x0009F0, "Member 'UWBP_Extra_Dialog_SpineViewer_C::SE_ChangeSpineData' has a wrong offset!");

}

