#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Button_Item

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Button_Item.WBP_Button_Item_C
// 0x0070 (0x04D0 - 0x0460)
class UWBP_Button_Item_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Focused;                                           // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             CountText;                                         // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_CountContainer;                            // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_FocusedContainer;                          // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_NewContainer;                              // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sprite;                                            // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const struct FKeyEvent& KeyEvent, class UWBP_Button_Item_C* Item)> OnPressed; // 0x0498(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UWBP_Button_Item_C* Item)> OnFocused;                        // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FDataTableRowHandle                    ItemHandle;                                        // 0x04B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UInventoryComponent*                    InventoryComponent;                                // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void ExecuteUbergraph_WBP_Button_Item(int32 EntryPoint);
	void Construct();
	struct FEventReply OnPressConfirm(const struct FKeyEvent& KeyEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void RefreshNewVisibility();
	void SetColor(const struct FLinearColor& Color);
	void SetFocusedState(bool Focus);
	void Setup(const struct FDataTableRowHandle& ItemHandle_0, int32 Count, const class FText& FallbackText, bool bNew);
	void TryMarkItemAsChecked();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Button_Item_C">();
	}
	static class UWBP_Button_Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Button_Item_C>();
	}
};
static_assert(alignof(UWBP_Button_Item_C) == 0x000008, "Wrong alignment on UWBP_Button_Item_C");
static_assert(sizeof(UWBP_Button_Item_C) == 0x0004D0, "Wrong size on UWBP_Button_Item_C");
static_assert(offsetof(UWBP_Button_Item_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Button_Item_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Button_Item_C, Focused) == 0x000468, "Member 'UWBP_Button_Item_C::Focused' has a wrong offset!");
static_assert(offsetof(UWBP_Button_Item_C, CountText) == 0x000470, "Member 'UWBP_Button_Item_C::CountText' has a wrong offset!");
static_assert(offsetof(UWBP_Button_Item_C, Overlay_CountContainer) == 0x000478, "Member 'UWBP_Button_Item_C::Overlay_CountContainer' has a wrong offset!");
static_assert(offsetof(UWBP_Button_Item_C, Overlay_FocusedContainer) == 0x000480, "Member 'UWBP_Button_Item_C::Overlay_FocusedContainer' has a wrong offset!");
static_assert(offsetof(UWBP_Button_Item_C, Overlay_NewContainer) == 0x000488, "Member 'UWBP_Button_Item_C::Overlay_NewContainer' has a wrong offset!");
static_assert(offsetof(UWBP_Button_Item_C, Sprite) == 0x000490, "Member 'UWBP_Button_Item_C::Sprite' has a wrong offset!");
static_assert(offsetof(UWBP_Button_Item_C, OnPressed) == 0x000498, "Member 'UWBP_Button_Item_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UWBP_Button_Item_C, OnFocused) == 0x0004A8, "Member 'UWBP_Button_Item_C::OnFocused' has a wrong offset!");
static_assert(offsetof(UWBP_Button_Item_C, ItemHandle) == 0x0004B8, "Member 'UWBP_Button_Item_C::ItemHandle' has a wrong offset!");
static_assert(offsetof(UWBP_Button_Item_C, InventoryComponent) == 0x0004C8, "Member 'UWBP_Button_Item_C::InventoryComponent' has a wrong offset!");

}

