#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InventoryEntry_Text

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_InventoryEntry_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InventoryEntry_Text.WBP_InventoryEntry_Text_C
// 0x0038 (0x04C0 - 0x0488)
class UWBP_InventoryEntry_Text_C final : public UWBP_InventoryEntry_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_InventoryEntry_Text_C;          // 0x0488(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Focused;                                           // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             ItemName;                                          // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_FocusedContainer;                          // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_NewContainer;                              // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sprite;                                            // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInventoryComponent*                    InventoryComponent;                                // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_InventoryEntry_Text(int32 EntryPoint);
	void RefreshNewVisibility();
	void SetFocusedState(bool Focus);
	void Setup(const struct FDataTableRowHandle& ItemHandle_0, int32 Count, const class FText& FallbackText, bool bNew);
	void TryMarkItemAsChecked();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_InventoryEntry_Text_C">();
	}
	static class UWBP_InventoryEntry_Text_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InventoryEntry_Text_C>();
	}
};
static_assert(alignof(UWBP_InventoryEntry_Text_C) == 0x000008, "Wrong alignment on UWBP_InventoryEntry_Text_C");
static_assert(sizeof(UWBP_InventoryEntry_Text_C) == 0x0004C0, "Wrong size on UWBP_InventoryEntry_Text_C");
static_assert(offsetof(UWBP_InventoryEntry_Text_C, UberGraphFrame_WBP_InventoryEntry_Text_C) == 0x000488, "Member 'UWBP_InventoryEntry_Text_C::UberGraphFrame_WBP_InventoryEntry_Text_C' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEntry_Text_C, Focused) == 0x000490, "Member 'UWBP_InventoryEntry_Text_C::Focused' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEntry_Text_C, ItemName) == 0x000498, "Member 'UWBP_InventoryEntry_Text_C::ItemName' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEntry_Text_C, Overlay_FocusedContainer) == 0x0004A0, "Member 'UWBP_InventoryEntry_Text_C::Overlay_FocusedContainer' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEntry_Text_C, Overlay_NewContainer) == 0x0004A8, "Member 'UWBP_InventoryEntry_Text_C::Overlay_NewContainer' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEntry_Text_C, Sprite) == 0x0004B0, "Member 'UWBP_InventoryEntry_Text_C::Sprite' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryEntry_Text_C, InventoryComponent) == 0x0004B8, "Member 'UWBP_InventoryEntry_Text_C::InventoryComponent' has a wrong offset!");

}

