#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Item_UpgradeInfoHolder

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function WBP_Item_UpgradeInfoHolder.WBP_Item_UpgradeInfoHolder_C.Setup
// 0x0078 (0x0078 - 0x0000)
struct WBP_Item_UpgradeInfoHolder_C_Setup final
{
public:
	TArray<struct FInventoryItemUpgradeInfo>      UpgradeInfoList;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInventoryItemUpgradeInfo              CallFunc_Array_Get_Item;                           // 0x0028(0x0030)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Item_UpgradeInfo_C*                CallFunc_Create_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Item_UpgradeInfoHolder_C_Setup) == 0x000008, "Wrong alignment on WBP_Item_UpgradeInfoHolder_C_Setup");
static_assert(sizeof(WBP_Item_UpgradeInfoHolder_C_Setup) == 0x000078, "Wrong size on WBP_Item_UpgradeInfoHolder_C_Setup");
static_assert(offsetof(WBP_Item_UpgradeInfoHolder_C_Setup, UpgradeInfoList) == 0x000000, "Member 'WBP_Item_UpgradeInfoHolder_C_Setup::UpgradeInfoList' has a wrong offset!");
static_assert(offsetof(WBP_Item_UpgradeInfoHolder_C_Setup, Temp_byte_Variable) == 0x000010, "Member 'WBP_Item_UpgradeInfoHolder_C_Setup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Item_UpgradeInfoHolder_C_Setup, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'WBP_Item_UpgradeInfoHolder_C_Setup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_UpgradeInfoHolder_C_Setup, CallFunc_Array_Length_ReturnValue_1) == 0x000018, "Member 'WBP_Item_UpgradeInfoHolder_C_Setup::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Item_UpgradeInfoHolder_C_Setup, Temp_byte_Variable_1) == 0x00001C, "Member 'WBP_Item_UpgradeInfoHolder_C_Setup::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Item_UpgradeInfoHolder_C_Setup, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00001D, "Member 'WBP_Item_UpgradeInfoHolder_C_Setup::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_UpgradeInfoHolder_C_Setup, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WBP_Item_UpgradeInfoHolder_C_Setup::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Item_UpgradeInfoHolder_C_Setup, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WBP_Item_UpgradeInfoHolder_C_Setup::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Item_UpgradeInfoHolder_C_Setup, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_Item_UpgradeInfoHolder_C_Setup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Item_UpgradeInfoHolder_C_Setup, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'WBP_Item_UpgradeInfoHolder_C_Setup::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_UpgradeInfoHolder_C_Setup, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'WBP_Item_UpgradeInfoHolder_C_Setup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_UpgradeInfoHolder_C_Setup, Temp_bool_Variable) == 0x000060, "Member 'WBP_Item_UpgradeInfoHolder_C_Setup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Item_UpgradeInfoHolder_C_Setup, K2Node_Select_Default) == 0x000061, "Member 'WBP_Item_UpgradeInfoHolder_C_Setup::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Item_UpgradeInfoHolder_C_Setup, CallFunc_Create_ReturnValue) == 0x000068, "Member 'WBP_Item_UpgradeInfoHolder_C_Setup::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_UpgradeInfoHolder_C_Setup, CallFunc_AddChild_ReturnValue) == 0x000070, "Member 'WBP_Item_UpgradeInfoHolder_C_Setup::CallFunc_AddChild_ReturnValue' has a wrong offset!");

}

