#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Extra_Price

#include "Basic.hpp"

#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function WBP_Extra_Price.WBP_Extra_Price_C.SetCurrencyValue
// 0x0018 (0x0018 - 0x0000)
struct WBP_Extra_Price_C_SetCurrencyValue final
{
public:
	struct FCurrencyValue                         CurrencyValue;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
};
static_assert(alignof(WBP_Extra_Price_C_SetCurrencyValue) == 0x000008, "Wrong alignment on WBP_Extra_Price_C_SetCurrencyValue");
static_assert(sizeof(WBP_Extra_Price_C_SetCurrencyValue) == 0x000018, "Wrong size on WBP_Extra_Price_C_SetCurrencyValue");
static_assert(offsetof(WBP_Extra_Price_C_SetCurrencyValue, CurrencyValue) == 0x000000, "Member 'WBP_Extra_Price_C_SetCurrencyValue::CurrencyValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Price_C_SetCurrencyValue, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_Extra_Price_C_SetCurrencyValue::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_Extra_Price.WBP_Extra_Price_C.Refresh
// 0x0010 (0x0010 - 0x0000)
struct WBP_Extra_Price_C_Refresh final
{
public:
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanSpendCurrency_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Price_C_Refresh) == 0x000008, "Wrong alignment on WBP_Extra_Price_C_Refresh");
static_assert(sizeof(WBP_Extra_Price_C_Refresh) == 0x000010, "Wrong size on WBP_Extra_Price_C_Refresh");
static_assert(offsetof(WBP_Extra_Price_C_Refresh, CallFunc_Get_ReturnValue) == 0x000000, "Member 'WBP_Extra_Price_C_Refresh::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Price_C_Refresh, CallFunc_CanSpendCurrency_ReturnValue) == 0x000008, "Member 'WBP_Extra_Price_C_Refresh::CallFunc_CanSpendCurrency_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Price_C_Refresh, CallFunc_SelectInt_ReturnValue) == 0x00000C, "Member 'WBP_Extra_Price_C_Refresh::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

}

