#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_DebugMenu.WBP_DebugMenu_C.BndEvt__WBP_DebugMenu_WBP_DebugMenu_Page_Default_K2Node_ComponentBoundEvent_0_OnRequestClose__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_DebugMenu_C_BndEvt__WBP_DebugMenu_WBP_DebugMenu_Page_Default_K2Node_ComponentBoundEvent_0_OnRequestClose__DelegateSignature final
{
public:
	bool                                          bSkipAnimation;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_C_BndEvt__WBP_DebugMenu_WBP_DebugMenu_Page_Default_K2Node_ComponentBoundEvent_0_OnRequestClose__DelegateSignature) == 0x000001, "Wrong alignment on WBP_DebugMenu_C_BndEvt__WBP_DebugMenu_WBP_DebugMenu_Page_Default_K2Node_ComponentBoundEvent_0_OnRequestClose__DelegateSignature");
static_assert(sizeof(WBP_DebugMenu_C_BndEvt__WBP_DebugMenu_WBP_DebugMenu_Page_Default_K2Node_ComponentBoundEvent_0_OnRequestClose__DelegateSignature) == 0x000001, "Wrong size on WBP_DebugMenu_C_BndEvt__WBP_DebugMenu_WBP_DebugMenu_Page_Default_K2Node_ComponentBoundEvent_0_OnRequestClose__DelegateSignature");
static_assert(offsetof(WBP_DebugMenu_C_BndEvt__WBP_DebugMenu_WBP_DebugMenu_Page_Default_K2Node_ComponentBoundEvent_0_OnRequestClose__DelegateSignature, bSkipAnimation) == 0x000000, "Member 'WBP_DebugMenu_C_BndEvt__WBP_DebugMenu_WBP_DebugMenu_Page_Default_K2Node_ComponentBoundEvent_0_OnRequestClose__DelegateSignature::bSkipAnimation' has a wrong offset!");

// Function WBP_DebugMenu.WBP_DebugMenu_C.Close
// 0x0001 (0x0001 - 0x0000)
struct WBP_DebugMenu_C_Close final
{
public:
	bool                                          bSkipAnimation;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_C_Close) == 0x000001, "Wrong alignment on WBP_DebugMenu_C_Close");
static_assert(sizeof(WBP_DebugMenu_C_Close) == 0x000001, "Wrong size on WBP_DebugMenu_C_Close");
static_assert(offsetof(WBP_DebugMenu_C_Close, bSkipAnimation) == 0x000000, "Member 'WBP_DebugMenu_C_Close::bSkipAnimation' has a wrong offset!");

// Function WBP_DebugMenu.WBP_DebugMenu_C.ExecuteUbergraph_WBP_DebugMenu
// 0x0048 (0x0048 - 0x0000)
struct WBP_DebugMenu_C_ExecuteUbergraph_WBP_DebugMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bSkipAnimation;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSkipAnimation;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue_1;              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue_1;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_C_ExecuteUbergraph_WBP_DebugMenu) == 0x000008, "Wrong alignment on WBP_DebugMenu_C_ExecuteUbergraph_WBP_DebugMenu");
static_assert(sizeof(WBP_DebugMenu_C_ExecuteUbergraph_WBP_DebugMenu) == 0x000048, "Wrong size on WBP_DebugMenu_C_ExecuteUbergraph_WBP_DebugMenu");
static_assert(offsetof(WBP_DebugMenu_C_ExecuteUbergraph_WBP_DebugMenu, EntryPoint) == 0x000000, "Member 'WBP_DebugMenu_C_ExecuteUbergraph_WBP_DebugMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_ExecuteUbergraph_WBP_DebugMenu, K2Node_ComponentBoundEvent_bSkipAnimation) == 0x000004, "Member 'WBP_DebugMenu_C_ExecuteUbergraph_WBP_DebugMenu::K2Node_ComponentBoundEvent_bSkipAnimation' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_ExecuteUbergraph_WBP_DebugMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_DebugMenu_C_ExecuteUbergraph_WBP_DebugMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_ExecuteUbergraph_WBP_DebugMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WBP_DebugMenu_C_ExecuteUbergraph_WBP_DebugMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_ExecuteUbergraph_WBP_DebugMenu, CallFunc_SetGamePaused_ReturnValue) == 0x000028, "Member 'WBP_DebugMenu_C_ExecuteUbergraph_WBP_DebugMenu::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_ExecuteUbergraph_WBP_DebugMenu, K2Node_CustomEvent_bSkipAnimation) == 0x000029, "Member 'WBP_DebugMenu_C_ExecuteUbergraph_WBP_DebugMenu::K2Node_CustomEvent_bSkipAnimation' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_ExecuteUbergraph_WBP_DebugMenu, CallFunc_SetGamePaused_ReturnValue_1) == 0x00002A, "Member 'WBP_DebugMenu_C_ExecuteUbergraph_WBP_DebugMenu::CallFunc_SetGamePaused_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_ExecuteUbergraph_WBP_DebugMenu, CallFunc_PlayUMGAnimation_ReturnValue) == 0x000030, "Member 'WBP_DebugMenu_C_ExecuteUbergraph_WBP_DebugMenu::CallFunc_PlayUMGAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_ExecuteUbergraph_WBP_DebugMenu, CallFunc_PlayUMGAnimation_ReturnValue_1) == 0x000038, "Member 'WBP_DebugMenu_C_ExecuteUbergraph_WBP_DebugMenu::CallFunc_PlayUMGAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_ExecuteUbergraph_WBP_DebugMenu, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'WBP_DebugMenu_C_ExecuteUbergraph_WBP_DebugMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_ExecuteUbergraph_WBP_DebugMenu, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'WBP_DebugMenu_C_ExecuteUbergraph_WBP_DebugMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_DebugMenu.WBP_DebugMenu_C.GetNewDebugPageIndex
// 0x001C (0x001C - 0x0000)
struct WBP_DebugMenu_C_GetNewDebugPageIndex final
{
public:
	int32                                         PageOffset;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_LoopAround_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_C_GetNewDebugPageIndex) == 0x000004, "Wrong alignment on WBP_DebugMenu_C_GetNewDebugPageIndex");
static_assert(sizeof(WBP_DebugMenu_C_GetNewDebugPageIndex) == 0x00001C, "Wrong size on WBP_DebugMenu_C_GetNewDebugPageIndex");
static_assert(offsetof(WBP_DebugMenu_C_GetNewDebugPageIndex, PageOffset) == 0x000000, "Member 'WBP_DebugMenu_C_GetNewDebugPageIndex::PageOffset' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_GetNewDebugPageIndex, ReturnValue) == 0x000004, "Member 'WBP_DebugMenu_C_GetNewDebugPageIndex::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_GetNewDebugPageIndex, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000008, "Member 'WBP_DebugMenu_C_GetNewDebugPageIndex::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_GetNewDebugPageIndex, CallFunc_GetChildrenCount_ReturnValue) == 0x00000C, "Member 'WBP_DebugMenu_C_GetNewDebugPageIndex::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_GetNewDebugPageIndex, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_DebugMenu_C_GetNewDebugPageIndex::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_GetNewDebugPageIndex, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'WBP_DebugMenu_C_GetNewDebugPageIndex::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_GetNewDebugPageIndex, CallFunc_LoopAround_ReturnValue) == 0x000018, "Member 'WBP_DebugMenu_C_GetNewDebugPageIndex::CallFunc_LoopAround_ReturnValue' has a wrong offset!");

// Function WBP_DebugMenu.WBP_DebugMenu_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_DebugMenu_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_DebugMenu_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_DebugMenu_C_OnFocusReceived");
static_assert(sizeof(WBP_DebugMenu_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_DebugMenu_C_OnFocusReceived");
static_assert(offsetof(WBP_DebugMenu_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_DebugMenu_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_DebugMenu_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_DebugMenu_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_DebugMenu_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_DebugMenu.WBP_DebugMenu_C.OnPressCancel
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_DebugMenu_C_OnPressCancel final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_DebugMenu_C_OnPressCancel) == 0x000008, "Wrong alignment on WBP_DebugMenu_C_OnPressCancel");
static_assert(sizeof(WBP_DebugMenu_C_OnPressCancel) == 0x0001B0, "Wrong size on WBP_DebugMenu_C_OnPressCancel");
static_assert(offsetof(WBP_DebugMenu_C_OnPressCancel, KeyEvent) == 0x000000, "Member 'WBP_DebugMenu_C_OnPressCancel::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_OnPressCancel, ReturnValue) == 0x000040, "Member 'WBP_DebugMenu_C_OnPressCancel::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_OnPressCancel, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_DebugMenu_C_OnPressCancel::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_DebugMenu.WBP_DebugMenu_C.OnPressNext
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_DebugMenu_C_OnPressNext final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	int32                                         CallFunc_GetNewDebugPageIndex_ReturnValue;         // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0100(0x00B8)()
};
static_assert(alignof(WBP_DebugMenu_C_OnPressNext) == 0x000008, "Wrong alignment on WBP_DebugMenu_C_OnPressNext");
static_assert(sizeof(WBP_DebugMenu_C_OnPressNext) == 0x0001B8, "Wrong size on WBP_DebugMenu_C_OnPressNext");
static_assert(offsetof(WBP_DebugMenu_C_OnPressNext, KeyEvent) == 0x000000, "Member 'WBP_DebugMenu_C_OnPressNext::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_OnPressNext, ReturnValue) == 0x000040, "Member 'WBP_DebugMenu_C_OnPressNext::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_OnPressNext, CallFunc_GetNewDebugPageIndex_ReturnValue) == 0x0000F8, "Member 'WBP_DebugMenu_C_OnPressNext::CallFunc_GetNewDebugPageIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_OnPressNext, CallFunc_Handled_ReturnValue) == 0x000100, "Member 'WBP_DebugMenu_C_OnPressNext::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_DebugMenu.WBP_DebugMenu_C.OnPressPrevious
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_DebugMenu_C_OnPressPrevious final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	int32                                         CallFunc_GetNewDebugPageIndex_ReturnValue;         // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0100(0x00B8)()
};
static_assert(alignof(WBP_DebugMenu_C_OnPressPrevious) == 0x000008, "Wrong alignment on WBP_DebugMenu_C_OnPressPrevious");
static_assert(sizeof(WBP_DebugMenu_C_OnPressPrevious) == 0x0001B8, "Wrong size on WBP_DebugMenu_C_OnPressPrevious");
static_assert(offsetof(WBP_DebugMenu_C_OnPressPrevious, KeyEvent) == 0x000000, "Member 'WBP_DebugMenu_C_OnPressPrevious::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_OnPressPrevious, ReturnValue) == 0x000040, "Member 'WBP_DebugMenu_C_OnPressPrevious::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_OnPressPrevious, CallFunc_GetNewDebugPageIndex_ReturnValue) == 0x0000F8, "Member 'WBP_DebugMenu_C_OnPressPrevious::CallFunc_GetNewDebugPageIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_OnPressPrevious, CallFunc_Handled_ReturnValue) == 0x000100, "Member 'WBP_DebugMenu_C_OnPressPrevious::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_DebugMenu.WBP_DebugMenu_C.SetDebugPage
// 0x0100 (0x0100 - 0x0000)
struct WBP_DebugMenu_C_SetDebugPage final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_DebugMenu_Page_C*                  K2Node_DynamicCast_AsWBP_Debug_Menu_Page;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetPageName_PageName;                     // 0x0020(0x0010)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0098(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F0(0x0010)()
};
static_assert(alignof(WBP_DebugMenu_C_SetDebugPage) == 0x000008, "Wrong alignment on WBP_DebugMenu_C_SetDebugPage");
static_assert(sizeof(WBP_DebugMenu_C_SetDebugPage) == 0x000100, "Wrong size on WBP_DebugMenu_C_SetDebugPage");
static_assert(offsetof(WBP_DebugMenu_C_SetDebugPage, Index_0) == 0x000000, "Member 'WBP_DebugMenu_C_SetDebugPage::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_SetDebugPage, CallFunc_GetActiveWidget_ReturnValue) == 0x000008, "Member 'WBP_DebugMenu_C_SetDebugPage::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_SetDebugPage, K2Node_DynamicCast_AsWBP_Debug_Menu_Page) == 0x000010, "Member 'WBP_DebugMenu_C_SetDebugPage::K2Node_DynamicCast_AsWBP_Debug_Menu_Page' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_SetDebugPage, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_DebugMenu_C_SetDebugPage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_SetDebugPage, CallFunc_GetChildrenCount_ReturnValue) == 0x00001C, "Member 'WBP_DebugMenu_C_SetDebugPage::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_SetDebugPage, CallFunc_GetPageName_PageName) == 0x000020, "Member 'WBP_DebugMenu_C_SetDebugPage::CallFunc_GetPageName_PageName' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_SetDebugPage, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000030, "Member 'WBP_DebugMenu_C_SetDebugPage::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_SetDebugPage, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'WBP_DebugMenu_C_SetDebugPage::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_SetDebugPage, CallFunc_Subtract_IntInt_ReturnValue) == 0x000080, "Member 'WBP_DebugMenu_C_SetDebugPage::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_SetDebugPage, CallFunc_Clamp_ReturnValue) == 0x000084, "Member 'WBP_DebugMenu_C_SetDebugPage::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_SetDebugPage, CallFunc_Add_IntInt_ReturnValue) == 0x000088, "Member 'WBP_DebugMenu_C_SetDebugPage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_SetDebugPage, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000090, "Member 'WBP_DebugMenu_C_SetDebugPage::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_SetDebugPage, K2Node_MakeStruct_FormatArgumentData_1) == 0x000098, "Member 'WBP_DebugMenu_C_SetDebugPage::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_SetDebugPage, K2Node_MakeArray_Array) == 0x0000E0, "Member 'WBP_DebugMenu_C_SetDebugPage::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_SetDebugPage, CallFunc_Format_ReturnValue) == 0x0000F0, "Member 'WBP_DebugMenu_C_SetDebugPage::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_DebugMenu.WBP_DebugMenu_C.SetupTexts
// 0x0270 (0x0270 - 0x0000)
struct WBP_DebugMenu_C_SetupTexts final
{
public:
	class UWorldLoaderSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCurrentGameMapID_ReturnValue;          // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0018(0x0010)()
	class AGameModeZion*                          CallFunc_Get_ReturnValue;                          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNewGamePlusGeneration_ReturnValue;     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlatformUserId                        CallFunc_GetPrimaryPlatformUser_ReturnValue;       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0040(0x0010)()
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue_1;                        // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStoryLevel_ReturnValue;                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEarlyAccessBuild_ReturnValue;           // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0060(0x0010)()
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue_2;                        // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLevel_ReturnValue;                     // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0080(0x0010)()
	class AGameModeZion*                          CallFunc_Get_ReturnValue_3;                        // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UZoneSystemComponent*                   CallFunc_Get_ReturnValue_4;                        // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRawEnvironmentLevel_ReturnValue;       // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetActiveZoneLevelName_ReturnValue;       // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00C0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00D0(0x0048)(HasGetValueTypeHash)
	int32                                         CallFunc_GetEnvironmentLevel_ReturnValue;          // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0128(0x0048)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0178(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0188(0x0010)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UZoneSystemComponent*                   CallFunc_Get_ReturnValue_5;                        // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetActiveZoneName_ReturnValue;            // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x01B8(0x0010)()
	class FString                                 CallFunc_GetGameVersion_ReturnValue;               // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x01D8(0x0010)()
	int32                                         CallFunc_GetGameBuildNumber_ReturnValue;           // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetRHIName_ReturnValue;                   // 0x01F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x0200(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0210(0x0010)()
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UInputDeviceSubsystem*                  CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x0238(0x0010)()
	struct FHardwareDeviceIdentifier              CallFunc_GetMostRecentlyUsedHardwareDevice_ReturnValue; // 0x0248(0x0018)(NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x0260(0x0010)()
};
static_assert(alignof(WBP_DebugMenu_C_SetupTexts) == 0x000008, "Wrong alignment on WBP_DebugMenu_C_SetupTexts");
static_assert(sizeof(WBP_DebugMenu_C_SetupTexts) == 0x000270, "Wrong size on WBP_DebugMenu_C_SetupTexts");
static_assert(offsetof(WBP_DebugMenu_C_SetupTexts, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'WBP_DebugMenu_C_SetupTexts::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_SetupTexts, Temp_byte_Variable) == 0x000008, "Member 'WBP_DebugMenu_C_SetupTexts::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_C_SetupTexts, CallFunc_GetCurrentGameMapID_ReturnValue) == 0x00000C, "Member 'WBP_DebugMenu_C_SetupTexts::CallFunc_GetCurrentGameMapID_ReturnValue' has a wrong offset!");
