#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MoviePlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MoviePlayer.WBP_MoviePlayer_C
// 0x00B8 (0x0518 - 0x0460)
class UWBP_MoviePlayer_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowHelp;                                          // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hide;                                              // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Show;                                              // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URefreshableRichTextBlock*              HelpTextLabel;                                     // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_0;                                            // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Subtitle;                                          // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_0;                                     // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Separator;                             // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VideoBuffer;                                       // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBinkMediaPlayer*                       MediaPlayer;                                       // 0x04B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnClosed;                                          // 0x04C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UPlatformMediaSource*                   MediaSource;                                       // 0x04D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UBinkMediaPlayer*                       NewVar;                                            // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EActionInputType                              Action_Input_Type;                                 // 0x04E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_4E1[0x3];                                      // 0x04E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SoundSnapshotTag;                                  // 0x04E4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EC[0x4];                                      // 0x04EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   LastText;                                          // 0x04F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	ESoundFamily                                  VolumeSound_Family;                                // 0x0500(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        VolumeMultiplier;                                  // 0x0508(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRHIDisabled;                                      // 0x0510(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void BindApplicationEvents();
	void Close();
	double ComputeSoundVolume();
	void ConditionalRHIDisable();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_MoviePlayer(int32 EntryPoint);
	void OnApplicationSuspend();
	void OnFinish_556FD2CD48FCB61E357CDEA0B1518839();
	void OnFinish_D6612E224FA8955C70C4388CAC8E0A07();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnPressCancel(const struct FKeyEvent& KeyEvent);
	void OnSetSubtitle_Event(const class FText& Subtitle_0);
	void Pause();
	void Resume();
	void RHIRevert();
	void SetupSubtitle(const class FText& Text, bool bForce);
	void SetWorldRenderingEnable(bool bEnable);
	void StopAndCloseMoviePlayer();
	void UnbindApplicationEvents();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MoviePlayer_C">();
	}
	static class UWBP_MoviePlayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MoviePlayer_C>();
	}
};
static_assert(alignof(UWBP_MoviePlayer_C) == 0x000008, "Wrong alignment on UWBP_MoviePlayer_C");
static_assert(sizeof(UWBP_MoviePlayer_C) == 0x000518, "Wrong size on UWBP_MoviePlayer_C");
static_assert(offsetof(UWBP_MoviePlayer_C, UberGraphFrame) == 0x000460, "Member 'UWBP_MoviePlayer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MoviePlayer_C, ShowHelp) == 0x000468, "Member 'UWBP_MoviePlayer_C::ShowHelp' has a wrong offset!");
static_assert(offsetof(UWBP_MoviePlayer_C, Hide) == 0x000470, "Member 'UWBP_MoviePlayer_C::Hide' has a wrong offset!");
static_assert(offsetof(UWBP_MoviePlayer_C, Show) == 0x000478, "Member 'UWBP_MoviePlayer_C::Show' has a wrong offset!");
static_assert(offsetof(UWBP_MoviePlayer_C, BG) == 0x000480, "Member 'UWBP_MoviePlayer_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_MoviePlayer_C, HelpTextLabel) == 0x000488, "Member 'UWBP_MoviePlayer_C::HelpTextLabel' has a wrong offset!");
static_assert(offsetof(UWBP_MoviePlayer_C, Name_0) == 0x000490, "Member 'UWBP_MoviePlayer_C::Name_0' has a wrong offset!");
static_assert(offsetof(UWBP_MoviePlayer_C, Subtitle) == 0x000498, "Member 'UWBP_MoviePlayer_C::Subtitle' has a wrong offset!");
static_assert(offsetof(UWBP_MoviePlayer_C, VerticalBox_0) == 0x0004A0, "Member 'UWBP_MoviePlayer_C::VerticalBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_MoviePlayer_C, VerticalBox_Separator) == 0x0004A8, "Member 'UWBP_MoviePlayer_C::VerticalBox_Separator' has a wrong offset!");
static_assert(offsetof(UWBP_MoviePlayer_C, VideoBuffer) == 0x0004B0, "Member 'UWBP_MoviePlayer_C::VideoBuffer' has a wrong offset!");
static_assert(offsetof(UWBP_MoviePlayer_C, MediaPlayer) == 0x0004B8, "Member 'UWBP_MoviePlayer_C::MediaPlayer' has a wrong offset!");
static_assert(offsetof(UWBP_MoviePlayer_C, OnClosed) == 0x0004C0, "Member 'UWBP_MoviePlayer_C::OnClosed' has a wrong offset!");
static_assert(offsetof(UWBP_MoviePlayer_C, MediaSource) == 0x0004D0, "Member 'UWBP_MoviePlayer_C::MediaSource' has a wrong offset!");
static_assert(offsetof(UWBP_MoviePlayer_C, NewVar) == 0x0004D8, "Member 'UWBP_MoviePlayer_C::NewVar' has a wrong offset!");
static_assert(offsetof(UWBP_MoviePlayer_C, Action_Input_Type) == 0x0004E0, "Member 'UWBP_MoviePlayer_C::Action_Input_Type' has a wrong offset!");
static_assert(offsetof(UWBP_MoviePlayer_C, SoundSnapshotTag) == 0x0004E4, "Member 'UWBP_MoviePlayer_C::SoundSnapshotTag' has a wrong offset!");
static_assert(offsetof(UWBP_MoviePlayer_C, LastText) == 0x0004F0, "Member 'UWBP_MoviePlayer_C::LastText' has a wrong offset!");
static_assert(offsetof(UWBP_MoviePlayer_C, VolumeSound_Family) == 0x000500, "Member 'UWBP_MoviePlayer_C::VolumeSound_Family' has a wrong offset!");
static_assert(offsetof(UWBP_MoviePlayer_C, VolumeMultiplier) == 0x000508, "Member 'UWBP_MoviePlayer_C::VolumeMultiplier' has a wrong offset!");
static_assert(offsetof(UWBP_MoviePlayer_C, bRHIDisabled) == 0x000510, "Member 'UWBP_MoviePlayer_C::bRHIDisabled' has a wrong offset!");

}

