#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Extra_CostumeEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function WBP_Extra_CostumeEntry.WBP_Extra_CostumeEntry_C.ExecuteUbergraph_WBP_Extra_CostumeEntry
// 0x0014 (0x0014 - 0x0000)
struct WBP_Extra_CostumeEntry_C_ExecuteUbergraph_WBP_Extra_CostumeEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0004(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x000C(0x0008)(NoDestructor)
};
static_assert(alignof(WBP_Extra_CostumeEntry_C_ExecuteUbergraph_WBP_Extra_CostumeEntry) == 0x000004, "Wrong alignment on WBP_Extra_CostumeEntry_C_ExecuteUbergraph_WBP_Extra_CostumeEntry");
static_assert(sizeof(WBP_Extra_CostumeEntry_C_ExecuteUbergraph_WBP_Extra_CostumeEntry) == 0x000014, "Wrong size on WBP_Extra_CostumeEntry_C_ExecuteUbergraph_WBP_Extra_CostumeEntry");
static_assert(offsetof(WBP_Extra_CostumeEntry_C_ExecuteUbergraph_WBP_Extra_CostumeEntry, EntryPoint) == 0x000000, "Member 'WBP_Extra_CostumeEntry_C_ExecuteUbergraph_WBP_Extra_CostumeEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Extra_CostumeEntry_C_ExecuteUbergraph_WBP_Extra_CostumeEntry, K2Node_Event_InFocusEvent_1) == 0x000004, "Member 'WBP_Extra_CostumeEntry_C_ExecuteUbergraph_WBP_Extra_CostumeEntry::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_CostumeEntry_C_ExecuteUbergraph_WBP_Extra_CostumeEntry, K2Node_Event_InFocusEvent) == 0x00000C, "Member 'WBP_Extra_CostumeEntry_C_ExecuteUbergraph_WBP_Extra_CostumeEntry::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function WBP_Extra_CostumeEntry.WBP_Extra_CostumeEntry_C.Initialize
// 0x0288 (0x0288 - 0x0000)
struct WBP_Extra_CostumeEntry_C_Initialize final
{
public:
	struct FInventoryItemCostumeData              CallFunc_GetItemCostumeData_out_ItemData;          // 0x0000(0x0278)()
	bool                                          CallFunc_GetItemCostumeData_ReturnValue;           // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCurrencyValue                         CallFunc_ToCurrencyValue_ReturnValue;              // 0x027C(0x0008)(NoDestructor)
};
static_assert(alignof(WBP_Extra_CostumeEntry_C_Initialize) == 0x000008, "Wrong alignment on WBP_Extra_CostumeEntry_C_Initialize");
static_assert(sizeof(WBP_Extra_CostumeEntry_C_Initialize) == 0x000288, "Wrong size on WBP_Extra_CostumeEntry_C_Initialize");
static_assert(offsetof(WBP_Extra_CostumeEntry_C_Initialize, CallFunc_GetItemCostumeData_out_ItemData) == 0x000000, "Member 'WBP_Extra_CostumeEntry_C_Initialize::CallFunc_GetItemCostumeData_out_ItemData' has a wrong offset!");
static_assert(offsetof(WBP_Extra_CostumeEntry_C_Initialize, CallFunc_GetItemCostumeData_ReturnValue) == 0x000278, "Member 'WBP_Extra_CostumeEntry_C_Initialize::CallFunc_GetItemCostumeData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_CostumeEntry_C_Initialize, CallFunc_ToCurrencyValue_ReturnValue) == 0x00027C, "Member 'WBP_Extra_CostumeEntry_C_Initialize::CallFunc_ToCurrencyValue_ReturnValue' has a wrong offset!");

// Function WBP_Extra_CostumeEntry.WBP_Extra_CostumeEntry_C.IsCostumeOwned
// 0x0018 (0x0018 - 0x0000)
struct WBP_Extra_CostumeEntry_C_IsCostumeOwned final
{
public:
	bool                                          IsCostumeOwned_0;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasItem_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_CostumeEntry_C_IsCostumeOwned) == 0x000008, "Wrong alignment on WBP_Extra_CostumeEntry_C_IsCostumeOwned");
static_assert(sizeof(WBP_Extra_CostumeEntry_C_IsCostumeOwned) == 0x000018, "Wrong size on WBP_Extra_CostumeEntry_C_IsCostumeOwned");
static_assert(offsetof(WBP_Extra_CostumeEntry_C_IsCostumeOwned, IsCostumeOwned_0) == 0x000000, "Member 'WBP_Extra_CostumeEntry_C_IsCostumeOwned::IsCostumeOwned_0' has a wrong offset!");
static_assert(offsetof(WBP_Extra_CostumeEntry_C_IsCostumeOwned, CallFunc_Get_ReturnValue) == 0x000008, "Member 'WBP_Extra_CostumeEntry_C_IsCostumeOwned::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_CostumeEntry_C_IsCostumeOwned, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_Extra_CostumeEntry_C_IsCostumeOwned::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_CostumeEntry_C_IsCostumeOwned, CallFunc_HasItem_ReturnValue) == 0x000011, "Member 'WBP_Extra_CostumeEntry_C_IsCostumeOwned::CallFunc_HasItem_ReturnValue' has a wrong offset!");

// Function WBP_Extra_CostumeEntry.WBP_Extra_CostumeEntry_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_Extra_CostumeEntry_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Extra_CostumeEntry_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on WBP_Extra_CostumeEntry_C_OnAddedToFocusPath");
static_assert(sizeof(WBP_Extra_CostumeEntry_C_OnAddedToFocusPath) == 0x000008, "Wrong size on WBP_Extra_CostumeEntry_C_OnAddedToFocusPath");
static_assert(offsetof(WBP_Extra_CostumeEntry_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_Extra_CostumeEntry_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_Extra_CostumeEntry.WBP_Extra_CostumeEntry_C.OnPressConfirm
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Extra_CostumeEntry_C_OnPressConfirm final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Extra_CostumeEntry_C_OnPressConfirm) == 0x000008, "Wrong alignment on WBP_Extra_CostumeEntry_C_OnPressConfirm");
static_assert(sizeof(WBP_Extra_CostumeEntry_C_OnPressConfirm) == 0x0001B0, "Wrong size on WBP_Extra_CostumeEntry_C_OnPressConfirm");
static_assert(offsetof(WBP_Extra_CostumeEntry_C_OnPressConfirm, KeyEvent) == 0x000000, "Member 'WBP_Extra_CostumeEntry_C_OnPressConfirm::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Extra_CostumeEntry_C_OnPressConfirm, ReturnValue) == 0x000040, "Member 'WBP_Extra_CostumeEntry_C_OnPressConfirm::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_CostumeEntry_C_OnPressConfirm, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Extra_CostumeEntry_C_OnPressConfirm::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Extra_CostumeEntry.WBP_Extra_CostumeEntry_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_Extra_CostumeEntry_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Extra_CostumeEntry_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on WBP_Extra_CostumeEntry_C_OnRemovedFromFocusPath");
static_assert(sizeof(WBP_Extra_CostumeEntry_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on WBP_Extra_CostumeEntry_C_OnRemovedFromFocusPath");
static_assert(offsetof(WBP_Extra_CostumeEntry_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_Extra_CostumeEntry_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_Extra_CostumeEntry.WBP_Extra_CostumeEntry_C.SetEquipped
// 0x0001 (0x0001 - 0x0000)
struct WBP_Extra_CostumeEntry_C_SetEquipped final
{
public:
	bool                                          bEquipped;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_CostumeEntry_C_SetEquipped) == 0x000001, "Wrong alignment on WBP_Extra_CostumeEntry_C_SetEquipped");
static_assert(sizeof(WBP_Extra_CostumeEntry_C_SetEquipped) == 0x000001, "Wrong size on WBP_Extra_CostumeEntry_C_SetEquipped");
static_assert(offsetof(WBP_Extra_CostumeEntry_C_SetEquipped, bEquipped) == 0x000000, "Member 'WBP_Extra_CostumeEntry_C_SetEquipped::bEquipped' has a wrong offset!");

// Function WBP_Extra_CostumeEntry.WBP_Extra_CostumeEntry_C.SetFocusedState
// 0x0001 (0x0001 - 0x0000)
struct WBP_Extra_CostumeEntry_C_SetFocusedState final
{
public:
	bool                                          Focus;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_CostumeEntry_C_SetFocusedState) == 0x000001, "Wrong alignment on WBP_Extra_CostumeEntry_C_SetFocusedState");
static_assert(sizeof(WBP_Extra_CostumeEntry_C_SetFocusedState) == 0x000001, "Wrong size on WBP_Extra_CostumeEntry_C_SetFocusedState");
static_assert(offsetof(WBP_Extra_CostumeEntry_C_SetFocusedState, Focus) == 0x000000, "Member 'WBP_Extra_CostumeEntry_C_SetFocusedState::Focus' has a wrong offset!");

// Function WBP_Extra_CostumeEntry.WBP_Extra_CostumeEntry_C.SetIsBought
// 0x0001 (0x0001 - 0x0000)
struct WBP_Extra_CostumeEntry_C_SetIsBought final
{
public:
	bool                                          CallFunc_IsCostumeOwned_IsCostumeOwned;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_CostumeEntry_C_SetIsBought) == 0x000001, "Wrong alignment on WBP_Extra_CostumeEntry_C_SetIsBought");
static_assert(sizeof(WBP_Extra_CostumeEntry_C_SetIsBought) == 0x000001, "Wrong size on WBP_Extra_CostumeEntry_C_SetIsBought");
static_assert(offsetof(WBP_Extra_CostumeEntry_C_SetIsBought, CallFunc_IsCostumeOwned_IsCostumeOwned) == 0x000000, "Member 'WBP_Extra_CostumeEntry_C_SetIsBought::CallFunc_IsCostumeOwned_IsCostumeOwned' has a wrong offset!");

}

