#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Item_EquipmentData

#include "Basic.hpp"

#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function WBP_Item_EquipmentData.WBP_Item_EquipmentData_C.Setup
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_Item_EquipmentData_C_Setup final
{
public:
	struct FExtendedStatsData                     ExtendedStatsData;                                 // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FExtendedStatsData                     CallFunc_GetPlayerMaxPossibleStats_ReturnValue;    // 0x0058(0x0050)(ConstParm)
	int32                                         CallFunc_GetSPGaugeValue_ReturnValue;              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_1;              // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Item_EquipmentData_C_Setup) == 0x000008, "Wrong alignment on WBP_Item_EquipmentData_C_Setup");
static_assert(sizeof(WBP_Item_EquipmentData_C_Setup) == 0x0000B8, "Wrong size on WBP_Item_EquipmentData_C_Setup");
static_assert(offsetof(WBP_Item_EquipmentData_C_Setup, ExtendedStatsData) == 0x000000, "Member 'WBP_Item_EquipmentData_C_Setup::ExtendedStatsData' has a wrong offset!");
static_assert(offsetof(WBP_Item_EquipmentData_C_Setup, CallFunc_Get_ReturnValue) == 0x000050, "Member 'WBP_Item_EquipmentData_C_Setup::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_EquipmentData_C_Setup, CallFunc_GetPlayerMaxPossibleStats_ReturnValue) == 0x000058, "Member 'WBP_Item_EquipmentData_C_Setup::CallFunc_GetPlayerMaxPossibleStats_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_EquipmentData_C_Setup, CallFunc_GetSPGaugeValue_ReturnValue) == 0x0000A8, "Member 'WBP_Item_EquipmentData_C_Setup::CallFunc_GetSPGaugeValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_EquipmentData_C_Setup, CallFunc_Divide_IntInt_ReturnValue) == 0x0000AC, "Member 'WBP_Item_EquipmentData_C_Setup::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Item_EquipmentData_C_Setup, CallFunc_Divide_IntInt_ReturnValue_1) == 0x0000B0, "Member 'WBP_Item_EquipmentData_C_Setup::CallFunc_Divide_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_Item_EquipmentData.WBP_Item_EquipmentData_C.SetupStat
// 0x0010 (0x0010 - 0x0000)
struct WBP_Item_EquipmentData_C_SetupStat final
{
public:
	class UWBP_Item_EquipmentData_Stat_C*         Stat;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxValue;                                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Item_EquipmentData_C_SetupStat) == 0x000008, "Wrong alignment on WBP_Item_EquipmentData_C_SetupStat");
static_assert(sizeof(WBP_Item_EquipmentData_C_SetupStat) == 0x000010, "Wrong size on WBP_Item_EquipmentData_C_SetupStat");
static_assert(offsetof(WBP_Item_EquipmentData_C_SetupStat, Stat) == 0x000000, "Member 'WBP_Item_EquipmentData_C_SetupStat::Stat' has a wrong offset!");
static_assert(offsetof(WBP_Item_EquipmentData_C_SetupStat, Value) == 0x000008, "Member 'WBP_Item_EquipmentData_C_SetupStat::Value' has a wrong offset!");
static_assert(offsetof(WBP_Item_EquipmentData_C_SetupStat, MaxValue) == 0x00000C, "Member 'WBP_Item_EquipmentData_C_SetupStat::MaxValue' has a wrong offset!");

}

