#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Dialog_YesNo_SaveSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Dialog_YesNo_SaveSlot.WBP_Dialog_YesNo_SaveSlot_C
// 0x0090 (0x04F0 - 0x0460)
class UWBP_Dialog_YesNo_SaveSlot_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideAnim;                                          // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_Button_Generic_C*                  WBP_Button_Generic_NO;                             // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Generic_C*                  WBP_Button_Generic_YES;                            // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Dialog_C*                          WBP_Dialog;                                        // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SlotSelection_Entry_C*             WBP_SlotSelection_Entry;                           // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Message;                                           // 0x0498(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)
	class FText                                   ButtonYES;                                         // 0x04A8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)
	class FText                                   ButtonNO;                                          // 0x04B8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)
	TMulticastInlineDelegate<void()>              OnYES;                                             // 0x04C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnNO;                                              // 0x04D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWBP_SlotSelection_Entry_C*             SaveSlotEntry;                                     // 0x04E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void AddTopContent(class UWidget* Content, class UCanvasPanelSlot** Slot_0);
	void BndEvt__WBP_Dialog_YesNo_WBP_Button_Generic_NO_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void BndEvt__WBP_Dialog_YesNo_WBP_Button_Generic_YES_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void Construct();
	void ExecuteUbergraph_WBP_Dialog_YesNo_SaveSlot(int32 EntryPoint);
	void OnFinish_72C7DC1544F90D6FD9C218841A2348B6();
	void OnFinish_72C7DC1544F90D6FD9C218846C42C3FF();
	void OnFinish_72C7DC1544F90D6FD9C21884B2232695();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Dialog_YesNo_SaveSlot_C">();
	}
	static class UWBP_Dialog_YesNo_SaveSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Dialog_YesNo_SaveSlot_C>();
	}
};
static_assert(alignof(UWBP_Dialog_YesNo_SaveSlot_C) == 0x000008, "Wrong alignment on UWBP_Dialog_YesNo_SaveSlot_C");
static_assert(sizeof(UWBP_Dialog_YesNo_SaveSlot_C) == 0x0004F0, "Wrong size on UWBP_Dialog_YesNo_SaveSlot_C");
static_assert(offsetof(UWBP_Dialog_YesNo_SaveSlot_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Dialog_YesNo_SaveSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_YesNo_SaveSlot_C, HideAnim) == 0x000468, "Member 'UWBP_Dialog_YesNo_SaveSlot_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_YesNo_SaveSlot_C, ShowAnim) == 0x000470, "Member 'UWBP_Dialog_YesNo_SaveSlot_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_YesNo_SaveSlot_C, WBP_Button_Generic_NO) == 0x000478, "Member 'UWBP_Dialog_YesNo_SaveSlot_C::WBP_Button_Generic_NO' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_YesNo_SaveSlot_C, WBP_Button_Generic_YES) == 0x000480, "Member 'UWBP_Dialog_YesNo_SaveSlot_C::WBP_Button_Generic_YES' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_YesNo_SaveSlot_C, WBP_Dialog) == 0x000488, "Member 'UWBP_Dialog_YesNo_SaveSlot_C::WBP_Dialog' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_YesNo_SaveSlot_C, WBP_SlotSelection_Entry) == 0x000490, "Member 'UWBP_Dialog_YesNo_SaveSlot_C::WBP_SlotSelection_Entry' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_YesNo_SaveSlot_C, Message) == 0x000498, "Member 'UWBP_Dialog_YesNo_SaveSlot_C::Message' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_YesNo_SaveSlot_C, ButtonYES) == 0x0004A8, "Member 'UWBP_Dialog_YesNo_SaveSlot_C::ButtonYES' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_YesNo_SaveSlot_C, ButtonNO) == 0x0004B8, "Member 'UWBP_Dialog_YesNo_SaveSlot_C::ButtonNO' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_YesNo_SaveSlot_C, OnYES) == 0x0004C8, "Member 'UWBP_Dialog_YesNo_SaveSlot_C::OnYES' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_YesNo_SaveSlot_C, OnNO) == 0x0004D8, "Member 'UWBP_Dialog_YesNo_SaveSlot_C::OnNO' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_YesNo_SaveSlot_C, SaveSlotEntry) == 0x0004E8, "Member 'UWBP_Dialog_YesNo_SaveSlot_C::SaveSlotEntry' has a wrong offset!");

}

