#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PassiveUnlock_Anim_Upgrade

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PassiveUnlock_Anim_Upgrade.WBP_PassiveUnlock_Anim_Upgrade_C
// 0x00B0 (0x0510 - 0x0460)
class UWBP_PassiveUnlock_Anim_Upgrade_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Animation;                                         // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG_Light;                                          // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bottom_Square;                                     // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Center_Block;                                      // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Center_Square;                                     // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Effect;                                            // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Left_Block;                                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Left_Square;                                       // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NiagaraSystemWidget_153;                           // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PassiveIcon;                                       // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PassiveIcon_1;                                     // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PassiveName;                                       // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Right_Block;                                       // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Right_Square;                                      // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Top_Square;                                        // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    CurrentPassiveHandle;                              // 0x04E0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, ExposeOnSpawn)
	struct FDataTableRowHandle                    UpgradePassiveHandle;                              // 0x04F0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, ExposeOnSpawn)
	TMulticastInlineDelegate<void()>              OnFinished;                                        // 0x0500(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Construct();
	void ExecuteUbergraph_WBP_PassiveUnlock_Anim_Upgrade(int32 EntryPoint);
	void OnAnimationFinished(const class UWidgetAnimation* Animation_0);
	void OnFinish_B227C5E34D61107E5ECAAD96D08EF2D9();
	void SequenceEvent_0();
	void SequenceEvent__ENTRYPOINTWBP_PassiveUnlock_Anim_Upgrade();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PassiveUnlock_Anim_Upgrade_C">();
	}
	static class UWBP_PassiveUnlock_Anim_Upgrade_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PassiveUnlock_Anim_Upgrade_C>();
	}
};
static_assert(alignof(UWBP_PassiveUnlock_Anim_Upgrade_C) == 0x000008, "Wrong alignment on UWBP_PassiveUnlock_Anim_Upgrade_C");
static_assert(sizeof(UWBP_PassiveUnlock_Anim_Upgrade_C) == 0x000510, "Wrong size on UWBP_PassiveUnlock_Anim_Upgrade_C");
static_assert(offsetof(UWBP_PassiveUnlock_Anim_Upgrade_C, UberGraphFrame) == 0x000460, "Member 'UWBP_PassiveUnlock_Anim_Upgrade_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PassiveUnlock_Anim_Upgrade_C, Animation) == 0x000468, "Member 'UWBP_PassiveUnlock_Anim_Upgrade_C::Animation' has a wrong offset!");
static_assert(offsetof(UWBP_PassiveUnlock_Anim_Upgrade_C, BG_Light) == 0x000470, "Member 'UWBP_PassiveUnlock_Anim_Upgrade_C::BG_Light' has a wrong offset!");
static_assert(offsetof(UWBP_PassiveUnlock_Anim_Upgrade_C, Bottom_Square) == 0x000478, "Member 'UWBP_PassiveUnlock_Anim_Upgrade_C::Bottom_Square' has a wrong offset!");
static_assert(offsetof(UWBP_PassiveUnlock_Anim_Upgrade_C, Center_Block) == 0x000480, "Member 'UWBP_PassiveUnlock_Anim_Upgrade_C::Center_Block' has a wrong offset!");
static_assert(offsetof(UWBP_PassiveUnlock_Anim_Upgrade_C, Center_Square) == 0x000488, "Member 'UWBP_PassiveUnlock_Anim_Upgrade_C::Center_Square' has a wrong offset!");
static_assert(offsetof(UWBP_PassiveUnlock_Anim_Upgrade_C, Effect) == 0x000490, "Member 'UWBP_PassiveUnlock_Anim_Upgrade_C::Effect' has a wrong offset!");
static_assert(offsetof(UWBP_PassiveUnlock_Anim_Upgrade_C, Left_Block) == 0x000498, "Member 'UWBP_PassiveUnlock_Anim_Upgrade_C::Left_Block' has a wrong offset!");
static_assert(offsetof(UWBP_PassiveUnlock_Anim_Upgrade_C, Left_Square) == 0x0004A0, "Member 'UWBP_PassiveUnlock_Anim_Upgrade_C::Left_Square' has a wrong offset!");
static_assert(offsetof(UWBP_PassiveUnlock_Anim_Upgrade_C, NiagaraSystemWidget_153) == 0x0004A8, "Member 'UWBP_PassiveUnlock_Anim_Upgrade_C::NiagaraSystemWidget_153' has a wrong offset!");
static_assert(offsetof(UWBP_PassiveUnlock_Anim_Upgrade_C, PassiveIcon) == 0x0004B0, "Member 'UWBP_PassiveUnlock_Anim_Upgrade_C::PassiveIcon' has a wrong offset!");
static_assert(offsetof(UWBP_PassiveUnlock_Anim_Upgrade_C, PassiveIcon_1) == 0x0004B8, "Member 'UWBP_PassiveUnlock_Anim_Upgrade_C::PassiveIcon_1' has a wrong offset!");
static_assert(offsetof(UWBP_PassiveUnlock_Anim_Upgrade_C, PassiveName) == 0x0004C0, "Member 'UWBP_PassiveUnlock_Anim_Upgrade_C::PassiveName' has a wrong offset!");
static_assert(offsetof(UWBP_PassiveUnlock_Anim_Upgrade_C, Right_Block) == 0x0004C8, "Member 'UWBP_PassiveUnlock_Anim_Upgrade_C::Right_Block' has a wrong offset!");
static_assert(offsetof(UWBP_PassiveUnlock_Anim_Upgrade_C, Right_Square) == 0x0004D0, "Member 'UWBP_PassiveUnlock_Anim_Upgrade_C::Right_Square' has a wrong offset!");
static_assert(offsetof(UWBP_PassiveUnlock_Anim_Upgrade_C, Top_Square) == 0x0004D8, "Member 'UWBP_PassiveUnlock_Anim_Upgrade_C::Top_Square' has a wrong offset!");
static_assert(offsetof(UWBP_PassiveUnlock_Anim_Upgrade_C, CurrentPassiveHandle) == 0x0004E0, "Member 'UWBP_PassiveUnlock_Anim_Upgrade_C::CurrentPassiveHandle' has a wrong offset!");
static_assert(offsetof(UWBP_PassiveUnlock_Anim_Upgrade_C, UpgradePassiveHandle) == 0x0004F0, "Member 'UWBP_PassiveUnlock_Anim_Upgrade_C::UpgradePassiveHandle' has a wrong offset!");
static_assert(offsetof(UWBP_PassiveUnlock_Anim_Upgrade_C, OnFinished) == 0x000500, "Member 'UWBP_PassiveUnlock_Anim_Upgrade_C::OnFinished' has a wrong offset!");

}

