#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Completion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Completion.WBP_Completion_C
// 0x0018 (0x0478 - 0x0460)
class UWBP_Completion_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             CompletionPercentage;                              // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EInventoryItemType                            ItemType;                                          // 0x0470(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Completion(int32 EntryPoint);
	void SetCompletionPercentage(int32 CompletionPercentage_0);
	void SetCompletionRatio(double CompletionRatio);
	void ShouldBeDisplayed(bool* bShouldBeDisplayed);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Completion_C">();
	}
	static class UWBP_Completion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Completion_C>();
	}
};
static_assert(alignof(UWBP_Completion_C) == 0x000008, "Wrong alignment on UWBP_Completion_C");
static_assert(sizeof(UWBP_Completion_C) == 0x000478, "Wrong size on UWBP_Completion_C");
static_assert(offsetof(UWBP_Completion_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Completion_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Completion_C, CompletionPercentage) == 0x000468, "Member 'UWBP_Completion_C::CompletionPercentage' has a wrong offset!");
static_assert(offsetof(UWBP_Completion_C, ItemType) == 0x000470, "Member 'UWBP_Completion_C::ItemType' has a wrong offset!");

}

