#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LanguageSelection

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_LanguageSelection.WBP_LanguageSelection_C.ExecuteUbergraph_WBP_LanguageSelection
// 0x0050 (0x0050 - 0x0000)
struct WBP_LanguageSelection_C_ExecuteUbergraph_WBP_LanguageSelection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_LanguageSelection_Entry_C*         K2Node_CustomEvent_LanguageEntry;                  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue_1;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LanguageSelection_C_ExecuteUbergraph_WBP_LanguageSelection) == 0x000008, "Wrong alignment on WBP_LanguageSelection_C_ExecuteUbergraph_WBP_LanguageSelection");
static_assert(sizeof(WBP_LanguageSelection_C_ExecuteUbergraph_WBP_LanguageSelection) == 0x000050, "Wrong size on WBP_LanguageSelection_C_ExecuteUbergraph_WBP_LanguageSelection");
static_assert(offsetof(WBP_LanguageSelection_C_ExecuteUbergraph_WBP_LanguageSelection, EntryPoint) == 0x000000, "Member 'WBP_LanguageSelection_C_ExecuteUbergraph_WBP_LanguageSelection::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_ExecuteUbergraph_WBP_LanguageSelection, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_LanguageSelection_C_ExecuteUbergraph_WBP_LanguageSelection::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_ExecuteUbergraph_WBP_LanguageSelection, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'WBP_LanguageSelection_C_ExecuteUbergraph_WBP_LanguageSelection::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_ExecuteUbergraph_WBP_LanguageSelection, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'WBP_LanguageSelection_C_ExecuteUbergraph_WBP_LanguageSelection::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_ExecuteUbergraph_WBP_LanguageSelection, K2Node_CustomEvent_LanguageEntry) == 0x000030, "Member 'WBP_LanguageSelection_C_ExecuteUbergraph_WBP_LanguageSelection::K2Node_CustomEvent_LanguageEntry' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_ExecuteUbergraph_WBP_LanguageSelection, CallFunc_PlayUMGAnimation_ReturnValue) == 0x000038, "Member 'WBP_LanguageSelection_C_ExecuteUbergraph_WBP_LanguageSelection::CallFunc_PlayUMGAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_ExecuteUbergraph_WBP_LanguageSelection, CallFunc_PlayUMGAnimation_ReturnValue_1) == 0x000040, "Member 'WBP_LanguageSelection_C_ExecuteUbergraph_WBP_LanguageSelection::CallFunc_PlayUMGAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_ExecuteUbergraph_WBP_LanguageSelection, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'WBP_LanguageSelection_C_ExecuteUbergraph_WBP_LanguageSelection::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_ExecuteUbergraph_WBP_LanguageSelection, CallFunc_IsValid_ReturnValue_1) == 0x000049, "Member 'WBP_LanguageSelection_C_ExecuteUbergraph_WBP_LanguageSelection::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_LanguageSelection.WBP_LanguageSelection_C.FindLanguageEntryForLanguage
// 0x0040 (0x0040 - 0x0000)
struct WBP_LanguageSelection_C_FindLanguageEntryForLanguage final
{
public:
	class FString                                 Language;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UWBP_LanguageSelection_Entry_C*         FallbackLanguageEntry;                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_LanguageSelection_Entry_C*         LanguageEntry;                                     // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_LanguageSelection_Entry_C*         CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LanguageSelection_C_FindLanguageEntryForLanguage) == 0x000008, "Wrong alignment on WBP_LanguageSelection_C_FindLanguageEntryForLanguage");
static_assert(sizeof(WBP_LanguageSelection_C_FindLanguageEntryForLanguage) == 0x000040, "Wrong size on WBP_LanguageSelection_C_FindLanguageEntryForLanguage");
static_assert(offsetof(WBP_LanguageSelection_C_FindLanguageEntryForLanguage, Language) == 0x000000, "Member 'WBP_LanguageSelection_C_FindLanguageEntryForLanguage::Language' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_FindLanguageEntryForLanguage, FallbackLanguageEntry) == 0x000010, "Member 'WBP_LanguageSelection_C_FindLanguageEntryForLanguage::FallbackLanguageEntry' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_FindLanguageEntryForLanguage, LanguageEntry) == 0x000018, "Member 'WBP_LanguageSelection_C_FindLanguageEntryForLanguage::LanguageEntry' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_FindLanguageEntryForLanguage, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WBP_LanguageSelection_C_FindLanguageEntryForLanguage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_FindLanguageEntryForLanguage, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'WBP_LanguageSelection_C_FindLanguageEntryForLanguage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_FindLanguageEntryForLanguage, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_LanguageSelection_C_FindLanguageEntryForLanguage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_FindLanguageEntryForLanguage, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'WBP_LanguageSelection_C_FindLanguageEntryForLanguage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_FindLanguageEntryForLanguage, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_LanguageSelection_C_FindLanguageEntryForLanguage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_FindLanguageEntryForLanguage, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'WBP_LanguageSelection_C_FindLanguageEntryForLanguage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_FindLanguageEntryForLanguage, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x000039, "Member 'WBP_LanguageSelection_C_FindLanguageEntryForLanguage::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");

// Function WBP_LanguageSelection.WBP_LanguageSelection_C.GenerateLanguageEntries
// 0x0060 (0x0060 - 0x0000)
struct WBP_LanguageSelection_C_GenerateLanguageEntries final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_LanguageSelection_Entry_C*         CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_LanguageSelection_Entry_C* LanguageEntry)> K2Node_CreateDelegate_OutputDelegate; // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_GetAvailableLanguages_ReturnValue;        // 0x0030(0x0010)(ReferenceParm)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LanguageSelection_C_GenerateLanguageEntries) == 0x000008, "Wrong alignment on WBP_LanguageSelection_C_GenerateLanguageEntries");
static_assert(sizeof(WBP_LanguageSelection_C_GenerateLanguageEntries) == 0x000060, "Wrong size on WBP_LanguageSelection_C_GenerateLanguageEntries");
static_assert(offsetof(WBP_LanguageSelection_C_GenerateLanguageEntries, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_LanguageSelection_C_GenerateLanguageEntries::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_GenerateLanguageEntries, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_LanguageSelection_C_GenerateLanguageEntries::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_GenerateLanguageEntries, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_LanguageSelection_C_GenerateLanguageEntries::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_GenerateLanguageEntries, CallFunc_Create_ReturnValue) == 0x000010, "Member 'WBP_LanguageSelection_C_GenerateLanguageEntries::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_GenerateLanguageEntries, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_LanguageSelection_C_GenerateLanguageEntries::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_GenerateLanguageEntries, CallFunc_Array_Add_ReturnValue) == 0x000028, "Member 'WBP_LanguageSelection_C_GenerateLanguageEntries::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_GenerateLanguageEntries, CallFunc_GetAvailableLanguages_ReturnValue) == 0x000030, "Member 'WBP_LanguageSelection_C_GenerateLanguageEntries::CallFunc_GetAvailableLanguages_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_GenerateLanguageEntries, CallFunc_AddChild_ReturnValue) == 0x000040, "Member 'WBP_LanguageSelection_C_GenerateLanguageEntries::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_GenerateLanguageEntries, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_LanguageSelection_C_GenerateLanguageEntries::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_GenerateLanguageEntries, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'WBP_LanguageSelection_C_GenerateLanguageEntries::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_GenerateLanguageEntries, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'WBP_LanguageSelection_C_GenerateLanguageEntries::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_LanguageSelection.WBP_LanguageSelection_C.OnEntryPressed
// 0x0008 (0x0008 - 0x0000)
struct WBP_LanguageSelection_C_OnEntryPressed final
{
public:
	class UWBP_LanguageSelection_Entry_C*         LanguageEntry;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LanguageSelection_C_OnEntryPressed) == 0x000008, "Wrong alignment on WBP_LanguageSelection_C_OnEntryPressed");
static_assert(sizeof(WBP_LanguageSelection_C_OnEntryPressed) == 0x000008, "Wrong size on WBP_LanguageSelection_C_OnEntryPressed");
static_assert(offsetof(WBP_LanguageSelection_C_OnEntryPressed, LanguageEntry) == 0x000000, "Member 'WBP_LanguageSelection_C_OnEntryPressed::LanguageEntry' has a wrong offset!");

// Function WBP_LanguageSelection.WBP_LanguageSelection_C.OnFocusReceived
// 0x01D0 (0x01D0 - 0x0000)
struct WBP_LanguageSelection_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	class FString                                 CallFunc_GetLanguage_ReturnValue;                  // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UWBP_LanguageSelection_Entry_C*         CallFunc_Array_Get_Item;                           // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0110(0x00B8)()
	class UWBP_LanguageSelection_Entry_C*         CallFunc_FindLanguageEntryForLanguage_LanguageEntry; // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LanguageSelection_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_LanguageSelection_C_OnFocusReceived");
static_assert(sizeof(WBP_LanguageSelection_C_OnFocusReceived) == 0x0001D0, "Wrong size on WBP_LanguageSelection_C_OnFocusReceived");
static_assert(offsetof(WBP_LanguageSelection_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_LanguageSelection_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_LanguageSelection_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_LanguageSelection_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_OnFocusReceived, CallFunc_GetLanguage_ReturnValue) == 0x0000F8, "Member 'WBP_LanguageSelection_C_OnFocusReceived::CallFunc_GetLanguage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_OnFocusReceived, CallFunc_Array_Get_Item) == 0x000108, "Member 'WBP_LanguageSelection_C_OnFocusReceived::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000110, "Member 'WBP_LanguageSelection_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LanguageSelection_C_OnFocusReceived, CallFunc_FindLanguageEntryForLanguage_LanguageEntry) == 0x0001C8, "Member 'WBP_LanguageSelection_C_OnFocusReceived::CallFunc_FindLanguageEntryForLanguage_LanguageEntry' has a wrong offset!");

}

