#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Completion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Completion.WBP_Completion_C.ExecuteUbergraph_WBP_Completion
// 0x000C (0x000C - 0x0000)
struct WBP_Completion_C_ExecuteUbergraph_WBP_Completion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldBeDisplayed_bShouldBeDisplayed;     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Completion_C_ExecuteUbergraph_WBP_Completion) == 0x000004, "Wrong alignment on WBP_Completion_C_ExecuteUbergraph_WBP_Completion");
static_assert(sizeof(WBP_Completion_C_ExecuteUbergraph_WBP_Completion) == 0x00000C, "Wrong size on WBP_Completion_C_ExecuteUbergraph_WBP_Completion");
static_assert(offsetof(WBP_Completion_C_ExecuteUbergraph_WBP_Completion, EntryPoint) == 0x000000, "Member 'WBP_Completion_C_ExecuteUbergraph_WBP_Completion::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Completion_C_ExecuteUbergraph_WBP_Completion, CallFunc_ShouldBeDisplayed_bShouldBeDisplayed) == 0x000004, "Member 'WBP_Completion_C_ExecuteUbergraph_WBP_Completion::CallFunc_ShouldBeDisplayed_bShouldBeDisplayed' has a wrong offset!");
static_assert(offsetof(WBP_Completion_C_ExecuteUbergraph_WBP_Completion, Temp_bool_Variable) == 0x000005, "Member 'WBP_Completion_C_ExecuteUbergraph_WBP_Completion::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Completion_C_ExecuteUbergraph_WBP_Completion, Temp_byte_Variable) == 0x000006, "Member 'WBP_Completion_C_ExecuteUbergraph_WBP_Completion::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Completion_C_ExecuteUbergraph_WBP_Completion, Temp_byte_Variable_1) == 0x000007, "Member 'WBP_Completion_C_ExecuteUbergraph_WBP_Completion::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Completion_C_ExecuteUbergraph_WBP_Completion, K2Node_Select_Default) == 0x000008, "Member 'WBP_Completion_C_ExecuteUbergraph_WBP_Completion::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Completion.WBP_Completion_C.SetCompletionPercentage
// 0x0078 (0x0078 - 0x0000)
struct WBP_Completion_C_SetCompletionPercentage final
{
public:
	int32                                         CompletionPercentage_0;                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0068(0x0010)()
};
static_assert(alignof(WBP_Completion_C_SetCompletionPercentage) == 0x000008, "Wrong alignment on WBP_Completion_C_SetCompletionPercentage");
static_assert(sizeof(WBP_Completion_C_SetCompletionPercentage) == 0x000078, "Wrong size on WBP_Completion_C_SetCompletionPercentage");
static_assert(offsetof(WBP_Completion_C_SetCompletionPercentage, CompletionPercentage_0) == 0x000000, "Member 'WBP_Completion_C_SetCompletionPercentage::CompletionPercentage_0' has a wrong offset!");
static_assert(offsetof(WBP_Completion_C_SetCompletionPercentage, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000008, "Member 'WBP_Completion_C_SetCompletionPercentage::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Completion_C_SetCompletionPercentage, K2Node_MakeStruct_FormatArgumentData) == 0x000010, "Member 'WBP_Completion_C_SetCompletionPercentage::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Completion_C_SetCompletionPercentage, K2Node_MakeArray_Array) == 0x000058, "Member 'WBP_Completion_C_SetCompletionPercentage::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Completion_C_SetCompletionPercentage, CallFunc_Format_ReturnValue) == 0x000068, "Member 'WBP_Completion_C_SetCompletionPercentage::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_Completion.WBP_Completion_C.SetCompletionRatio
// 0x0018 (0x0018 - 0x0000)
struct WBP_Completion_C_SetCompletionRatio final
{
public:
	double                                        CompletionRatio;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Completion_C_SetCompletionRatio) == 0x000008, "Wrong alignment on WBP_Completion_C_SetCompletionRatio");
static_assert(sizeof(WBP_Completion_C_SetCompletionRatio) == 0x000018, "Wrong size on WBP_Completion_C_SetCompletionRatio");
static_assert(offsetof(WBP_Completion_C_SetCompletionRatio, CompletionRatio) == 0x000000, "Member 'WBP_Completion_C_SetCompletionRatio::CompletionRatio' has a wrong offset!");
static_assert(offsetof(WBP_Completion_C_SetCompletionRatio, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_Completion_C_SetCompletionRatio::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Completion_C_SetCompletionRatio, CallFunc_Round_ReturnValue) == 0x000010, "Member 'WBP_Completion_C_SetCompletionRatio::CallFunc_Round_ReturnValue' has a wrong offset!");

// Function WBP_Completion.WBP_Completion_C.ShouldBeDisplayed
// 0x0008 (0x0008 - 0x0000)
struct WBP_Completion_C_ShouldBeDisplayed final
{
public:
	bool                                          bShouldBeDisplayed;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDemoBuild_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEarlyAccessBuild_ReturnValue;           // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldDisplayCompletionWidget_ReturnValue; // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Completion_C_ShouldBeDisplayed) == 0x000001, "Wrong alignment on WBP_Completion_C_ShouldBeDisplayed");
static_assert(sizeof(WBP_Completion_C_ShouldBeDisplayed) == 0x000008, "Wrong size on WBP_Completion_C_ShouldBeDisplayed");
static_assert(offsetof(WBP_Completion_C_ShouldBeDisplayed, bShouldBeDisplayed) == 0x000000, "Member 'WBP_Completion_C_ShouldBeDisplayed::bShouldBeDisplayed' has a wrong offset!");
static_assert(offsetof(WBP_Completion_C_ShouldBeDisplayed, CallFunc_IsDemoBuild_ReturnValue) == 0x000001, "Member 'WBP_Completion_C_ShouldBeDisplayed::CallFunc_IsDemoBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Completion_C_ShouldBeDisplayed, CallFunc_IsEarlyAccessBuild_ReturnValue) == 0x000002, "Member 'WBP_Completion_C_ShouldBeDisplayed::CallFunc_IsEarlyAccessBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Completion_C_ShouldBeDisplayed, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'WBP_Completion_C_ShouldBeDisplayed::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Completion_C_ShouldBeDisplayed, CallFunc_Not_PreBool_ReturnValue_1) == 0x000004, "Member 'WBP_Completion_C_ShouldBeDisplayed::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Completion_C_ShouldBeDisplayed, CallFunc_ShouldDisplayCompletionWidget_ReturnValue) == 0x000005, "Member 'WBP_Completion_C_ShouldBeDisplayed::CallFunc_ShouldDisplayCompletionWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Completion_C_ShouldBeDisplayed, CallFunc_BooleanAND_ReturnValue) == 0x000006, "Member 'WBP_Completion_C_ShouldBeDisplayed::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Completion_C_ShouldBeDisplayed, CallFunc_BooleanAND_ReturnValue_1) == 0x000007, "Member 'WBP_Completion_C_ShouldBeDisplayed::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

}

