#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EquipSlot_Equipment

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "WBP_EquipSlot_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_EquipSlot_Equipment.WBP_EquipSlot_Equipment_C
// 0x0018 (0x0510 - 0x04F8)
class UWBP_EquipSlot_Equipment_C final : public UWBP_EquipSlot_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_EquipSlot_Equipment_C;          // 0x04F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UEquipmentComponent*                    EquipmentComponent;                                // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	EEquipmentSlot                                EquipmentSlot;                                     // 0x0508(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_EquipSlot_Equipment(int32 EntryPoint);
	void Refresh();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_EquipSlot_Equipment_C">();
	}
	static class UWBP_EquipSlot_Equipment_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_EquipSlot_Equipment_C>();
	}
};
static_assert(alignof(UWBP_EquipSlot_Equipment_C) == 0x000008, "Wrong alignment on UWBP_EquipSlot_Equipment_C");
static_assert(sizeof(UWBP_EquipSlot_Equipment_C) == 0x000510, "Wrong size on UWBP_EquipSlot_Equipment_C");
static_assert(offsetof(UWBP_EquipSlot_Equipment_C, UberGraphFrame_WBP_EquipSlot_Equipment_C) == 0x0004F8, "Member 'UWBP_EquipSlot_Equipment_C::UberGraphFrame_WBP_EquipSlot_Equipment_C' has a wrong offset!");
static_assert(offsetof(UWBP_EquipSlot_Equipment_C, EquipmentComponent) == 0x000500, "Member 'UWBP_EquipSlot_Equipment_C::EquipmentComponent' has a wrong offset!");
static_assert(offsetof(UWBP_EquipSlot_Equipment_C, EquipmentSlot) == 0x000508, "Member 'UWBP_EquipSlot_Equipment_C::EquipmentSlot' has a wrong offset!");

}

