#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WorldSpace_DoorLocked

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_WorldSpace_DoorLocked.WBP_WorldSpace_DoorLocked_C
// 0x0018 (0x0330 - 0x0318)
class UWBP_WorldSpace_DoorLocked_C final : public UUserWidgetWorldSpace
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Animation;                                         // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_WorldSpace_DoorLocked(int32 EntryPoint);
	void OnAnimationFinished(const class UWidgetAnimation* Animation_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_WorldSpace_DoorLocked_C">();
	}
	static class UWBP_WorldSpace_DoorLocked_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_WorldSpace_DoorLocked_C>();
	}
};
static_assert(alignof(UWBP_WorldSpace_DoorLocked_C) == 0x000008, "Wrong alignment on UWBP_WorldSpace_DoorLocked_C");
static_assert(sizeof(UWBP_WorldSpace_DoorLocked_C) == 0x000330, "Wrong size on UWBP_WorldSpace_DoorLocked_C");
static_assert(offsetof(UWBP_WorldSpace_DoorLocked_C, UberGraphFrame) == 0x000318, "Member 'UWBP_WorldSpace_DoorLocked_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_WorldSpace_DoorLocked_C, Animation) == 0x000320, "Member 'UWBP_WorldSpace_DoorLocked_C::Animation' has a wrong offset!");
static_assert(offsetof(UWBP_WorldSpace_DoorLocked_C, Text) == 0x000328, "Member 'UWBP_WorldSpace_DoorLocked_C::Text' has a wrong offset!");

}

