#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugMenu_Page_Default

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_DebugMenu_Page_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DebugMenu_Page_Default.WBP_DebugMenu_Page_Default_C
// 0x00E8 (0x0568 - 0x0480)
class UWBP_DebugMenu_Page_Default_C final : public UWBP_DebugMenu_Page_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           VerticalBoxContainer;                              // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Button_C*        WBP_DebugMenu_Element_Button_FastTravel;           // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Button_C*        WBP_DebugMenu_Element_Button_GameMenu;             // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Button_C*        WBP_DebugMenu_Element_Button_Save;                 // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Button_C*        WBP_DebugMenu_Element_Button_UnlockAllAptitudes;   // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Button_C*        WBP_DebugMenu_Element_Button_UnlockAllEquipments;  // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Button_C*        WBP_DebugMenu_Element_Button_UnlockAllPassives;    // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Button_C*        WBP_DebugMenu_Element_Button_UnlockAllSkills;      // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_DoNotConsumeHeal; // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_EnableSPQuickRegen; // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Text_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_EnemyRepulsion; // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_FlyMode; // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_ForceBreakPart; // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_IgnoreCooldowns; // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_IgnoreDMG; // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_IgnoreDMG_Enemies; // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_IgnoreDMG_Player; // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_InfiniteJump; // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_InstantKillEnemies; // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_InstantKillPlayer; // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_InstantLevelUp; // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_OneShotStunEnemies; // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_ShowHitboxVisuals; // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_ShowHurtboxVisuals; // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_ShowHurtboxVisuals_1; // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* WBP_DebugMenu_Element_Choice_Toggle_Command_StopAI; // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Toggle_C* WBP_DebugMenu_Element_Choice_Toggle_SlowMotion;    // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Map_C*                             MapMenu;                                           // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Button_FastTravel_K2Node_ComponentBoundEvent_6_OnConfirm__DelegateSignature();
	void BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Button_GameMenu_K2Node_ComponentBoundEvent_5_OnConfirm__DelegateSignature();
	void BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Button_Save_K2Node_ComponentBoundEvent_4_OnConfirm__DelegateSignature();
	void BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Button_UnlockAllAptitudes_K2Node_ComponentBoundEvent_2_OnConfirm__DelegateSignature();
	void BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Button_UnlockAllEquipments_K2Node_ComponentBoundEvent_7_OnConfirm__DelegateSignature();
	void BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Button_UnlockAllPassives_K2Node_ComponentBoundEvent_3_OnConfirm__DelegateSignature();
	void BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Button_UnlockAllSpirits_K2Node_ComponentBoundEvent_0_OnConfirm__DelegateSignature();
	void BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Choice_Toggle_SlowMotion_K2Node_ComponentBoundEvent_1_OnToggle__DelegateSignature(bool ToggleValue);
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_DebugMenu_Page_Default(int32 EntryPoint);
	void Grant_All_Items_from_Data_Table(class UDataTable* Table);
	void OnFadeFinished();
	void OnFastTravelRequested(class FName RestPointID, const struct FRestPointData& RestPointData);
	void OnFinish_068867E84E566D42111C4DA7BC3EBD3A();
	void OnFinish_8A73D40F411A32B26B23729638D10ED3();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnSaveFinished(bool Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DebugMenu_Page_Default_C">();
	}
	static class UWBP_DebugMenu_Page_Default_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DebugMenu_Page_Default_C>();
	}
};
static_assert(alignof(UWBP_DebugMenu_Page_Default_C) == 0x000008, "Wrong alignment on UWBP_DebugMenu_Page_Default_C");
static_assert(sizeof(UWBP_DebugMenu_Page_Default_C) == 0x000568, "Wrong size on UWBP_DebugMenu_Page_Default_C");
static_assert(offsetof(UWBP_DebugMenu_Page_Default_C, UberGraphFrame) == 0x000480, "Member 'UWBP_DebugMenu_Page_Default_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Default_C, VerticalBoxContainer) == 0x000488, "Member 'UWBP_DebugMenu_Page_Default_C::VerticalBoxContainer' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Default_C, WBP_DebugMenu_Element_Button_FastTravel) == 0x000490, "Member 'UWBP_DebugMenu_Page_Default_C::WBP_DebugMenu_Element_Button_FastTravel' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Default_C, WBP_DebugMenu_Element_Button_GameMenu) == 0x000498, "Member 'UWBP_DebugMenu_Page_Default_C::WBP_DebugMenu_Element_Button_GameMenu' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Default_C, WBP_DebugMenu_Element_Button_Save) == 0x0004A0, "Member 'UWBP_DebugMenu_Page_Default_C::WBP_DebugMenu_Element_Button_Save' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Default_C, WBP_DebugMenu_Element_Button_UnlockAllAptitudes) == 0x0004A8, "Member 'UWBP_DebugMenu_Page_Default_C::WBP_DebugMenu_Element_Button_UnlockAllAptitudes' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Default_C, WBP_DebugMenu_Element_Button_UnlockAllEquipments) == 0x0004B0, "Member 'UWBP_DebugMenu_Page_Default_C::WBP_DebugMenu_Element_Button_UnlockAllEquipments' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Default_C, WBP_DebugMenu_Element_Button_UnlockAllPassives) == 0x0004B8, "Member 'UWBP_DebugMenu_Page_Default_C::WBP_DebugMenu_Element_Button_UnlockAllPassives' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Default_C, WBP_DebugMenu_Element_Button_UnlockAllSkills) == 0x0004C0, "Member 'UWBP_DebugMenu_Page_Default_C::WBP_DebugMenu_Element_Button_UnlockAllSkills' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Default_C, WBP_DebugMenu_Element_Choice_Toggle_Command_DoNotConsumeHeal) == 0x0004C8, "Member 'UWBP_DebugMenu_Page_Default_C::WBP_DebugMenu_Element_Choice_Toggle_Command_DoNotConsumeHeal' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Default_C, WBP_DebugMenu_Element_Choice_Toggle_Command_EnableSPQuickRegen) == 0x0004D0, "Member 'UWBP_DebugMenu_Page_Default_C::WBP_DebugMenu_Element_Choice_Toggle_Command_EnableSPQuickRegen' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Default_C, WBP_DebugMenu_Element_Choice_Toggle_Command_EnemyRepulsion) == 0x0004D8, "Member 'UWBP_DebugMenu_Page_Default_C::WBP_DebugMenu_Element_Choice_Toggle_Command_EnemyRepulsion' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Default_C, WBP_DebugMenu_Element_Choice_Toggle_Command_FlyMode) == 0x0004E0, "Member 'UWBP_DebugMenu_Page_Default_C::WBP_DebugMenu_Element_Choice_Toggle_Command_FlyMode' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Default_C, WBP_DebugMenu_Element_Choice_Toggle_Command_ForceBreakPart) == 0x0004E8, "Member 'UWBP_DebugMenu_Page_Default_C::WBP_DebugMenu_Element_Choice_Toggle_Command_ForceBreakPart' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Default_C, WBP_DebugMenu_Element_Choice_Toggle_Command_IgnoreCooldowns) == 0x0004F0, "Member 'UWBP_DebugMenu_Page_Default_C::WBP_DebugMenu_Element_Choice_Toggle_Command_IgnoreCooldowns' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Default_C, WBP_DebugMenu_Element_Choice_Toggle_Command_IgnoreDMG) == 0x0004F8, "Member 'UWBP_DebugMenu_Page_Default_C::WBP_DebugMenu_Element_Choice_Toggle_Command_IgnoreDMG' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Default_C, WBP_DebugMenu_Element_Choice_Toggle_Command_IgnoreDMG_Enemies) == 0x000500, "Member 'UWBP_DebugMenu_Page_Default_C::WBP_DebugMenu_Element_Choice_Toggle_Command_IgnoreDMG_Enemies' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Default_C, WBP_DebugMenu_Element_Choice_Toggle_Command_IgnoreDMG_Player) == 0x000508, "Member 'UWBP_DebugMenu_Page_Default_C::WBP_DebugMenu_Element_Choice_Toggle_Command_IgnoreDMG_Player' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Default_C, WBP_DebugMenu_Element_Choice_Toggle_Command_InfiniteJump) == 0x000510, "Member 'UWBP_DebugMenu_Page_Default_C::WBP_DebugMenu_Element_Choice_Toggle_Command_InfiniteJump' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Default_C, WBP_DebugMenu_Element_Choice_Toggle_Command_InstantKillEnemies) == 0x000518, "Member 'UWBP_DebugMenu_Page_Default_C::WBP_DebugMenu_Element_Choice_Toggle_Command_InstantKillEnemies' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Default_C, WBP_DebugMenu_Element_Choice_Toggle_Command_InstantKillPlayer) == 0x000520, "Member 'UWBP_DebugMenu_Page_Default_C::WBP_DebugMenu_Element_Choice_Toggle_Command_InstantKillPlayer' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Default_C, WBP_DebugMenu_Element_Choice_Toggle_Command_InstantLevelUp) == 0x000528, "Member 'UWBP_DebugMenu_Page_Default_C::WBP_DebugMenu_Element_Choice_Toggle_Command_InstantLevelUp' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Default_C, WBP_DebugMenu_Element_Choice_Toggle_Command_OneShotStunEnemies) == 0x000530, "Member 'UWBP_DebugMenu_Page_Default_C::WBP_DebugMenu_Element_Choice_Toggle_Command_OneShotStunEnemies' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Default_C, WBP_DebugMenu_Element_Choice_Toggle_Command_ShowHitboxVisuals) == 0x000538, "Member 'UWBP_DebugMenu_Page_Default_C::WBP_DebugMenu_Element_Choice_Toggle_Command_ShowHitboxVisuals' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Default_C, WBP_DebugMenu_Element_Choice_Toggle_Command_ShowHurtboxVisuals) == 0x000540, "Member 'UWBP_DebugMenu_Page_Default_C::WBP_DebugMenu_Element_Choice_Toggle_Command_ShowHurtboxVisuals' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Default_C, WBP_DebugMenu_Element_Choice_Toggle_Command_ShowHurtboxVisuals_1) == 0x000548, "Member 'UWBP_DebugMenu_Page_Default_C::WBP_DebugMenu_Element_Choice_Toggle_Command_ShowHurtboxVisuals_1' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Default_C, WBP_DebugMenu_Element_Choice_Toggle_Command_StopAI) == 0x000550, "Member 'UWBP_DebugMenu_Page_Default_C::WBP_DebugMenu_Element_Choice_Toggle_Command_StopAI' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Default_C, WBP_DebugMenu_Element_Choice_Toggle_SlowMotion) == 0x000558, "Member 'UWBP_DebugMenu_Page_Default_C::WBP_DebugMenu_Element_Choice_Toggle_SlowMotion' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_Default_C, MapMenu) == 0x000560, "Member 'UWBP_DebugMenu_Page_Default_C::MapMenu' has a wrong offset!");

}

