#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugMenu_Page_Aptitudes

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_DebugMenu_Page_Aptitudes.WBP_DebugMenu_Page_Aptitudes_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_DebugMenu_Page_Aptitudes_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Page_Aptitudes_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_DebugMenu_Page_Aptitudes_C_OnFocusReceived");
static_assert(sizeof(WBP_DebugMenu_Page_Aptitudes_C_OnFocusReceived) == 0x0001B8, "Wrong size on WBP_DebugMenu_Page_Aptitudes_C_OnFocusReceived");
static_assert(offsetof(WBP_DebugMenu_Page_Aptitudes_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_DebugMenu_Page_Aptitudes_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Aptitudes_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_DebugMenu_Page_Aptitudes_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Aptitudes_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_DebugMenu_Page_Aptitudes_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Aptitudes_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_DebugMenu_Page_Aptitudes_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Aptitudes_C_OnFocusReceived, CallFunc_GetChildAt_ReturnValue) == 0x0001B0, "Member 'WBP_DebugMenu_Page_Aptitudes_C_OnFocusReceived::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");

// Function WBP_DebugMenu_Page_Aptitudes.WBP_DebugMenu_Page_Aptitudes_C.ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes
// 0x0088 (0x0088 - 0x0000)
struct WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_DebugMenu_Element_Choice_Toggle_Aptitude_C* CallFunc_Create_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeZion*                          CallFunc_Get_ReturnValue;                          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             CallFunc_GetDataTableItemAptitudes_ReturnValue;    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0040(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0060(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue;               // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes) == 0x000008, "Wrong alignment on WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes");
static_assert(sizeof(WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes) == 0x000088, "Wrong size on WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes");
static_assert(offsetof(WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes, EntryPoint) == 0x000000, "Member 'WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes, CallFunc_Create_ReturnValue) == 0x000010, "Member 'WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes, Temp_int_Variable) == 0x000018, "Member 'WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes, CallFunc_Get_ReturnValue) == 0x000028, "Member 'WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes, CallFunc_GetDataTableItemAptitudes_ReturnValue) == 0x000038, "Member 'WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes::CallFunc_GetDataTableItemAptitudes_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000040, "Member 'WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes, CallFunc_Add_IntInt_ReturnValue_1) == 0x000050, "Member 'WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes, CallFunc_Array_Get_Item) == 0x000054, "Member 'WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes, K2Node_MakeStruct_DataTableRowHandle) == 0x000060, "Member 'WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes, CallFunc_Divide_IntInt_ReturnValue) == 0x000078, "Member 'WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes, CallFunc_Percent_IntInt_ReturnValue) == 0x00007C, "Member 'WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes, CallFunc_AddChildToGrid_ReturnValue) == 0x000080, "Member 'WBP_DebugMenu_Page_Aptitudes_C_ExecuteUbergraph_WBP_DebugMenu_Page_Aptitudes::CallFunc_AddChildToGrid_ReturnValue' has a wrong offset!");

}

