#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SkillSet

#include "Basic.hpp"

#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SkillSet.WBP_SkillSet_C
// 0x0020 (0x0480 - 0x0460)
class UWBP_SkillSet_C final : public UUserWidgetZion
{
public:
	class UWBP_SkillEntry_C*                      WBP_SkillEntry_AttackA;                            // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SkillEntry_C*                      WBP_SkillEntry_AttackB;                            // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SkillEntry_C*                      WBP_SkillEntry_AttackC;                            // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SkillEntry_C*                      WBP_SkillEntry_AttackD;                            // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void DisableSpecialMode();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SkillSet_C">();
	}
	static class UWBP_SkillSet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SkillSet_C>();
	}
};
static_assert(alignof(UWBP_SkillSet_C) == 0x000008, "Wrong alignment on UWBP_SkillSet_C");
static_assert(sizeof(UWBP_SkillSet_C) == 0x000480, "Wrong size on UWBP_SkillSet_C");
static_assert(offsetof(UWBP_SkillSet_C, WBP_SkillEntry_AttackA) == 0x000460, "Member 'UWBP_SkillSet_C::WBP_SkillEntry_AttackA' has a wrong offset!");
static_assert(offsetof(UWBP_SkillSet_C, WBP_SkillEntry_AttackB) == 0x000468, "Member 'UWBP_SkillSet_C::WBP_SkillEntry_AttackB' has a wrong offset!");
static_assert(offsetof(UWBP_SkillSet_C, WBP_SkillEntry_AttackC) == 0x000470, "Member 'UWBP_SkillSet_C::WBP_SkillEntry_AttackC' has a wrong offset!");
static_assert(offsetof(UWBP_SkillSet_C, WBP_SkillEntry_AttackD) == 0x000478, "Member 'UWBP_SkillSet_C::WBP_SkillEntry_AttackD' has a wrong offset!");

}

