#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Dialog

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Dialog.WBP_Dialog_C
// 0x0058 (0x04B8 - 0x0460)
class UWBP_Dialog_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BG;                                                // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             ButtonsContainerSlot;                              // 0x0470(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             ImageSlot;                                         // 0x0478(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_153;                                     // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             TopContainerSlot;                                  // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Footer_C*                          WBP_Footer;                                        // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Message;                                           // 0x0498(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)
	TArray<struct FFooterData>                    Footer_Data_List;                                  // 0x04A8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)

public:
	void ExecuteUbergraph_WBP_Dialog(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetMessageText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Dialog_C">();
	}
	static class UWBP_Dialog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Dialog_C>();
	}
};
static_assert(alignof(UWBP_Dialog_C) == 0x000008, "Wrong alignment on UWBP_Dialog_C");
static_assert(sizeof(UWBP_Dialog_C) == 0x0004B8, "Wrong size on UWBP_Dialog_C");
static_assert(offsetof(UWBP_Dialog_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Dialog_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_C, BG) == 0x000468, "Member 'UWBP_Dialog_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_C, ButtonsContainerSlot) == 0x000470, "Member 'UWBP_Dialog_C::ButtonsContainerSlot' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_C, ImageSlot) == 0x000478, "Member 'UWBP_Dialog_C::ImageSlot' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_C, TextBlock_153) == 0x000480, "Member 'UWBP_Dialog_C::TextBlock_153' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_C, TopContainerSlot) == 0x000488, "Member 'UWBP_Dialog_C::TopContainerSlot' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_C, WBP_Footer) == 0x000490, "Member 'UWBP_Dialog_C::WBP_Footer' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_C, Message) == 0x000498, "Member 'UWBP_Dialog_C::Message' has a wrong offset!");
static_assert(offsetof(UWBP_Dialog_C, Footer_Data_List) == 0x0004A8, "Member 'UWBP_Dialog_C::Footer_Data_List' has a wrong offset!");

}

