#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugMenu_Element_Choice_Toggle_Event

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DebugMenu_Element_Choice_Toggle_Event.WBP_DebugMenu_Element_Choice_Toggle_Event_C
// 0x0018 (0x0478 - 0x0460)
class UWBP_DebugMenu_Element_Choice_Toggle_Event_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_DebugMenu_Element_Choice_Toggle_C* WBP_DebugMenu_Element_Choice_Toggle;               // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   EventId;                                           // 0x0470(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Toggle_Event(int32 EntryPoint);
	void Construct();
	void BndEvt__WBP_DebugMenu_Element_Choice_Toggle_Command_WBP_DebugMenu_Element_Choice_Toggle_K2Node_ComponentBoundEvent_0_OnToggle__DelegateSignature(bool ToggleValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DebugMenu_Element_Choice_Toggle_Event_C">();
	}
	static class UWBP_DebugMenu_Element_Choice_Toggle_Event_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DebugMenu_Element_Choice_Toggle_Event_C>();
	}
};
static_assert(alignof(UWBP_DebugMenu_Element_Choice_Toggle_Event_C) == 0x000008, "Wrong alignment on UWBP_DebugMenu_Element_Choice_Toggle_Event_C");
static_assert(sizeof(UWBP_DebugMenu_Element_Choice_Toggle_Event_C) == 0x000478, "Wrong size on UWBP_DebugMenu_Element_Choice_Toggle_Event_C");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Toggle_Event_C, UberGraphFrame) == 0x000460, "Member 'UWBP_DebugMenu_Element_Choice_Toggle_Event_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Toggle_Event_C, WBP_DebugMenu_Element_Choice_Toggle) == 0x000468, "Member 'UWBP_DebugMenu_Element_Choice_Toggle_Event_C::WBP_DebugMenu_Element_Choice_Toggle' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Toggle_Event_C, EventId) == 0x000470, "Member 'UWBP_DebugMenu_Element_Choice_Toggle_Event_C::EventId' has a wrong offset!");

}

