#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PassiveUnlock_Button

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PassiveUnlock_Button.WBP_PassiveUnlock_Button_C
// 0x0028 (0x0308 - 0x02E0)
class UWBP_PassiveUnlock_Button_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             ButtonText;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_FocusedContainer;                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x02F8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)

public:
	void ExecuteUbergraph_WBP_PassiveUnlock_Button(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PassiveUnlock_Button_C">();
	}
	static class UWBP_PassiveUnlock_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PassiveUnlock_Button_C>();
	}
};
static_assert(alignof(UWBP_PassiveUnlock_Button_C) == 0x000008, "Wrong alignment on UWBP_PassiveUnlock_Button_C");
static_assert(sizeof(UWBP_PassiveUnlock_Button_C) == 0x000308, "Wrong size on UWBP_PassiveUnlock_Button_C");
static_assert(offsetof(UWBP_PassiveUnlock_Button_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_PassiveUnlock_Button_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PassiveUnlock_Button_C, ButtonText) == 0x0002E8, "Member 'UWBP_PassiveUnlock_Button_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_PassiveUnlock_Button_C, Overlay_FocusedContainer) == 0x0002F0, "Member 'UWBP_PassiveUnlock_Button_C::Overlay_FocusedContainer' has a wrong offset!");
static_assert(offsetof(UWBP_PassiveUnlock_Button_C, Text) == 0x0002F8, "Member 'UWBP_PassiveUnlock_Button_C::Text' has a wrong offset!");

}

