#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Recollection_Boss_NGSelection

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Recollection_Boss_NGSelection.WBP_Recollection_Boss_NGSelection_C
// 0x0038 (0x0498 - 0x0460)
class UWBP_Recollection_Boss_NGSelection_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Recollection_BossRush_DifficultySettings_Entry_Choice_C* WBP_Recollection_BossRush_DifficultySettings_Entry_Choice; // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bBossRush;                                         // 0x0470(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_471[0x7];                                      // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnFocused;                                         // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnSelectionChanged;                                // 0x0488(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_Recollection_Boss_NGSelection_WBP_Recollection_BossRush_DifficultySettings_Entry_Choice_K2Node_ComponentBoundEvent_0_OnLeft__DelegateSignature();
	void BndEvt__WBP_Recollection_Boss_NGSelection_WBP_Recollection_BossRush_DifficultySettings_Entry_Choice_K2Node_ComponentBoundEvent_1_OnRight__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_Recollection_Boss_NGSelection(int32 EntryPoint);
	void GetBossComponent(class URecollectionBossBaseComponent** Result);
	int32 GetSelectedIndex();
	class FText GetSelectedText();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void PreConstruct(bool IsDesignTime);
	void RefreshDisplay();
	void SwitchSelection(int32 Offset);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Recollection_Boss_NGSelection_C">();
	}
	static class UWBP_Recollection_Boss_NGSelection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Recollection_Boss_NGSelection_C>();
	}
};
static_assert(alignof(UWBP_Recollection_Boss_NGSelection_C) == 0x000008, "Wrong alignment on UWBP_Recollection_Boss_NGSelection_C");
static_assert(sizeof(UWBP_Recollection_Boss_NGSelection_C) == 0x000498, "Wrong size on UWBP_Recollection_Boss_NGSelection_C");
static_assert(offsetof(UWBP_Recollection_Boss_NGSelection_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Recollection_Boss_NGSelection_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Boss_NGSelection_C, WBP_Recollection_BossRush_DifficultySettings_Entry_Choice) == 0x000468, "Member 'UWBP_Recollection_Boss_NGSelection_C::WBP_Recollection_BossRush_DifficultySettings_Entry_Choice' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Boss_NGSelection_C, bBossRush) == 0x000470, "Member 'UWBP_Recollection_Boss_NGSelection_C::bBossRush' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Boss_NGSelection_C, OnFocused) == 0x000478, "Member 'UWBP_Recollection_Boss_NGSelection_C::OnFocused' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Boss_NGSelection_C, OnSelectionChanged) == 0x000488, "Member 'UWBP_Recollection_Boss_NGSelection_C::OnSelectionChanged' has a wrong offset!");

}

