#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Achievement

#include "Basic.hpp"

#include "Zion_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Achievement.WBP_Achievement_C.AddAchievementEntry
// 0x0098 (0x0098 - 0x0000)
struct WBP_Achievement_C_AddAchievementEntry final
{
public:
	struct FAchievementData                       AchievementData;                                   // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UWBP_AchievementEntry_C*                CallFunc_Create_ReturnValue;                       // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Achievement_C_AddAchievementEntry) == 0x000008, "Wrong alignment on WBP_Achievement_C_AddAchievementEntry");
static_assert(sizeof(WBP_Achievement_C_AddAchievementEntry) == 0x000098, "Wrong size on WBP_Achievement_C_AddAchievementEntry");
static_assert(offsetof(WBP_Achievement_C_AddAchievementEntry, AchievementData) == 0x000000, "Member 'WBP_Achievement_C_AddAchievementEntry::AchievementData' has a wrong offset!");
static_assert(offsetof(WBP_Achievement_C_AddAchievementEntry, CallFunc_Create_ReturnValue) == 0x000088, "Member 'WBP_Achievement_C_AddAchievementEntry::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Achievement_C_AddAchievementEntry, CallFunc_AddChild_ReturnValue) == 0x000090, "Member 'WBP_Achievement_C_AddAchievementEntry::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function WBP_Achievement.WBP_Achievement_C.CreateAchievementList
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_Achievement_C_CreateAchievementList final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeZion*                          CallFunc_Get_ReturnValue;                          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             CallFunc_GetDataTableAchievements_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAchievementData                       CallFunc_GetDataTableRowFromName_OutRow;           // 0x0040(0x0088)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Achievement_C_CreateAchievementList) == 0x000008, "Wrong alignment on WBP_Achievement_C_CreateAchievementList");
static_assert(sizeof(WBP_Achievement_C_CreateAchievementList) == 0x0000D0, "Wrong size on WBP_Achievement_C_CreateAchievementList");
static_assert(offsetof(WBP_Achievement_C_CreateAchievementList, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_Achievement_C_CreateAchievementList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Achievement_C_CreateAchievementList, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Achievement_C_CreateAchievementList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Achievement_C_CreateAchievementList, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Achievement_C_CreateAchievementList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Achievement_C_CreateAchievementList, CallFunc_Get_ReturnValue) == 0x000010, "Member 'WBP_Achievement_C_CreateAchievementList::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Achievement_C_CreateAchievementList, CallFunc_GetDataTableAchievements_ReturnValue) == 0x000018, "Member 'WBP_Achievement_C_CreateAchievementList::CallFunc_GetDataTableAchievements_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Achievement_C_CreateAchievementList, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000020, "Member 'WBP_Achievement_C_CreateAchievementList::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WBP_Achievement_C_CreateAchievementList, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_Achievement_C_CreateAchievementList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Achievement_C_CreateAchievementList, CallFunc_Array_Get_Item) == 0x000034, "Member 'WBP_Achievement_C_CreateAchievementList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Achievement_C_CreateAchievementList, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_Achievement_C_CreateAchievementList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Achievement_C_CreateAchievementList, CallFunc_GetDataTableRowFromName_OutRow) == 0x000040, "Member 'WBP_Achievement_C_CreateAchievementList::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_Achievement_C_CreateAchievementList, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000C8, "Member 'WBP_Achievement_C_CreateAchievementList::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function WBP_Achievement.WBP_Achievement_C.ExecuteUbergraph_WBP_Achievement
// 0x0068 (0x0068 - 0x0000)
struct WBP_Achievement_C_ExecuteUbergraph_WBP_Achievement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSwitchBuild_ReturnValue;                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaystationBuild_ReturnValue;           // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_SelectText_ReturnValue;                   // 0x0018(0x0010)()
	class FText                                   CallFunc_SelectText_ReturnValue_1;                 // 0x0028(0x0010)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue_1;           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Achievement_C_ExecuteUbergraph_WBP_Achievement) == 0x000008, "Wrong alignment on WBP_Achievement_C_ExecuteUbergraph_WBP_Achievement");
static_assert(sizeof(WBP_Achievement_C_ExecuteUbergraph_WBP_Achievement) == 0x000068, "Wrong size on WBP_Achievement_C_ExecuteUbergraph_WBP_Achievement");
static_assert(offsetof(WBP_Achievement_C_ExecuteUbergraph_WBP_Achievement, EntryPoint) == 0x000000, "Member 'WBP_Achievement_C_ExecuteUbergraph_WBP_Achievement::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Achievement_C_ExecuteUbergraph_WBP_Achievement, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Achievement_C_ExecuteUbergraph_WBP_Achievement::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Achievement_C_ExecuteUbergraph_WBP_Achievement, CallFunc_IsSwitchBuild_ReturnValue) == 0x000014, "Member 'WBP_Achievement_C_ExecuteUbergraph_WBP_Achievement::CallFunc_IsSwitchBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Achievement_C_ExecuteUbergraph_WBP_Achievement, CallFunc_IsPlaystationBuild_ReturnValue) == 0x000015, "Member 'WBP_Achievement_C_ExecuteUbergraph_WBP_Achievement::CallFunc_IsPlaystationBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Achievement_C_ExecuteUbergraph_WBP_Achievement, CallFunc_SelectText_ReturnValue) == 0x000018, "Member 'WBP_Achievement_C_ExecuteUbergraph_WBP_Achievement::CallFunc_SelectText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Achievement_C_ExecuteUbergraph_WBP_Achievement, CallFunc_SelectText_ReturnValue_1) == 0x000028, "Member 'WBP_Achievement_C_ExecuteUbergraph_WBP_Achievement::CallFunc_SelectText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Achievement_C_ExecuteUbergraph_WBP_Achievement, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'WBP_Achievement_C_ExecuteUbergraph_WBP_Achievement::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Achievement_C_ExecuteUbergraph_WBP_Achievement, CallFunc_PlayUMGAnimation_ReturnValue) == 0x000048, "Member 'WBP_Achievement_C_ExecuteUbergraph_WBP_Achievement::CallFunc_PlayUMGAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Achievement_C_ExecuteUbergraph_WBP_Achievement, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'WBP_Achievement_C_ExecuteUbergraph_WBP_Achievement::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Achievement_C_ExecuteUbergraph_WBP_Achievement, CallFunc_PlayUMGAnimation_ReturnValue_1) == 0x000058, "Member 'WBP_Achievement_C_ExecuteUbergraph_WBP_Achievement::CallFunc_PlayUMGAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Achievement_C_ExecuteUbergraph_WBP_Achievement, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'WBP_Achievement_C_ExecuteUbergraph_WBP_Achievement::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_Achievement.WBP_Achievement_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_Achievement_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Achievement_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Achievement_C_OnFocusReceived");
static_assert(sizeof(WBP_Achievement_C_OnFocusReceived) == 0x0001B8, "Wrong size on WBP_Achievement_C_OnFocusReceived");
static_assert(offsetof(WBP_Achievement_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Achievement_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Achievement_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Achievement_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Achievement_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Achievement_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Achievement_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Achievement_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Achievement_C_OnFocusReceived, CallFunc_GetChildAt_ReturnValue) == 0x0001B0, "Member 'WBP_Achievement_C_OnFocusReceived::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");

// Function WBP_Achievement.WBP_Achievement_C.OnPressCancel
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Achievement_C_OnPressCancel final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Achievement_C_OnPressCancel) == 0x000008, "Wrong alignment on WBP_Achievement_C_OnPressCancel");
static_assert(sizeof(WBP_Achievement_C_OnPressCancel) == 0x0001B0, "Wrong size on WBP_Achievement_C_OnPressCancel");
static_assert(offsetof(WBP_Achievement_C_OnPressCancel, KeyEvent) == 0x000000, "Member 'WBP_Achievement_C_OnPressCancel::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Achievement_C_OnPressCancel, ReturnValue) == 0x000040, "Member 'WBP_Achievement_C_OnPressCancel::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Achievement_C_OnPressCancel, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Achievement_C_OnPressCancel::CallFunc_Handled_ReturnValue' has a wrong offset!");

}

