#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugMenu_ItemList

#include "Basic.hpp"

#include "Zion_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_DebugMenu_ItemList.WBP_DebugMenu_ItemList_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_DebugMenu_ItemList_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_ItemList_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_DebugMenu_ItemList_C_OnFocusReceived");
static_assert(sizeof(WBP_DebugMenu_ItemList_C_OnFocusReceived) == 0x0001B8, "Wrong size on WBP_DebugMenu_ItemList_C_OnFocusReceived");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_DebugMenu_ItemList_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_DebugMenu_ItemList_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_DebugMenu_ItemList_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_DebugMenu_ItemList_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_OnFocusReceived, CallFunc_GetChildAt_ReturnValue) == 0x0001B0, "Member 'WBP_DebugMenu_ItemList_C_OnFocusReceived::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");

// Function WBP_DebugMenu_ItemList.WBP_DebugMenu_ItemList_C.OnButtonPressed
// 0x0008 (0x0008 - 0x0000)
struct WBP_DebugMenu_ItemList_C_OnButtonPressed final
{
public:
	class UWBP_DebugMenu_Element_ItemButton_C*    ItemButton;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_ItemList_C_OnButtonPressed) == 0x000008, "Wrong alignment on WBP_DebugMenu_ItemList_C_OnButtonPressed");
static_assert(sizeof(WBP_DebugMenu_ItemList_C_OnButtonPressed) == 0x000008, "Wrong size on WBP_DebugMenu_ItemList_C_OnButtonPressed");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_OnButtonPressed, ItemButton) == 0x000000, "Member 'WBP_DebugMenu_ItemList_C_OnButtonPressed::ItemButton' has a wrong offset!");

// Function WBP_DebugMenu_ItemList.WBP_DebugMenu_ItemList_C.GenerateLabel
// 0x0250 (0x0250 - 0x0000)
struct WBP_DebugMenu_ItemList_C_GenerateLabel final
{
public:
	struct FInventoryItemData                     InventoryItemData;                                 // 0x0000(0x0168)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   Result;                                            // 0x0168(0x0010)(Parm, OutParm)
	bool                                          Temp_bool_Variable;                                // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0180(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01D8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0220(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0230(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x0240(0x0010)()
};
static_assert(alignof(WBP_DebugMenu_ItemList_C_GenerateLabel) == 0x000008, "Wrong alignment on WBP_DebugMenu_ItemList_C_GenerateLabel");
static_assert(sizeof(WBP_DebugMenu_ItemList_C_GenerateLabel) == 0x000250, "Wrong size on WBP_DebugMenu_ItemList_C_GenerateLabel");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_GenerateLabel, InventoryItemData) == 0x000000, "Member 'WBP_DebugMenu_ItemList_C_GenerateLabel::InventoryItemData' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_GenerateLabel, Result) == 0x000168, "Member 'WBP_DebugMenu_ItemList_C_GenerateLabel::Result' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_GenerateLabel, Temp_bool_Variable) == 0x000178, "Member 'WBP_DebugMenu_ItemList_C_GenerateLabel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_GenerateLabel, K2Node_MakeStruct_FormatArgumentData) == 0x000180, "Member 'WBP_DebugMenu_ItemList_C_GenerateLabel::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_GenerateLabel, CallFunc_Greater_IntInt_ReturnValue) == 0x0001C8, "Member 'WBP_DebugMenu_ItemList_C_GenerateLabel::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_GenerateLabel, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0001D0, "Member 'WBP_DebugMenu_ItemList_C_GenerateLabel::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_GenerateLabel, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001D8, "Member 'WBP_DebugMenu_ItemList_C_GenerateLabel::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_GenerateLabel, K2Node_MakeArray_Array) == 0x000220, "Member 'WBP_DebugMenu_ItemList_C_GenerateLabel::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_GenerateLabel, CallFunc_Format_ReturnValue) == 0x000230, "Member 'WBP_DebugMenu_ItemList_C_GenerateLabel::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_GenerateLabel, K2Node_Select_Default) == 0x000240, "Member 'WBP_DebugMenu_ItemList_C_GenerateLabel::K2Node_Select_Default' has a wrong offset!");

// Function WBP_DebugMenu_ItemList.WBP_DebugMenu_ItemList_C.ExecuteUbergraph_WBP_DebugMenu_ItemList
// 0x0208 (0x0208 - 0x0000)
struct WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_DebugMenu_Element_ItemButton_C*    K2Node_CustomEvent_ItemButton;                     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0020(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0040(0x0010)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInventoryItemData                     CallFunc_GetInventoryItemData_out_ItemData;        // 0x0058(0x0168)()
	bool                                          CallFunc_GetInventoryItemData_ReturnValue;         // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GenerateLabel_Result;                     // 0x01C8(0x0010)()
	TDelegate<void(class UWBP_DebugMenu_Element_ItemButton_C* ItemButton)> K2Node_CreateDelegate_OutputDelegate; // 0x01D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_ItemButton_C*    CallFunc_Create_ReturnValue;                       // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddItem_ReturnValue;                      // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList) == 0x000008, "Wrong alignment on WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList");
static_assert(sizeof(WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList) == 0x000208, "Wrong size on WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList, EntryPoint) == 0x000000, "Member 'WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList, K2Node_CustomEvent_ItemButton) == 0x000008, "Member 'WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList::K2Node_CustomEvent_ItemButton' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000020, "Member 'WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList, K2Node_MakeStruct_DataTableRowHandle) == 0x000040, "Member 'WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList, CallFunc_GetInventoryItemData_out_ItemData) == 0x000058, "Member 'WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList::CallFunc_GetInventoryItemData_out_ItemData' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList, CallFunc_GetInventoryItemData_ReturnValue) == 0x0001C0, "Member 'WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList::CallFunc_GetInventoryItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList, CallFunc_GenerateLabel_Result) == 0x0001C8, "Member 'WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList::CallFunc_GenerateLabel_Result' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList, K2Node_CreateDelegate_OutputDelegate) == 0x0001D8, "Member 'WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList, CallFunc_Create_ReturnValue) == 0x0001E8, "Member 'WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList, CallFunc_AddChild_ReturnValue) == 0x0001F0, "Member 'WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList, CallFunc_Get_ReturnValue) == 0x0001F8, "Member 'WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList, CallFunc_AddItem_ReturnValue) == 0x000200, "Member 'WBP_DebugMenu_ItemList_C_ExecuteUbergraph_WBP_DebugMenu_ItemList::CallFunc_AddItem_ReturnValue' has a wrong offset!");

}

