#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugMenu_Page_Map

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_DebugMenu_Page_Map.WBP_DebugMenu_Page_Map_C.ExecuteUbergraph_WBP_DebugMenu_Page_Map
// 0x0088 (0x0088 - 0x0000)
struct WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Map_C*                             CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Map_C*                             CallFunc_Create_ReturnValue_1;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDelayFrameAsyncAction*                 CallFunc_DelayFrame_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue_1;                        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFogOfWarComponent*                     CallFunc_GetComponentByClass_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFogOfWarComponent*                     CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDelayFrameAsyncAction*                 CallFunc_DelayFrame_ReturnValue_1;                 // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map) == 0x000008, "Wrong alignment on WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map");
static_assert(sizeof(WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map) == 0x000088, "Wrong size on WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map");
static_assert(offsetof(WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map, EntryPoint) == 0x000000, "Member 'WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map, CallFunc_Create_ReturnValue_1) == 0x000010, "Member 'WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map, CallFunc_DelayFrame_ReturnValue) == 0x000028, "Member 'WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map::CallFunc_DelayFrame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map, CallFunc_Get_ReturnValue) == 0x000038, "Member 'WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map, CallFunc_Get_ReturnValue_1) == 0x000040, "Member 'WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map, CallFunc_IsValid_ReturnValue_2) == 0x000049, "Member 'WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map, CallFunc_GetComponentByClass_ReturnValue) == 0x000050, "Member 'WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000058, "Member 'WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map, CallFunc_IsValid_ReturnValue_3) == 0x000060, "Member 'WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map, CallFunc_IsValid_ReturnValue_4) == 0x000061, "Member 'WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map, CallFunc_DelayFrame_ReturnValue_1) == 0x000068, "Member 'WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map::CallFunc_DelayFrame_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map, CallFunc_IsValid_ReturnValue_5) == 0x000070, "Member 'WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map, K2Node_CreateDelegate_OutputDelegate_1) == 0x000074, "Member 'WBP_DebugMenu_Page_Map_C_ExecuteUbergraph_WBP_DebugMenu_Page_Map::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WBP_DebugMenu_Page_Map.WBP_DebugMenu_Page_Map_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_DebugMenu_Page_Map_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Page_Map_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_DebugMenu_Page_Map_C_OnFocusReceived");
static_assert(sizeof(WBP_DebugMenu_Page_Map_C_OnFocusReceived) == 0x0001B8, "Wrong size on WBP_DebugMenu_Page_Map_C_OnFocusReceived");
static_assert(offsetof(WBP_DebugMenu_Page_Map_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_DebugMenu_Page_Map_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Map_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_DebugMenu_Page_Map_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Map_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_DebugMenu_Page_Map_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Map_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_DebugMenu_Page_Map_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Page_Map_C_OnFocusReceived, CallFunc_GetChildAt_ReturnValue) == 0x0001B0, "Member 'WBP_DebugMenu_Page_Map_C_OnFocusReceived::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");

}

