#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ChoiceMarker_Entry

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_ChoiceMarker_Entry.WBP_ChoiceMarker_Entry_C.SetSelected
// 0x0005 (0x0005 - 0x0000)
struct WBP_ChoiceMarker_Entry_C_SetSelected final
{
public:
	bool                                          bSelected;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ChoiceMarker_Entry_C_SetSelected) == 0x000001, "Wrong alignment on WBP_ChoiceMarker_Entry_C_SetSelected");
static_assert(sizeof(WBP_ChoiceMarker_Entry_C_SetSelected) == 0x000005, "Wrong size on WBP_ChoiceMarker_Entry_C_SetSelected");
static_assert(offsetof(WBP_ChoiceMarker_Entry_C_SetSelected, bSelected) == 0x000000, "Member 'WBP_ChoiceMarker_Entry_C_SetSelected::bSelected' has a wrong offset!");
static_assert(offsetof(WBP_ChoiceMarker_Entry_C_SetSelected, Temp_bool_Variable) == 0x000001, "Member 'WBP_ChoiceMarker_Entry_C_SetSelected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ChoiceMarker_Entry_C_SetSelected, Temp_byte_Variable) == 0x000002, "Member 'WBP_ChoiceMarker_Entry_C_SetSelected::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ChoiceMarker_Entry_C_SetSelected, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_ChoiceMarker_Entry_C_SetSelected::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ChoiceMarker_Entry_C_SetSelected, K2Node_Select_Default) == 0x000004, "Member 'WBP_ChoiceMarker_Entry_C_SetSelected::K2Node_Select_Default' has a wrong offset!");

}

