#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Footer_Entry

#include "Basic.hpp"

#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function WBP_Footer_Entry.WBP_Footer_Entry_C.ExecuteUbergraph_WBP_Footer_Entry
// 0x0040 (0x0040 - 0x0000)
struct WBP_Footer_Entry_C_ExecuteUbergraph_WBP_Footer_Entry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0010)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRichTextInputElement>          K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ConstParm, ReferenceParm)
	TArray<class FString>                         Temp_string_Variable;                              // 0x0030(0x0010)(ConstParm, ReferenceParm)
};
static_assert(alignof(WBP_Footer_Entry_C_ExecuteUbergraph_WBP_Footer_Entry) == 0x000008, "Wrong alignment on WBP_Footer_Entry_C_ExecuteUbergraph_WBP_Footer_Entry");
static_assert(sizeof(WBP_Footer_Entry_C_ExecuteUbergraph_WBP_Footer_Entry) == 0x000040, "Wrong size on WBP_Footer_Entry_C_ExecuteUbergraph_WBP_Footer_Entry");
static_assert(offsetof(WBP_Footer_Entry_C_ExecuteUbergraph_WBP_Footer_Entry, EntryPoint) == 0x000000, "Member 'WBP_Footer_Entry_C_ExecuteUbergraph_WBP_Footer_Entry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Footer_Entry_C_ExecuteUbergraph_WBP_Footer_Entry, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'WBP_Footer_Entry_C_ExecuteUbergraph_WBP_Footer_Entry::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Footer_Entry_C_ExecuteUbergraph_WBP_Footer_Entry, K2Node_Event_IsDesignTime) == 0x000018, "Member 'WBP_Footer_Entry_C_ExecuteUbergraph_WBP_Footer_Entry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Footer_Entry_C_ExecuteUbergraph_WBP_Footer_Entry, K2Node_MakeArray_Array) == 0x000020, "Member 'WBP_Footer_Entry_C_ExecuteUbergraph_WBP_Footer_Entry::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Footer_Entry_C_ExecuteUbergraph_WBP_Footer_Entry, Temp_string_Variable) == 0x000030, "Member 'WBP_Footer_Entry_C_ExecuteUbergraph_WBP_Footer_Entry::Temp_string_Variable' has a wrong offset!");

// Function WBP_Footer_Entry.WBP_Footer_Entry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Footer_Entry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Footer_Entry_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Footer_Entry_C_PreConstruct");
static_assert(sizeof(WBP_Footer_Entry_C_PreConstruct) == 0x000001, "Wrong size on WBP_Footer_Entry_C_PreConstruct");
static_assert(offsetof(WBP_Footer_Entry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Footer_Entry_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

