#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_Page_Language

#include "Basic.hpp"

#include "WBP_Settings_Page_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Settings_Page_Language.WBP_Settings_Page_Language_C
// 0x0098 (0x0518 - 0x0480)
class UWBP_Settings_Page_Language_C final : public UWBP_Settings_Page_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Settings_Entry_Choice_Text_C*      WBP_Settings_Entry_Choice_Text_LanguageText;       // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_Entry_Choice_Text_C*      WBP_Settings_Entry_Choice_Text_LanguageVoice;      // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FString>                         Languages;                                         // 0x0498(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, AdvancedDisplay)
	int32                                         CurrLanguageIndex;                                 // 0x04A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_4AC[0x4];                                      // 0x04AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         VoiceLanguages;                                    // 0x04B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	TMap<class FString, class FText>              VoiceLanguageTexts;                                // 0x04C0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly)
	int32                                         CurrVoiceIndex;                                    // 0x0510(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void ApplyVoiceSettings();
	void BndEvt__WBP_Settings_Page_Language_WBP_Settings_Entry_Choice_Text_LanguageText_K2Node_ComponentBoundEvent_0_OnLeft__DelegateSignature();
	void BndEvt__WBP_Settings_Page_Language_WBP_Settings_Entry_Choice_Text_LanguageText_K2Node_ComponentBoundEvent_1_OnRight__DelegateSignature();
	void BndEvt__WBP_Settings_Page_Language_WBP_Settings_Entry_Choice_Text_LanguageVoice_K2Node_ComponentBoundEvent_2_OnLeft__DelegateSignature();
	void BndEvt__WBP_Settings_Page_Language_WBP_Settings_Entry_Choice_Text_LanguageVoice_K2Node_ComponentBoundEvent_3_OnRight__DelegateSignature();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_Settings_Page_Language(int32 EntryPoint);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void RefreshText();
	void SetLanguageFromIndex(int32 Index_0);
	void SetVoiceFromIndex(int32 Index_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Settings_Page_Language_C">();
	}
	static class UWBP_Settings_Page_Language_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Settings_Page_Language_C>();
	}
};
static_assert(alignof(UWBP_Settings_Page_Language_C) == 0x000008, "Wrong alignment on UWBP_Settings_Page_Language_C");
static_assert(sizeof(UWBP_Settings_Page_Language_C) == 0x000518, "Wrong size on UWBP_Settings_Page_Language_C");
static_assert(offsetof(UWBP_Settings_Page_Language_C, UberGraphFrame) == 0x000480, "Member 'UWBP_Settings_Page_Language_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Page_Language_C, WBP_Settings_Entry_Choice_Text_LanguageText) == 0x000488, "Member 'UWBP_Settings_Page_Language_C::WBP_Settings_Entry_Choice_Text_LanguageText' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Page_Language_C, WBP_Settings_Entry_Choice_Text_LanguageVoice) == 0x000490, "Member 'UWBP_Settings_Page_Language_C::WBP_Settings_Entry_Choice_Text_LanguageVoice' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Page_Language_C, Languages) == 0x000498, "Member 'UWBP_Settings_Page_Language_C::Languages' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Page_Language_C, CurrLanguageIndex) == 0x0004A8, "Member 'UWBP_Settings_Page_Language_C::CurrLanguageIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Page_Language_C, VoiceLanguages) == 0x0004B0, "Member 'UWBP_Settings_Page_Language_C::VoiceLanguages' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Page_Language_C, VoiceLanguageTexts) == 0x0004C0, "Member 'UWBP_Settings_Page_Language_C::VoiceLanguageTexts' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Page_Language_C, CurrVoiceIndex) == 0x000510, "Member 'UWBP_Settings_Page_Language_C::CurrVoiceIndex' has a wrong offset!");

}

