#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Button_Tab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Button_Tab.WBP_Button_Tab_C
// 0x0078 (0x04D8 - 0x0460)
class UWBP_Button_Tab_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hovered;                                           // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             ButtonText;                                        // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_HoveredContainer;                          // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_SelectedContainer;                         // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectedImage;                                     // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const struct FKeyEvent& KeyEvent, class UWBP_Button_Tab_C* PressedButtonTab)> OnPressed; // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         WidthOverride;                                     // 0x04B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B4[0x4];                                      // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x04B8(0x0010)(Edit, BlueprintVisible)
	class UPaperSprite*                           Sprite;                                            // 0x04C8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Payload;                                           // 0x04D0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Button_Tab(int32 EntryPoint);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	struct FEventReply OnPressConfirm(const struct FKeyEvent& KeyEvent);
	void PreConstruct(bool IsDesignTime);
	void SetHoveredState(bool bHovered);
	void SetIcon();
	void SetSelected(bool Selected);
	void SetText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Button_Tab_C">();
	}
	static class UWBP_Button_Tab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Button_Tab_C>();
	}
};
static_assert(alignof(UWBP_Button_Tab_C) == 0x000008, "Wrong alignment on UWBP_Button_Tab_C");
static_assert(sizeof(UWBP_Button_Tab_C) == 0x0004D8, "Wrong size on UWBP_Button_Tab_C");
static_assert(offsetof(UWBP_Button_Tab_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Button_Tab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Button_Tab_C, Hovered) == 0x000468, "Member 'UWBP_Button_Tab_C::Hovered' has a wrong offset!");
static_assert(offsetof(UWBP_Button_Tab_C, ButtonText) == 0x000470, "Member 'UWBP_Button_Tab_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_Button_Tab_C, Icon) == 0x000478, "Member 'UWBP_Button_Tab_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_Button_Tab_C, Overlay_HoveredContainer) == 0x000480, "Member 'UWBP_Button_Tab_C::Overlay_HoveredContainer' has a wrong offset!");
static_assert(offsetof(UWBP_Button_Tab_C, Overlay_SelectedContainer) == 0x000488, "Member 'UWBP_Button_Tab_C::Overlay_SelectedContainer' has a wrong offset!");
static_assert(offsetof(UWBP_Button_Tab_C, SelectedImage) == 0x000490, "Member 'UWBP_Button_Tab_C::SelectedImage' has a wrong offset!");
static_assert(offsetof(UWBP_Button_Tab_C, SizeBox_0) == 0x000498, "Member 'UWBP_Button_Tab_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Button_Tab_C, OnPressed) == 0x0004A0, "Member 'UWBP_Button_Tab_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UWBP_Button_Tab_C, WidthOverride) == 0x0004B0, "Member 'UWBP_Button_Tab_C::WidthOverride' has a wrong offset!");
static_assert(offsetof(UWBP_Button_Tab_C, Text) == 0x0004B8, "Member 'UWBP_Button_Tab_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_Button_Tab_C, Sprite) == 0x0004C8, "Member 'UWBP_Button_Tab_C::Sprite' has a wrong offset!");
static_assert(offsetof(UWBP_Button_Tab_C, Payload) == 0x0004D0, "Member 'UWBP_Button_Tab_C::Payload' has a wrong offset!");

}

