#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Footer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Footer.WBP_Footer_C
// 0x0030 (0x0490 - 0x0460)
class UWBP_Footer_C final : public UUserWidgetFooter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalBox_Container;                           // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FFooterData>                    DefaultFooterEntries;                              // 0x0470(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	TArray<class UWBP_Footer_Entry_C*>            TemporaryEntries;                                  // 0x0480(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay)

public:
	void Add_EntriesInternal(const TArray<struct FFooterData>& FooterDataArray, bool Temporary);
	void AddEntries(const TArray<struct FFooterData>& FooterDataList, bool bTemporary);
	void AddEntry(const struct FFooterData& FooterData, bool bTemporary);
	void AddEntryInternal(const struct FFooterData& FooterData, bool Temporary);
	void ClearAllEntries();
	void ClearEntries(bool bTemporaryOnly);
	void ClearTemporaryEntries();
	void ExecuteUbergraph_WBP_Footer(int32 EntryPoint);
	void InitializeWithEntries(const TArray<struct FFooterData>& FooterDataArray);
	void PreConstruct(bool IsDesignTime);
	void SetEntriesVisible(bool bVisible);
	void Setup(const TArray<struct FFooterData>& FooterDataList);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Footer_C">();
	}
	static class UWBP_Footer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Footer_C>();
	}
};
static_assert(alignof(UWBP_Footer_C) == 0x000008, "Wrong alignment on UWBP_Footer_C");
static_assert(sizeof(UWBP_Footer_C) == 0x000490, "Wrong size on UWBP_Footer_C");
static_assert(offsetof(UWBP_Footer_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Footer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Footer_C, HorizontalBox_Container) == 0x000468, "Member 'UWBP_Footer_C::HorizontalBox_Container' has a wrong offset!");
static_assert(offsetof(UWBP_Footer_C, DefaultFooterEntries) == 0x000470, "Member 'UWBP_Footer_C::DefaultFooterEntries' has a wrong offset!");
static_assert(offsetof(UWBP_Footer_C, TemporaryEntries) == 0x000480, "Member 'UWBP_Footer_C::TemporaryEntries' has a wrong offset!");

}

