#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Recollection_BossRush_BossProgression

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Recollection_BossRush_BossProgression.WBP_Recollection_BossRush_BossProgression_C.ExecuteUbergraph_WBP_Recollection_BossRush_BossProgression
// 0x0018 (0x0018 - 0x0000)
struct WBP_Recollection_BossRush_BossProgression_C_ExecuteUbergraph_WBP_Recollection_BossRush_BossProgression final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_Recollection_BossRush_BossProgression_Entry_C*> K2Node_MakeArray_Array;        // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_Recollection_BossRush_BossProgression_C_ExecuteUbergraph_WBP_Recollection_BossRush_BossProgression) == 0x000008, "Wrong alignment on WBP_Recollection_BossRush_BossProgression_C_ExecuteUbergraph_WBP_Recollection_BossRush_BossProgression");
static_assert(sizeof(WBP_Recollection_BossRush_BossProgression_C_ExecuteUbergraph_WBP_Recollection_BossRush_BossProgression) == 0x000018, "Wrong size on WBP_Recollection_BossRush_BossProgression_C_ExecuteUbergraph_WBP_Recollection_BossRush_BossProgression");
static_assert(offsetof(WBP_Recollection_BossRush_BossProgression_C_ExecuteUbergraph_WBP_Recollection_BossRush_BossProgression, EntryPoint) == 0x000000, "Member 'WBP_Recollection_BossRush_BossProgression_C_ExecuteUbergraph_WBP_Recollection_BossRush_BossProgression::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_BossProgression_C_ExecuteUbergraph_WBP_Recollection_BossRush_BossProgression, K2Node_MakeArray_Array) == 0x000008, "Member 'WBP_Recollection_BossRush_BossProgression_C_ExecuteUbergraph_WBP_Recollection_BossRush_BossProgression::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_Recollection_BossRush_BossProgression.WBP_Recollection_BossRush_BossProgression_C.ResetEntries
// 0x0020 (0x0020 - 0x0000)
struct WBP_Recollection_BossRush_BossProgression_C_ResetEntries final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Recollection_BossRush_BossProgression_Entry_C* CallFunc_Array_Get_Item;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_BossRush_BossProgression_C_ResetEntries) == 0x000008, "Wrong alignment on WBP_Recollection_BossRush_BossProgression_C_ResetEntries");
static_assert(sizeof(WBP_Recollection_BossRush_BossProgression_C_ResetEntries) == 0x000020, "Wrong size on WBP_Recollection_BossRush_BossProgression_C_ResetEntries");
static_assert(offsetof(WBP_Recollection_BossRush_BossProgression_C_ResetEntries, Temp_int_Variable) == 0x000000, "Member 'WBP_Recollection_BossRush_BossProgression_C_ResetEntries::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_BossProgression_C_ResetEntries, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'WBP_Recollection_BossRush_BossProgression_C_ResetEntries::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_BossProgression_C_ResetEntries, CallFunc_Array_Get_Item) == 0x000008, "Member 'WBP_Recollection_BossRush_BossProgression_C_ResetEntries::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_BossProgression_C_ResetEntries, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'WBP_Recollection_BossRush_BossProgression_C_ResetEntries::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_BossProgression_C_ResetEntries, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000014, "Member 'WBP_Recollection_BossRush_BossProgression_C_ResetEntries::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_BossProgression_C_ResetEntries, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Recollection_BossRush_BossProgression_C_ResetEntries::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Recollection_BossRush_BossProgression.WBP_Recollection_BossRush_BossProgression_C.SetActiveEntry
// 0x0010 (0x0010 - 0x0000)
struct WBP_Recollection_BossRush_BossProgression_C_SetActiveEntry final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Recollection_BossRush_BossProgression_Entry_C* CallFunc_Array_Get_Item;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_BossRush_BossProgression_C_SetActiveEntry) == 0x000008, "Wrong alignment on WBP_Recollection_BossRush_BossProgression_C_SetActiveEntry");
static_assert(sizeof(WBP_Recollection_BossRush_BossProgression_C_SetActiveEntry) == 0x000010, "Wrong size on WBP_Recollection_BossRush_BossProgression_C_SetActiveEntry");
static_assert(offsetof(WBP_Recollection_BossRush_BossProgression_C_SetActiveEntry, Index_0) == 0x000000, "Member 'WBP_Recollection_BossRush_BossProgression_C_SetActiveEntry::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_BossProgression_C_SetActiveEntry, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000004, "Member 'WBP_Recollection_BossRush_BossProgression_C_SetActiveEntry::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_BossProgression_C_SetActiveEntry, CallFunc_Array_Get_Item) == 0x000008, "Member 'WBP_Recollection_BossRush_BossProgression_C_SetActiveEntry::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_Recollection_BossRush_BossProgression.WBP_Recollection_BossRush_BossProgression_C.SetBossesDefeatedCount
// 0x0014 (0x0014 - 0x0000)
struct WBP_Recollection_BossRush_BossProgression_C_SetBossesDefeatedCount final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_BossRush_BossProgression_C_SetBossesDefeatedCount) == 0x000004, "Wrong alignment on WBP_Recollection_BossRush_BossProgression_C_SetBossesDefeatedCount");
static_assert(sizeof(WBP_Recollection_BossRush_BossProgression_C_SetBossesDefeatedCount) == 0x000014, "Wrong size on WBP_Recollection_BossRush_BossProgression_C_SetBossesDefeatedCount");
static_assert(offsetof(WBP_Recollection_BossRush_BossProgression_C_SetBossesDefeatedCount, Count) == 0x000000, "Member 'WBP_Recollection_BossRush_BossProgression_C_SetBossesDefeatedCount::Count' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_BossProgression_C_SetBossesDefeatedCount, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'WBP_Recollection_BossRush_BossProgression_C_SetBossesDefeatedCount::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_BossProgression_C_SetBossesDefeatedCount, Temp_int_Variable) == 0x000008, "Member 'WBP_Recollection_BossRush_BossProgression_C_SetBossesDefeatedCount::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_BossProgression_C_SetBossesDefeatedCount, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_Recollection_BossRush_BossProgression_C_SetBossesDefeatedCount::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_BossProgression_C_SetBossesDefeatedCount, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000010, "Member 'WBP_Recollection_BossRush_BossProgression_C_SetBossesDefeatedCount::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Recollection_BossRush_BossProgression.WBP_Recollection_BossRush_BossProgression_C.SetDefeatedEntry
// 0x0010 (0x0010 - 0x0000)
struct WBP_Recollection_BossRush_BossProgression_C_SetDefeatedEntry final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Recollection_BossRush_BossProgression_Entry_C* CallFunc_Array_Get_Item;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_BossRush_BossProgression_C_SetDefeatedEntry) == 0x000008, "Wrong alignment on WBP_Recollection_BossRush_BossProgression_C_SetDefeatedEntry");
static_assert(sizeof(WBP_Recollection_BossRush_BossProgression_C_SetDefeatedEntry) == 0x000010, "Wrong size on WBP_Recollection_BossRush_BossProgression_C_SetDefeatedEntry");
static_assert(offsetof(WBP_Recollection_BossRush_BossProgression_C_SetDefeatedEntry, Index_0) == 0x000000, "Member 'WBP_Recollection_BossRush_BossProgression_C_SetDefeatedEntry::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_BossProgression_C_SetDefeatedEntry, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000004, "Member 'WBP_Recollection_BossRush_BossProgression_C_SetDefeatedEntry::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_BossProgression_C_SetDefeatedEntry, CallFunc_Array_Get_Item) == 0x000008, "Member 'WBP_Recollection_BossRush_BossProgression_C_SetDefeatedEntry::CallFunc_Array_Get_Item' has a wrong offset!");

}

