#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Extra

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Extra.WBP_Extra_C.ExecuteUbergraph_WBP_Extra
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_Extra_C_ExecuteUbergraph_WBP_Extra final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSubsystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue_1;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyEvent                              K2Node_CustomEvent_KeyEvent;                       // 0x0038(0x0040)()
	class UWBP_GameMenu_Tab_C*                    K2Node_CustomEvent_PressedButtonTab;               // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue_1;              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_C_ExecuteUbergraph_WBP_Extra) == 0x000008, "Wrong alignment on WBP_Extra_C_ExecuteUbergraph_WBP_Extra");
static_assert(sizeof(WBP_Extra_C_ExecuteUbergraph_WBP_Extra) == 0x0000A8, "Wrong size on WBP_Extra_C_ExecuteUbergraph_WBP_Extra");
static_assert(offsetof(WBP_Extra_C_ExecuteUbergraph_WBP_Extra, EntryPoint) == 0x000000, "Member 'WBP_Extra_C_ExecuteUbergraph_WBP_Extra::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_ExecuteUbergraph_WBP_Extra, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Extra_C_ExecuteUbergraph_WBP_Extra::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_ExecuteUbergraph_WBP_Extra, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'WBP_Extra_C_ExecuteUbergraph_WBP_Extra::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_ExecuteUbergraph_WBP_Extra, CallFunc_PlayUMGAnimation_ReturnValue) == 0x000020, "Member 'WBP_Extra_C_ExecuteUbergraph_WBP_Extra::CallFunc_PlayUMGAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_ExecuteUbergraph_WBP_Extra, CallFunc_PlayUMGAnimation_ReturnValue_1) == 0x000028, "Member 'WBP_Extra_C_ExecuteUbergraph_WBP_Extra::CallFunc_PlayUMGAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_ExecuteUbergraph_WBP_Extra, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_Extra_C_ExecuteUbergraph_WBP_Extra::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_ExecuteUbergraph_WBP_Extra, CallFunc_IsValid_ReturnValue_1) == 0x000031, "Member 'WBP_Extra_C_ExecuteUbergraph_WBP_Extra::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_ExecuteUbergraph_WBP_Extra, K2Node_CustomEvent_KeyEvent) == 0x000038, "Member 'WBP_Extra_C_ExecuteUbergraph_WBP_Extra::K2Node_CustomEvent_KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_ExecuteUbergraph_WBP_Extra, K2Node_CustomEvent_PressedButtonTab) == 0x000078, "Member 'WBP_Extra_C_ExecuteUbergraph_WBP_Extra::K2Node_CustomEvent_PressedButtonTab' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_ExecuteUbergraph_WBP_Extra, CallFunc_SetGamePaused_ReturnValue) == 0x000080, "Member 'WBP_Extra_C_ExecuteUbergraph_WBP_Extra::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_ExecuteUbergraph_WBP_Extra, CallFunc_Array_Find_ReturnValue) == 0x000084, "Member 'WBP_Extra_C_ExecuteUbergraph_WBP_Extra::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_ExecuteUbergraph_WBP_Extra, CallFunc_SetGamePaused_ReturnValue_1) == 0x000088, "Member 'WBP_Extra_C_ExecuteUbergraph_WBP_Extra::CallFunc_SetGamePaused_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_ExecuteUbergraph_WBP_Extra, K2Node_CreateDelegate_OutputDelegate_1) == 0x00008C, "Member 'WBP_Extra_C_ExecuteUbergraph_WBP_Extra::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_ExecuteUbergraph_WBP_Extra, CallFunc_Get_ReturnValue) == 0x0000A0, "Member 'WBP_Extra_C_ExecuteUbergraph_WBP_Extra::CallFunc_Get_ReturnValue' has a wrong offset!");

// Function WBP_Extra.WBP_Extra_C.GoToPage
// 0x0048 (0x0048 - 0x0000)
struct WBP_Extra_C_GoToPage final
{
public:
	int32                                         PageIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSubsystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidgetFooter*                      CallFunc_GetActiveFooter_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GameMenu_Tab_C*                    CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_C_GoToPage) == 0x000008, "Wrong alignment on WBP_Extra_C_GoToPage");
static_assert(sizeof(WBP_Extra_C_GoToPage) == 0x000048, "Wrong size on WBP_Extra_C_GoToPage");
static_assert(offsetof(WBP_Extra_C_GoToPage, PageIndex) == 0x000000, "Member 'WBP_Extra_C_GoToPage::PageIndex' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_GoToPage, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_Extra_C_GoToPage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_GoToPage, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_Extra_C_GoToPage::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_GoToPage, CallFunc_GetActiveFooter_ReturnValue) == 0x000010, "Member 'WBP_Extra_C_GoToPage::CallFunc_GetActiveFooter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_GoToPage, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'WBP_Extra_C_GoToPage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_GoToPage, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_Extra_C_GoToPage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_GoToPage, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_Extra_C_GoToPage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_GoToPage, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000021, "Member 'WBP_Extra_C_GoToPage::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_GoToPage, CallFunc_GetActiveWidget_ReturnValue) == 0x000028, "Member 'WBP_Extra_C_GoToPage::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_GoToPage, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_Extra_C_GoToPage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_GoToPage, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_Extra_C_GoToPage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_GoToPage, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WBP_Extra_C_GoToPage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Extra.WBP_Extra_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_Extra_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Extra_C_OnFocusReceived");
static_assert(sizeof(WBP_Extra_C_OnFocusReceived) == 0x0001B8, "Wrong size on WBP_Extra_C_OnFocusReceived");
static_assert(offsetof(WBP_Extra_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Extra_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Extra_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Extra_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Extra_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_OnFocusReceived, CallFunc_GetActiveWidget_ReturnValue) == 0x0001B0, "Member 'WBP_Extra_C_OnFocusReceived::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");

// Function WBP_Extra.WBP_Extra_C.OnPressCancel
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Extra_C_OnPressCancel final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Extra_C_OnPressCancel) == 0x000008, "Wrong alignment on WBP_Extra_C_OnPressCancel");
static_assert(sizeof(WBP_Extra_C_OnPressCancel) == 0x0001B0, "Wrong size on WBP_Extra_C_OnPressCancel");
static_assert(offsetof(WBP_Extra_C_OnPressCancel, KeyEvent) == 0x000000, "Member 'WBP_Extra_C_OnPressCancel::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_OnPressCancel, ReturnValue) == 0x000040, "Member 'WBP_Extra_C_OnPressCancel::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_OnPressCancel, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Extra_C_OnPressCancel::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Extra.WBP_Extra_C.OnPressNext
// 0x01C8 (0x01C8 - 0x0000)
struct WBP_Extra_C_OnPressNext final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0108(0x00B8)()
	int32                                         CallFunc_LoopAround_ReturnValue;                   // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_C_OnPressNext) == 0x000008, "Wrong alignment on WBP_Extra_C_OnPressNext");
static_assert(sizeof(WBP_Extra_C_OnPressNext) == 0x0001C8, "Wrong size on WBP_Extra_C_OnPressNext");
static_assert(offsetof(WBP_Extra_C_OnPressNext, KeyEvent) == 0x000000, "Member 'WBP_Extra_C_OnPressNext::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_OnPressNext, ReturnValue) == 0x000040, "Member 'WBP_Extra_C_OnPressNext::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_OnPressNext, CallFunc_Array_Length_ReturnValue) == 0x0000F8, "Member 'WBP_Extra_C_OnPressNext::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_OnPressNext, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000FC, "Member 'WBP_Extra_C_OnPressNext::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_OnPressNext, CallFunc_Add_IntInt_ReturnValue) == 0x000100, "Member 'WBP_Extra_C_OnPressNext::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_OnPressNext, CallFunc_Handled_ReturnValue) == 0x000108, "Member 'WBP_Extra_C_OnPressNext::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_OnPressNext, CallFunc_LoopAround_ReturnValue) == 0x0001C0, "Member 'WBP_Extra_C_OnPressNext::CallFunc_LoopAround_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_OnPressNext, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0001C4, "Member 'WBP_Extra_C_OnPressNext::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Extra.WBP_Extra_C.OnPressPrevious
// 0x01C8 (0x01C8 - 0x0000)
struct WBP_Extra_C_OnPressPrevious final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0108(0x00B8)()
	int32                                         CallFunc_LoopAround_ReturnValue;                   // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_C_OnPressPrevious) == 0x000008, "Wrong alignment on WBP_Extra_C_OnPressPrevious");
static_assert(sizeof(WBP_Extra_C_OnPressPrevious) == 0x0001C8, "Wrong size on WBP_Extra_C_OnPressPrevious");
static_assert(offsetof(WBP_Extra_C_OnPressPrevious, KeyEvent) == 0x000000, "Member 'WBP_Extra_C_OnPressPrevious::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_OnPressPrevious, ReturnValue) == 0x000040, "Member 'WBP_Extra_C_OnPressPrevious::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_OnPressPrevious, CallFunc_Array_Length_ReturnValue) == 0x0000F8, "Member 'WBP_Extra_C_OnPressPrevious::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_OnPressPrevious, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000FC, "Member 'WBP_Extra_C_OnPressPrevious::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_OnPressPrevious, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000100, "Member 'WBP_Extra_C_OnPressPrevious::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_OnPressPrevious, CallFunc_Handled_ReturnValue) == 0x000108, "Member 'WBP_Extra_C_OnPressPrevious::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_OnPressPrevious, CallFunc_LoopAround_ReturnValue) == 0x0001C0, "Member 'WBP_Extra_C_OnPressPrevious::CallFunc_LoopAround_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_OnPressPrevious, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0001C4, "Member 'WBP_Extra_C_OnPressPrevious::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Extra.WBP_Extra_C.OnTabPressed
// 0x0048 (0x0048 - 0x0000)
struct WBP_Extra_C_OnTabPressed final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UWBP_GameMenu_Tab_C*                    PressedButtonTab;                                  // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_C_OnTabPressed) == 0x000008, "Wrong alignment on WBP_Extra_C_OnTabPressed");
static_assert(sizeof(WBP_Extra_C_OnTabPressed) == 0x000048, "Wrong size on WBP_Extra_C_OnTabPressed");
static_assert(offsetof(WBP_Extra_C_OnTabPressed, KeyEvent) == 0x000000, "Member 'WBP_Extra_C_OnTabPressed::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_OnTabPressed, PressedButtonTab) == 0x000040, "Member 'WBP_Extra_C_OnTabPressed::PressedButtonTab' has a wrong offset!");

// Function WBP_Extra.WBP_Extra_C.SetupTabsAndPages
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_Extra_C_SetupTabsAndPages final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_GameMenu_Tab_C*                    CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsEarlyAccessBuild_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEarlyAccessBuild_ReturnValue_1;         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_GameMenu_Tab_C*>            K2Node_MakeArray_Array_1;                          // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsEarlyAccessBuild_ReturnValue_2;         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    K2Node_MakeArray_Array_2;                          // 0x0050(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UUserWidget*>                    K2Node_Select_Default;                             // 0x0060(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UWBP_GameMenu_Tab_C*>            K2Node_MakeArray_Array_3;                          // 0x0070(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void(const struct FKeyEvent& KeyEvent, class UWBP_GameMenu_Tab_C* PressedButtonTab)> K2Node_CreateDelegate_OutputDelegate; // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_GameMenu_Tab_C*>            K2Node_Select_Default_1;                           // 0x0090(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_Extra_C_SetupTabsAndPages) == 0x000008, "Wrong alignment on WBP_Extra_C_SetupTabsAndPages");
static_assert(sizeof(WBP_Extra_C_SetupTabsAndPages) == 0x0000A0, "Wrong size on WBP_Extra_C_SetupTabsAndPages");
static_assert(offsetof(WBP_Extra_C_SetupTabsAndPages, Temp_bool_Variable) == 0x000000, "Member 'WBP_Extra_C_SetupTabsAndPages::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_SetupTabsAndPages, Temp_bool_Variable_1) == 0x000001, "Member 'WBP_Extra_C_SetupTabsAndPages::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_C_SetupTabsAndPages, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'WBP_Extra_C_SetupTabsAndPages::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
