#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Dialog_ItemGet

#include "Basic.hpp"

#include "Zion_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Dialog_ItemGet.WBP_Dialog_ItemGet_C.BndEvt__WBP_Dialog_ItemGet_WBP_Button_Generic_OK_1_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_Dialog_ItemGet_C_BndEvt__WBP_Dialog_ItemGet_WBP_Button_Generic_OK_1_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Dialog_ItemGet_C_BndEvt__WBP_Dialog_ItemGet_WBP_Button_Generic_OK_1_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Dialog_ItemGet_C_BndEvt__WBP_Dialog_ItemGet_WBP_Button_Generic_OK_1_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Dialog_ItemGet_C_BndEvt__WBP_Dialog_ItemGet_WBP_Button_Generic_OK_1_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_Dialog_ItemGet_C_BndEvt__WBP_Dialog_ItemGet_WBP_Button_Generic_OK_1_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Dialog_ItemGet_C_BndEvt__WBP_Dialog_ItemGet_WBP_Button_Generic_OK_1_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_Dialog_ItemGet_C_BndEvt__WBP_Dialog_ItemGet_WBP_Button_Generic_OK_1_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_Dialog_ItemGet.WBP_Dialog_ItemGet_C.BndEvt__WBP_Dialog_ItemGet_WBP_Button_Generic_OK_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_Dialog_ItemGet_C_BndEvt__WBP_Dialog_ItemGet_WBP_Button_Generic_OK_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Dialog_ItemGet_C_BndEvt__WBP_Dialog_ItemGet_WBP_Button_Generic_OK_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Dialog_ItemGet_C_BndEvt__WBP_Dialog_ItemGet_WBP_Button_Generic_OK_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Dialog_ItemGet_C_BndEvt__WBP_Dialog_ItemGet_WBP_Button_Generic_OK_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_Dialog_ItemGet_C_BndEvt__WBP_Dialog_ItemGet_WBP_Button_Generic_OK_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Dialog_ItemGet_C_BndEvt__WBP_Dialog_ItemGet_WBP_Button_Generic_OK_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_Dialog_ItemGet_C_BndEvt__WBP_Dialog_ItemGet_WBP_Button_Generic_OK_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_Dialog_ItemGet.WBP_Dialog_ItemGet_C.ExecuteUbergraph_WBP_Dialog_ItemGet
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_Dialog_ItemGet_C_ExecuteUbergraph_WBP_Dialog_ItemGet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_1;             // 0x0030(0x0040)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue_1;           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue_1;              // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83[0x5];                                       // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent;               // 0x0088(0x0040)()
};
static_assert(alignof(WBP_Dialog_ItemGet_C_ExecuteUbergraph_WBP_Dialog_ItemGet) == 0x000008, "Wrong alignment on WBP_Dialog_ItemGet_C_ExecuteUbergraph_WBP_Dialog_ItemGet");
static_assert(sizeof(WBP_Dialog_ItemGet_C_ExecuteUbergraph_WBP_Dialog_ItemGet) == 0x0000C8, "Wrong size on WBP_Dialog_ItemGet_C_ExecuteUbergraph_WBP_Dialog_ItemGet");
static_assert(offsetof(WBP_Dialog_ItemGet_C_ExecuteUbergraph_WBP_Dialog_ItemGet, EntryPoint) == 0x000000, "Member 'WBP_Dialog_ItemGet_C_ExecuteUbergraph_WBP_Dialog_ItemGet::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_ExecuteUbergraph_WBP_Dialog_ItemGet, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Dialog_ItemGet_C_ExecuteUbergraph_WBP_Dialog_ItemGet::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_ExecuteUbergraph_WBP_Dialog_ItemGet, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_Dialog_ItemGet_C_ExecuteUbergraph_WBP_Dialog_ItemGet::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_ExecuteUbergraph_WBP_Dialog_ItemGet, CallFunc_PlayUMGAnimation_ReturnValue) == 0x000028, "Member 'WBP_Dialog_ItemGet_C_ExecuteUbergraph_WBP_Dialog_ItemGet::CallFunc_PlayUMGAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_ExecuteUbergraph_WBP_Dialog_ItemGet, K2Node_ComponentBoundEvent_KeyEvent_1) == 0x000030, "Member 'WBP_Dialog_ItemGet_C_ExecuteUbergraph_WBP_Dialog_ItemGet::K2Node_ComponentBoundEvent_KeyEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_ExecuteUbergraph_WBP_Dialog_ItemGet, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'WBP_Dialog_ItemGet_C_ExecuteUbergraph_WBP_Dialog_ItemGet::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_ExecuteUbergraph_WBP_Dialog_ItemGet, CallFunc_PlayUMGAnimation_ReturnValue_1) == 0x000078, "Member 'WBP_Dialog_ItemGet_C_ExecuteUbergraph_WBP_Dialog_ItemGet::CallFunc_PlayUMGAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_ExecuteUbergraph_WBP_Dialog_ItemGet, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'WBP_Dialog_ItemGet_C_ExecuteUbergraph_WBP_Dialog_ItemGet::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_ExecuteUbergraph_WBP_Dialog_ItemGet, CallFunc_SetGamePaused_ReturnValue) == 0x000081, "Member 'WBP_Dialog_ItemGet_C_ExecuteUbergraph_WBP_Dialog_ItemGet::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_ExecuteUbergraph_WBP_Dialog_ItemGet, CallFunc_SetGamePaused_ReturnValue_1) == 0x000082, "Member 'WBP_Dialog_ItemGet_C_ExecuteUbergraph_WBP_Dialog_ItemGet::CallFunc_SetGamePaused_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_ExecuteUbergraph_WBP_Dialog_ItemGet, K2Node_ComponentBoundEvent_KeyEvent) == 0x000088, "Member 'WBP_Dialog_ItemGet_C_ExecuteUbergraph_WBP_Dialog_ItemGet::K2Node_ComponentBoundEvent_KeyEvent' has a wrong offset!");

// Function WBP_Dialog_ItemGet.WBP_Dialog_ItemGet_C.Initialize
// 0x02E0 (0x02E0 - 0x0000)
struct WBP_Dialog_ItemGet_C_Initialize final
{
public:
	class FText                                   Temp_text_Variable;                                // 0x0000(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0010(0x0010)()
	class FText                                   Temp_text_Variable_2;                              // 0x0020(0x0010)()
	class FText                                   Temp_text_Variable_3;                              // 0x0030(0x0010)()
	class FText                                   Temp_text_Variable_4;                              // 0x0040(0x0010)()
	class FText                                   Temp_text_Variable_5;                              // 0x0050(0x0010)()
	class FText                                   Temp_text_Variable_6;                              // 0x0060(0x0010)()
	class FText                                   Temp_text_Variable_7;                              // 0x0070(0x0010)()
	class FText                                   Temp_text_Variable_8;                              // 0x0080(0x0010)()
	class FText                                   Temp_text_Variable_9;                              // 0x0090(0x0010)()
	class FText                                   Temp_text_Variable_10;                             // 0x00A0(0x0010)()
	class FText                                   Temp_text_Variable_11;                             // 0x00B0(0x0010)()
	class FText                                   Temp_text_Variable_12;                             // 0x00C0(0x0010)()
	EEquipmentType                                Temp_byte_Variable;                                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_13;                             // 0x00D8(0x0010)()
	class FText                                   Temp_text_Variable_14;                             // 0x00E8(0x0010)()
	class FText                                   Temp_text_Variable_15;                             // 0x00F8(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x0108(0x0010)()
	class FText                                   Temp_text_Variable_16;                             // 0x0118(0x0010)()
	class FText                                   Temp_text_Variable_17;                             // 0x0128(0x0010)()
	class FText                                   Temp_text_Variable_18;                             // 0x0138(0x0010)()
	class FText                                   Temp_text_Variable_19;                             // 0x0148(0x0010)()
	EInventoryItemType                            Temp_byte_Variable_1;                              // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0160(0x0010)()
	struct FInventoryItemData                     CallFunc_GetInventoryItemData_out_ItemData;        // 0x0170(0x0168)()
	bool                                          CallFunc_GetInventoryItemData_ReturnValue;         // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dialog_ItemGet_C_Initialize) == 0x000008, "Wrong alignment on WBP_Dialog_ItemGet_C_Initialize");
static_assert(sizeof(WBP_Dialog_ItemGet_C_Initialize) == 0x0002E0, "Wrong size on WBP_Dialog_ItemGet_C_Initialize");
static_assert(offsetof(WBP_Dialog_ItemGet_C_Initialize, Temp_text_Variable) == 0x000000, "Member 'WBP_Dialog_ItemGet_C_Initialize::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_Initialize, Temp_text_Variable_1) == 0x000010, "Member 'WBP_Dialog_ItemGet_C_Initialize::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_Initialize, Temp_text_Variable_2) == 0x000020, "Member 'WBP_Dialog_ItemGet_C_Initialize::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_Initialize, Temp_text_Variable_3) == 0x000030, "Member 'WBP_Dialog_ItemGet_C_Initialize::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_Initialize, Temp_text_Variable_4) == 0x000040, "Member 'WBP_Dialog_ItemGet_C_Initialize::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_Initialize, Temp_text_Variable_5) == 0x000050, "Member 'WBP_Dialog_ItemGet_C_Initialize::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_Initialize, Temp_text_Variable_6) == 0x000060, "Member 'WBP_Dialog_ItemGet_C_Initialize::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_Initialize, Temp_text_Variable_7) == 0x000070, "Member 'WBP_Dialog_ItemGet_C_Initialize::Temp_text_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_Initialize, Temp_text_Variable_8) == 0x000080, "Member 'WBP_Dialog_ItemGet_C_Initialize::Temp_text_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_Initialize, Temp_text_Variable_9) == 0x000090, "Member 'WBP_Dialog_ItemGet_C_Initialize::Temp_text_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_Initialize, Temp_text_Variable_10) == 0x0000A0, "Member 'WBP_Dialog_ItemGet_C_Initialize::Temp_text_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_Initialize, Temp_text_Variable_11) == 0x0000B0, "Member 'WBP_Dialog_ItemGet_C_Initialize::Temp_text_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_Initialize, Temp_text_Variable_12) == 0x0000C0, "Member 'WBP_Dialog_ItemGet_C_Initialize::Temp_text_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_Initialize, Temp_byte_Variable) == 0x0000D0, "Member 'WBP_Dialog_ItemGet_C_Initialize::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_Initialize, Temp_text_Variable_13) == 0x0000D8, "Member 'WBP_Dialog_ItemGet_C_Initialize::Temp_text_Variable_13' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_Initialize, Temp_text_Variable_14) == 0x0000E8, "Member 'WBP_Dialog_ItemGet_C_Initialize::Temp_text_Variable_14' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_Initialize, Temp_text_Variable_15) == 0x0000F8, "Member 'WBP_Dialog_ItemGet_C_Initialize::Temp_text_Variable_15' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_Initialize, K2Node_Select_Default) == 0x000108, "Member 'WBP_Dialog_ItemGet_C_Initialize::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_Initialize, Temp_text_Variable_16) == 0x000118, "Member 'WBP_Dialog_ItemGet_C_Initialize::Temp_text_Variable_16' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_Initialize, Temp_text_Variable_17) == 0x000128, "Member 'WBP_Dialog_ItemGet_C_Initialize::Temp_text_Variable_17' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_Initialize, Temp_text_Variable_18) == 0x000138, "Member 'WBP_Dialog_ItemGet_C_Initialize::Temp_text_Variable_18' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_Initialize, Temp_text_Variable_19) == 0x000148, "Member 'WBP_Dialog_ItemGet_C_Initialize::Temp_text_Variable_19' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_Initialize, Temp_byte_Variable_1) == 0x000158, "Member 'WBP_Dialog_ItemGet_C_Initialize::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_Initialize, K2Node_Select_Default_1) == 0x000160, "Member 'WBP_Dialog_ItemGet_C_Initialize::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_Initialize, CallFunc_GetInventoryItemData_out_ItemData) == 0x000170, "Member 'WBP_Dialog_ItemGet_C_Initialize::CallFunc_GetInventoryItemData_out_ItemData' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_Initialize, CallFunc_GetInventoryItemData_ReturnValue) == 0x0002D8, "Member 'WBP_Dialog_ItemGet_C_Initialize::CallFunc_GetInventoryItemData_ReturnValue' has a wrong offset!");

// Function WBP_Dialog_ItemGet.WBP_Dialog_ItemGet_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Dialog_ItemGet_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Dialog_ItemGet_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Dialog_ItemGet_C_OnFocusReceived");
static_assert(sizeof(WBP_Dialog_ItemGet_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_Dialog_ItemGet_C_OnFocusReceived");
static_assert(offsetof(WBP_Dialog_ItemGet_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Dialog_ItemGet_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Dialog_ItemGet_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Dialog_ItemGet_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Dialog_ItemGet_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Dialog_ItemGet.WBP_Dialog_ItemGet_C.PlaySE
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_Dialog_ItemGet_C_PlaySE final
{
public:
	EInventoryItemType                            Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFMODEvent*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             Temp_object_Variable_3;                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             Temp_object_Variable_4;                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             Temp_object_Variable_5;                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             Temp_object_Variable_6;                            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             Temp_object_Variable_7;                            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             Temp_object_Variable_8;                            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             Temp_object_Variable_9;                            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             Temp_object_Variable_10;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             Temp_object_Variable_11;                           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             Temp_object_Variable_12;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             Temp_object_Variable_13;                           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             Temp_object_Variable_14;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             Temp_object_Variable_15;                           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             Temp_object_Variable_16;                           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             Temp_object_Variable_17;                           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundSubsystem*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             K2Node_Select_Default;                             // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlaySoundEvent_ReturnValue;               // 0x00A8(0x0008)(NoDestructor)
};
static_assert(alignof(WBP_Dialog_ItemGet_C_PlaySE) == 0x000008, "Wrong alignment on WBP_Dialog_ItemGet_C_PlaySE");
static_assert(sizeof(WBP_Dialog_ItemGet_C_PlaySE) == 0x0000B0, "Wrong size on WBP_Dialog_ItemGet_C_PlaySE");
static_assert(offsetof(WBP_Dialog_ItemGet_C_PlaySE, Temp_byte_Variable) == 0x000000, "Member 'WBP_Dialog_ItemGet_C_PlaySE::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_PlaySE, Temp_object_Variable) == 0x000008, "Member 'WBP_Dialog_ItemGet_C_PlaySE::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_PlaySE, Temp_object_Variable_1) == 0x000010, "Member 'WBP_Dialog_ItemGet_C_PlaySE::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_PlaySE, Temp_object_Variable_2) == 0x000018, "Member 'WBP_Dialog_ItemGet_C_PlaySE::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_PlaySE, Temp_object_Variable_3) == 0x000020, "Member 'WBP_Dialog_ItemGet_C_PlaySE::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_PlaySE, Temp_object_Variable_4) == 0x000028, "Member 'WBP_Dialog_ItemGet_C_PlaySE::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_PlaySE, Temp_object_Variable_5) == 0x000030, "Member 'WBP_Dialog_ItemGet_C_PlaySE::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_PlaySE, Temp_object_Variable_6) == 0x000038, "Member 'WBP_Dialog_ItemGet_C_PlaySE::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_PlaySE, Temp_object_Variable_7) == 0x000040, "Member 'WBP_Dialog_ItemGet_C_PlaySE::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_PlaySE, Temp_object_Variable_8) == 0x000048, "Member 'WBP_Dialog_ItemGet_C_PlaySE::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_PlaySE, Temp_object_Variable_9) == 0x000050, "Member 'WBP_Dialog_ItemGet_C_PlaySE::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_PlaySE, Temp_object_Variable_10) == 0x000058, "Member 'WBP_Dialog_ItemGet_C_PlaySE::Temp_object_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_PlaySE, Temp_object_Variable_11) == 0x000060, "Member 'WBP_Dialog_ItemGet_C_PlaySE::Temp_object_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_PlaySE, Temp_object_Variable_12) == 0x000068, "Member 'WBP_Dialog_ItemGet_C_PlaySE::Temp_object_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_PlaySE, Temp_object_Variable_13) == 0x000070, "Member 'WBP_Dialog_ItemGet_C_PlaySE::Temp_object_Variable_13' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_PlaySE, Temp_object_Variable_14) == 0x000078, "Member 'WBP_Dialog_ItemGet_C_PlaySE::Temp_object_Variable_14' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_PlaySE, Temp_object_Variable_15) == 0x000080, "Member 'WBP_Dialog_ItemGet_C_PlaySE::Temp_object_Variable_15' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_PlaySE, Temp_object_Variable_16) == 0x000088, "Member 'WBP_Dialog_ItemGet_C_PlaySE::Temp_object_Variable_16' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_PlaySE, Temp_object_Variable_17) == 0x000090, "Member 'WBP_Dialog_ItemGet_C_PlaySE::Temp_object_Variable_17' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_PlaySE, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000098, "Member 'WBP_Dialog_ItemGet_C_PlaySE::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_PlaySE, K2Node_Select_Default) == 0x0000A0, "Member 'WBP_Dialog_ItemGet_C_PlaySE::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_PlaySE, CallFunc_PlaySoundEvent_ReturnValue) == 0x0000A8, "Member 'WBP_Dialog_ItemGet_C_PlaySE::CallFunc_PlaySoundEvent_ReturnValue' has a wrong offset!");

// Function WBP_Dialog_ItemGet.WBP_Dialog_ItemGet_C.SetName
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_Dialog_ItemGet_C_SetName final
{
public:
	class FText                                   InputPin;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0048)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0070(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C8(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x00D8(0x0010)()
};
static_assert(alignof(WBP_Dialog_ItemGet_C_SetName) == 0x000008, "Wrong alignment on WBP_Dialog_ItemGet_C_SetName");
static_assert(sizeof(WBP_Dialog_ItemGet_C_SetName) == 0x0000E8, "Wrong size on WBP_Dialog_ItemGet_C_SetName");
static_assert(offsetof(WBP_Dialog_ItemGet_C_SetName, InputPin) == 0x000000, "Member 'WBP_Dialog_ItemGet_C_SetName::InputPin' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_SetName, Temp_bool_Variable) == 0x000010, "Member 'WBP_Dialog_ItemGet_C_SetName::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_SetName, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'WBP_Dialog_ItemGet_C_SetName::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_SetName, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000060, "Member 'WBP_Dialog_ItemGet_C_SetName::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_SetName, CallFunc_Greater_IntInt_ReturnValue) == 0x000068, "Member 'WBP_Dialog_ItemGet_C_SetName::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_SetName, K2Node_MakeStruct_FormatArgumentData_1) == 0x000070, "Member 'WBP_Dialog_ItemGet_C_SetName::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_SetName, K2Node_MakeArray_Array) == 0x0000B8, "Member 'WBP_Dialog_ItemGet_C_SetName::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_SetName, CallFunc_Format_ReturnValue) == 0x0000C8, "Member 'WBP_Dialog_ItemGet_C_SetName::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_SetName, K2Node_Select_Default) == 0x0000D8, "Member 'WBP_Dialog_ItemGet_C_SetName::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Dialog_ItemGet.WBP_Dialog_ItemGet_C.SetupElementVisibility
// 0x0018 (0x0018 - 0x0000)
struct WBP_Dialog_ItemGet_C_SetupElementVisibility final
{
public:
	EInventoryItemType                            Index_0;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_1;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dialog_ItemGet_C_SetupElementVisibility) == 0x000008, "Wrong alignment on WBP_Dialog_ItemGet_C_SetupElementVisibility");
static_assert(sizeof(WBP_Dialog_ItemGet_C_SetupElementVisibility) == 0x000018, "Wrong size on WBP_Dialog_ItemGet_C_SetupElementVisibility");
static_assert(offsetof(WBP_Dialog_ItemGet_C_SetupElementVisibility, Index_0) == 0x000000, "Member 'WBP_Dialog_ItemGet_C_SetupElementVisibility::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_SetupElementVisibility, Temp_bool_Variable) == 0x000001, "Member 'WBP_Dialog_ItemGet_C_SetupElementVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Dialog_ItemGet_C_SetupElementVisibility, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'WBP_Dialog_ItemGet_C_SetupElementVisibility::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
