#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WorldSpace_LevelUp

#include "Basic.hpp"

#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_WorldSpace_LevelUp.WBP_WorldSpace_LevelUp_C.ExecuteUbergraph_WBP_WorldSpace_LevelUp
// 0x0028 (0x0028 - 0x0000)
struct WBP_WorldSpace_LevelUp_C_ExecuteUbergraph_WBP_WorldSpace_LevelUp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundSubsystem*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFMODEventInstance                     CallFunc_PlaySoundEvent_ReturnValue;               // 0x0020(0x0008)(NoDestructor)
};
static_assert(alignof(WBP_WorldSpace_LevelUp_C_ExecuteUbergraph_WBP_WorldSpace_LevelUp) == 0x000008, "Wrong alignment on WBP_WorldSpace_LevelUp_C_ExecuteUbergraph_WBP_WorldSpace_LevelUp");
static_assert(sizeof(WBP_WorldSpace_LevelUp_C_ExecuteUbergraph_WBP_WorldSpace_LevelUp) == 0x000028, "Wrong size on WBP_WorldSpace_LevelUp_C_ExecuteUbergraph_WBP_WorldSpace_LevelUp");
static_assert(offsetof(WBP_WorldSpace_LevelUp_C_ExecuteUbergraph_WBP_WorldSpace_LevelUp, EntryPoint) == 0x000000, "Member 'WBP_WorldSpace_LevelUp_C_ExecuteUbergraph_WBP_WorldSpace_LevelUp::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_LevelUp_C_ExecuteUbergraph_WBP_WorldSpace_LevelUp, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_WorldSpace_LevelUp_C_ExecuteUbergraph_WBP_WorldSpace_LevelUp::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_LevelUp_C_ExecuteUbergraph_WBP_WorldSpace_LevelUp, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_WorldSpace_LevelUp_C_ExecuteUbergraph_WBP_WorldSpace_LevelUp::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_LevelUp_C_ExecuteUbergraph_WBP_WorldSpace_LevelUp, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'WBP_WorldSpace_LevelUp_C_ExecuteUbergraph_WBP_WorldSpace_LevelUp::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_LevelUp_C_ExecuteUbergraph_WBP_WorldSpace_LevelUp, CallFunc_PlaySoundEvent_ReturnValue) == 0x000020, "Member 'WBP_WorldSpace_LevelUp_C_ExecuteUbergraph_WBP_WorldSpace_LevelUp::CallFunc_PlaySoundEvent_ReturnValue' has a wrong offset!");

// Function WBP_WorldSpace_LevelUp.WBP_WorldSpace_LevelUp_C.SetLevelText
// 0x0018 (0x0018 - 0x0000)
struct WBP_WorldSpace_LevelUp_C_SetLevelText final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
};
static_assert(alignof(WBP_WorldSpace_LevelUp_C_SetLevelText) == 0x000008, "Wrong alignment on WBP_WorldSpace_LevelUp_C_SetLevelText");
static_assert(sizeof(WBP_WorldSpace_LevelUp_C_SetLevelText) == 0x000018, "Wrong size on WBP_WorldSpace_LevelUp_C_SetLevelText");
static_assert(offsetof(WBP_WorldSpace_LevelUp_C_SetLevelText, Level) == 0x000000, "Member 'WBP_WorldSpace_LevelUp_C_SetLevelText::Level' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_LevelUp_C_SetLevelText, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_WorldSpace_LevelUp_C_SetLevelText::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

}

