#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WorldSpace_LevelUp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_WorldSpace_LevelUp.WBP_WorldSpace_LevelUp_C
// 0x0038 (0x0350 - 0x0318)
class UWBP_WorldSpace_LevelUp_C final : public UUserWidgetWorldSpace
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideAnim;                                          // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             LevelText;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Light;                                             // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SeparateLine_C*                    WBP_SeparateLine;                                  // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         DisplayTime;                                       // 0x0348(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_WorldSpace_LevelUp(int32 EntryPoint);
	void OnHide();
	void OnShow();
	void SetLevelText(int32 Level);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_WorldSpace_LevelUp_C">();
	}
	static class UWBP_WorldSpace_LevelUp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_WorldSpace_LevelUp_C>();
	}
};
static_assert(alignof(UWBP_WorldSpace_LevelUp_C) == 0x000008, "Wrong alignment on UWBP_WorldSpace_LevelUp_C");
static_assert(sizeof(UWBP_WorldSpace_LevelUp_C) == 0x000350, "Wrong size on UWBP_WorldSpace_LevelUp_C");
static_assert(offsetof(UWBP_WorldSpace_LevelUp_C, UberGraphFrame) == 0x000318, "Member 'UWBP_WorldSpace_LevelUp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_WorldSpace_LevelUp_C, HideAnim) == 0x000320, "Member 'UWBP_WorldSpace_LevelUp_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UWBP_WorldSpace_LevelUp_C, ShowAnim) == 0x000328, "Member 'UWBP_WorldSpace_LevelUp_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UWBP_WorldSpace_LevelUp_C, LevelText) == 0x000330, "Member 'UWBP_WorldSpace_LevelUp_C::LevelText' has a wrong offset!");
static_assert(offsetof(UWBP_WorldSpace_LevelUp_C, Light) == 0x000338, "Member 'UWBP_WorldSpace_LevelUp_C::Light' has a wrong offset!");
static_assert(offsetof(UWBP_WorldSpace_LevelUp_C, WBP_SeparateLine) == 0x000340, "Member 'UWBP_WorldSpace_LevelUp_C::WBP_SeparateLine' has a wrong offset!");
static_assert(offsetof(UWBP_WorldSpace_LevelUp_C, DisplayTime) == 0x000348, "Member 'UWBP_WorldSpace_LevelUp_C::DisplayTime' has a wrong offset!");

}

