#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Recollection_Page_BossRush

#include "Basic.hpp"

#include "Zion_structs.hpp"
#include "Zion_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Recollection_Page_BossRush.WBP_Recollection_Page_BossRush_C
// 0x00C8 (0x0528 - 0x0460)
class UWBP_Recollection_Page_BossRush_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 base;                                              // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Btn;                                          // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Btn_1;                                        // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Left;                                          // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Right;                                         // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Difficulty;                                   // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_NewGame;                                      // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_NoRecord;                                     // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Records;                                      // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Generic_C*                  WBP_Button_Difficulty;                             // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Generic_C*                  WBP_Button_Generic_Start_BossRush;                 // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Recollection_Boss_NGSelection_C*   WBP_Recollection_Boss_NGSelection;                 // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Recollection_BossRush_BossProgression_C* WBP_Recollection_BossRush_BossProgression;   // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Recollection_BossRush_Leaderboard_C* WBP_Recollection_BossRush_Leaderboard;           // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SeparateLine2_C*                   WBP_SeparateLine2;                                 // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SeparateLine2_C*                   WBP_SeparateLine2_1;                               // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Leaderboard;                        // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_NewGame;                            // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnRequestStartBossRush;                            // 0x04F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct FFooterData>                    DefaultFooterEntries;                              // 0x0508(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	TArray<struct FFooterData>                    StartBossRushFooterEntries;                        // 0x0518(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)

public:
	void BndEvt__WBP_Recollection_Page_BossRush_WBP_Button_Difficulty_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void BndEvt__WBP_Recollection_Page_BossRush_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void BndEvt__WBP_Recollection_Page_BossRush_WBP_Recollection_Boss_NGSelection_K2Node_ComponentBoundEvent_1_OnSelectionChanged__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_Recollection_Page_BossRush(int32 EntryPoint);
	void GetMaxBossesDefeated(int32* Count);
	void InitializeNewGameDifficultyLabel();
	void IsBossRushAlreadyCleared(bool* bResult);
	void IsNewGamePlusAvailable(bool* bResult);
	void OnChildFocused(class UNativeWidgetHost* FocusedWidgetHost, const struct FFocusEvent& FocusEvent);
	void OnCloseBossRushDifficultySettings(EDifficultyPreset SelectedPreset, const struct FDifficultySettings& SelectedSettings);
	void OnDifficultyModeChanged();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnPressContext(const struct FKeyEvent& KeyEvent);
	void OnResetCurrentRecords_Confirm();
	void RefreshDisplay();
	void RefreshNoRecordDisplay();
	void RefreshPresetDisplay();
	void RequestResetCurrentRecords();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Recollection_Page_BossRush_C">();
	}
	static class UWBP_Recollection_Page_BossRush_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Recollection_Page_BossRush_C>();
	}
};
static_assert(alignof(UWBP_Recollection_Page_BossRush_C) == 0x000008, "Wrong alignment on UWBP_Recollection_Page_BossRush_C");
static_assert(sizeof(UWBP_Recollection_Page_BossRush_C) == 0x000528, "Wrong size on UWBP_Recollection_Page_BossRush_C");
static_assert(offsetof(UWBP_Recollection_Page_BossRush_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Recollection_Page_BossRush_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_BossRush_C, base) == 0x000468, "Member 'UWBP_Recollection_Page_BossRush_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_BossRush_C, Base_Btn) == 0x000470, "Member 'UWBP_Recollection_Page_BossRush_C::Base_Btn' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_BossRush_C, Base_Btn_1) == 0x000478, "Member 'UWBP_Recollection_Page_BossRush_C::Base_Btn_1' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_BossRush_C, Img_Left) == 0x000480, "Member 'UWBP_Recollection_Page_BossRush_C::Img_Left' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_BossRush_C, Img_Right) == 0x000488, "Member 'UWBP_Recollection_Page_BossRush_C::Img_Right' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_BossRush_C, Text_Difficulty) == 0x000490, "Member 'UWBP_Recollection_Page_BossRush_C::Text_Difficulty' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_BossRush_C, Text_NewGame) == 0x000498, "Member 'UWBP_Recollection_Page_BossRush_C::Text_NewGame' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_BossRush_C, Text_NoRecord) == 0x0004A0, "Member 'UWBP_Recollection_Page_BossRush_C::Text_NoRecord' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_BossRush_C, Text_Records) == 0x0004A8, "Member 'UWBP_Recollection_Page_BossRush_C::Text_Records' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_BossRush_C, WBP_Button_Difficulty) == 0x0004B0, "Member 'UWBP_Recollection_Page_BossRush_C::WBP_Button_Difficulty' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_BossRush_C, WBP_Button_Generic_Start_BossRush) == 0x0004B8, "Member 'UWBP_Recollection_Page_BossRush_C::WBP_Button_Generic_Start_BossRush' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_BossRush_C, WBP_Recollection_Boss_NGSelection) == 0x0004C0, "Member 'UWBP_Recollection_Page_BossRush_C::WBP_Recollection_Boss_NGSelection' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_BossRush_C, WBP_Recollection_BossRush_BossProgression) == 0x0004C8, "Member 'UWBP_Recollection_Page_BossRush_C::WBP_Recollection_BossRush_BossProgression' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_BossRush_C, WBP_Recollection_BossRush_Leaderboard) == 0x0004D0, "Member 'UWBP_Recollection_Page_BossRush_C::WBP_Recollection_BossRush_Leaderboard' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_BossRush_C, WBP_SeparateLine2) == 0x0004D8, "Member 'UWBP_Recollection_Page_BossRush_C::WBP_SeparateLine2' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_BossRush_C, WBP_SeparateLine2_1) == 0x0004E0, "Member 'UWBP_Recollection_Page_BossRush_C::WBP_SeparateLine2_1' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_BossRush_C, WidgetSwitcher_Leaderboard) == 0x0004E8, "Member 'UWBP_Recollection_Page_BossRush_C::WidgetSwitcher_Leaderboard' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_BossRush_C, WidgetSwitcher_NewGame) == 0x0004F0, "Member 'UWBP_Recollection_Page_BossRush_C::WidgetSwitcher_NewGame' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_BossRush_C, OnRequestStartBossRush) == 0x0004F8, "Member 'UWBP_Recollection_Page_BossRush_C::OnRequestStartBossRush' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_BossRush_C, DefaultFooterEntries) == 0x000508, "Member 'UWBP_Recollection_Page_BossRush_C::DefaultFooterEntries' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_Page_BossRush_C, StartBossRushFooterEntries) == 0x000518, "Member 'UWBP_Recollection_Page_BossRush_C::StartBossRushFooterEntries' has a wrong offset!");

}

