#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerUI

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_PlayerUI.WBP_PlayerUI_C.ExecuteUbergraph_WBP_PlayerUI
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83[0x5];                                       // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidgetMinimap*                     CallFunc_GetMinimapWidget_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInstant;                             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanShowSP_ReturnValue;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanShowHeal_ReturnValue;                  // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bVisible;                             // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x00CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Opacity;                              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI) == 0x000008, "Wrong alignment on WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI");
static_assert(sizeof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI) == 0x0000D8, "Wrong size on WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, EntryPoint) == 0x000000, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, Temp_byte_Variable) == 0x000004, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, Temp_bool_Variable) == 0x000005, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, Temp_byte_Variable_2) == 0x000007, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000008, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000028, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x00002C, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000030, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, Temp_object_Variable) == 0x000038, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000040, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, Temp_real_Variable) == 0x000048, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, Temp_real_Variable_1) == 0x000050, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, Temp_real_Variable_0) == 0x000058, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, Temp_real_Variable_1_0) == 0x000060, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, Temp_bool_Variable_1) == 0x000068, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000070, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000078, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, Temp_bool_Variable_2) == 0x000080, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, Temp_byte_Variable_3) == 0x000081, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, Temp_byte_Variable_4) == 0x000082, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_GetMinimapWidget_ReturnValue) == 0x000088, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_GetMinimapWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_PlayAnimationForward_ReturnValue) == 0x000090, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, K2Node_Event_bInstant) == 0x000098, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::K2Node_Event_bInstant' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x0000A0, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_CanShowSP_ReturnValue) == 0x0000A8, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_CanShowSP_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_CanShowHeal_ReturnValue) == 0x0000A9, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_CanShowHeal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, K2Node_Select_Default) == 0x0000AA, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, Temp_byte_Variable_5) == 0x0000AB, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, K2Node_CreateDelegate_OutputDelegate) == 0x0000AC, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000BC, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, K2Node_Event_bVisible) == 0x0000CC, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::K2Node_Event_bVisible' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, Temp_bool_Variable_3) == 0x0000CD, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, K2Node_Select_Default_1) == 0x0000CE, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, K2Node_Select_Default_2) == 0x0000CF, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, K2Node_Event_Opacity) == 0x0000D0, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::K2Node_Event_Opacity' has a wrong offset!");

// Function WBP_PlayerUI.WBP_PlayerUI_C.HideUI
// 0x0001 (0x0001 - 0x0000)
struct WBP_PlayerUI_C_HideUI final
{
public:
	bool                                          bInstant;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerUI_C_HideUI) == 0x000001, "Wrong alignment on WBP_PlayerUI_C_HideUI");
static_assert(sizeof(WBP_PlayerUI_C_HideUI) == 0x000001, "Wrong size on WBP_PlayerUI_C_HideUI");
static_assert(offsetof(WBP_PlayerUI_C_HideUI, bInstant) == 0x000000, "Member 'WBP_PlayerUI_C_HideUI::bInstant' has a wrong offset!");

// Function WBP_PlayerUI.WBP_PlayerUI_C.Initialize
// 0x0018 (0x0018 - 0x0000)
struct WBP_PlayerUI_C_Initialize final
{
public:
	class APlayerController*                      CallFunc_GetController_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetController_ReturnValue_1;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPawn_ReturnValue;                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerUI_C_Initialize) == 0x000008, "Wrong alignment on WBP_PlayerUI_C_Initialize");
static_assert(sizeof(WBP_PlayerUI_C_Initialize) == 0x000018, "Wrong size on WBP_PlayerUI_C_Initialize");
static_assert(offsetof(WBP_PlayerUI_C_Initialize, CallFunc_GetController_ReturnValue) == 0x000000, "Member 'WBP_PlayerUI_C_Initialize::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_Initialize, CallFunc_GetController_ReturnValue_1) == 0x000008, "Member 'WBP_PlayerUI_C_Initialize::CallFunc_GetController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_Initialize, CallFunc_GetPawn_ReturnValue) == 0x000010, "Member 'WBP_PlayerUI_C_Initialize::CallFunc_GetPawn_ReturnValue' has a wrong offset!");

// Function WBP_PlayerUI.WBP_PlayerUI_C.InpActEvt_IA_Minimap_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_PlayerUI_C_InpActEvt_IA_Minimap_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerUI_C_InpActEvt_IA_Minimap_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WBP_PlayerUI_C_InpActEvt_IA_Minimap_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WBP_PlayerUI_C_InpActEvt_IA_Minimap_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WBP_PlayerUI_C_InpActEvt_IA_Minimap_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WBP_PlayerUI_C_InpActEvt_IA_Minimap_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WBP_PlayerUI_C_InpActEvt_IA_Minimap_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_InpActEvt_IA_Minimap_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WBP_PlayerUI_C_InpActEvt_IA_Minimap_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_InpActEvt_IA_Minimap_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WBP_PlayerUI_C_InpActEvt_IA_Minimap_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_InpActEvt_IA_Minimap_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WBP_PlayerUI_C_InpActEvt_IA_Minimap_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WBP_PlayerUI.WBP_PlayerUI_C.OnRefreshLowHPFeedbackOpacity
// 0x0004 (0x0004 - 0x0000)
struct WBP_PlayerUI_C_OnRefreshLowHPFeedbackOpacity final
{
public:
	float                                         Opacity;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerUI_C_OnRefreshLowHPFeedbackOpacity) == 0x000004, "Wrong alignment on WBP_PlayerUI_C_OnRefreshLowHPFeedbackOpacity");
static_assert(sizeof(WBP_PlayerUI_C_OnRefreshLowHPFeedbackOpacity) == 0x000004, "Wrong size on WBP_PlayerUI_C_OnRefreshLowHPFeedbackOpacity");
static_assert(offsetof(WBP_PlayerUI_C_OnRefreshLowHPFeedbackOpacity, Opacity) == 0x000000, "Member 'WBP_PlayerUI_C_OnRefreshLowHPFeedbackOpacity::Opacity' has a wrong offset!");

// Function WBP_PlayerUI.WBP_PlayerUI_C.OnRefreshPlayerUIVisibility
// 0x0001 (0x0001 - 0x0000)
struct WBP_PlayerUI_C_OnRefreshPlayerUIVisibility final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerUI_C_OnRefreshPlayerUIVisibility) == 0x000001, "Wrong alignment on WBP_PlayerUI_C_OnRefreshPlayerUIVisibility");
static_assert(sizeof(WBP_PlayerUI_C_OnRefreshPlayerUIVisibility) == 0x000001, "Wrong size on WBP_PlayerUI_C_OnRefreshPlayerUIVisibility");
static_assert(offsetof(WBP_PlayerUI_C_OnRefreshPlayerUIVisibility, bVisible) == 0x000000, "Member 'WBP_PlayerUI_C_OnRefreshPlayerUIVisibility::bVisible' has a wrong offset!");

// Function WBP_PlayerUI.WBP_PlayerUI_C.UpdateAnchors
// 0x0070 (0x0070 - 0x0000)
struct WBP_PlayerUI_C_UpdateAnchors final
{
public:
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0000(0x0020)(NoDestructor)
	struct FAnchors                               K2Node_MakeStruct_Anchors_1;                       // 0x0020(0x0020)(NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConstraintHUDAspectRatio_ReturnValue;  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerUI_C_UpdateAnchors) == 0x000008, "Wrong alignment on WBP_PlayerUI_C_UpdateAnchors");
static_assert(sizeof(WBP_PlayerUI_C_UpdateAnchors) == 0x000070, "Wrong size on WBP_PlayerUI_C_UpdateAnchors");
static_assert(offsetof(WBP_PlayerUI_C_UpdateAnchors, K2Node_MakeStruct_Anchors) == 0x000000, "Member 'WBP_PlayerUI_C_UpdateAnchors::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_UpdateAnchors, K2Node_MakeStruct_Anchors_1) == 0x000020, "Member 'WBP_PlayerUI_C_UpdateAnchors::K2Node_MakeStruct_Anchors_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_UpdateAnchors, K2Node_MakeStruct_Margin) == 0x000040, "Member 'WBP_PlayerUI_C_UpdateAnchors::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_UpdateAnchors, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000050, "Member 'WBP_PlayerUI_C_UpdateAnchors::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_UpdateAnchors, CallFunc_GetConstraintHUDAspectRatio_ReturnValue) == 0x000058, "Member 'WBP_PlayerUI_C_UpdateAnchors::CallFunc_GetConstraintHUDAspectRatio_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_UpdateAnchors, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000060, "Member 'WBP_PlayerUI_C_UpdateAnchors::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_UpdateAnchors, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000068, "Member 'WBP_PlayerUI_C_UpdateAnchors::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");

}

