#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DebugMenu.WBP_DebugMenu_C
// 0x0120 (0x0580 - 0x0460)
class UWBP_DebugMenu_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hide;                                              // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Show;                                              // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BuildText;                                         // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DebugPageName;                                     // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DebugPageNumberText;                               // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             EarlyAccessText;                                   // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             EnvironmentLevel;                                  // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GameGeneration;                                    // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GameMapName;                                       // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HardwardID;                                        // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MapNameText;                                       // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URefreshableRichTextBlock*              NextPageIcon;                                      // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URefreshableRichTextBlock*              PrevPageIcon;                                      // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RHIText;                                           // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ShopLevel;                                         // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             StoryLevel;                                        // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             VersionText;                                       // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Page_Aptitudes_C*        WBP_DebugMenu_Page_Aptitudes;                      // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Page_DebugDisplay_C*     WBP_DebugMenu_Page_DebugDisplay;                   // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Page_Default_C*          WBP_DebugMenu_Page_Default;                        // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Page_Events_C*           WBP_DebugMenu_Page_Events;                         // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Page_Items_C*            WBP_DebugMenu_Page_Items;                          // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Page_Map_C*              WBP_DebugMenu_Page_Map;                            // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Page_MiscItems_C*        WBP_DebugMenu_Page_MiscItems;                      // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Page_Other_C*            WBP_DebugMenu_Page_Other;                          // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Page_Rendering_C*        WBP_DebugMenu_Page_Rendering;                      // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Page_Spawn_C*            WBP_DebugMenu_Page_Spawn;                          // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Page_TextureStreaming_C* WBP_DebugMenu_Page_TextureStreaming;               // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Scrollbox_C*                       WBP_Scrollbox;                                     // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_DebugPage;                          // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ZoneLevelName;                                     // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ZoneName;                                          // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnClose;                                           // 0x0570(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_DebugMenu_WBP_DebugMenu_Page_Default_K2Node_ComponentBoundEvent_0_OnRequestClose__DelegateSignature(bool bSkipAnimation);
	void Close(bool bSkipAnimation);
	void Construct();
	void ExecuteUbergraph_WBP_DebugMenu(int32 EntryPoint);
	int32 GetNewDebugPageIndex(int32 PageOffset);
	void OnFinish_72C7DC1544F90D6FD9C2188406070826();
	void OnFinish_72C7DC1544F90D6FD9C218843C636E94();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnPressCancel(const struct FKeyEvent& KeyEvent);
	struct FEventReply OnPressNext(const struct FKeyEvent& KeyEvent);
	struct FEventReply OnPressPrevious(const struct FKeyEvent& KeyEvent);
	void SetDebugPage(int32 Index_0);
	void SetupTexts();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DebugMenu_C">();
	}
	static class UWBP_DebugMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DebugMenu_C>();
	}
};
static_assert(alignof(UWBP_DebugMenu_C) == 0x000008, "Wrong alignment on UWBP_DebugMenu_C");
static_assert(sizeof(UWBP_DebugMenu_C) == 0x000580, "Wrong size on UWBP_DebugMenu_C");
static_assert(offsetof(UWBP_DebugMenu_C, UberGraphFrame) == 0x000460, "Member 'UWBP_DebugMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, Hide) == 0x000468, "Member 'UWBP_DebugMenu_C::Hide' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, Show) == 0x000470, "Member 'UWBP_DebugMenu_C::Show' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, BG) == 0x000478, "Member 'UWBP_DebugMenu_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, BuildText) == 0x000480, "Member 'UWBP_DebugMenu_C::BuildText' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, DebugPageName) == 0x000488, "Member 'UWBP_DebugMenu_C::DebugPageName' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, DebugPageNumberText) == 0x000490, "Member 'UWBP_DebugMenu_C::DebugPageNumberText' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, EarlyAccessText) == 0x000498, "Member 'UWBP_DebugMenu_C::EarlyAccessText' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, EnvironmentLevel) == 0x0004A0, "Member 'UWBP_DebugMenu_C::EnvironmentLevel' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, GameGeneration) == 0x0004A8, "Member 'UWBP_DebugMenu_C::GameGeneration' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, GameMapName) == 0x0004B0, "Member 'UWBP_DebugMenu_C::GameMapName' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, HardwardID) == 0x0004B8, "Member 'UWBP_DebugMenu_C::HardwardID' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, MapNameText) == 0x0004C0, "Member 'UWBP_DebugMenu_C::MapNameText' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, NextPageIcon) == 0x0004C8, "Member 'UWBP_DebugMenu_C::NextPageIcon' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, PrevPageIcon) == 0x0004D0, "Member 'UWBP_DebugMenu_C::PrevPageIcon' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, RHIText) == 0x0004D8, "Member 'UWBP_DebugMenu_C::RHIText' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, ShopLevel) == 0x0004E0, "Member 'UWBP_DebugMenu_C::ShopLevel' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, StoryLevel) == 0x0004E8, "Member 'UWBP_DebugMenu_C::StoryLevel' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, VersionText) == 0x0004F0, "Member 'UWBP_DebugMenu_C::VersionText' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, WBP_DebugMenu_Page_Aptitudes) == 0x0004F8, "Member 'UWBP_DebugMenu_C::WBP_DebugMenu_Page_Aptitudes' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, WBP_DebugMenu_Page_DebugDisplay) == 0x000500, "Member 'UWBP_DebugMenu_C::WBP_DebugMenu_Page_DebugDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, WBP_DebugMenu_Page_Default) == 0x000508, "Member 'UWBP_DebugMenu_C::WBP_DebugMenu_Page_Default' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, WBP_DebugMenu_Page_Events) == 0x000510, "Member 'UWBP_DebugMenu_C::WBP_DebugMenu_Page_Events' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, WBP_DebugMenu_Page_Items) == 0x000518, "Member 'UWBP_DebugMenu_C::WBP_DebugMenu_Page_Items' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, WBP_DebugMenu_Page_Map) == 0x000520, "Member 'UWBP_DebugMenu_C::WBP_DebugMenu_Page_Map' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, WBP_DebugMenu_Page_MiscItems) == 0x000528, "Member 'UWBP_DebugMenu_C::WBP_DebugMenu_Page_MiscItems' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, WBP_DebugMenu_Page_Other) == 0x000530, "Member 'UWBP_DebugMenu_C::WBP_DebugMenu_Page_Other' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, WBP_DebugMenu_Page_Rendering) == 0x000538, "Member 'UWBP_DebugMenu_C::WBP_DebugMenu_Page_Rendering' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, WBP_DebugMenu_Page_Spawn) == 0x000540, "Member 'UWBP_DebugMenu_C::WBP_DebugMenu_Page_Spawn' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, WBP_DebugMenu_Page_TextureStreaming) == 0x000548, "Member 'UWBP_DebugMenu_C::WBP_DebugMenu_Page_TextureStreaming' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, WBP_Scrollbox) == 0x000550, "Member 'UWBP_DebugMenu_C::WBP_Scrollbox' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, WidgetSwitcher_DebugPage) == 0x000558, "Member 'UWBP_DebugMenu_C::WidgetSwitcher_DebugPage' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, ZoneLevelName) == 0x000560, "Member 'UWBP_DebugMenu_C::ZoneLevelName' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, ZoneName) == 0x000568, "Member 'UWBP_DebugMenu_C::ZoneName' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_C, OnClose) == 0x000570, "Member 'UWBP_DebugMenu_C::OnClose' has a wrong offset!");

}

