#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WorldSpace_DoorLocked

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_WorldSpace_DoorLocked.WBP_WorldSpace_DoorLocked_C.ExecuteUbergraph_WBP_WorldSpace_DoorLocked
// 0x0018 (0x0018 - 0x0000)
struct WBP_WorldSpace_DoorLocked_C_ExecuteUbergraph_WBP_WorldSpace_DoorLocked final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldSpace_DoorLocked_C_ExecuteUbergraph_WBP_WorldSpace_DoorLocked) == 0x000008, "Wrong alignment on WBP_WorldSpace_DoorLocked_C_ExecuteUbergraph_WBP_WorldSpace_DoorLocked");
static_assert(sizeof(WBP_WorldSpace_DoorLocked_C_ExecuteUbergraph_WBP_WorldSpace_DoorLocked) == 0x000018, "Wrong size on WBP_WorldSpace_DoorLocked_C_ExecuteUbergraph_WBP_WorldSpace_DoorLocked");
static_assert(offsetof(WBP_WorldSpace_DoorLocked_C_ExecuteUbergraph_WBP_WorldSpace_DoorLocked, EntryPoint) == 0x000000, "Member 'WBP_WorldSpace_DoorLocked_C_ExecuteUbergraph_WBP_WorldSpace_DoorLocked::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_DoorLocked_C_ExecuteUbergraph_WBP_WorldSpace_DoorLocked, K2Node_Event_Animation) == 0x000008, "Member 'WBP_WorldSpace_DoorLocked_C_ExecuteUbergraph_WBP_WorldSpace_DoorLocked::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_DoorLocked_C_ExecuteUbergraph_WBP_WorldSpace_DoorLocked, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'WBP_WorldSpace_DoorLocked_C_ExecuteUbergraph_WBP_WorldSpace_DoorLocked::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_WorldSpace_DoorLocked.WBP_WorldSpace_DoorLocked_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_WorldSpace_DoorLocked_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation_0;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldSpace_DoorLocked_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WBP_WorldSpace_DoorLocked_C_OnAnimationFinished");
static_assert(sizeof(WBP_WorldSpace_DoorLocked_C_OnAnimationFinished) == 0x000008, "Wrong size on WBP_WorldSpace_DoorLocked_C_OnAnimationFinished");
static_assert(offsetof(WBP_WorldSpace_DoorLocked_C_OnAnimationFinished, Animation_0) == 0x000000, "Member 'WBP_WorldSpace_DoorLocked_C_OnAnimationFinished::Animation_0' has a wrong offset!");

}

