#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugMenu_Element_Choice_Toggle_Command

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DebugMenu_Element_Choice_Toggle_Command.WBP_DebugMenu_Element_Choice_Toggle_Command_C
// 0x0050 (0x04B0 - 0x0460)
class UWBP_DebugMenu_Element_Choice_Toggle_Command_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_DebugMenu_Element_Choice_Toggle_C* WBP_DebugMenu_Element_Choice_Toggle;               // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Label;                                             // 0x0470(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	class FString                                 ConsoleVarName;                                    // 0x0480(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ValueOFF;                                          // 0x0490(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ValueON;                                           // 0x04A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Toggle_Command(int32 EntryPoint);
	void Construct();
	void BndEvt__WBP_DebugMenu_Element_Choice_Toggle_Command_WBP_DebugMenu_Element_Choice_Toggle_K2Node_ComponentBoundEvent_0_OnToggle__DelegateSignature(bool ToggleValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DebugMenu_Element_Choice_Toggle_Command_C">();
	}
	static class UWBP_DebugMenu_Element_Choice_Toggle_Command_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DebugMenu_Element_Choice_Toggle_Command_C>();
	}
};
static_assert(alignof(UWBP_DebugMenu_Element_Choice_Toggle_Command_C) == 0x000008, "Wrong alignment on UWBP_DebugMenu_Element_Choice_Toggle_Command_C");
static_assert(sizeof(UWBP_DebugMenu_Element_Choice_Toggle_Command_C) == 0x0004B0, "Wrong size on UWBP_DebugMenu_Element_Choice_Toggle_Command_C");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Toggle_Command_C, UberGraphFrame) == 0x000460, "Member 'UWBP_DebugMenu_Element_Choice_Toggle_Command_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Toggle_Command_C, WBP_DebugMenu_Element_Choice_Toggle) == 0x000468, "Member 'UWBP_DebugMenu_Element_Choice_Toggle_Command_C::WBP_DebugMenu_Element_Choice_Toggle' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Toggle_Command_C, Label) == 0x000470, "Member 'UWBP_DebugMenu_Element_Choice_Toggle_Command_C::Label' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Toggle_Command_C, ConsoleVarName) == 0x000480, "Member 'UWBP_DebugMenu_Element_Choice_Toggle_Command_C::ConsoleVarName' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Toggle_Command_C, ValueOFF) == 0x000490, "Member 'UWBP_DebugMenu_Element_Choice_Toggle_Command_C::ValueOFF' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Toggle_Command_C, ValueON) == 0x0004A0, "Member 'UWBP_DebugMenu_Element_Choice_Toggle_Command_C::ValueON' has a wrong offset!");

}

