#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RestMenu

#include "Basic.hpp"

#include "Zion_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_RestMenu.WBP_RestMenu_C.BndEvt__WBP_RestMenu_WBP_RestMenu_Button_DifficultyA_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_DifficultyA_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_DifficultyA_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_DifficultyA_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_DifficultyA_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_DifficultyA_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_DifficultyA_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_DifficultyA_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_RestMenu.WBP_RestMenu_C.BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Exit_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Exit_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Exit_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Exit_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Exit_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Exit_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Exit_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Exit_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_RestMenu.WBP_RestMenu_C.BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Extra_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Extra_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Extra_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Extra_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Extra_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Extra_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Extra_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Extra_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_RestMenu.WBP_RestMenu_C.BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Extra_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Extra_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Extra_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Extra_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Extra_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Extra_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Extra_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Extra_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_RestMenu.WBP_RestMenu_C.BndEvt__WBP_RestMenu_WBP_RestMenu_Button_FastTravelqa_K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_FastTravelqa_K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_FastTravelqa_K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_FastTravelqa_K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_FastTravelqa_K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_FastTravelqa_K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_FastTravelqa_K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_FastTravelqa_K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_RestMenu.WBP_RestMenu_C.BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Save_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Save_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Save_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Save_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Save_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Save_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Save_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_Save_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_RestMenu.WBP_RestMenu_C.BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SetEquipment_K2Node_ComponentBoundEvent_7_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SetEquipment_K2Node_ComponentBoundEvent_7_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SetEquipment_K2Node_ComponentBoundEvent_7_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SetEquipment_K2Node_ComponentBoundEvent_7_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SetEquipment_K2Node_ComponentBoundEvent_7_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SetEquipment_K2Node_ComponentBoundEvent_7_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SetEquipment_K2Node_ComponentBoundEvent_7_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SetEquipment_K2Node_ComponentBoundEvent_7_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_RestMenu.WBP_RestMenu_C.BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SetPassive_K2Node_ComponentBoundEvent_8_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SetPassive_K2Node_ComponentBoundEvent_8_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SetPassive_K2Node_ComponentBoundEvent_8_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SetPassive_K2Node_ComponentBoundEvent_8_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SetPassive_K2Node_ComponentBoundEvent_8_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SetPassive_K2Node_ComponentBoundEvent_8_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SetPassive_K2Node_ComponentBoundEvent_8_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SetPassive_K2Node_ComponentBoundEvent_8_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_RestMenu.WBP_RestMenu_C.BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SetSkill_K2Node_ComponentBoundEvent_6_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SetSkill_K2Node_ComponentBoundEvent_6_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SetSkill_K2Node_ComponentBoundEvent_6_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SetSkill_K2Node_ComponentBoundEvent_6_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SetSkill_K2Node_ComponentBoundEvent_6_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SetSkill_K2Node_ComponentBoundEvent_6_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SetSkill_K2Node_ComponentBoundEvent_6_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SetSkill_K2Node_ComponentBoundEvent_6_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_RestMenu.WBP_RestMenu_C.BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SkillUpgrade_K2Node_ComponentBoundEvent_9_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SkillUpgrade_K2Node_ComponentBoundEvent_9_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SkillUpgrade_K2Node_ComponentBoundEvent_9_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SkillUpgrade_K2Node_ComponentBoundEvent_9_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SkillUpgrade_K2Node_ComponentBoundEvent_9_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SkillUpgrade_K2Node_ComponentBoundEvent_9_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SkillUpgrade_K2Node_ComponentBoundEvent_9_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_RestMenu_C_BndEvt__WBP_RestMenu_WBP_RestMenu_Button_SkillUpgrade_K2Node_ComponentBoundEvent_9_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_RestMenu.WBP_RestMenu_C.ExecuteUbergraph_WBP_RestMenu
// 0x04E0 (0x04E0 - 0x0000)
struct WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0010)()
	class UWBP_Difficulty_C*                      CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Extra_C*                           CallFunc_Create_ReturnValue_1;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SkillUnlock_C*                     CallFunc_Create_ReturnValue_2;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Dialog_OK_C*                       CallFunc_Create_ReturnValue_3;                     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSubsystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USaveSubsystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue_1;           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_9;             // 0x0078(0x0040)()
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_8;             // 0x00C0(0x0040)()
	bool                                          K2Node_CustomEvent_Result;                         // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0108(0x0010)()
	int32                                         CallFunc_GetUMGZOrder_ReturnValue;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UEventContext*                          K2Node_Event_InEventContext;                       // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0128(0x0010)()
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_RestPointID;                    // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRestPointData                         K2Node_CustomEvent_RestPointData;                  // 0x0148(0x0088)()
	class UWBP_Dialog_OK_C*                       CallFunc_Create_ReturnValue_4;                     // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_7;             // 0x01D8(0x0040)()
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_6;             // 0x0218(0x0040)()
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_5;             // 0x0258(0x0040)()
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_4;             // 0x0298(0x0040)()
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_3;             // 0x02D8(0x0040)()
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_2;             // 0x0318(0x0040)()
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_1;             // 0x0358(0x0040)()
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent;               // 0x0398(0x0040)()
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x03E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetActorForBinding_ReturnValue;           // 0x03F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AInteractable_RestPoint*                K2Node_DynamicCast_AsInteractable_Rest_Point;      // 0x03F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_401[0x3];                                      // 0x0401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_2;            // 0x0404(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_3;            // 0x040C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0418(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEarlyAccessBuild_ReturnValue;           // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_CustomEvent_RecollectionBossDataHandle;     // 0x0428(0x0010)(NoDestructor)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_4;            // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_5;            // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSubsystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0448(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451[0x3];                                      // 0x0451(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_6;            // 0x0454(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue_1;            // 0x045C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45D[0x3];                                      // 0x045D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSubsystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0460(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameViewportZion*                      CallFunc_Get_ReturnValue_1;                        // 0x0468(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Result)>                  K2Node_CreateDelegate_OutputDelegate_2;            // 0x0480(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_2;                              // 0x0498(0x0010)(ConstParm)
	class UGameViewportZion*                      CallFunc_Get_ReturnValue_2;                        // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x04B0(0x0008)(NoDestructor)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryAutoOpenRecollection_bOpened;          // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetViewportOverlayRenderOpacity_Opacity_ImplicitCast; // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetViewportOverlayRenderOpacity_Opacity_ImplicitCast_1; // 0x04DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu) == 0x000008, "Wrong alignment on WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu");
static_assert(sizeof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu) == 0x0004E0, "Wrong size on WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, EntryPoint) == 0x000000, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, Temp_text_Variable) == 0x000008, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_Create_ReturnValue) == 0x000018, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_Create_ReturnValue_1) == 0x000020, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_Create_ReturnValue_2) == 0x000028, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_IsValid_ReturnValue_1) == 0x000031, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_Create_ReturnValue_3) == 0x000038, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000040, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_PlayUMGAnimation_ReturnValue) == 0x000058, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_PlayUMGAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000060, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_IsValid_ReturnValue_2) == 0x000068, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_PlayUMGAnimation_ReturnValue_1) == 0x000070, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_PlayUMGAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, K2Node_ComponentBoundEvent_KeyEvent_9) == 0x000078, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::K2Node_ComponentBoundEvent_KeyEvent_9' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_IsValid_ReturnValue_3) == 0x0000B8, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, K2Node_ComponentBoundEvent_KeyEvent_8) == 0x0000C0, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::K2Node_ComponentBoundEvent_KeyEvent_8' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, K2Node_CustomEvent_Result) == 0x000100, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, Temp_text_Variable_1) == 0x000108, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_GetUMGZOrder_ReturnValue) == 0x000118, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_GetUMGZOrder_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, Temp_bool_Variable) == 0x00011C, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, K2Node_Event_InEventContext) == 0x000120, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::K2Node_Event_InEventContext' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, K2Node_Select_Default) == 0x000128, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_MakeLiteralName_ReturnValue) == 0x000138, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, K2Node_CustomEvent_RestPointID) == 0x000140, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::K2Node_CustomEvent_RestPointID' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, K2Node_CustomEvent_RestPointData) == 0x000148, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::K2Node_CustomEvent_RestPointData' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_Create_ReturnValue_4) == 0x0001D0, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_Create_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, K2Node_ComponentBoundEvent_KeyEvent_7) == 0x0001D8, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::K2Node_ComponentBoundEvent_KeyEvent_7' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, K2Node_ComponentBoundEvent_KeyEvent_6) == 0x000218, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::K2Node_ComponentBoundEvent_KeyEvent_6' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, K2Node_ComponentBoundEvent_KeyEvent_5) == 0x000258, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::K2Node_ComponentBoundEvent_KeyEvent_5' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, K2Node_ComponentBoundEvent_KeyEvent_4) == 0x000298, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::K2Node_ComponentBoundEvent_KeyEvent_4' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, K2Node_ComponentBoundEvent_KeyEvent_3) == 0x0002D8, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::K2Node_ComponentBoundEvent_KeyEvent_3' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, K2Node_ComponentBoundEvent_KeyEvent_2) == 0x000318, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::K2Node_ComponentBoundEvent_KeyEvent_2' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, K2Node_ComponentBoundEvent_KeyEvent_1) == 0x000358, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::K2Node_ComponentBoundEvent_KeyEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, K2Node_ComponentBoundEvent_KeyEvent) == 0x000398, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::K2Node_ComponentBoundEvent_KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_MakeLiteralName_ReturnValue_1) == 0x0003D8, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x0003E0, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_GetActorForBinding_ReturnValue) == 0x0003F0, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_GetActorForBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, K2Node_DynamicCast_AsInteractable_Rest_Point) == 0x0003F8, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::K2Node_DynamicCast_AsInteractable_Rest_Point' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, K2Node_DynamicCast_bSuccess) == 0x000400, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_MakeLiteralName_ReturnValue_2) == 0x000404, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_MakeLiteralName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_MakeLiteralName_ReturnValue_3) == 0x00040C, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_MakeLiteralName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_Get_ReturnValue) == 0x000418, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_IsEarlyAccessBuild_ReturnValue) == 0x000420, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_IsEarlyAccessBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, K2Node_CustomEvent_RecollectionBossDataHandle) == 0x000428, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::K2Node_CustomEvent_RecollectionBossDataHandle' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_MakeLiteralName_ReturnValue_4) == 0x000438, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_MakeLiteralName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_MakeLiteralName_ReturnValue_5) == 0x000440, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_MakeLiteralName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000448, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_MakeLiteralBool_ReturnValue) == 0x000450, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_MakeLiteralBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_MakeLiteralName_ReturnValue_6) == 0x000454, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_MakeLiteralName_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_MakeLiteralBool_ReturnValue_1) == 0x00045C, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_MakeLiteralBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000460, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_Get_ReturnValue_1) == 0x000468, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_GetEndTime_ReturnValue) == 0x000470, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x000474, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000478, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x000480, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000490, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, Temp_text_Variable_2) == 0x000498, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_Get_ReturnValue_2) == 0x0004A8, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_Get_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, K2Node_Event_InFocusEvent) == 0x0004B0, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_SelectFloat_ReturnValue) == 0x0004B8, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_TryAutoOpenRecollection_bOpened) == 0x0004C0, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_TryAutoOpenRecollection_bOpened' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x0004C8, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x0004D0, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_SetViewportOverlayRenderOpacity_Opacity_ImplicitCast) == 0x0004D8, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_SetViewportOverlayRenderOpacity_Opacity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu, CallFunc_SetViewportOverlayRenderOpacity_Opacity_ImplicitCast_1) == 0x0004DC, "Member 'WBP_RestMenu_C_ExecuteUbergraph_WBP_RestMenu::CallFunc_SetViewportOverlayRenderOpacity_Opacity_ImplicitCast_1' has a wrong offset!");

// Function WBP_RestMenu.WBP_RestMenu_C.LoadRestPointData
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_RestMenu_C_LoadRestPointData final
{
public:
	struct FDataTableRowHandle                    RestPointDataHandle;                               // 0x0000(0x0010)(Edit, BlueprintVisible, NoDestructor)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    CallFunc_GetValueRowHandle_ReturnValue;            // 0x0020(0x0010)(NoDestructor)
	struct FRestPointData                         CallFunc_GetDataTableRowFromName_OutRow;           // 0x0030(0x0088)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RestMenu_C_LoadRestPointData) == 0x000008, "Wrong alignment on WBP_RestMenu_C_LoadRestPointData");
static_assert(sizeof(WBP_RestMenu_C_LoadRestPointData) == 0x0000C0, "Wrong size on WBP_RestMenu_C_LoadRestPointData");
static_assert(offsetof(WBP_RestMenu_C_LoadRestPointData, RestPointDataHandle) == 0x000000, "Member 'WBP_RestMenu_C_LoadRestPointData::RestPointDataHandle' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_LoadRestPointData, CallFunc_MakeLiteralName_ReturnValue) == 0x000010, "Member 'WBP_RestMenu_C_LoadRestPointData::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_LoadRestPointData, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_RestMenu_C_LoadRestPointData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_LoadRestPointData, CallFunc_GetValueRowHandle_ReturnValue) == 0x000020, "Member 'WBP_RestMenu_C_LoadRestPointData::CallFunc_GetValueRowHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_LoadRestPointData, CallFunc_GetDataTableRowFromName_OutRow) == 0x000030, "Member 'WBP_RestMenu_C_LoadRestPointData::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_LoadRestPointData, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000B8, "Member 'WBP_RestMenu_C_LoadRestPointData::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function WBP_RestMenu.WBP_RestMenu_C.LoadRestPointEventData
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_RestMenu_C_LoadRestPointEventData final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    CallFunc_GetAvailableRestEvent_out_RestPointEventRowHandle; // 0x0010(0x0010)(NoDestructor)
	struct FRestPointEventData                    CallFunc_GetAvailableRestEvent_out_RestPointEventData; // 0x0020(0x0090)()
	bool                                          CallFunc_GetAvailableRestEvent_ReturnValue;        // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RestMenu_C_LoadRestPointEventData) == 0x000008, "Wrong alignment on WBP_RestMenu_C_LoadRestPointEventData");
static_assert(sizeof(WBP_RestMenu_C_LoadRestPointEventData) == 0x0000B8, "Wrong size on WBP_RestMenu_C_LoadRestPointEventData");
static_assert(offsetof(WBP_RestMenu_C_LoadRestPointEventData, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'WBP_RestMenu_C_LoadRestPointEventData::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_LoadRestPointEventData, CallFunc_Get_ReturnValue) == 0x000008, "Member 'WBP_RestMenu_C_LoadRestPointEventData::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_LoadRestPointEventData, CallFunc_GetAvailableRestEvent_out_RestPointEventRowHandle) == 0x000010, "Member 'WBP_RestMenu_C_LoadRestPointEventData::CallFunc_GetAvailableRestEvent_out_RestPointEventRowHandle' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_LoadRestPointEventData, CallFunc_GetAvailableRestEvent_out_RestPointEventData) == 0x000020, "Member 'WBP_RestMenu_C_LoadRestPointEventData::CallFunc_GetAvailableRestEvent_out_RestPointEventData' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_LoadRestPointEventData, CallFunc_GetAvailableRestEvent_ReturnValue) == 0x0000B0, "Member 'WBP_RestMenu_C_LoadRestPointEventData::CallFunc_GetAvailableRestEvent_ReturnValue' has a wrong offset!");

// Function WBP_RestMenu.WBP_RestMenu_C.OnFastTravelRequested
// 0x0090 (0x0090 - 0x0000)
struct WBP_RestMenu_C_OnFastTravelRequested final
{
public:
	class FName                                   RestPointID;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRestPointData                         RestPointData_0;                                   // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_RestMenu_C_OnFastTravelRequested) == 0x000008, "Wrong alignment on WBP_RestMenu_C_OnFastTravelRequested");
static_assert(sizeof(WBP_RestMenu_C_OnFastTravelRequested) == 0x000090, "Wrong size on WBP_RestMenu_C_OnFastTravelRequested");
static_assert(offsetof(WBP_RestMenu_C_OnFastTravelRequested, RestPointID) == 0x000000, "Member 'WBP_RestMenu_C_OnFastTravelRequested::RestPointID' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_OnFastTravelRequested, RestPointData_0) == 0x000008, "Member 'WBP_RestMenu_C_OnFastTravelRequested::RestPointData_0' has a wrong offset!");

// Function WBP_RestMenu.WBP_RestMenu_C.OnFocusReceived
// 0x01C8 (0x01C8 - 0x0000)
struct WBP_RestMenu_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0100(0x00B8)()
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RestMenu_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_RestMenu_C_OnFocusReceived");
static_assert(sizeof(WBP_RestMenu_C_OnFocusReceived) == 0x0001C8, "Wrong size on WBP_RestMenu_C_OnFocusReceived");
static_assert(offsetof(WBP_RestMenu_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_RestMenu_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_RestMenu_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_RestMenu_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_OnFocusReceived, Temp_bool_Variable) == 0x0000F8, "Member 'WBP_RestMenu_C_OnFocusReceived::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000100, "Member 'WBP_RestMenu_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_OnFocusReceived, CallFunc_GetIsEnabled_ReturnValue) == 0x0001B8, "Member 'WBP_RestMenu_C_OnFocusReceived::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_OnFocusReceived, K2Node_Select_Default) == 0x0001C0, "Member 'WBP_RestMenu_C_OnFocusReceived::K2Node_Select_Default' has a wrong offset!");

// Function WBP_RestMenu.WBP_RestMenu_C.OnPressCancel
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_RestMenu_C_OnPressCancel final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_RestMenu_C_OnPressCancel) == 0x000008, "Wrong alignment on WBP_RestMenu_C_OnPressCancel");
static_assert(sizeof(WBP_RestMenu_C_OnPressCancel) == 0x0001B0, "Wrong size on WBP_RestMenu_C_OnPressCancel");
static_assert(offsetof(WBP_RestMenu_C_OnPressCancel, KeyEvent) == 0x000000, "Member 'WBP_RestMenu_C_OnPressCancel::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_OnPressCancel, ReturnValue) == 0x000040, "Member 'WBP_RestMenu_C_OnPressCancel::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_OnPressCancel, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_RestMenu_C_OnPressCancel::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_RestMenu.WBP_RestMenu_C.OnPressContext
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_RestMenu_C_OnPressContext final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_RestMenu_C_OnPressContext) == 0x000008, "Wrong alignment on WBP_RestMenu_C_OnPressContext");
static_assert(sizeof(WBP_RestMenu_C_OnPressContext) == 0x0001B0, "Wrong size on WBP_RestMenu_C_OnPressContext");
static_assert(offsetof(WBP_RestMenu_C_OnPressContext, KeyEvent) == 0x000000, "Member 'WBP_RestMenu_C_OnPressContext::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_OnPressContext, ReturnValue) == 0x000040, "Member 'WBP_RestMenu_C_OnPressContext::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_OnPressContext, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_RestMenu_C_OnPressContext::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_RestMenu.WBP_RestMenu_C.OnPressContextAlt
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_RestMenu_C_OnPressContextAlt final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_RestMenu_C_OnPressContextAlt) == 0x000008, "Wrong alignment on WBP_RestMenu_C_OnPressContextAlt");
static_assert(sizeof(WBP_RestMenu_C_OnPressContextAlt) == 0x0001B0, "Wrong size on WBP_RestMenu_C_OnPressContextAlt");
static_assert(offsetof(WBP_RestMenu_C_OnPressContextAlt, KeyEvent) == 0x000000, "Member 'WBP_RestMenu_C_OnPressContextAlt::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_OnPressContextAlt, ReturnValue) == 0x000040, "Member 'WBP_RestMenu_C_OnPressContextAlt::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_C_OnPressContextAlt, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_RestMenu_C_OnPressContextAlt::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_RestMenu.WBP_RestMenu_C.OnPreviewKeyDown
// 0x02D0 (0x02D0 - 0x0000)
struct WBP_RestMenu_C_OnPreviewKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0130(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsRepeatKeyEvent_ReturnValue;             // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUIContextAltKey_ReturnValue;            // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUIConfirmKey_ReturnValue;               // 0x014B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUICancelKey_ReturnValue;                // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0150(0x00B8)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20B[0x5];                                      // 0x020B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0210(0x00B8)()
