#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SkillData_ProgressBar

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_SkillData_ProgressBar.WBP_SkillData_ProgressBar_C.SetSubRating
// 0x0018 (0x0018 - 0x0000)
struct WBP_SkillData_ProgressBar_C_SetSubRating final
{
public:
	double                                        SubRating;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SkillData_ProgressBar_C_SetSubRating) == 0x000008, "Wrong alignment on WBP_SkillData_ProgressBar_C_SetSubRating");
static_assert(sizeof(WBP_SkillData_ProgressBar_C_SetSubRating) == 0x000018, "Wrong size on WBP_SkillData_ProgressBar_C_SetSubRating");
static_assert(offsetof(WBP_SkillData_ProgressBar_C_SetSubRating, SubRating) == 0x000000, "Member 'WBP_SkillData_ProgressBar_C_SetSubRating::SubRating' has a wrong offset!");
static_assert(offsetof(WBP_SkillData_ProgressBar_C_SetSubRating, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_SkillData_ProgressBar_C_SetSubRating::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillData_ProgressBar_C_SetSubRating, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000010, "Member 'WBP_SkillData_ProgressBar_C_SetSubRating::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function WBP_SkillData_ProgressBar.WBP_SkillData_ProgressBar_C.SetRating
// 0x0028 (0x0028 - 0x0000)
struct WBP_SkillData_ProgressBar_C_SetRating final
{
public:
	float                                         Rating;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SubRating;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SkillData_ProgressBar_C_SetRating) == 0x000008, "Wrong alignment on WBP_SkillData_ProgressBar_C_SetRating");
static_assert(sizeof(WBP_SkillData_ProgressBar_C_SetRating) == 0x000028, "Wrong size on WBP_SkillData_ProgressBar_C_SetRating");
static_assert(offsetof(WBP_SkillData_ProgressBar_C_SetRating, Rating) == 0x000000, "Member 'WBP_SkillData_ProgressBar_C_SetRating::Rating' has a wrong offset!");
static_assert(offsetof(WBP_SkillData_ProgressBar_C_SetRating, SubRating) == 0x000008, "Member 'WBP_SkillData_ProgressBar_C_SetRating::SubRating' has a wrong offset!");
static_assert(offsetof(WBP_SkillData_ProgressBar_C_SetRating, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_SkillData_ProgressBar_C_SetRating::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillData_ProgressBar_C_SetRating, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000018, "Member 'WBP_SkillData_ProgressBar_C_SetRating::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_SkillData_ProgressBar_C_SetRating, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000020, "Member 'WBP_SkillData_ProgressBar_C_SetRating::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

}

