#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugMenu_Element_Choice_Toggle_Aptitude

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DebugMenu_Element_Choice_Toggle_Aptitude.WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C
// 0x0028 (0x0488 - 0x0460)
class UWBP_DebugMenu_Element_Choice_Toggle_Aptitude_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_DebugMenu_Element_Choice_Toggle_C* WBP_DebugMenu_Element_Choice_Toggle;               // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    AptitudeData;                                      // 0x0470(0x0010)(Edit, BlueprintVisible, Transient, NoDestructor, AdvancedDisplay, ExposeOnSpawn)
	bool                                          HandleLeftRight;                                   // 0x0480(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Toggle_Aptitude(int32 EntryPoint);
	void Construct();
	void BndEvt__WBP_DebugMenu_Element_Choice_Toggle_Command_WBP_DebugMenu_Element_Choice_Toggle_K2Node_ComponentBoundEvent_0_OnToggle__DelegateSignature(bool ToggleValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DebugMenu_Element_Choice_Toggle_Aptitude_C">();
	}
	static class UWBP_DebugMenu_Element_Choice_Toggle_Aptitude_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DebugMenu_Element_Choice_Toggle_Aptitude_C>();
	}
};
static_assert(alignof(UWBP_DebugMenu_Element_Choice_Toggle_Aptitude_C) == 0x000008, "Wrong alignment on UWBP_DebugMenu_Element_Choice_Toggle_Aptitude_C");
static_assert(sizeof(UWBP_DebugMenu_Element_Choice_Toggle_Aptitude_C) == 0x000488, "Wrong size on UWBP_DebugMenu_Element_Choice_Toggle_Aptitude_C");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Toggle_Aptitude_C, UberGraphFrame) == 0x000460, "Member 'UWBP_DebugMenu_Element_Choice_Toggle_Aptitude_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Toggle_Aptitude_C, WBP_DebugMenu_Element_Choice_Toggle) == 0x000468, "Member 'UWBP_DebugMenu_Element_Choice_Toggle_Aptitude_C::WBP_DebugMenu_Element_Choice_Toggle' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Toggle_Aptitude_C, AptitudeData) == 0x000470, "Member 'UWBP_DebugMenu_Element_Choice_Toggle_Aptitude_C::AptitudeData' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Toggle_Aptitude_C, HandleLeftRight) == 0x000480, "Member 'UWBP_DebugMenu_Element_Choice_Toggle_Aptitude_C::HandleLeftRight' has a wrong offset!");

}

