#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MapIcon_StoryEvent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MapIcon_StoryEvent.WBP_MapIcon_StoryEvent_C
// 0x0018 (0x05A0 - 0x0588)
class UWBP_MapIcon_StoryEvent_C final : public UUserWidgetMapIcon_StoryEvent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0588(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x0590(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                StickyBorder;                                      // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_MapIcon_StoryEvent(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MapIcon_StoryEvent_C">();
	}
	static class UWBP_MapIcon_StoryEvent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MapIcon_StoryEvent_C>();
	}
};
static_assert(alignof(UWBP_MapIcon_StoryEvent_C) == 0x000008, "Wrong alignment on UWBP_MapIcon_StoryEvent_C");
static_assert(sizeof(UWBP_MapIcon_StoryEvent_C) == 0x0005A0, "Wrong size on UWBP_MapIcon_StoryEvent_C");
static_assert(offsetof(UWBP_MapIcon_StoryEvent_C, UberGraphFrame) == 0x000588, "Member 'UWBP_MapIcon_StoryEvent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MapIcon_StoryEvent_C, Loop) == 0x000590, "Member 'UWBP_MapIcon_StoryEvent_C::Loop' has a wrong offset!");
static_assert(offsetof(UWBP_MapIcon_StoryEvent_C, StickyBorder) == 0x000598, "Member 'UWBP_MapIcon_StoryEvent_C::StickyBorder' has a wrong offset!");

}

