#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InputBuffer_Log_Raw

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function WBP_InputBuffer_Log_Raw.WBP_InputBuffer_Log_Raw_C.ExecuteUbergraph_WBP_InputBuffer_Log_Raw
// 0x01C8 (0x01C8 - 0x0000)
struct WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0018(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_InputBuffer_Entry_C*               CallFunc_Create_ReturnValue;                       // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputBufferComponent*                  CallFunc_GetComponentByClass_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_InputBuffer_Entry_C*               CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetInputSnapshotCount_ReturnValue;        // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimedInputSnapshot                    CallFunc_GetInputSnapshotAtIndex_ReturnValue;      // 0x00B0(0x0118)(ConstParm)
};
static_assert(alignof(WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw) == 0x000008, "Wrong alignment on WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw");
static_assert(sizeof(WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw) == 0x0001C8, "Wrong size on WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw");
static_assert(offsetof(WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw, EntryPoint) == 0x000000, "Member 'WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw, Temp_int_Variable) == 0x000004, "Member 'WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw, Temp_int_Variable_1) == 0x000008, "Member 'WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw, K2Node_Event_MyGeometry) == 0x000018, "Member 'WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw, K2Node_Event_InDeltaTime) == 0x000050, "Member 'WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw, CallFunc_GetPlayerController_ReturnValue) == 0x000058, "Member 'WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw, CallFunc_Create_ReturnValue) == 0x000060, "Member 'WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw, CallFunc_K2_GetPawn_ReturnValue) == 0x000068, "Member 'WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw, CallFunc_Array_Add_ReturnValue) == 0x000074, "Member 'WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw, CallFunc_GetComponentByClass_ReturnValue) == 0x000078, "Member 'WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw, CallFunc_Array_Get_Item) == 0x000088, "Member 'WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw, CallFunc_GetInputSnapshotCount_ReturnValue) == 0x000090, "Member 'WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw::CallFunc_GetInputSnapshotCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw, CallFunc_Greater_IntInt_ReturnValue) == 0x000094, "Member 'WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000098, "Member 'WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000A0, "Member 'WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0000A4, "Member 'WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0000A8, "Member 'WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw, CallFunc_GetInputSnapshotAtIndex_ReturnValue) == 0x0000B0, "Member 'WBP_InputBuffer_Log_Raw_C_ExecuteUbergraph_WBP_InputBuffer_Log_Raw::CallFunc_GetInputSnapshotAtIndex_ReturnValue' has a wrong offset!");

// Function WBP_InputBuffer_Log_Raw.WBP_InputBuffer_Log_Raw_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_InputBuffer_Log_Raw_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InputBuffer_Log_Raw_C_Tick) == 0x000004, "Wrong alignment on WBP_InputBuffer_Log_Raw_C_Tick");
static_assert(sizeof(WBP_InputBuffer_Log_Raw_C_Tick) == 0x00003C, "Wrong size on WBP_InputBuffer_Log_Raw_C_Tick");
static_assert(offsetof(WBP_InputBuffer_Log_Raw_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_InputBuffer_Log_Raw_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_InputBuffer_Log_Raw_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_InputBuffer_Log_Raw_C_Tick::InDeltaTime' has a wrong offset!");

}

