#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Debug_Extra_SpineOverlay

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Debug_Extra_SpineOverlay.WBP_Debug_Extra_SpineOverlay_C.SetZoomMinMax
// 0x0008 (0x0008 - 0x0000)
struct WBP_Debug_Extra_SpineOverlay_C_SetZoomMinMax final
{
public:
	float                                         ZoomMin;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ZoomMax;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_Extra_SpineOverlay_C_SetZoomMinMax) == 0x000004, "Wrong alignment on WBP_Debug_Extra_SpineOverlay_C_SetZoomMinMax");
static_assert(sizeof(WBP_Debug_Extra_SpineOverlay_C_SetZoomMinMax) == 0x000008, "Wrong size on WBP_Debug_Extra_SpineOverlay_C_SetZoomMinMax");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_SetZoomMinMax, ZoomMin) == 0x000000, "Member 'WBP_Debug_Extra_SpineOverlay_C_SetZoomMinMax::ZoomMin' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_SetZoomMinMax, ZoomMax) == 0x000004, "Member 'WBP_Debug_Extra_SpineOverlay_C_SetZoomMinMax::ZoomMax' has a wrong offset!");

// Function WBP_Debug_Extra_SpineOverlay.WBP_Debug_Extra_SpineOverlay_C.SetSceneOffset
// 0x0028 (0x0028 - 0x0000)
struct WBP_Debug_Extra_SpineOverlay_C_SetSceneOffset final
{
public:
	struct FVector2D                              SceneOffset_0;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_NewValue_ImplicitCast;           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_NewValue_ImplicitCast_1;         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_Extra_SpineOverlay_C_SetSceneOffset) == 0x000008, "Wrong alignment on WBP_Debug_Extra_SpineOverlay_C_SetSceneOffset");
static_assert(sizeof(WBP_Debug_Extra_SpineOverlay_C_SetSceneOffset) == 0x000028, "Wrong size on WBP_Debug_Extra_SpineOverlay_C_SetSceneOffset");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_SetSceneOffset, SceneOffset_0) == 0x000000, "Member 'WBP_Debug_Extra_SpineOverlay_C_SetSceneOffset::SceneOffset_0' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_SetSceneOffset, CallFunc_BreakVector2D_X) == 0x000010, "Member 'WBP_Debug_Extra_SpineOverlay_C_SetSceneOffset::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_SetSceneOffset, CallFunc_BreakVector2D_Y) == 0x000018, "Member 'WBP_Debug_Extra_SpineOverlay_C_SetSceneOffset::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_SetSceneOffset, CallFunc_SetValue_NewValue_ImplicitCast) == 0x000020, "Member 'WBP_Debug_Extra_SpineOverlay_C_SetSceneOffset::CallFunc_SetValue_NewValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_SetSceneOffset, CallFunc_SetValue_NewValue_ImplicitCast_1) == 0x000024, "Member 'WBP_Debug_Extra_SpineOverlay_C_SetSceneOffset::CallFunc_SetValue_NewValue_ImplicitCast_1' has a wrong offset!");

// Function WBP_Debug_Extra_SpineOverlay.WBP_Debug_Extra_SpineOverlay_C.SetOffset
// 0x0028 (0x0028 - 0x0000)
struct WBP_Debug_Extra_SpineOverlay_C_SetOffset final
{
public:
	struct FVector2D                              Offset;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_NewValue_ImplicitCast;           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_NewValue_ImplicitCast_1;         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_Extra_SpineOverlay_C_SetOffset) == 0x000008, "Wrong alignment on WBP_Debug_Extra_SpineOverlay_C_SetOffset");
static_assert(sizeof(WBP_Debug_Extra_SpineOverlay_C_SetOffset) == 0x000028, "Wrong size on WBP_Debug_Extra_SpineOverlay_C_SetOffset");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_SetOffset, Offset) == 0x000000, "Member 'WBP_Debug_Extra_SpineOverlay_C_SetOffset::Offset' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_SetOffset, CallFunc_BreakVector2D_X) == 0x000010, "Member 'WBP_Debug_Extra_SpineOverlay_C_SetOffset::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_SetOffset, CallFunc_BreakVector2D_Y) == 0x000018, "Member 'WBP_Debug_Extra_SpineOverlay_C_SetOffset::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_SetOffset, CallFunc_SetValue_NewValue_ImplicitCast) == 0x000020, "Member 'WBP_Debug_Extra_SpineOverlay_C_SetOffset::CallFunc_SetValue_NewValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_SetOffset, CallFunc_SetValue_NewValue_ImplicitCast_1) == 0x000024, "Member 'WBP_Debug_Extra_SpineOverlay_C_SetOffset::CallFunc_SetValue_NewValue_ImplicitCast_1' has a wrong offset!");

// Function WBP_Debug_Extra_SpineOverlay.WBP_Debug_Extra_SpineOverlay_C.ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_InValue_5;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEditor_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_InValue_4;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_InValue_3;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_InValue_2;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_InValue_1;              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_2;                        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_2;                        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_InValue;                // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X_3;                        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_3;                        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_X_ImplicitCast;              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_Y_ImplicitCast;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CallDelegate_NewZoomMin_ImplicitCast;       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CallDelegate_NewZoomMax_ImplicitCast;       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_X_ImplicitCast_1;            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_Y_ImplicitCast_1;            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay) == 0x000008, "Wrong alignment on WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay");
static_assert(sizeof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay) == 0x0000E8, "Wrong size on WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay, EntryPoint) == 0x000000, "Member 'WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay, Temp_bool_Variable) == 0x000004, "Member 'WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay, CallFunc_BreakVector2D_X) == 0x000008, "Member 'WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay, CallFunc_BreakVector2D_Y) == 0x000010, "Member 'WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay, CallFunc_BreakVector2D_X_1) == 0x000018, "Member 'WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay, CallFunc_BreakVector2D_Y_1) == 0x000020, "Member 'WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay, K2Node_ComponentBoundEvent_InValue_5) == 0x000028, "Member 'WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay::K2Node_ComponentBoundEvent_InValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay, CallFunc_MakeVector2D_ReturnValue) == 0x000030, "Member 'WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay, CallFunc_IsEditor_ReturnValue) == 0x000040, "Member 'WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay::CallFunc_IsEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay, K2Node_ComponentBoundEvent_InValue_4) == 0x000044, "Member 'WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay::K2Node_ComponentBoundEvent_InValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay, K2Node_ComponentBoundEvent_InValue_3) == 0x000048, "Member 'WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay::K2Node_ComponentBoundEvent_InValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay, CallFunc_MakeVector2D_ReturnValue_1) == 0x000050, "Member 'WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay, K2Node_ComponentBoundEvent_InValue_2) == 0x000060, "Member 'WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay::K2Node_ComponentBoundEvent_InValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay, K2Node_ComponentBoundEvent_InValue_1) == 0x000064, "Member 'WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay::K2Node_ComponentBoundEvent_InValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay, CallFunc_BreakVector2D_X_2) == 0x000068, "Member 'WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay, CallFunc_BreakVector2D_Y_2) == 0x000070, "Member 'WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay, CallFunc_MakeVector2D_ReturnValue_2) == 0x000078, "Member 'WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay, Temp_byte_Variable) == 0x000088, "Member 'WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay, Temp_byte_Variable_1) == 0x000089, "Member 'WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay, K2Node_ComponentBoundEvent_InValue) == 0x00008C, "Member 'WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay::K2Node_ComponentBoundEvent_InValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay, K2Node_Select_Default) == 0x000090, "Member 'WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay, CallFunc_BreakVector2D_X_3) == 0x000098, "Member 'WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay::CallFunc_BreakVector2D_X_3' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay, CallFunc_BreakVector2D_Y_3) == 0x0000A0, "Member 'WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay::CallFunc_BreakVector2D_Y_3' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay, CallFunc_MakeVector2D_ReturnValue_3) == 0x0000A8, "Member 'WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay::CallFunc_MakeVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay, CallFunc_MakeVector2D_X_ImplicitCast) == 0x0000B8, "Member 'WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay::CallFunc_MakeVector2D_X_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay, CallFunc_MakeVector2D_Y_ImplicitCast) == 0x0000C0, "Member 'WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay::CallFunc_MakeVector2D_Y_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay, K2Node_CallDelegate_NewZoomMin_ImplicitCast) == 0x0000C8, "Member 'WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay::K2Node_CallDelegate_NewZoomMin_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay, K2Node_CallDelegate_NewZoomMax_ImplicitCast) == 0x0000D0, "Member 'WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay::K2Node_CallDelegate_NewZoomMax_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay, CallFunc_MakeVector2D_X_ImplicitCast_1) == 0x0000D8, "Member 'WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay::CallFunc_MakeVector2D_X_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay, CallFunc_MakeVector2D_Y_ImplicitCast_1) == 0x0000E0, "Member 'WBP_Debug_Extra_SpineOverlay_C_ExecuteUbergraph_WBP_Debug_Extra_SpineOverlay::CallFunc_MakeVector2D_Y_ImplicitCast_1' has a wrong offset!");

// Function WBP_Debug_Extra_SpineOverlay.WBP_Debug_Extra_SpineOverlay_C.BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_ZoomMin_K2Node_ComponentBoundEvent_3_OnSpinBoxValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_ZoomMin_K2Node_ComponentBoundEvent_3_OnSpinBoxValueChangedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_ZoomMin_K2Node_ComponentBoundEvent_3_OnSpinBoxValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_ZoomMin_K2Node_ComponentBoundEvent_3_OnSpinBoxValueChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_ZoomMin_K2Node_ComponentBoundEvent_3_OnSpinBoxValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_ZoomMin_K2Node_ComponentBoundEvent_3_OnSpinBoxValueChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_ZoomMin_K2Node_ComponentBoundEvent_3_OnSpinBoxValueChangedEvent__DelegateSignature, InValue) == 0x000000, "Member 'WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_ZoomMin_K2Node_ComponentBoundEvent_3_OnSpinBoxValueChangedEvent__DelegateSignature::InValue' has a wrong offset!");

// Function WBP_Debug_Extra_SpineOverlay.WBP_Debug_Extra_SpineOverlay_C.BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_ZoomMax_K2Node_ComponentBoundEvent_4_OnSpinBoxValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_ZoomMax_K2Node_ComponentBoundEvent_4_OnSpinBoxValueChangedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_ZoomMax_K2Node_ComponentBoundEvent_4_OnSpinBoxValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_ZoomMax_K2Node_ComponentBoundEvent_4_OnSpinBoxValueChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_ZoomMax_K2Node_ComponentBoundEvent_4_OnSpinBoxValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_ZoomMax_K2Node_ComponentBoundEvent_4_OnSpinBoxValueChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_ZoomMax_K2Node_ComponentBoundEvent_4_OnSpinBoxValueChangedEvent__DelegateSignature, InValue) == 0x000000, "Member 'WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_ZoomMax_K2Node_ComponentBoundEvent_4_OnSpinBoxValueChangedEvent__DelegateSignature::InValue' has a wrong offset!");

// Function WBP_Debug_Extra_SpineOverlay.WBP_Debug_Extra_SpineOverlay_C.BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_Y_K2Node_ComponentBoundEvent_2_OnSpinBoxValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_Y_K2Node_ComponentBoundEvent_2_OnSpinBoxValueChangedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_Y_K2Node_ComponentBoundEvent_2_OnSpinBoxValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_Y_K2Node_ComponentBoundEvent_2_OnSpinBoxValueChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_Y_K2Node_ComponentBoundEvent_2_OnSpinBoxValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_Y_K2Node_ComponentBoundEvent_2_OnSpinBoxValueChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_Y_K2Node_ComponentBoundEvent_2_OnSpinBoxValueChangedEvent__DelegateSignature, InValue) == 0x000000, "Member 'WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_Y_K2Node_ComponentBoundEvent_2_OnSpinBoxValueChangedEvent__DelegateSignature::InValue' has a wrong offset!");

// Function WBP_Debug_Extra_SpineOverlay.WBP_Debug_Extra_SpineOverlay_C.BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_X_K2Node_ComponentBoundEvent_1_OnSpinBoxValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_X_K2Node_ComponentBoundEvent_1_OnSpinBoxValueChangedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_X_K2Node_ComponentBoundEvent_1_OnSpinBoxValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_X_K2Node_ComponentBoundEvent_1_OnSpinBoxValueChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_X_K2Node_ComponentBoundEvent_1_OnSpinBoxValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_X_K2Node_ComponentBoundEvent_1_OnSpinBoxValueChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_X_K2Node_ComponentBoundEvent_1_OnSpinBoxValueChangedEvent__DelegateSignature, InValue) == 0x000000, "Member 'WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_X_K2Node_ComponentBoundEvent_1_OnSpinBoxValueChangedEvent__DelegateSignature::InValue' has a wrong offset!");

// Function WBP_Debug_Extra_SpineOverlay.WBP_Debug_Extra_SpineOverlay_C.BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_SceneY_K2Node_ComponentBoundEvent_5_OnSpinBoxValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_SceneY_K2Node_ComponentBoundEvent_5_OnSpinBoxValueChangedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_SceneY_K2Node_ComponentBoundEvent_5_OnSpinBoxValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_SceneY_K2Node_ComponentBoundEvent_5_OnSpinBoxValueChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_SceneY_K2Node_ComponentBoundEvent_5_OnSpinBoxValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_SceneY_K2Node_ComponentBoundEvent_5_OnSpinBoxValueChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_SceneY_K2Node_ComponentBoundEvent_5_OnSpinBoxValueChangedEvent__DelegateSignature, InValue) == 0x000000, "Member 'WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_SceneY_K2Node_ComponentBoundEvent_5_OnSpinBoxValueChangedEvent__DelegateSignature::InValue' has a wrong offset!");

// Function WBP_Debug_Extra_SpineOverlay.WBP_Debug_Extra_SpineOverlay_C.BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_SceneX_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_SceneX_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_SceneX_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_SceneX_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_SceneX_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on WBP_Debug_Extra_SpineOverlay_C_BndEvt__WBP_Debug_Extra_SpineOverlay_SpinBox_SceneX_K2Node_ComponentBoundEvent_0_OnSpinBoxValueChangedEvent__DelegateSignature");
