#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_Entry_Label

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Settings_Entry_Label.WBP_Settings_Entry_Label_C
// 0x0050 (0x04B0 - 0x0460)
class UWBP_Settings_Entry_Label_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             LabelBlock;                                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LabelIcon;                                         // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              LabelScaleBox;                                     // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             OptionSlot;                                        // 0x0480(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_Entry_FocusDisplay_C*     WBP_Settings_Entry_FocusDisplay;                   // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Label;                                             // 0x0490(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	class UPaperSprite*                           LabelImage;                                        // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EStretch                                      LabelScaleBoxStretch;                              // 0x04A8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetLabelScaleBoxStretch(EStretch InStretch);
	void SetLabelImage(class UPaperSprite* InputPin);
	void SetLabel(const class FText& InText);
	void SetFocusDisplay(bool Focused);
	void PreConstruct(bool IsDesignTime);
	void OnSetIsEnabled(bool bInIsEnabled);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void ExecuteUbergraph_WBP_Settings_Entry_Label(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Settings_Entry_Label_C">();
	}
	static class UWBP_Settings_Entry_Label_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Settings_Entry_Label_C>();
	}
};
static_assert(alignof(UWBP_Settings_Entry_Label_C) == 0x000008, "Wrong alignment on UWBP_Settings_Entry_Label_C");
static_assert(sizeof(UWBP_Settings_Entry_Label_C) == 0x0004B0, "Wrong size on UWBP_Settings_Entry_Label_C");
static_assert(offsetof(UWBP_Settings_Entry_Label_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Settings_Entry_Label_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_Label_C, LabelBlock) == 0x000468, "Member 'UWBP_Settings_Entry_Label_C::LabelBlock' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_Label_C, LabelIcon) == 0x000470, "Member 'UWBP_Settings_Entry_Label_C::LabelIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_Label_C, LabelScaleBox) == 0x000478, "Member 'UWBP_Settings_Entry_Label_C::LabelScaleBox' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_Label_C, OptionSlot) == 0x000480, "Member 'UWBP_Settings_Entry_Label_C::OptionSlot' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_Label_C, WBP_Settings_Entry_FocusDisplay) == 0x000488, "Member 'UWBP_Settings_Entry_Label_C::WBP_Settings_Entry_FocusDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_Label_C, Label) == 0x000490, "Member 'UWBP_Settings_Entry_Label_C::Label' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_Label_C, LabelImage) == 0x0004A0, "Member 'UWBP_Settings_Entry_Label_C::LabelImage' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_Label_C, LabelScaleBoxStretch) == 0x0004A8, "Member 'UWBP_Settings_Entry_Label_C::LabelScaleBoxStretch' has a wrong offset!");

}

