#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_Entry_Choice_AntiAliasingType

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Settings_Entry_Choice_AntiAliasingType.WBP_Settings_Entry_Choice_AntiAliasingType_C
// 0x0088 (0x04E8 - 0x0460)
class UWBP_Settings_Entry_Choice_AntiAliasingType_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Settings_Entry_Choice_Text_C*      WBP_Settings_Entry_Choice_Text;                    // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrIndex;                                         // 0x0470(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_474[0x4];                                      // 0x0474(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EAntiAliasingMethod, class FText>        AATypeTextMap;                                     // 0x0478(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly)
	TArray<EAntiAliasingMethod>                   AATypes;                                           // 0x04C8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	TMulticastInlineDelegate<void()>              OnAntiAliasingTypeChanged;                         // 0x04D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_Settings_Entry_Choice_FPSLimit_WBP_Settings_Entry_Choice_Text_K2Node_ComponentBoundEvent_0_OnLeft__DelegateSignature();
	void BndEvt__WBP_Settings_Entry_Choice_FPSLimit_WBP_Settings_Entry_Choice_Text_K2Node_ComponentBoundEvent_1_OnRight__DelegateSignature();
	void ComputeCurrIndex();
	void Construct();
	void ExecuteUbergraph_WBP_Settings_Entry_Choice_AntiAliasingType(int32 EntryPoint);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void PreConstruct(bool IsDesignTime);
	void Refresh();
	void RefreshText();
	void SetAATypeFromIndex(int32 Index_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Settings_Entry_Choice_AntiAliasingType_C">();
	}
	static class UWBP_Settings_Entry_Choice_AntiAliasingType_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Settings_Entry_Choice_AntiAliasingType_C>();
	}
};
static_assert(alignof(UWBP_Settings_Entry_Choice_AntiAliasingType_C) == 0x000008, "Wrong alignment on UWBP_Settings_Entry_Choice_AntiAliasingType_C");
static_assert(sizeof(UWBP_Settings_Entry_Choice_AntiAliasingType_C) == 0x0004E8, "Wrong size on UWBP_Settings_Entry_Choice_AntiAliasingType_C");
static_assert(offsetof(UWBP_Settings_Entry_Choice_AntiAliasingType_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Settings_Entry_Choice_AntiAliasingType_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_Choice_AntiAliasingType_C, WBP_Settings_Entry_Choice_Text) == 0x000468, "Member 'UWBP_Settings_Entry_Choice_AntiAliasingType_C::WBP_Settings_Entry_Choice_Text' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_Choice_AntiAliasingType_C, CurrIndex) == 0x000470, "Member 'UWBP_Settings_Entry_Choice_AntiAliasingType_C::CurrIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_Choice_AntiAliasingType_C, AATypeTextMap) == 0x000478, "Member 'UWBP_Settings_Entry_Choice_AntiAliasingType_C::AATypeTextMap' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_Choice_AntiAliasingType_C, AATypes) == 0x0004C8, "Member 'UWBP_Settings_Entry_Choice_AntiAliasingType_C::AATypes' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_Entry_Choice_AntiAliasingType_C, OnAntiAliasingTypeChanged) == 0x0004D8, "Member 'UWBP_Settings_Entry_Choice_AntiAliasingType_C::OnAntiAliasingTypeChanged' has a wrong offset!");

}

