#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RestMenu_EventBanner

#include "Basic.hpp"

#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function WBP_RestMenu_EventBanner.WBP_RestMenu_EventBanner_C.ExecuteUbergraph_WBP_RestMenu_EventBanner
// 0x0010 (0x0010 - 0x0000)
struct WBP_RestMenu_EventBanner_C_ExecuteUbergraph_WBP_RestMenu_EventBanner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RestMenu_EventBanner_C_ExecuteUbergraph_WBP_RestMenu_EventBanner) == 0x000008, "Wrong alignment on WBP_RestMenu_EventBanner_C_ExecuteUbergraph_WBP_RestMenu_EventBanner");
static_assert(sizeof(WBP_RestMenu_EventBanner_C_ExecuteUbergraph_WBP_RestMenu_EventBanner) == 0x000010, "Wrong size on WBP_RestMenu_EventBanner_C_ExecuteUbergraph_WBP_RestMenu_EventBanner");
static_assert(offsetof(WBP_RestMenu_EventBanner_C_ExecuteUbergraph_WBP_RestMenu_EventBanner, EntryPoint) == 0x000000, "Member 'WBP_RestMenu_EventBanner_C_ExecuteUbergraph_WBP_RestMenu_EventBanner::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_RestMenu_EventBanner_C_ExecuteUbergraph_WBP_RestMenu_EventBanner, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_RestMenu_EventBanner_C_ExecuteUbergraph_WBP_RestMenu_EventBanner::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_RestMenu_EventBanner.WBP_RestMenu_EventBanner_C.Setup
// 0x0090 (0x0090 - 0x0000)
struct WBP_RestMenu_EventBanner_C_Setup final
{
public:
	struct FRestPointEventData                    RestPointEventData;                                // 0x0000(0x0090)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_RestMenu_EventBanner_C_Setup) == 0x000008, "Wrong alignment on WBP_RestMenu_EventBanner_C_Setup");
static_assert(sizeof(WBP_RestMenu_EventBanner_C_Setup) == 0x000090, "Wrong size on WBP_RestMenu_EventBanner_C_Setup");
static_assert(offsetof(WBP_RestMenu_EventBanner_C_Setup, RestPointEventData) == 0x000000, "Member 'WBP_RestMenu_EventBanner_C_Setup::RestPointEventData' has a wrong offset!");

}

