#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ProfileIllustration

#include "Basic.hpp"

#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function WBP_ProfileIllustration.WBP_ProfileIllustration_C.ExecuteUbergraph_WBP_ProfileIllustration
// 0x0004 (0x0004 - 0x0000)
struct WBP_ProfileIllustration_C_ExecuteUbergraph_WBP_ProfileIllustration final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ProfileIllustration_C_ExecuteUbergraph_WBP_ProfileIllustration) == 0x000004, "Wrong alignment on WBP_ProfileIllustration_C_ExecuteUbergraph_WBP_ProfileIllustration");
static_assert(sizeof(WBP_ProfileIllustration_C_ExecuteUbergraph_WBP_ProfileIllustration) == 0x000004, "Wrong size on WBP_ProfileIllustration_C_ExecuteUbergraph_WBP_ProfileIllustration");
static_assert(offsetof(WBP_ProfileIllustration_C_ExecuteUbergraph_WBP_ProfileIllustration, EntryPoint) == 0x000000, "Member 'WBP_ProfileIllustration_C_ExecuteUbergraph_WBP_ProfileIllustration::EntryPoint' has a wrong offset!");

// Function WBP_ProfileIllustration.WBP_ProfileIllustration_C.SetupIllustration
// 0x0078 (0x0078 - 0x0000)
struct WBP_ProfileIllustration_C_SetupIllustration final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConditionedTexture>            CallFunc_GetConditionedTextures_ReturnValue;       // 0x0020(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	struct FConditionedTexture                    CallFunc_Array_Get_Item;                           // 0x0030(0x0040)(ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckGameplayConditions_ReturnValue;      // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ProfileIllustration_C_SetupIllustration) == 0x000008, "Wrong alignment on WBP_ProfileIllustration_C_SetupIllustration");
static_assert(sizeof(WBP_ProfileIllustration_C_SetupIllustration) == 0x000078, "Wrong size on WBP_ProfileIllustration_C_SetupIllustration");
static_assert(offsetof(WBP_ProfileIllustration_C_SetupIllustration, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_ProfileIllustration_C_SetupIllustration::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ProfileIllustration_C_SetupIllustration, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_ProfileIllustration_C_SetupIllustration::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ProfileIllustration_C_SetupIllustration, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_ProfileIllustration_C_SetupIllustration::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ProfileIllustration_C_SetupIllustration, CallFunc_Get_ReturnValue) == 0x000010, "Member 'WBP_ProfileIllustration_C_SetupIllustration::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ProfileIllustration_C_SetupIllustration, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_ProfileIllustration_C_SetupIllustration::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ProfileIllustration_C_SetupIllustration, CallFunc_GetConditionedTextures_ReturnValue) == 0x000020, "Member 'WBP_ProfileIllustration_C_SetupIllustration::CallFunc_GetConditionedTextures_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ProfileIllustration_C_SetupIllustration, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_ProfileIllustration_C_SetupIllustration::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ProfileIllustration_C_SetupIllustration, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'WBP_ProfileIllustration_C_SetupIllustration::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ProfileIllustration_C_SetupIllustration, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'WBP_ProfileIllustration_C_SetupIllustration::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ProfileIllustration_C_SetupIllustration, CallFunc_CheckGameplayConditions_ReturnValue) == 0x000075, "Member 'WBP_ProfileIllustration_C_SetupIllustration::CallFunc_CheckGameplayConditions_ReturnValue' has a wrong offset!");

}

