#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugMenu_Element_Choice_Text_TextureGroup

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_DebugMenu_Element_Choice_Text_TextureGroup.WBP_DebugMenu_Element_Choice_Text_TextureGroup_C.RefreshOptionText
// 0x0028 (0x0028 - 0x0000)
struct WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_RefreshOptionText final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0010)()
};
static_assert(alignof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_RefreshOptionText) == 0x000008, "Wrong alignment on WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_RefreshOptionText");
static_assert(sizeof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_RefreshOptionText) == 0x000028, "Wrong size on WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_RefreshOptionText");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_RefreshOptionText, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_RefreshOptionText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_RefreshOptionText, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000008, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_RefreshOptionText::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_RefreshOptionText, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_RefreshOptionText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_DebugMenu_Element_Choice_Text_TextureGroup.WBP_DebugMenu_Element_Choice_Text_TextureGroup_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_PreConstruct");
static_assert(sizeof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_PreConstruct) == 0x000001, "Wrong size on WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_PreConstruct");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_DebugMenu_Element_Choice_Text_TextureGroup.WBP_DebugMenu_Element_Choice_Text_TextureGroup_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_OnFocusReceived");
static_assert(sizeof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_OnFocusReceived");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_DebugMenu_Element_Choice_Text_TextureGroup.WBP_DebugMenu_Element_Choice_Text_TextureGroup_C.GetTextureGroupIndex
// 0x0014 (0x0014 - 0x0000)
struct WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_GetTextureGroupIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_GetTextureGroupIndex) == 0x000004, "Wrong alignment on WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_GetTextureGroupIndex");
static_assert(sizeof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_GetTextureGroupIndex) == 0x000014, "Wrong size on WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_GetTextureGroupIndex");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_GetTextureGroupIndex, Index_0) == 0x000000, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_GetTextureGroupIndex::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_GetTextureGroupIndex, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_GetTextureGroupIndex::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_GetTextureGroupIndex, CallFunc_Array_Find_ReturnValue) == 0x000008, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_GetTextureGroupIndex::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_GetTextureGroupIndex, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_GetTextureGroupIndex::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_GetTextureGroupIndex, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000010, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_GetTextureGroupIndex::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_DebugMenu_Element_Choice_Text_TextureGroup.WBP_DebugMenu_Element_Choice_Text_TextureGroup_C.ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup
// 0x0080 (0x0080 - 0x0000)
struct WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_TextureChecker_Holder_C*>   CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_TextureChecker_Holder_C*           CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTextureGroupIndex_Index;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_TextureChecker_Holder_C*           CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTextureGroupIndex_Index_1;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_2;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_3;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_TextureChecker_Holder_C*           CallFunc_Create_ReturnValue_1;                     // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup) == 0x000008, "Wrong alignment on WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup");
static_assert(sizeof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup) == 0x000080, "Wrong size on WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup, EntryPoint) == 0x000000, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000008, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup, CallFunc_Greater_IntInt_ReturnValue) == 0x000024, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup, CallFunc_IsValid_ReturnValue_1) == 0x000025, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup, CallFunc_Array_Length_ReturnValue_1) == 0x000028, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup, CallFunc_GetTextureGroupIndex_Index) == 0x00002C, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup::CallFunc_GetTextureGroupIndex_Index' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup, CallFunc_SelectInt_ReturnValue) == 0x000030, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup, CallFunc_Subtract_IntInt_ReturnValue) == 0x000034, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup, CallFunc_SelectInt_ReturnValue_1) == 0x00003C, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup, CallFunc_IsValid_ReturnValue_2) == 0x000040, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000041, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000044, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup, CallFunc_Create_ReturnValue) == 0x000048, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup, CallFunc_IsValid_ReturnValue_3) == 0x000050, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup, K2Node_Event_IsDesignTime) == 0x000051, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup, CallFunc_GetTextureGroupIndex_Index_1) == 0x000054, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup::CallFunc_GetTextureGroupIndex_Index_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup, CallFunc_Array_Length_ReturnValue_2) == 0x000058, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup, CallFunc_SelectInt_ReturnValue_2) == 0x000060, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup::CallFunc_SelectInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup, CallFunc_Less_IntInt_ReturnValue_1) == 0x000064, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup, CallFunc_SelectInt_ReturnValue_3) == 0x000068, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup::CallFunc_SelectInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup, CallFunc_IsValid_ReturnValue_4) == 0x00006C, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup, CallFunc_Greater_IntInt_ReturnValue_2) == 0x00006D, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000070, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup, CallFunc_Create_ReturnValue_1) == 0x000078, "Member 'WBP_DebugMenu_Element_Choice_Text_TextureGroup_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_TextureGroup::CallFunc_Create_ReturnValue_1' has a wrong offset!");

}

