#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MapArea_Completed

#include "Basic.hpp"

#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MapArea_Completed.WBP_MapArea_Completed_C
// 0x0018 (0x0478 - 0x0460)
class UWBP_MapArea_Completed_C final : public UUserWidgetZion
{
public:
	class UImage*                                 CompleteIcon;                                      // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NotCompleteIcon;                                   // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetCompleteState(bool CompleteState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MapArea_Completed_C">();
	}
	static class UWBP_MapArea_Completed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MapArea_Completed_C>();
	}
};
static_assert(alignof(UWBP_MapArea_Completed_C) == 0x000008, "Wrong alignment on UWBP_MapArea_Completed_C");
static_assert(sizeof(UWBP_MapArea_Completed_C) == 0x000478, "Wrong size on UWBP_MapArea_Completed_C");
static_assert(offsetof(UWBP_MapArea_Completed_C, CompleteIcon) == 0x000460, "Member 'UWBP_MapArea_Completed_C::CompleteIcon' has a wrong offset!");
static_assert(offsetof(UWBP_MapArea_Completed_C, NotCompleteIcon) == 0x000468, "Member 'UWBP_MapArea_Completed_C::NotCompleteIcon' has a wrong offset!");
static_assert(offsetof(UWBP_MapArea_Completed_C, WidgetSwitcher) == 0x000470, "Member 'UWBP_MapArea_Completed_C::WidgetSwitcher' has a wrong offset!");

}

