#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugMenu_Page_TextureStreaming

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_DebugMenu_Page_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DebugMenu_Page_TextureStreaming.WBP_DebugMenu_Page_TextureStreaming_C
// 0x0028 (0x04A8 - 0x0480)
class UWBP_DebugMenu_Page_TextureStreaming_C final : public UWBP_DebugMenu_Page_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           VerticalBoxContainer;                              // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Button_C*        WBP_DebugMenu_Element_Button_ListStreamingTextures; // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Button_C*        WBP_DebugMenu_Element_Button_ShowTextureSize;      // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_Text_TextureGroup_C* WBP_DebugMenu_Element_Choice_Text_TextureGroup; // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void ExecuteUbergraph_WBP_DebugMenu_Page_TextureStreaming(int32 EntryPoint);
	void Construct();
	void BndEvt__WBP_DebugMenu_Page_TextureStreaming_WBP_DebugMenu_Element_Button_ShowTextureSize_K2Node_ComponentBoundEvent_0_OnConfirm__DelegateSignature();
	void BndEvt__WBP_DebugMenu_Page_Default_WBP_DebugMenu_Element_Button_Save_K2Node_ComponentBoundEvent_4_OnConfirm__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DebugMenu_Page_TextureStreaming_C">();
	}
	static class UWBP_DebugMenu_Page_TextureStreaming_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DebugMenu_Page_TextureStreaming_C>();
	}
};
static_assert(alignof(UWBP_DebugMenu_Page_TextureStreaming_C) == 0x000008, "Wrong alignment on UWBP_DebugMenu_Page_TextureStreaming_C");
static_assert(sizeof(UWBP_DebugMenu_Page_TextureStreaming_C) == 0x0004A8, "Wrong size on UWBP_DebugMenu_Page_TextureStreaming_C");
static_assert(offsetof(UWBP_DebugMenu_Page_TextureStreaming_C, UberGraphFrame) == 0x000480, "Member 'UWBP_DebugMenu_Page_TextureStreaming_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_TextureStreaming_C, VerticalBoxContainer) == 0x000488, "Member 'UWBP_DebugMenu_Page_TextureStreaming_C::VerticalBoxContainer' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_TextureStreaming_C, WBP_DebugMenu_Element_Button_ListStreamingTextures) == 0x000490, "Member 'UWBP_DebugMenu_Page_TextureStreaming_C::WBP_DebugMenu_Element_Button_ListStreamingTextures' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_TextureStreaming_C, WBP_DebugMenu_Element_Button_ShowTextureSize) == 0x000498, "Member 'UWBP_DebugMenu_Page_TextureStreaming_C::WBP_DebugMenu_Element_Button_ShowTextureSize' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Page_TextureStreaming_C, WBP_DebugMenu_Element_Choice_Text_TextureGroup) == 0x0004A0, "Member 'UWBP_DebugMenu_Page_TextureStreaming_C::WBP_DebugMenu_Element_Choice_Text_TextureGroup' has a wrong offset!");

}

