#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MapArea_Completed

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_MapArea_Completed.WBP_MapArea_Completed_C.SetCompleteState
// 0x0010 (0x0010 - 0x0000)
struct WBP_MapArea_Completed_C_SetCompleteState final
{
public:
	bool                                          CompleteState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapArea_Completed_C_SetCompleteState) == 0x000008, "Wrong alignment on WBP_MapArea_Completed_C_SetCompleteState");
static_assert(sizeof(WBP_MapArea_Completed_C_SetCompleteState) == 0x000010, "Wrong size on WBP_MapArea_Completed_C_SetCompleteState");
static_assert(offsetof(WBP_MapArea_Completed_C_SetCompleteState, CompleteState) == 0x000000, "Member 'WBP_MapArea_Completed_C_SetCompleteState::CompleteState' has a wrong offset!");
static_assert(offsetof(WBP_MapArea_Completed_C_SetCompleteState, Temp_bool_Variable) == 0x000001, "Member 'WBP_MapArea_Completed_C_SetCompleteState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MapArea_Completed_C_SetCompleteState, K2Node_Select_Default) == 0x000008, "Member 'WBP_MapArea_Completed_C_SetCompleteState::K2Node_Select_Default' has a wrong offset!");

}

