#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_Entry_Sound

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_Settings_Entry_Sound.WBP_Settings_Entry_Sound_C.BndEvt__WBP_Settings_Entry_Sound_WBP_Settings_Entry_Slider_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Settings_Entry_Sound_C_BndEvt__WBP_Settings_Entry_Sound_WBP_Settings_Entry_Slider_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Sound_C_BndEvt__WBP_Settings_Entry_Sound_WBP_Settings_Entry_Slider_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Sound_C_BndEvt__WBP_Settings_Entry_Sound_WBP_Settings_Entry_Slider_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_Entry_Sound_C_BndEvt__WBP_Settings_Entry_Sound_WBP_Settings_Entry_Slider_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong size on WBP_Settings_Entry_Sound_C_BndEvt__WBP_Settings_Entry_Sound_WBP_Settings_Entry_Slider_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_BndEvt__WBP_Settings_Entry_Sound_WBP_Settings_Entry_Slider_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_Entry_Sound_C_BndEvt__WBP_Settings_Entry_Sound_WBP_Settings_Entry_Slider_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function WBP_Settings_Entry_Sound.WBP_Settings_Entry_Sound_C.ExecuteUbergraph_WBP_Settings_Entry_Sound
// 0x0058 (0x0058 - 0x0000)
struct WBP_Settings_Entry_Sound_C_ExecuteUbergraph_WBP_Settings_Entry_Sound final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_Value;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x001C(0x0008)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0028(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0030(0x0008)(NoDestructor)
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue_1;                // 0x0038(0x0008)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundSubsystem*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EventInstanceIsValid_ReturnValue;         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetVolume_NewVolume_ImplicitCast;         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Sound_C_ExecuteUbergraph_WBP_Settings_Entry_Sound) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Sound_C_ExecuteUbergraph_WBP_Settings_Entry_Sound");
static_assert(sizeof(WBP_Settings_Entry_Sound_C_ExecuteUbergraph_WBP_Settings_Entry_Sound) == 0x000058, "Wrong size on WBP_Settings_Entry_Sound_C_ExecuteUbergraph_WBP_Settings_Entry_Sound");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_ExecuteUbergraph_WBP_Settings_Entry_Sound, EntryPoint) == 0x000000, "Member 'WBP_Settings_Entry_Sound_C_ExecuteUbergraph_WBP_Settings_Entry_Sound::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_ExecuteUbergraph_WBP_Settings_Entry_Sound, K2Node_ComponentBoundEvent_Value) == 0x000008, "Member 'WBP_Settings_Entry_Sound_C_ExecuteUbergraph_WBP_Settings_Entry_Sound::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_ExecuteUbergraph_WBP_Settings_Entry_Sound, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_Settings_Entry_Sound_C_ExecuteUbergraph_WBP_Settings_Entry_Sound::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_ExecuteUbergraph_WBP_Settings_Entry_Sound, K2Node_Event_IsDesignTime) == 0x000018, "Member 'WBP_Settings_Entry_Sound_C_ExecuteUbergraph_WBP_Settings_Entry_Sound::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_ExecuteUbergraph_WBP_Settings_Entry_Sound, K2Node_Event_InFocusEvent_1) == 0x00001C, "Member 'WBP_Settings_Entry_Sound_C_ExecuteUbergraph_WBP_Settings_Entry_Sound::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_ExecuteUbergraph_WBP_Settings_Entry_Sound, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'WBP_Settings_Entry_Sound_C_ExecuteUbergraph_WBP_Settings_Entry_Sound::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_ExecuteUbergraph_WBP_Settings_Entry_Sound, CallFunc_PlayEvent2D_ReturnValue) == 0x000028, "Member 'WBP_Settings_Entry_Sound_C_ExecuteUbergraph_WBP_Settings_Entry_Sound::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_ExecuteUbergraph_WBP_Settings_Entry_Sound, K2Node_Event_InFocusEvent) == 0x000030, "Member 'WBP_Settings_Entry_Sound_C_ExecuteUbergraph_WBP_Settings_Entry_Sound::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_ExecuteUbergraph_WBP_Settings_Entry_Sound, CallFunc_PlayEvent2D_ReturnValue_1) == 0x000038, "Member 'WBP_Settings_Entry_Sound_C_ExecuteUbergraph_WBP_Settings_Entry_Sound::CallFunc_PlayEvent2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_ExecuteUbergraph_WBP_Settings_Entry_Sound, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'WBP_Settings_Entry_Sound_C_ExecuteUbergraph_WBP_Settings_Entry_Sound::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_ExecuteUbergraph_WBP_Settings_Entry_Sound, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000048, "Member 'WBP_Settings_Entry_Sound_C_ExecuteUbergraph_WBP_Settings_Entry_Sound::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_ExecuteUbergraph_WBP_Settings_Entry_Sound, CallFunc_EventInstanceIsValid_ReturnValue) == 0x000050, "Member 'WBP_Settings_Entry_Sound_C_ExecuteUbergraph_WBP_Settings_Entry_Sound::CallFunc_EventInstanceIsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_ExecuteUbergraph_WBP_Settings_Entry_Sound, CallFunc_SetVolume_NewVolume_ImplicitCast) == 0x000054, "Member 'WBP_Settings_Entry_Sound_C_ExecuteUbergraph_WBP_Settings_Entry_Sound::CallFunc_SetVolume_NewVolume_ImplicitCast' has a wrong offset!");

// Function WBP_Settings_Entry_Sound.WBP_Settings_Entry_Sound_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_Settings_Entry_Sound_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Settings_Entry_Sound_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on WBP_Settings_Entry_Sound_C_OnAddedToFocusPath");
static_assert(sizeof(WBP_Settings_Entry_Sound_C_OnAddedToFocusPath) == 0x000008, "Wrong size on WBP_Settings_Entry_Sound_C_OnAddedToFocusPath");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_Settings_Entry_Sound_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_Settings_Entry_Sound.WBP_Settings_Entry_Sound_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Settings_Entry_Sound_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Settings_Entry_Sound_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Sound_C_OnFocusReceived");
static_assert(sizeof(WBP_Settings_Entry_Sound_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_Settings_Entry_Sound_C_OnFocusReceived");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Settings_Entry_Sound_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Settings_Entry_Sound_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Settings_Entry_Sound_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Settings_Entry_Sound_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Settings_Entry_Sound.WBP_Settings_Entry_Sound_C.OnKeyUp
// 0x02C8 (0x02C8 - 0x0000)
struct WBP_Settings_Entry_Sound_C_OnKeyUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0130(0x00B8)()
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x01E8(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsKeyUIInputType_ReturnValue;             // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsKeyUIInputType_ReturnValue_1;           // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_202[0x6];                                      // 0x0202(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue_1;                  // 0x0208(0x00B8)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Sound_C_OnKeyUp) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Sound_C_OnKeyUp");
static_assert(sizeof(WBP_Settings_Entry_Sound_C_OnKeyUp) == 0x0002C8, "Wrong size on WBP_Settings_Entry_Sound_C_OnKeyUp");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_OnKeyUp, MyGeometry) == 0x000000, "Member 'WBP_Settings_Entry_Sound_C_OnKeyUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_OnKeyUp, InKeyEvent) == 0x000038, "Member 'WBP_Settings_Entry_Sound_C_OnKeyUp::InKeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_OnKeyUp, ReturnValue) == 0x000078, "Member 'WBP_Settings_Entry_Sound_C_OnKeyUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_OnKeyUp, CallFunc_Unhandled_ReturnValue) == 0x000130, "Member 'WBP_Settings_Entry_Sound_C_OnKeyUp::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_OnKeyUp, CallFunc_GetKey_ReturnValue) == 0x0001E8, "Member 'WBP_Settings_Entry_Sound_C_OnKeyUp::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_OnKeyUp, CallFunc_IsKeyUIInputType_ReturnValue) == 0x000200, "Member 'WBP_Settings_Entry_Sound_C_OnKeyUp::CallFunc_IsKeyUIInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_OnKeyUp, CallFunc_IsKeyUIInputType_ReturnValue_1) == 0x000201, "Member 'WBP_Settings_Entry_Sound_C_OnKeyUp::CallFunc_IsKeyUIInputType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_OnKeyUp, CallFunc_Unhandled_ReturnValue_1) == 0x000208, "Member 'WBP_Settings_Entry_Sound_C_OnKeyUp::CallFunc_Unhandled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_OnKeyUp, CallFunc_BooleanOR_ReturnValue) == 0x0002C0, "Member 'WBP_Settings_Entry_Sound_C_OnKeyUp::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_Settings_Entry_Sound.WBP_Settings_Entry_Sound_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_Settings_Entry_Sound_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Settings_Entry_Sound_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on WBP_Settings_Entry_Sound_C_OnRemovedFromFocusPath");
static_assert(sizeof(WBP_Settings_Entry_Sound_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on WBP_Settings_Entry_Sound_C_OnRemovedFromFocusPath");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_Settings_Entry_Sound_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_Settings_Entry_Sound.WBP_Settings_Entry_Sound_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_Entry_Sound_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Sound_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Settings_Entry_Sound_C_PreConstruct");
static_assert(sizeof(WBP_Settings_Entry_Sound_C_PreConstruct) == 0x000001, "Wrong size on WBP_Settings_Entry_Sound_C_PreConstruct");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Settings_Entry_Sound_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Settings_Entry_Sound.WBP_Settings_Entry_Sound_C.Refresh
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_Entry_Sound_C_Refresh final
{
public:
	class USoundSubsystem*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetVolume_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Sound_C_Refresh) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Sound_C_Refresh");
static_assert(sizeof(WBP_Settings_Entry_Sound_C_Refresh) == 0x000020, "Wrong size on WBP_Settings_Entry_Sound_C_Refresh");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_Refresh, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'WBP_Settings_Entry_Sound_C_Refresh::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_Refresh, CallFunc_GetVolume_ReturnValue) == 0x000008, "Member 'WBP_Settings_Entry_Sound_C_Refresh::CallFunc_GetVolume_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_Refresh, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_Settings_Entry_Sound_C_Refresh::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Sound_C_Refresh, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000018, "Member 'WBP_Settings_Entry_Sound_C_Refresh::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

