#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Extra_Item_Entry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Extra_Item_Entry.WBP_Extra_Item_Entry_C
// 0x0058 (0x04B8 - 0x0460)
class UWBP_Extra_Item_Entry_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Focused;                                           // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CheckBox;                                          // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Material;                                     // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemName;                                          // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Checkbox;                                  // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_FocusedContainer;                          // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_NewContainer;                              // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PriceBox;                                          // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Separate;                                          // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Extra_Price_C*                     WBP_Extra_Price;                                   // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Extra_Item_Entry(int32 EntryPoint);
	void RefreshPrice();
	void SetCheckBox(bool bVisible, bool bChecked);
	void SetCurrencyValue(const struct FCurrencyValue& CurrencyValue);
	void SetFocusedState(bool Focus);
	void SetIsBought(bool bIsBought);
	void SetIsNew(bool IsNew);
	void SetItemName(const class FText& Name_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Extra_Item_Entry_C">();
	}
	static class UWBP_Extra_Item_Entry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Extra_Item_Entry_C>();
	}
};
static_assert(alignof(UWBP_Extra_Item_Entry_C) == 0x000008, "Wrong alignment on UWBP_Extra_Item_Entry_C");
static_assert(sizeof(UWBP_Extra_Item_Entry_C) == 0x0004B8, "Wrong size on UWBP_Extra_Item_Entry_C");
static_assert(offsetof(UWBP_Extra_Item_Entry_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Extra_Item_Entry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Item_Entry_C, Focused) == 0x000468, "Member 'UWBP_Extra_Item_Entry_C::Focused' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Item_Entry_C, CheckBox) == 0x000470, "Member 'UWBP_Extra_Item_Entry_C::CheckBox' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Item_Entry_C, Icon_Material) == 0x000478, "Member 'UWBP_Extra_Item_Entry_C::Icon_Material' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Item_Entry_C, ItemName) == 0x000480, "Member 'UWBP_Extra_Item_Entry_C::ItemName' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Item_Entry_C, Overlay_Checkbox) == 0x000488, "Member 'UWBP_Extra_Item_Entry_C::Overlay_Checkbox' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Item_Entry_C, Overlay_FocusedContainer) == 0x000490, "Member 'UWBP_Extra_Item_Entry_C::Overlay_FocusedContainer' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Item_Entry_C, Overlay_NewContainer) == 0x000498, "Member 'UWBP_Extra_Item_Entry_C::Overlay_NewContainer' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Item_Entry_C, PriceBox) == 0x0004A0, "Member 'UWBP_Extra_Item_Entry_C::PriceBox' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Item_Entry_C, Separate) == 0x0004A8, "Member 'UWBP_Extra_Item_Entry_C::Separate' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Item_Entry_C, WBP_Extra_Price) == 0x0004B0, "Member 'UWBP_Extra_Item_Entry_C::WBP_Extra_Price' has a wrong offset!");

}

