#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ProfileConfirmation

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_ProfileConfirmation.WBP_ProfileConfirmation_C.ExecuteUbergraph_WBP_ProfileConfirmation
// 0x0048 (0x0048 - 0x0000)
struct WBP_ProfileConfirmation_C_ExecuteUbergraph_WBP_ProfileConfirmation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue_1;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ProfileConfirmation_C_ExecuteUbergraph_WBP_ProfileConfirmation) == 0x000008, "Wrong alignment on WBP_ProfileConfirmation_C_ExecuteUbergraph_WBP_ProfileConfirmation");
static_assert(sizeof(WBP_ProfileConfirmation_C_ExecuteUbergraph_WBP_ProfileConfirmation) == 0x000048, "Wrong size on WBP_ProfileConfirmation_C_ExecuteUbergraph_WBP_ProfileConfirmation");
static_assert(offsetof(WBP_ProfileConfirmation_C_ExecuteUbergraph_WBP_ProfileConfirmation, EntryPoint) == 0x000000, "Member 'WBP_ProfileConfirmation_C_ExecuteUbergraph_WBP_ProfileConfirmation::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ProfileConfirmation_C_ExecuteUbergraph_WBP_ProfileConfirmation, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_ProfileConfirmation_C_ExecuteUbergraph_WBP_ProfileConfirmation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ProfileConfirmation_C_ExecuteUbergraph_WBP_ProfileConfirmation, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_ProfileConfirmation_C_ExecuteUbergraph_WBP_ProfileConfirmation::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ProfileConfirmation_C_ExecuteUbergraph_WBP_ProfileConfirmation, CallFunc_PlayUMGAnimation_ReturnValue) == 0x000028, "Member 'WBP_ProfileConfirmation_C_ExecuteUbergraph_WBP_ProfileConfirmation::CallFunc_PlayUMGAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ProfileConfirmation_C_ExecuteUbergraph_WBP_ProfileConfirmation, CallFunc_PlayUMGAnimation_ReturnValue_1) == 0x000030, "Member 'WBP_ProfileConfirmation_C_ExecuteUbergraph_WBP_ProfileConfirmation::CallFunc_PlayUMGAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ProfileConfirmation_C_ExecuteUbergraph_WBP_ProfileConfirmation, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_ProfileConfirmation_C_ExecuteUbergraph_WBP_ProfileConfirmation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ProfileConfirmation_C_ExecuteUbergraph_WBP_ProfileConfirmation, CallFunc_IsValid_ReturnValue_1) == 0x000039, "Member 'WBP_ProfileConfirmation_C_ExecuteUbergraph_WBP_ProfileConfirmation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ProfileConfirmation_C_ExecuteUbergraph_WBP_ProfileConfirmation, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'WBP_ProfileConfirmation_C_ExecuteUbergraph_WBP_ProfileConfirmation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_ProfileConfirmation.WBP_ProfileConfirmation_C.OnPressConfirm
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_ProfileConfirmation_C_OnPressConfirm final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_ProfileConfirmation_C_OnPressConfirm) == 0x000008, "Wrong alignment on WBP_ProfileConfirmation_C_OnPressConfirm");
static_assert(sizeof(WBP_ProfileConfirmation_C_OnPressConfirm) == 0x0001B0, "Wrong size on WBP_ProfileConfirmation_C_OnPressConfirm");
static_assert(offsetof(WBP_ProfileConfirmation_C_OnPressConfirm, KeyEvent) == 0x000000, "Member 'WBP_ProfileConfirmation_C_OnPressConfirm::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_ProfileConfirmation_C_OnPressConfirm, ReturnValue) == 0x000040, "Member 'WBP_ProfileConfirmation_C_OnPressConfirm::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ProfileConfirmation_C_OnPressConfirm, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_ProfileConfirmation_C_OnPressConfirm::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_ProfileConfirmation.WBP_ProfileConfirmation_C.RefreshUserProfile
// 0x0090 (0x0090 - 0x0000)
struct WBP_ProfileConfirmation_C_RefreshUserProfile final
{
public:
	class UProfileSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentProfileName_ReturnValue;        // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0080(0x0010)()
};
static_assert(alignof(WBP_ProfileConfirmation_C_RefreshUserProfile) == 0x000008, "Wrong alignment on WBP_ProfileConfirmation_C_RefreshUserProfile");
static_assert(sizeof(WBP_ProfileConfirmation_C_RefreshUserProfile) == 0x000090, "Wrong size on WBP_ProfileConfirmation_C_RefreshUserProfile");
static_assert(offsetof(WBP_ProfileConfirmation_C_RefreshUserProfile, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'WBP_ProfileConfirmation_C_RefreshUserProfile::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ProfileConfirmation_C_RefreshUserProfile, CallFunc_GetCurrentProfileName_ReturnValue) == 0x000008, "Member 'WBP_ProfileConfirmation_C_RefreshUserProfile::CallFunc_GetCurrentProfileName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ProfileConfirmation_C_RefreshUserProfile, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WBP_ProfileConfirmation_C_RefreshUserProfile::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ProfileConfirmation_C_RefreshUserProfile, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'WBP_ProfileConfirmation_C_RefreshUserProfile::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_ProfileConfirmation_C_RefreshUserProfile, K2Node_MakeArray_Array) == 0x000070, "Member 'WBP_ProfileConfirmation_C_RefreshUserProfile::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ProfileConfirmation_C_RefreshUserProfile, CallFunc_Format_ReturnValue) == 0x000080, "Member 'WBP_ProfileConfirmation_C_RefreshUserProfile::CallFunc_Format_ReturnValue' has a wrong offset!");

}

