#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Extra_Gallery_Entry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Extra_Gallery_Entry.WBP_Extra_Gallery_Entry_C
// 0x0088 (0x04E8 - 0x0460)
class UWBP_Extra_Gallery_Entry_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Focused;                                           // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NewIcon;                                           // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Available;                                 // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_FocusedContainer;                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Locked;                                    // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_NewContainer;                              // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Extra_Price_C*                     WBP_Extra_Price;                                   // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWBP_Extra_Gallery_Entry_C* GalleryEntry)> OnPressed;        // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UWBP_Extra_Gallery_Entry_C* GalleryEntry)> OnFocused;        // 0x04B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FDataTableRowHandle                    DataHandle;                                        // 0x04C8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, ExposeOnSpawn)
	bool                                          bIsAvailable;                                      // 0x04D8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_4D9[0x3];                                      // 0x04D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCurrencyValue                         CurrencyValue;                                     // 0x04DC(0x0008)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor, AdvancedDisplay)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Extra_Gallery_Entry(int32 EntryPoint);
	void GetCost(int32* Cost);
	void GetCurrencyValue(struct FCurrencyValue* CurrencyValue_0);
	void GetDataHandle(struct FDataTableRowHandle* DataHandle_0);
	void GetImage(TSoftObjectPtr<class UTexture2D>* Display_Image);
	void GetImageName(class FText* Name_0);
	void Initialize();
	void IsGalleryDataAlreadyBought(bool* IsAlreadyBought);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnPressConfirm(const struct FKeyEvent& KeyEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void RefreshPrice();
	void SetFocusedState(bool Focus);
	void SetIsBought();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Extra_Gallery_Entry_C">();
	}
	static class UWBP_Extra_Gallery_Entry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Extra_Gallery_Entry_C>();
	}
};
static_assert(alignof(UWBP_Extra_Gallery_Entry_C) == 0x000008, "Wrong alignment on UWBP_Extra_Gallery_Entry_C");
static_assert(sizeof(UWBP_Extra_Gallery_Entry_C) == 0x0004E8, "Wrong size on UWBP_Extra_Gallery_Entry_C");
static_assert(offsetof(UWBP_Extra_Gallery_Entry_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Extra_Gallery_Entry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Gallery_Entry_C, Focused) == 0x000468, "Member 'UWBP_Extra_Gallery_Entry_C::Focused' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Gallery_Entry_C, Icon) == 0x000470, "Member 'UWBP_Extra_Gallery_Entry_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Gallery_Entry_C, NewIcon) == 0x000478, "Member 'UWBP_Extra_Gallery_Entry_C::NewIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Gallery_Entry_C, Overlay_Available) == 0x000480, "Member 'UWBP_Extra_Gallery_Entry_C::Overlay_Available' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Gallery_Entry_C, Overlay_FocusedContainer) == 0x000488, "Member 'UWBP_Extra_Gallery_Entry_C::Overlay_FocusedContainer' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Gallery_Entry_C, Overlay_Locked) == 0x000490, "Member 'UWBP_Extra_Gallery_Entry_C::Overlay_Locked' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Gallery_Entry_C, Overlay_NewContainer) == 0x000498, "Member 'UWBP_Extra_Gallery_Entry_C::Overlay_NewContainer' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Gallery_Entry_C, WBP_Extra_Price) == 0x0004A0, "Member 'UWBP_Extra_Gallery_Entry_C::WBP_Extra_Price' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Gallery_Entry_C, OnPressed) == 0x0004A8, "Member 'UWBP_Extra_Gallery_Entry_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Gallery_Entry_C, OnFocused) == 0x0004B8, "Member 'UWBP_Extra_Gallery_Entry_C::OnFocused' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Gallery_Entry_C, DataHandle) == 0x0004C8, "Member 'UWBP_Extra_Gallery_Entry_C::DataHandle' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Gallery_Entry_C, bIsAvailable) == 0x0004D8, "Member 'UWBP_Extra_Gallery_Entry_C::bIsAvailable' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Gallery_Entry_C, CurrencyValue) == 0x0004DC, "Member 'UWBP_Extra_Gallery_Entry_C::CurrencyValue' has a wrong offset!");

}

