#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Tutorial

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function WBP_Tutorial.WBP_Tutorial_C.BndEvt__WBP_Tutorial_MediaPlayer_K2Node_ComponentBoundEvent_1_OnBinkMediaPlayerMediaOpened__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_Tutorial_C_BndEvt__WBP_Tutorial_MediaPlayer_K2Node_ComponentBoundEvent_1_OnBinkMediaPlayerMediaOpened__DelegateSignature final
{
public:
	class FString                                 OpenedUrl;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Tutorial_C_BndEvt__WBP_Tutorial_MediaPlayer_K2Node_ComponentBoundEvent_1_OnBinkMediaPlayerMediaOpened__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Tutorial_C_BndEvt__WBP_Tutorial_MediaPlayer_K2Node_ComponentBoundEvent_1_OnBinkMediaPlayerMediaOpened__DelegateSignature");
static_assert(sizeof(WBP_Tutorial_C_BndEvt__WBP_Tutorial_MediaPlayer_K2Node_ComponentBoundEvent_1_OnBinkMediaPlayerMediaOpened__DelegateSignature) == 0x000010, "Wrong size on WBP_Tutorial_C_BndEvt__WBP_Tutorial_MediaPlayer_K2Node_ComponentBoundEvent_1_OnBinkMediaPlayerMediaOpened__DelegateSignature");
static_assert(offsetof(WBP_Tutorial_C_BndEvt__WBP_Tutorial_MediaPlayer_K2Node_ComponentBoundEvent_1_OnBinkMediaPlayerMediaOpened__DelegateSignature, OpenedUrl) == 0x000000, "Member 'WBP_Tutorial_C_BndEvt__WBP_Tutorial_MediaPlayer_K2Node_ComponentBoundEvent_1_OnBinkMediaPlayerMediaOpened__DelegateSignature::OpenedUrl' has a wrong offset!");

// Function WBP_Tutorial.WBP_Tutorial_C.BndEvt__WBP_Tutorial_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_Tutorial_C_BndEvt__WBP_Tutorial_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Tutorial_C_BndEvt__WBP_Tutorial_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Tutorial_C_BndEvt__WBP_Tutorial_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Tutorial_C_BndEvt__WBP_Tutorial_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_Tutorial_C_BndEvt__WBP_Tutorial_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Tutorial_C_BndEvt__WBP_Tutorial_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_Tutorial_C_BndEvt__WBP_Tutorial_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_Tutorial.WBP_Tutorial_C.ExecuteUbergraph_WBP_Tutorial
// 0x0230 (0x0230 - 0x0000)
struct WBP_Tutorial_C_ExecuteUbergraph_WBP_Tutorial final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent;               // 0x0028(0x0040)()
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue_1;              // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue_1;           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_OpenedUrl;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FInventoryItemTutorialData             CallFunc_GetItemTutorialData_out_ItemData;         // 0x0098(0x0190)()
	bool                                          CallFunc_GetItemTutorialData_ReturnValue;          // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Tutorial_C_ExecuteUbergraph_WBP_Tutorial) == 0x000008, "Wrong alignment on WBP_Tutorial_C_ExecuteUbergraph_WBP_Tutorial");
static_assert(sizeof(WBP_Tutorial_C_ExecuteUbergraph_WBP_Tutorial) == 0x000230, "Wrong size on WBP_Tutorial_C_ExecuteUbergraph_WBP_Tutorial");
static_assert(offsetof(WBP_Tutorial_C_ExecuteUbergraph_WBP_Tutorial, EntryPoint) == 0x000000, "Member 'WBP_Tutorial_C_ExecuteUbergraph_WBP_Tutorial::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_C_ExecuteUbergraph_WBP_Tutorial, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Tutorial_C_ExecuteUbergraph_WBP_Tutorial::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_C_ExecuteUbergraph_WBP_Tutorial, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_Tutorial_C_ExecuteUbergraph_WBP_Tutorial::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_C_ExecuteUbergraph_WBP_Tutorial, K2Node_ComponentBoundEvent_KeyEvent) == 0x000028, "Member 'WBP_Tutorial_C_ExecuteUbergraph_WBP_Tutorial::K2Node_ComponentBoundEvent_KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_C_ExecuteUbergraph_WBP_Tutorial, CallFunc_SetGamePaused_ReturnValue) == 0x000068, "Member 'WBP_Tutorial_C_ExecuteUbergraph_WBP_Tutorial::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_C_ExecuteUbergraph_WBP_Tutorial, CallFunc_SetGamePaused_ReturnValue_1) == 0x000069, "Member 'WBP_Tutorial_C_ExecuteUbergraph_WBP_Tutorial::CallFunc_SetGamePaused_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_C_ExecuteUbergraph_WBP_Tutorial, CallFunc_PlayUMGAnimation_ReturnValue) == 0x000070, "Member 'WBP_Tutorial_C_ExecuteUbergraph_WBP_Tutorial::CallFunc_PlayUMGAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_C_ExecuteUbergraph_WBP_Tutorial, CallFunc_PlayUMGAnimation_ReturnValue_1) == 0x000078, "Member 'WBP_Tutorial_C_ExecuteUbergraph_WBP_Tutorial::CallFunc_PlayUMGAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_C_ExecuteUbergraph_WBP_Tutorial, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'WBP_Tutorial_C_ExecuteUbergraph_WBP_Tutorial::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_C_ExecuteUbergraph_WBP_Tutorial, CallFunc_IsValid_ReturnValue_1) == 0x000081, "Member 'WBP_Tutorial_C_ExecuteUbergraph_WBP_Tutorial::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_C_ExecuteUbergraph_WBP_Tutorial, K2Node_ComponentBoundEvent_OpenedUrl) == 0x000088, "Member 'WBP_Tutorial_C_ExecuteUbergraph_WBP_Tutorial::K2Node_ComponentBoundEvent_OpenedUrl' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_C_ExecuteUbergraph_WBP_Tutorial, CallFunc_GetItemTutorialData_out_ItemData) == 0x000098, "Member 'WBP_Tutorial_C_ExecuteUbergraph_WBP_Tutorial::CallFunc_GetItemTutorialData_out_ItemData' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_C_ExecuteUbergraph_WBP_Tutorial, CallFunc_GetItemTutorialData_ReturnValue) == 0x000228, "Member 'WBP_Tutorial_C_ExecuteUbergraph_WBP_Tutorial::CallFunc_GetItemTutorialData_ReturnValue' has a wrong offset!");

// Function WBP_Tutorial.WBP_Tutorial_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Tutorial_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Tutorial_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Tutorial_C_OnFocusReceived");
static_assert(sizeof(WBP_Tutorial_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_Tutorial_C_OnFocusReceived");
static_assert(offsetof(WBP_Tutorial_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Tutorial_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Tutorial_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Tutorial_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Tutorial_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Tutorial.WBP_Tutorial_C.OpenVideo
// 0x0038 (0x0038 - 0x0000)
struct WBP_Tutorial_C_OpenVideo final
{
public:
	class UPlatformMediaSource*                   VideoToPlay;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetBinkURLFromPlatformMediaSource_ReturnValue; // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlatformMediaSource*                   CallFunc_GetTutorialVideo_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetLooping_ReturnValue;                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OpenUrl_ReturnValue;                      // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Tutorial_C_OpenVideo) == 0x000008, "Wrong alignment on WBP_Tutorial_C_OpenVideo");
static_assert(sizeof(WBP_Tutorial_C_OpenVideo) == 0x000038, "Wrong size on WBP_Tutorial_C_OpenVideo");
static_assert(offsetof(WBP_Tutorial_C_OpenVideo, VideoToPlay) == 0x000000, "Member 'WBP_Tutorial_C_OpenVideo::VideoToPlay' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_C_OpenVideo, CallFunc_Get_ReturnValue) == 0x000008, "Member 'WBP_Tutorial_C_OpenVideo::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_C_OpenVideo, CallFunc_GetBinkURLFromPlatformMediaSource_ReturnValue) == 0x000010, "Member 'WBP_Tutorial_C_OpenVideo::CallFunc_GetBinkURLFromPlatformMediaSource_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_C_OpenVideo, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_Tutorial_C_OpenVideo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_C_OpenVideo, CallFunc_GetTutorialVideo_ReturnValue) == 0x000028, "Member 'WBP_Tutorial_C_OpenVideo::CallFunc_GetTutorialVideo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_C_OpenVideo, CallFunc_Play_ReturnValue) == 0x000030, "Member 'WBP_Tutorial_C_OpenVideo::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_C_OpenVideo, CallFunc_SetLooping_ReturnValue) == 0x000031, "Member 'WBP_Tutorial_C_OpenVideo::CallFunc_SetLooping_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_C_OpenVideo, CallFunc_OpenUrl_ReturnValue) == 0x000032, "Member 'WBP_Tutorial_C_OpenVideo::CallFunc_OpenUrl_ReturnValue' has a wrong offset!");

// Function WBP_Tutorial.WBP_Tutorial_C.SetupTexts
// 0x0010 (0x0010 - 0x0000)
struct WBP_Tutorial_C_SetupTexts final
{
public:
	TArray<class FString>                         Temp_string_Variable;                              // 0x0000(0x0010)(ConstParm, ReferenceParm)
};
static_assert(alignof(WBP_Tutorial_C_SetupTexts) == 0x000008, "Wrong alignment on WBP_Tutorial_C_SetupTexts");
static_assert(sizeof(WBP_Tutorial_C_SetupTexts) == 0x000010, "Wrong size on WBP_Tutorial_C_SetupTexts");
static_assert(offsetof(WBP_Tutorial_C_SetupTexts, Temp_string_Variable) == 0x000000, "Member 'WBP_Tutorial_C_SetupTexts::Temp_string_Variable' has a wrong offset!");

}

