#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Extra_Dialog_GalleryImage

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Zion_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Extra_Dialog_GalleryImage.WBP_Extra_Dialog_GalleryImage_C.ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue_1;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TSoftObjectPtr<class UObject> SoftImageObject)> K2Node_CreateDelegate_OutputDelegate_2; // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TSoftObjectPtr<class UObject> SoftImageObject)> K2Node_CreateDelegate_OutputDelegate_3; // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(double NewZoomValue)>          K2Node_CreateDelegate_OutputDelegate_4;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_NewZoomValue;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Initialize_MinZoom;                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Initialize_DefaultZoom;                   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Initialize_MaxZoom;                       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 K2Node_CustomEvent_SoftImageObject_1;              // 0x0090(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 K2Node_CustomEvent_SoftImageObject;                // 0x00B8(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_SoftObjectReference_ReturnValue; // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetUserSpecifiedScale_InUserSpecifiedScale_ImplicitCast; // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage) == 0x000008, "Wrong alignment on WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage");
static_assert(sizeof(WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage) == 0x0000E8, "Wrong size on WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage, EntryPoint) == 0x000000, "Member 'WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage, CallFunc_PlayUMGAnimation_ReturnValue) == 0x000028, "Member 'WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage::CallFunc_PlayUMGAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage, CallFunc_PlayUMGAnimation_ReturnValue_1) == 0x000030, "Member 'WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage::CallFunc_PlayUMGAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage, CallFunc_IsValid_ReturnValue_1) == 0x000039, "Member 'WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage, K2Node_CreateDelegate_OutputDelegate_2) == 0x00003C, "Member 'WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage, K2Node_CreateDelegate_OutputDelegate_3) == 0x00004C, "Member 'WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage, K2Node_CreateDelegate_OutputDelegate_4) == 0x00005C, "Member 'WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage, K2Node_CustomEvent_NewZoomValue) == 0x000070, "Member 'WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage::K2Node_CustomEvent_NewZoomValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage, CallFunc_Initialize_MinZoom) == 0x000078, "Member 'WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage::CallFunc_Initialize_MinZoom' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage, CallFunc_Initialize_DefaultZoom) == 0x000080, "Member 'WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage::CallFunc_Initialize_DefaultZoom' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage, CallFunc_Initialize_MaxZoom) == 0x000088, "Member 'WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage::CallFunc_Initialize_MaxZoom' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage, K2Node_CustomEvent_SoftImageObject_1) == 0x000090, "Member 'WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage::K2Node_CustomEvent_SoftImageObject_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage, K2Node_CustomEvent_SoftImageObject) == 0x0000B8, "Member 'WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage::K2Node_CustomEvent_SoftImageObject' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage, CallFunc_EqualEqual_SoftObjectReference_ReturnValue) == 0x0000E0, "Member 'WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage::CallFunc_EqualEqual_SoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage, CallFunc_SetUserSpecifiedScale_InUserSpecifiedScale_ImplicitCast) == 0x0000E4, "Member 'WBP_Extra_Dialog_GalleryImage_C_ExecuteUbergraph_WBP_Extra_Dialog_GalleryImage::CallFunc_SetUserSpecifiedScale_InUserSpecifiedScale_ImplicitCast' has a wrong offset!");

// Function WBP_Extra_Dialog_GalleryImage.WBP_Extra_Dialog_GalleryImage_C.OnAnalogValueChanged
// 0x0260 (0x0260 - 0x0000)
struct WBP_Extra_Dialog_GalleryImage_C_OnAnalogValueChanged final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FAnalogInputEvent                      InAnalogInputEvent;                                // 0x0038(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0080(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKeyEvent                              CallFunc_GetKeyEventFromAnalogInputEvent_ReturnValue; // 0x0138(0x0040)()
	float                                         CallFunc_GetAnalogValue_ReturnValue;               // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0180(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_AnalogValueZoom_bReturnValue;             // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x01A0(0x00B8)()
	double                                        CallFunc_AnalogValueZoom_AnalogValue_ImplicitCast; // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Dialog_GalleryImage_C_OnAnalogValueChanged) == 0x000008, "Wrong alignment on WBP_Extra_Dialog_GalleryImage_C_OnAnalogValueChanged");
static_assert(sizeof(WBP_Extra_Dialog_GalleryImage_C_OnAnalogValueChanged) == 0x000260, "Wrong size on WBP_Extra_Dialog_GalleryImage_C_OnAnalogValueChanged");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnAnalogValueChanged, MyGeometry) == 0x000000, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnAnalogValueChanged::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnAnalogValueChanged, InAnalogInputEvent) == 0x000038, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnAnalogValueChanged::InAnalogInputEvent' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnAnalogValueChanged, ReturnValue) == 0x000080, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnAnalogValueChanged::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnAnalogValueChanged, CallFunc_GetKeyEventFromAnalogInputEvent_ReturnValue) == 0x000138, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnAnalogValueChanged::CallFunc_GetKeyEventFromAnalogInputEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnAnalogValueChanged, CallFunc_GetAnalogValue_ReturnValue) == 0x000178, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnAnalogValueChanged::CallFunc_GetAnalogValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnAnalogValueChanged, CallFunc_GetKey_ReturnValue) == 0x000180, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnAnalogValueChanged::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnAnalogValueChanged, CallFunc_AnalogValueZoom_bReturnValue) == 0x000198, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnAnalogValueChanged::CallFunc_AnalogValueZoom_bReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnAnalogValueChanged, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000199, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnAnalogValueChanged::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnAnalogValueChanged, CallFunc_Handled_ReturnValue) == 0x0001A0, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnAnalogValueChanged::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnAnalogValueChanged, CallFunc_AnalogValueZoom_AnalogValue_ImplicitCast) == 0x000258, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnAnalogValueChanged::CallFunc_AnalogValueZoom_AnalogValue_ImplicitCast' has a wrong offset!");

// Function WBP_Extra_Dialog_GalleryImage.WBP_Extra_Dialog_GalleryImage_C.OnDownNext
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Extra_Dialog_GalleryImage_C_OnDownNext final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Extra_Dialog_GalleryImage_C_OnDownNext) == 0x000008, "Wrong alignment on WBP_Extra_Dialog_GalleryImage_C_OnDownNext");
static_assert(sizeof(WBP_Extra_Dialog_GalleryImage_C_OnDownNext) == 0x0001B0, "Wrong size on WBP_Extra_Dialog_GalleryImage_C_OnDownNext");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnDownNext, KeyEvent) == 0x000000, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnDownNext::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnDownNext, ReturnValue) == 0x000040, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnDownNext::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnDownNext, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnDownNext::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Extra_Dialog_GalleryImage.WBP_Extra_Dialog_GalleryImage_C.OnDownPrevious
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Extra_Dialog_GalleryImage_C_OnDownPrevious final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Extra_Dialog_GalleryImage_C_OnDownPrevious) == 0x000008, "Wrong alignment on WBP_Extra_Dialog_GalleryImage_C_OnDownPrevious");
static_assert(sizeof(WBP_Extra_Dialog_GalleryImage_C_OnDownPrevious) == 0x0001B0, "Wrong size on WBP_Extra_Dialog_GalleryImage_C_OnDownPrevious");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnDownPrevious, KeyEvent) == 0x000000, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnDownPrevious::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnDownPrevious, ReturnValue) == 0x000040, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnDownPrevious::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnDownPrevious, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnDownPrevious::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Extra_Dialog_GalleryImage.WBP_Extra_Dialog_GalleryImage_C.OnImageStreamingFinish
// 0x0028 (0x0028 - 0x0000)
struct WBP_Extra_Dialog_GalleryImage_C_OnImageStreamingFinish final
{
public:
	TSoftObjectPtr<class UObject>                 SoftImageObject;                                   // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Dialog_GalleryImage_C_OnImageStreamingFinish) == 0x000008, "Wrong alignment on WBP_Extra_Dialog_GalleryImage_C_OnImageStreamingFinish");
static_assert(sizeof(WBP_Extra_Dialog_GalleryImage_C_OnImageStreamingFinish) == 0x000028, "Wrong size on WBP_Extra_Dialog_GalleryImage_C_OnImageStreamingFinish");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnImageStreamingFinish, SoftImageObject) == 0x000000, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnImageStreamingFinish::SoftImageObject' has a wrong offset!");

// Function WBP_Extra_Dialog_GalleryImage.WBP_Extra_Dialog_GalleryImage_C.OnImageStreamingStart
// 0x0028 (0x0028 - 0x0000)
struct WBP_Extra_Dialog_GalleryImage_C_OnImageStreamingStart final
{
public:
	TSoftObjectPtr<class UObject>                 SoftImageObject;                                   // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Dialog_GalleryImage_C_OnImageStreamingStart) == 0x000008, "Wrong alignment on WBP_Extra_Dialog_GalleryImage_C_OnImageStreamingStart");
static_assert(sizeof(WBP_Extra_Dialog_GalleryImage_C_OnImageStreamingStart) == 0x000028, "Wrong size on WBP_Extra_Dialog_GalleryImage_C_OnImageStreamingStart");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnImageStreamingStart, SoftImageObject) == 0x000000, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnImageStreamingStart::SoftImageObject' has a wrong offset!");

// Function WBP_Extra_Dialog_GalleryImage.WBP_Extra_Dialog_GalleryImage_C.OnMouseButtonDown
// 0x0228 (0x0228 - 0x0000)
struct WBP_Extra_Dialog_GalleryImage_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0170(0x00B8)()
};
static_assert(alignof(WBP_Extra_Dialog_GalleryImage_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on WBP_Extra_Dialog_GalleryImage_C_OnMouseButtonDown");
static_assert(sizeof(WBP_Extra_Dialog_GalleryImage_C_OnMouseButtonDown) == 0x000228, "Wrong size on WBP_Extra_Dialog_GalleryImage_C_OnMouseButtonDown");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnMouseButtonDown, CallFunc_Not_PreBool_ReturnValue) == 0x000168, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnMouseButtonDown::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000170, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Extra_Dialog_GalleryImage.WBP_Extra_Dialog_GalleryImage_C.OnMouseWheel
// 0x0230 (0x0230 - 0x0000)
struct WBP_Extra_Dialog_GalleryImage_C_OnMouseWheel final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	float                                         CallFunc_PointerEvent_GetWheelDelta_ReturnValue;   // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0170(0x00B8)()
	double                                        CallFunc_MouseWheelZoom_WheelDelta_ImplicitCast;   // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Dialog_GalleryImage_C_OnMouseWheel) == 0x000008, "Wrong alignment on WBP_Extra_Dialog_GalleryImage_C_OnMouseWheel");
static_assert(sizeof(WBP_Extra_Dialog_GalleryImage_C_OnMouseWheel) == 0x000230, "Wrong size on WBP_Extra_Dialog_GalleryImage_C_OnMouseWheel");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnMouseWheel, MyGeometry) == 0x000000, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnMouseWheel::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnMouseWheel, MouseEvent) == 0x000038, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnMouseWheel::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnMouseWheel, ReturnValue) == 0x0000B0, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnMouseWheel::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnMouseWheel, CallFunc_PointerEvent_GetWheelDelta_ReturnValue) == 0x000168, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnMouseWheel::CallFunc_PointerEvent_GetWheelDelta_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnMouseWheel, CallFunc_Handled_ReturnValue) == 0x000170, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnMouseWheel::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnMouseWheel, CallFunc_MouseWheelZoom_WheelDelta_ImplicitCast) == 0x000228, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnMouseWheel::CallFunc_MouseWheelZoom_WheelDelta_ImplicitCast' has a wrong offset!");

// Function WBP_Extra_Dialog_GalleryImage.WBP_Extra_Dialog_GalleryImage_C.OnPressCancel
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Extra_Dialog_GalleryImage_C_OnPressCancel final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Extra_Dialog_GalleryImage_C_OnPressCancel) == 0x000008, "Wrong alignment on WBP_Extra_Dialog_GalleryImage_C_OnPressCancel");
static_assert(sizeof(WBP_Extra_Dialog_GalleryImage_C_OnPressCancel) == 0x0001B0, "Wrong size on WBP_Extra_Dialog_GalleryImage_C_OnPressCancel");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnPressCancel, KeyEvent) == 0x000000, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnPressCancel::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnPressCancel, ReturnValue) == 0x000040, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnPressCancel::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnPressCancel, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnPressCancel::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Extra_Dialog_GalleryImage.WBP_Extra_Dialog_GalleryImage_C.OnPressConfirm
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Extra_Dialog_GalleryImage_C_OnPressConfirm final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Extra_Dialog_GalleryImage_C_OnPressConfirm) == 0x000008, "Wrong alignment on WBP_Extra_Dialog_GalleryImage_C_OnPressConfirm");
static_assert(sizeof(WBP_Extra_Dialog_GalleryImage_C_OnPressConfirm) == 0x0001B0, "Wrong size on WBP_Extra_Dialog_GalleryImage_C_OnPressConfirm");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnPressConfirm, KeyEvent) == 0x000000, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnPressConfirm::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnPressConfirm, ReturnValue) == 0x000040, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnPressConfirm::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnPressConfirm, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnPressConfirm::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Extra_Dialog_GalleryImage.WBP_Extra_Dialog_GalleryImage_C.OnPressContext
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Extra_Dialog_GalleryImage_C_OnPressContext final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Extra_Dialog_GalleryImage_C_OnPressContext) == 0x000008, "Wrong alignment on WBP_Extra_Dialog_GalleryImage_C_OnPressContext");
static_assert(sizeof(WBP_Extra_Dialog_GalleryImage_C_OnPressContext) == 0x0001B0, "Wrong size on WBP_Extra_Dialog_GalleryImage_C_OnPressContext");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnPressContext, KeyEvent) == 0x000000, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnPressContext::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnPressContext, ReturnValue) == 0x000040, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnPressContext::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnPressContext, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnPressContext::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Extra_Dialog_GalleryImage.WBP_Extra_Dialog_GalleryImage_C.OnPressNext
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Extra_Dialog_GalleryImage_C_OnPressNext final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Extra_Dialog_GalleryImage_C_OnPressNext) == 0x000008, "Wrong alignment on WBP_Extra_Dialog_GalleryImage_C_OnPressNext");
static_assert(sizeof(WBP_Extra_Dialog_GalleryImage_C_OnPressNext) == 0x0001B0, "Wrong size on WBP_Extra_Dialog_GalleryImage_C_OnPressNext");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnPressNext, KeyEvent) == 0x000000, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnPressNext::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnPressNext, ReturnValue) == 0x000040, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnPressNext::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnPressNext, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnPressNext::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Extra_Dialog_GalleryImage.WBP_Extra_Dialog_GalleryImage_C.OnPressPrevious
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Extra_Dialog_GalleryImage_C_OnPressPrevious final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Extra_Dialog_GalleryImage_C_OnPressPrevious) == 0x000008, "Wrong alignment on WBP_Extra_Dialog_GalleryImage_C_OnPressPrevious");
static_assert(sizeof(WBP_Extra_Dialog_GalleryImage_C_OnPressPrevious) == 0x0001B0, "Wrong size on WBP_Extra_Dialog_GalleryImage_C_OnPressPrevious");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnPressPrevious, KeyEvent) == 0x000000, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnPressPrevious::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnPressPrevious, ReturnValue) == 0x000040, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnPressPrevious::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnPressPrevious, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnPressPrevious::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Extra_Dialog_GalleryImage.WBP_Extra_Dialog_GalleryImage_C.OnZoomChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_Extra_Dialog_GalleryImage_C_OnZoomChanged final
{
public:
	double                                        NewZoomValue;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Dialog_GalleryImage_C_OnZoomChanged) == 0x000008, "Wrong alignment on WBP_Extra_Dialog_GalleryImage_C_OnZoomChanged");
static_assert(sizeof(WBP_Extra_Dialog_GalleryImage_C_OnZoomChanged) == 0x000008, "Wrong size on WBP_Extra_Dialog_GalleryImage_C_OnZoomChanged");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_OnZoomChanged, NewZoomValue) == 0x000000, "Member 'WBP_Extra_Dialog_GalleryImage_C_OnZoomChanged::NewZoomValue' has a wrong offset!");

// Function WBP_Extra_Dialog_GalleryImage.WBP_Extra_Dialog_GalleryImage_C.SetGalleryItemData
// 0x01F0 (0x01F0 - 0x0000)
struct WBP_Extra_Dialog_GalleryImage_C_SetGalleryItemData final
{
public:
	struct FInventoryItemGalleryData              GalleryItemData_0;                                 // 0x0000(0x01E0)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x01E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Dialog_GalleryImage_C_SetGalleryItemData) == 0x000008, "Wrong alignment on WBP_Extra_Dialog_GalleryImage_C_SetGalleryItemData");
static_assert(sizeof(WBP_Extra_Dialog_GalleryImage_C_SetGalleryItemData) == 0x0001F0, "Wrong size on WBP_Extra_Dialog_GalleryImage_C_SetGalleryItemData");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_SetGalleryItemData, GalleryItemData_0) == 0x000000, "Member 'WBP_Extra_Dialog_GalleryImage_C_SetGalleryItemData::GalleryItemData_0' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_SetGalleryItemData, CallFunc_MakeVector2D_ReturnValue) == 0x0001E0, "Member 'WBP_Extra_Dialog_GalleryImage_C_SetGalleryItemData::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function WBP_Extra_Dialog_GalleryImage.WBP_Extra_Dialog_GalleryImage_C.SetupCanChangeImage
// 0x0020 (0x0020 - 0x0000)
struct WBP_Extra_Dialog_GalleryImage_C_SetupCanChangeImage final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Dialog_GalleryImage_C_SetupCanChangeImage) == 0x000004, "Wrong alignment on WBP_Extra_Dialog_GalleryImage_C_SetupCanChangeImage");
static_assert(sizeof(WBP_Extra_Dialog_GalleryImage_C_SetupCanChangeImage) == 0x000020, "Wrong size on WBP_Extra_Dialog_GalleryImage_C_SetupCanChangeImage");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_SetupCanChangeImage, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_Extra_Dialog_GalleryImage_C_SetupCanChangeImage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_SetupCanChangeImage, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'WBP_Extra_Dialog_GalleryImage_C_SetupCanChangeImage::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WBP_Extra_Dialog_GalleryImage.WBP_Extra_Dialog_GalleryImage_C.ToggleUIVisibility
// 0x0018 (0x0018 - 0x0000)
struct WBP_Extra_Dialog_GalleryImage_C_ToggleUIVisibility final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Dialog_GalleryImage_C_ToggleUIVisibility) == 0x000008, "Wrong alignment on WBP_Extra_Dialog_GalleryImage_C_ToggleUIVisibility");
static_assert(sizeof(WBP_Extra_Dialog_GalleryImage_C_ToggleUIVisibility) == 0x000018, "Wrong size on WBP_Extra_Dialog_GalleryImage_C_ToggleUIVisibility");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_ToggleUIVisibility, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'WBP_Extra_Dialog_GalleryImage_C_ToggleUIVisibility::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_ToggleUIVisibility, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000008, "Member 'WBP_Extra_Dialog_GalleryImage_C_ToggleUIVisibility::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_ToggleUIVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'WBP_Extra_Dialog_GalleryImage_C_ToggleUIVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_Extra_Dialog_GalleryImage.WBP_Extra_Dialog_GalleryImage_C.GetCurrentScaleFactor
// 0x0018 (0x0018 - 0x0000)
struct WBP_Extra_Dialog_GalleryImage_C_GetCurrentScaleFactor final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetCurrentZoom_CurrentZoom;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Extra_Dialog_GalleryImage_C_GetCurrentScaleFactor) == 0x000008, "Wrong alignment on WBP_Extra_Dialog_GalleryImage_C_GetCurrentScaleFactor");
static_assert(sizeof(WBP_Extra_Dialog_GalleryImage_C_GetCurrentScaleFactor) == 0x000018, "Wrong size on WBP_Extra_Dialog_GalleryImage_C_GetCurrentScaleFactor");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_GetCurrentScaleFactor, ReturnValue) == 0x000000, "Member 'WBP_Extra_Dialog_GalleryImage_C_GetCurrentScaleFactor::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Extra_Dialog_GalleryImage_C_GetCurrentScaleFactor, CallFunc_GetCurrentZoom_CurrentZoom) == 0x000008, "Member 'WBP_Extra_Dialog_GalleryImage_C_GetCurrentScaleFactor::CallFunc_GetCurrentZoom_CurrentZoom' has a wrong offset!");
