#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Pause

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Zion_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Pause.WBP_Pause_C.BndEvt__WBP_Pause_WBP_Button_Generic_Achievements_K2Node_ComponentBoundEvent_9_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_Achievements_K2Node_ComponentBoundEvent_9_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_Achievements_K2Node_ComponentBoundEvent_9_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_Achievements_K2Node_ComponentBoundEvent_9_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_Achievements_K2Node_ComponentBoundEvent_9_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_Achievements_K2Node_ComponentBoundEvent_9_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_Achievements_K2Node_ComponentBoundEvent_9_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_Achievements_K2Node_ComponentBoundEvent_9_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_Pause.WBP_Pause_C.BndEvt__WBP_Pause_WBP_Button_Generic_BackToRestpoint_K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_BackToRestpoint_K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_BackToRestpoint_K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_BackToRestpoint_K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_BackToRestpoint_K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_BackToRestpoint_K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_BackToRestpoint_K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_BackToRestpoint_K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_Pause.WBP_Pause_C.BndEvt__WBP_Pause_WBP_Button_Generic_BackToTitle_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_BackToTitle_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_BackToTitle_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_BackToTitle_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_BackToTitle_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_BackToTitle_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_BackToTitle_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_BackToTitle_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_Pause.WBP_Pause_C.BndEvt__WBP_Pause_WBP_Button_Generic_Continue_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_Continue_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_Continue_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_Continue_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_Continue_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_Continue_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_Continue_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_Continue_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_Pause.WBP_Pause_C.BndEvt__WBP_Pause_WBP_Button_Generic_Exit_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_Exit_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_Exit_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_Exit_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_Exit_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_Exit_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_Exit_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_Exit_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_Pause.WBP_Pause_C.BndEvt__WBP_Pause_WBP_Button_Generic_QuitBossRush_K2Node_ComponentBoundEvent_8_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_QuitBossRush_K2Node_ComponentBoundEvent_8_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_QuitBossRush_K2Node_ComponentBoundEvent_8_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_QuitBossRush_K2Node_ComponentBoundEvent_8_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_QuitBossRush_K2Node_ComponentBoundEvent_8_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_QuitBossRush_K2Node_ComponentBoundEvent_8_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_QuitBossRush_K2Node_ComponentBoundEvent_8_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_QuitBossRush_K2Node_ComponentBoundEvent_8_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_Pause.WBP_Pause_C.BndEvt__WBP_Pause_WBP_Button_Generic_QuitRecollectionBoss_K2Node_ComponentBoundEvent_6_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_QuitRecollectionBoss_K2Node_ComponentBoundEvent_6_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_QuitRecollectionBoss_K2Node_ComponentBoundEvent_6_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_QuitRecollectionBoss_K2Node_ComponentBoundEvent_6_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_QuitRecollectionBoss_K2Node_ComponentBoundEvent_6_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_QuitRecollectionBoss_K2Node_ComponentBoundEvent_6_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_QuitRecollectionBoss_K2Node_ComponentBoundEvent_6_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_QuitRecollectionBoss_K2Node_ComponentBoundEvent_6_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_Pause.WBP_Pause_C.BndEvt__WBP_Pause_WBP_Button_Generic_RecollectionRetry_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_RecollectionRetry_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_RecollectionRetry_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_RecollectionRetry_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_RecollectionRetry_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_RecollectionRetry_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_RecollectionRetry_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_RecollectionRetry_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_Pause.WBP_Pause_C.BndEvt__WBP_Pause_WBP_Button_Generic_RetryBossRush_K2Node_ComponentBoundEvent_7_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_RetryBossRush_K2Node_ComponentBoundEvent_7_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_RetryBossRush_K2Node_ComponentBoundEvent_7_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_RetryBossRush_K2Node_ComponentBoundEvent_7_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_RetryBossRush_K2Node_ComponentBoundEvent_7_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_RetryBossRush_K2Node_ComponentBoundEvent_7_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_RetryBossRush_K2Node_ComponentBoundEvent_7_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_RetryBossRush_K2Node_ComponentBoundEvent_7_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_Pause.WBP_Pause_C.BndEvt__WBP_Pause_WBP_Button_Generic_Settings_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_Settings_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_Settings_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_Settings_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_Settings_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_Settings_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_Settings_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_Pause_C_BndEvt__WBP_Pause_WBP_Button_Generic_Settings_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_Pause.WBP_Pause_C.CanLeaveRecollectionBoss
// 0x0018 (0x0018 - 0x0000)
struct WBP_Pause_C_CanLeaveRecollectionBoss final
{
public:
	bool                                          bResult;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeZion*                          CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInRecollectionBoss_bResult;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanLeaveRecollectionBoss_ReturnValue;     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Pause_C_CanLeaveRecollectionBoss) == 0x000008, "Wrong alignment on WBP_Pause_C_CanLeaveRecollectionBoss");
static_assert(sizeof(WBP_Pause_C_CanLeaveRecollectionBoss) == 0x000018, "Wrong size on WBP_Pause_C_CanLeaveRecollectionBoss");
static_assert(offsetof(WBP_Pause_C_CanLeaveRecollectionBoss, bResult) == 0x000000, "Member 'WBP_Pause_C_CanLeaveRecollectionBoss::bResult' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_CanLeaveRecollectionBoss, CallFunc_Get_ReturnValue) == 0x000008, "Member 'WBP_Pause_C_CanLeaveRecollectionBoss::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_CanLeaveRecollectionBoss, CallFunc_IsInRecollectionBoss_bResult) == 0x000010, "Member 'WBP_Pause_C_CanLeaveRecollectionBoss::CallFunc_IsInRecollectionBoss_bResult' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_CanLeaveRecollectionBoss, CallFunc_CanLeaveRecollectionBoss_ReturnValue) == 0x000011, "Member 'WBP_Pause_C_CanLeaveRecollectionBoss::CallFunc_CanLeaveRecollectionBoss_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_CanLeaveRecollectionBoss, CallFunc_BooleanAND_ReturnValue) == 0x000012, "Member 'WBP_Pause_C_CanLeaveRecollectionBoss::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_Pause.WBP_Pause_C.CloseMenu
// 0x0001 (0x0001 - 0x0000)
struct WBP_Pause_C_CloseMenu final
{
public:
	bool                                          bSkipAnimation;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Pause_C_CloseMenu) == 0x000001, "Wrong alignment on WBP_Pause_C_CloseMenu");
static_assert(sizeof(WBP_Pause_C_CloseMenu) == 0x000001, "Wrong size on WBP_Pause_C_CloseMenu");
static_assert(offsetof(WBP_Pause_C_CloseMenu, bSkipAnimation) == 0x000000, "Member 'WBP_Pause_C_CloseMenu::bSkipAnimation' has a wrong offset!");

// Function WBP_Pause.WBP_Pause_C.ExecuteUbergraph_WBP_Pause
// 0x0650 (0x0650 - 0x0000)
struct WBP_Pause_C_ExecuteUbergraph_WBP_Pause final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeZion*                          CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Dialog_YesNo_C*                    CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWorldLoaderSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFadeDescriptionData                   K2Node_MakeStruct_FadeDescriptionData;             // 0x0020(0x0020)(NoDestructor)
	struct FFadeDescriptionData                   K2Node_MakeStruct_FadeDescriptionData_1;           // 0x0040(0x0020)(NoDestructor)
	class UWBP_Dialog_YesNo_C*                    CallFunc_Create_ReturnValue_1;                     // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Settings_C*                        CallFunc_Create_ReturnValue_2;                     // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSubsystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Dialog_YesNo_C*                    CallFunc_Create_ReturnValue_3;                     // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFadeSubsystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Dialog_YesNo_C*                    CallFunc_Create_ReturnValue_4;                     // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USaveSubsystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USaveSubsystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSinceLastGameSave_ReturnValue;     // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSinceLastGameSave_ReturnValue_1;   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_TimeSecondsToString_ReturnValue;          // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_TimeSecondsToString_ReturnValue_1;        // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00D8(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00E8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00F8(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0140(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0188(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0198(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01A8(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01B8(0x0010)()
	class USoundSubsystem*                        CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x01D8(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x01E8(0x0010)()
	class USoundSubsystem*                        CallFunc_GetGameInstanceSubsystem_ReturnValue_6;   // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0200(0x0010)()
	class USoundSubsystem*                        CallFunc_GetGameInstanceSubsystem_ReturnValue_7;   // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Dialog_YesNo_C*                    CallFunc_Create_ReturnValue_5;                     // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Achievement_C*                     CallFunc_Create_ReturnValue_6;                     // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSwitchBuild_ReturnValue;                // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaystationBuild_ReturnValue;           // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22A[0x6];                                      // 0x022A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_SelectText_ReturnValue;                   // 0x0230(0x0010)()
	class FText                                   CallFunc_SelectText_ReturnValue_1;                 // 0x0240(0x0010)()
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_9;             // 0x0258(0x0040)()
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue;             // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSkipAnimation;                 // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A2[0x2];                                      // 0x02A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x02A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue_1;           // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_8;             // 0x02C8(0x0040)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0308(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_7;             // 0x0318(0x0040)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0358(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_6;             // 0x0368(0x0040)()
	class FText                                   Temp_text_Variable_2;                              // 0x03A8(0x0010)()
	class UGameViewportZion*                      CallFunc_Get_ReturnValue_1;                        // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeZion*                          CallFunc_Get_ReturnValue_2;                        // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_5;             // 0x03E0(0x0040)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0420(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetPause_ReturnValue;                     // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeZion*                          CallFunc_Get_ReturnValue_3;                        // 0x0438(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameViewportZion*                      CallFunc_Get_ReturnValue_4;                        // 0x0440(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0448(0x0008)(NoDestructor)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_3;                              // 0x0458(0x0010)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0468(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameModeZion*                          CallFunc_Get_ReturnValue_5;                        // 0x0478(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue_1;              // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_4;             // 0x0488(0x0040)()
	int32                                         CallFunc_UnsetPause_ReturnValue;                   // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CC[0x4];                                      // 0x04CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_3;             // 0x04D0(0x0040)()
	bool                                          Temp_bool_Variable_1;                              // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511[0x3];                                      // 0x0511(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0514(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_524[0x4];                                      // 0x0524(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0528(0x0010)()
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_2;             // 0x0538(0x0040)()
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_1;             // 0x0578(0x0040)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x05B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent;               // 0x05C8(0x0040)()
	class FText                                   Temp_text_Variable_4;                              // 0x0608(0x0010)(ConstParm)
	class AGameModeZion*                          CallFunc_Get_ReturnValue_6;                        // 0x0618(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameModeZion*                          CallFunc_Get_ReturnValue_7;                        // 0x0620(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InstantiateRetryDialog_ReturnValue;       // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InstantiateRetryDialog_ReturnValue_1;     // 0x0629(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62A[0x6];                                      // 0x062A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeZion*                          CallFunc_Get_ReturnValue_8;                        // 0x0630(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetViewportOverlayRenderOpacity_Opacity_ImplicitCast; // 0x0648(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetViewportOverlayRenderOpacity_Opacity_ImplicitCast_1; // 0x064C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause) == 0x000008, "Wrong alignment on WBP_Pause_C_ExecuteUbergraph_WBP_Pause");
static_assert(sizeof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause) == 0x000650, "Wrong size on WBP_Pause_C_ExecuteUbergraph_WBP_Pause");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, EntryPoint) == 0x000000, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_Get_ReturnValue) == 0x000008, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_Create_ReturnValue) == 0x000010, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, K2Node_MakeStruct_FadeDescriptionData) == 0x000020, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::K2Node_MakeStruct_FadeDescriptionData' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, K2Node_MakeStruct_FadeDescriptionData_1) == 0x000040, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::K2Node_MakeStruct_FadeDescriptionData_1' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_Create_ReturnValue_1) == 0x000060, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_Create_ReturnValue_2) == 0x000068, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000070, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_Create_ReturnValue_3) == 0x000078, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000080, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_Create_ReturnValue_4) == 0x000088, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_Create_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, K2Node_CreateDelegate_OutputDelegate) == 0x000090, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x0000A0, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x0000A8, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_GetTimeSinceLastGameSave_ReturnValue) == 0x0000B0, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_GetTimeSinceLastGameSave_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_GetTimeSinceLastGameSave_ReturnValue_1) == 0x0000B4, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_GetTimeSinceLastGameSave_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_TimeSecondsToString_ReturnValue) == 0x0000B8, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_TimeSecondsToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_TimeSecondsToString_ReturnValue_1) == 0x0000C8, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_TimeSecondsToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_Conv_StringToText_ReturnValue) == 0x0000D8, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000E8, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, K2Node_MakeStruct_FormatArgumentData) == 0x0000F8, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, K2Node_MakeStruct_FormatArgumentData_1) == 0x000140, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, K2Node_MakeArray_Array) == 0x000188, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, K2Node_MakeArray_Array_1) == 0x000198, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_Format_ReturnValue) == 0x0001A8, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_Format_ReturnValue_1) == 0x0001B8, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_GetGameInstanceSubsystem_ReturnValue_5) == 0x0001C8, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_GetGameInstanceSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, Temp_bool_Variable) == 0x0001D0, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, Temp_text_Variable) == 0x0001D8, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, Temp_text_Variable_1) == 0x0001E8, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_GetGameInstanceSubsystem_ReturnValue_6) == 0x0001F8, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_GetGameInstanceSubsystem_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, K2Node_Select_Default) == 0x000200, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_GetGameInstanceSubsystem_ReturnValue_7) == 0x000210, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_GetGameInstanceSubsystem_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_Create_ReturnValue_5) == 0x000218, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_Create_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_Create_ReturnValue_6) == 0x000220, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_Create_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_IsSwitchBuild_ReturnValue) == 0x000228, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_IsSwitchBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_IsPlaystationBuild_ReturnValue) == 0x000229, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_IsPlaystationBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_SelectText_ReturnValue) == 0x000230, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_SelectText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_SelectText_ReturnValue_1) == 0x000240, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_SelectText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_SetGamePaused_ReturnValue) == 0x000250, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, K2Node_ComponentBoundEvent_KeyEvent_9) == 0x000258, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::K2Node_ComponentBoundEvent_KeyEvent_9' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_PlayUMGAnimation_ReturnValue) == 0x000298, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_PlayUMGAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, K2Node_CustomEvent_bSkipAnimation) == 0x0002A0, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::K2Node_CustomEvent_bSkipAnimation' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_IsValid_ReturnValue) == 0x0002A1, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002A4, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_PlayUMGAnimation_ReturnValue_1) == 0x0002B8, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_PlayUMGAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_IsValid_ReturnValue_1) == 0x0002C0, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, K2Node_ComponentBoundEvent_KeyEvent_8) == 0x0002C8, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::K2Node_ComponentBoundEvent_KeyEvent_8' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, K2Node_CreateDelegate_OutputDelegate_2) == 0x000308, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, K2Node_ComponentBoundEvent_KeyEvent_7) == 0x000318, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::K2Node_ComponentBoundEvent_KeyEvent_7' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, K2Node_CreateDelegate_OutputDelegate_3) == 0x000358, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, K2Node_ComponentBoundEvent_KeyEvent_6) == 0x000368, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::K2Node_ComponentBoundEvent_KeyEvent_6' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, Temp_text_Variable_2) == 0x0003A8, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_Get_ReturnValue_1) == 0x0003B8, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_GetEndTime_ReturnValue) == 0x0003C0, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x0003C4, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0003C8, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0003D0, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_Get_ReturnValue_2) == 0x0003D8, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_Get_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, K2Node_ComponentBoundEvent_KeyEvent_5) == 0x0003E0, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::K2Node_ComponentBoundEvent_KeyEvent_5' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, K2Node_CreateDelegate_OutputDelegate_4) == 0x000420, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_SetPause_ReturnValue) == 0x000430, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_SetPause_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_Get_ReturnValue_3) == 0x000438, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_Get_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_Get_ReturnValue_4) == 0x000440, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_Get_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, K2Node_Event_InFocusEvent) == 0x000448, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_SelectFloat_ReturnValue) == 0x000450, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, Temp_text_Variable_3) == 0x000458, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, K2Node_CreateDelegate_OutputDelegate_5) == 0x000468, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_Get_ReturnValue_5) == 0x000478, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_Get_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_SetGamePaused_ReturnValue_1) == 0x000480, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_SetGamePaused_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, K2Node_ComponentBoundEvent_KeyEvent_4) == 0x000488, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::K2Node_ComponentBoundEvent_KeyEvent_4' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_UnsetPause_ReturnValue) == 0x0004C8, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_UnsetPause_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, K2Node_ComponentBoundEvent_KeyEvent_3) == 0x0004D0, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::K2Node_ComponentBoundEvent_KeyEvent_3' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, Temp_bool_Variable_1) == 0x000510, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, K2Node_CreateDelegate_OutputDelegate_6) == 0x000514, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, K2Node_Select_Default_1) == 0x000528, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, K2Node_ComponentBoundEvent_KeyEvent_2) == 0x000538, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::K2Node_ComponentBoundEvent_KeyEvent_2' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, K2Node_ComponentBoundEvent_KeyEvent_1) == 0x000578, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::K2Node_ComponentBoundEvent_KeyEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, K2Node_CreateDelegate_OutputDelegate_7) == 0x0005B8, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, K2Node_ComponentBoundEvent_KeyEvent) == 0x0005C8, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::K2Node_ComponentBoundEvent_KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, Temp_text_Variable_4) == 0x000608, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_Get_ReturnValue_6) == 0x000618, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_Get_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_Get_ReturnValue_7) == 0x000620, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_Get_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_InstantiateRetryDialog_ReturnValue) == 0x000628, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_InstantiateRetryDialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_InstantiateRetryDialog_ReturnValue_1) == 0x000629, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_InstantiateRetryDialog_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_Get_ReturnValue_8) == 0x000630, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_Get_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000638, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000640, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_SetViewportOverlayRenderOpacity_Opacity_ImplicitCast) == 0x000648, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_SetViewportOverlayRenderOpacity_Opacity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_ExecuteUbergraph_WBP_Pause, CallFunc_SetViewportOverlayRenderOpacity_Opacity_ImplicitCast_1) == 0x00064C, "Member 'WBP_Pause_C_ExecuteUbergraph_WBP_Pause::CallFunc_SetViewportOverlayRenderOpacity_Opacity_ImplicitCast_1' has a wrong offset!");

// Function WBP_Pause.WBP_Pause_C.IsInRecollectionBoss
// 0x0018 (0x0018 - 0x0000)
struct WBP_Pause_C_IsInRecollectionBoss final
{
public:
	bool                                          bResult;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeZion*                          CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGameModeType                                 CallFunc_GetGameModeType_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Pause_C_IsInRecollectionBoss) == 0x000008, "Wrong alignment on WBP_Pause_C_IsInRecollectionBoss");
static_assert(sizeof(WBP_Pause_C_IsInRecollectionBoss) == 0x000018, "Wrong size on WBP_Pause_C_IsInRecollectionBoss");
static_assert(offsetof(WBP_Pause_C_IsInRecollectionBoss, bResult) == 0x000000, "Member 'WBP_Pause_C_IsInRecollectionBoss::bResult' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_IsInRecollectionBoss, CallFunc_Get_ReturnValue) == 0x000008, "Member 'WBP_Pause_C_IsInRecollectionBoss::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_IsInRecollectionBoss, CallFunc_GetGameModeType_ReturnValue) == 0x000010, "Member 'WBP_Pause_C_IsInRecollectionBoss::CallFunc_GetGameModeType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_IsInRecollectionBoss, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'WBP_Pause_C_IsInRecollectionBoss::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_IsInRecollectionBoss, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000012, "Member 'WBP_Pause_C_IsInRecollectionBoss::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_IsInRecollectionBoss, CallFunc_BooleanOR_ReturnValue) == 0x000013, "Member 'WBP_Pause_C_IsInRecollectionBoss::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_Pause.WBP_Pause_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Pause_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Pause_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Pause_C_OnFocusReceived");
static_assert(sizeof(WBP_Pause_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_Pause_C_OnFocusReceived");
static_assert(offsetof(WBP_Pause_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Pause_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Pause_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Pause_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Pause_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Pause_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Pause.WBP_Pause_C.OnKeyDown
// 0x02C8 (0x02C8 - 0x0000)
struct WBP_Pause_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
