#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugMenu_Element_Choice_Text_Integer

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_DebugMenu_Element_Choice_Text_Integer.WBP_DebugMenu_Element_Choice_Text_Integer_C.SetValue
// 0x0008 (0x0008 - 0x0000)
struct WBP_DebugMenu_Element_Choice_Text_Integer_C_SetValue final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Element_Choice_Text_Integer_C_SetValue) == 0x000004, "Wrong alignment on WBP_DebugMenu_Element_Choice_Text_Integer_C_SetValue");
static_assert(sizeof(WBP_DebugMenu_Element_Choice_Text_Integer_C_SetValue) == 0x000008, "Wrong size on WBP_DebugMenu_Element_Choice_Text_Integer_C_SetValue");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Integer_C_SetValue, Value) == 0x000000, "Member 'WBP_DebugMenu_Element_Choice_Text_Integer_C_SetValue::Value' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Integer_C_SetValue, CallFunc_Clamp_ReturnValue) == 0x000004, "Member 'WBP_DebugMenu_Element_Choice_Text_Integer_C_SetValue::CallFunc_Clamp_ReturnValue' has a wrong offset!");

// Function WBP_DebugMenu_Element_Choice_Text_Integer.WBP_DebugMenu_Element_Choice_Text_Integer_C.RefreshOptionText
// 0x0010 (0x0010 - 0x0000)
struct WBP_DebugMenu_Element_Choice_Text_Integer_C_RefreshOptionText final
{
public:
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0000(0x0010)()
};
static_assert(alignof(WBP_DebugMenu_Element_Choice_Text_Integer_C_RefreshOptionText) == 0x000008, "Wrong alignment on WBP_DebugMenu_Element_Choice_Text_Integer_C_RefreshOptionText");
static_assert(sizeof(WBP_DebugMenu_Element_Choice_Text_Integer_C_RefreshOptionText) == 0x000010, "Wrong size on WBP_DebugMenu_Element_Choice_Text_Integer_C_RefreshOptionText");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Integer_C_RefreshOptionText, CallFunc_Conv_IntToText_ReturnValue) == 0x000000, "Member 'WBP_DebugMenu_Element_Choice_Text_Integer_C_RefreshOptionText::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_DebugMenu_Element_Choice_Text_Integer.WBP_DebugMenu_Element_Choice_Text_Integer_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_DebugMenu_Element_Choice_Text_Integer_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Element_Choice_Text_Integer_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_DebugMenu_Element_Choice_Text_Integer_C_PreConstruct");
static_assert(sizeof(WBP_DebugMenu_Element_Choice_Text_Integer_C_PreConstruct) == 0x000001, "Wrong size on WBP_DebugMenu_Element_Choice_Text_Integer_C_PreConstruct");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Integer_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_DebugMenu_Element_Choice_Text_Integer_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_DebugMenu_Element_Choice_Text_Integer.WBP_DebugMenu_Element_Choice_Text_Integer_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_DebugMenu_Element_Choice_Text_Integer_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_DebugMenu_Element_Choice_Text_Integer_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_DebugMenu_Element_Choice_Text_Integer_C_OnFocusReceived");
static_assert(sizeof(WBP_DebugMenu_Element_Choice_Text_Integer_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_DebugMenu_Element_Choice_Text_Integer_C_OnFocusReceived");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Integer_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_DebugMenu_Element_Choice_Text_Integer_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Integer_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_DebugMenu_Element_Choice_Text_Integer_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Integer_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_DebugMenu_Element_Choice_Text_Integer_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Integer_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_DebugMenu_Element_Choice_Text_Integer_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_DebugMenu_Element_Choice_Text_Integer.WBP_DebugMenu_Element_Choice_Text_Integer_C.GetValue
// 0x0004 (0x0004 - 0x0000)
struct WBP_DebugMenu_Element_Choice_Text_Integer_C_GetValue final
{
public:
	int32                                         CurrValue_0;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Element_Choice_Text_Integer_C_GetValue) == 0x000004, "Wrong alignment on WBP_DebugMenu_Element_Choice_Text_Integer_C_GetValue");
static_assert(sizeof(WBP_DebugMenu_Element_Choice_Text_Integer_C_GetValue) == 0x000004, "Wrong size on WBP_DebugMenu_Element_Choice_Text_Integer_C_GetValue");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Integer_C_GetValue, CurrValue_0) == 0x000000, "Member 'WBP_DebugMenu_Element_Choice_Text_Integer_C_GetValue::CurrValue_0' has a wrong offset!");

// Function WBP_DebugMenu_Element_Choice_Text_Integer.WBP_DebugMenu_Element_Choice_Text_Integer_C.ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Integer
// 0x0028 (0x0028 - 0x0000)
struct WBP_DebugMenu_Element_Choice_Text_Integer_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Integer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Wrap_ReturnValue;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_1;                      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Wrap_ReturnValue_1;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_Element_Choice_Text_Integer_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Integer) == 0x000004, "Wrong alignment on WBP_DebugMenu_Element_Choice_Text_Integer_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Integer");
static_assert(sizeof(WBP_DebugMenu_Element_Choice_Text_Integer_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Integer) == 0x000028, "Wrong size on WBP_DebugMenu_Element_Choice_Text_Integer_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Integer");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Integer_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Integer, EntryPoint) == 0x000000, "Member 'WBP_DebugMenu_Element_Choice_Text_Integer_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Integer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Integer_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Integer, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_DebugMenu_Element_Choice_Text_Integer_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Integer::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Integer_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Integer, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'WBP_DebugMenu_Element_Choice_Text_Integer_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Integer::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Integer_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Integer, CallFunc_Clamp_ReturnValue) == 0x00000C, "Member 'WBP_DebugMenu_Element_Choice_Text_Integer_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Integer::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Integer_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Integer, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_DebugMenu_Element_Choice_Text_Integer_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Integer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Integer_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Integer, CallFunc_Wrap_ReturnValue) == 0x000014, "Member 'WBP_DebugMenu_Element_Choice_Text_Integer_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Integer::CallFunc_Wrap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Integer_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Integer, CallFunc_Clamp_ReturnValue_1) == 0x000018, "Member 'WBP_DebugMenu_Element_Choice_Text_Integer_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Integer::CallFunc_Clamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Integer_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Integer, CallFunc_SelectInt_ReturnValue) == 0x00001C, "Member 'WBP_DebugMenu_Element_Choice_Text_Integer_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Integer::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Integer_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Integer, CallFunc_Wrap_ReturnValue_1) == 0x000020, "Member 'WBP_DebugMenu_Element_Choice_Text_Integer_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Integer::CallFunc_Wrap_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_Element_Choice_Text_Integer_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Integer, CallFunc_SelectInt_ReturnValue_1) == 0x000024, "Member 'WBP_DebugMenu_Element_Choice_Text_Integer_C_ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text_Integer::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");

}

