#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Tutorial

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Tutorial.WBP_Tutorial_C
// 0x01F8 (0x0678 - 0x0480)
class UWBP_Tutorial_C final : public UUserWidgetTutorial
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideAnim;                                          // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_146;                                         // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URefreshableRichTextBlock*              RefreshableRichTextBlock;                          // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleText;                                         // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VideoBuffer;                                       // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Generic_C*                  WBP_Button_Generic;                                // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Footer_C*                          WBP_Footer;                                        // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SeparateLine_C*                    WBP_SeparateLine;                                  // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBinkMediaPlayer*                       MediaPlayer;                                       // 0x04D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FInventoryItemTutorialData             ItemTutorialData;                                  // 0x04E0(0x0190)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, AdvancedDisplay)
	class UFMODEvent*                             OpenSoundEvent;                                    // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Tutorial_MediaPlayer_K2Node_ComponentBoundEvent_1_OnBinkMediaPlayerMediaOpened__DelegateSignature(const class FString& OpenedUrl);
	void BndEvt__WBP_Tutorial_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void CloseVideo();
	void Construct();
	void ExecuteUbergraph_WBP_Tutorial(int32 EntryPoint);
	void OnFinish_415A319940FEC13D93940E80F3CC9C56();
	void OnFinish_BD0EA68A49A2399B9C76558A3237AA40();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OpenVideo();
	void SetupTexts();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Tutorial_C">();
	}
	static class UWBP_Tutorial_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Tutorial_C>();
	}
};
static_assert(alignof(UWBP_Tutorial_C) == 0x000008, "Wrong alignment on UWBP_Tutorial_C");
static_assert(sizeof(UWBP_Tutorial_C) == 0x000678, "Wrong size on UWBP_Tutorial_C");
static_assert(offsetof(UWBP_Tutorial_C, UberGraphFrame) == 0x000480, "Member 'UWBP_Tutorial_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_C, HideAnim) == 0x000488, "Member 'UWBP_Tutorial_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_C, ShowAnim) == 0x000490, "Member 'UWBP_Tutorial_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_C, BG) == 0x000498, "Member 'UWBP_Tutorial_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_C, Image_146) == 0x0004A0, "Member 'UWBP_Tutorial_C::Image_146' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_C, RefreshableRichTextBlock) == 0x0004A8, "Member 'UWBP_Tutorial_C::RefreshableRichTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_C, TitleText) == 0x0004B0, "Member 'UWBP_Tutorial_C::TitleText' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_C, VideoBuffer) == 0x0004B8, "Member 'UWBP_Tutorial_C::VideoBuffer' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_C, WBP_Button_Generic) == 0x0004C0, "Member 'UWBP_Tutorial_C::WBP_Button_Generic' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_C, WBP_Footer) == 0x0004C8, "Member 'UWBP_Tutorial_C::WBP_Footer' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_C, WBP_SeparateLine) == 0x0004D0, "Member 'UWBP_Tutorial_C::WBP_SeparateLine' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_C, MediaPlayer) == 0x0004D8, "Member 'UWBP_Tutorial_C::MediaPlayer' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_C, ItemTutorialData) == 0x0004E0, "Member 'UWBP_Tutorial_C::ItemTutorialData' has a wrong offset!");
static_assert(offsetof(UWBP_Tutorial_C, OpenSoundEvent) == 0x000670, "Member 'UWBP_Tutorial_C::OpenSoundEvent' has a wrong offset!");

}

