#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_Page_Sound

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Settings_Page_Sound.WBP_Settings_Page_Sound_C.BndEvt__WBP_Settings_Page_Audio_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_Settings_Page_Sound_C_BndEvt__WBP_Settings_Page_Audio_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Settings_Page_Sound_C_BndEvt__WBP_Settings_Page_Audio_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_Page_Sound_C_BndEvt__WBP_Settings_Page_Audio_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Settings_Page_Sound_C_BndEvt__WBP_Settings_Page_Audio_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_Settings_Page_Sound_C_BndEvt__WBP_Settings_Page_Audio_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Settings_Page_Sound_C_BndEvt__WBP_Settings_Page_Audio_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_Settings_Page_Sound_C_BndEvt__WBP_Settings_Page_Audio_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_Settings_Page_Sound.WBP_Settings_Page_Sound_C.ExecuteUbergraph_WBP_Settings_Page_Sound
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_Settings_Page_Sound_C_ExecuteUbergraph_WBP_Settings_Page_Sound final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundSubsystem*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Dialog_YesNo_C*                    CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0030(0x0010)(ConstParm)
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent;               // 0x0040(0x0040)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_Settings_Entry_Sound_C*>    K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Settings_Entry_Sound_C*            CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Page_Sound_C_ExecuteUbergraph_WBP_Settings_Page_Sound) == 0x000008, "Wrong alignment on WBP_Settings_Page_Sound_C_ExecuteUbergraph_WBP_Settings_Page_Sound");
static_assert(sizeof(WBP_Settings_Page_Sound_C_ExecuteUbergraph_WBP_Settings_Page_Sound) == 0x0000B0, "Wrong size on WBP_Settings_Page_Sound_C_ExecuteUbergraph_WBP_Settings_Page_Sound");
static_assert(offsetof(WBP_Settings_Page_Sound_C_ExecuteUbergraph_WBP_Settings_Page_Sound, EntryPoint) == 0x000000, "Member 'WBP_Settings_Page_Sound_C_ExecuteUbergraph_WBP_Settings_Page_Sound::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Sound_C_ExecuteUbergraph_WBP_Settings_Page_Sound, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_Settings_Page_Sound_C_ExecuteUbergraph_WBP_Settings_Page_Sound::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Sound_C_ExecuteUbergraph_WBP_Settings_Page_Sound, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_Settings_Page_Sound_C_ExecuteUbergraph_WBP_Settings_Page_Sound::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Sound_C_ExecuteUbergraph_WBP_Settings_Page_Sound, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WBP_Settings_Page_Sound_C_ExecuteUbergraph_WBP_Settings_Page_Sound::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Sound_C_ExecuteUbergraph_WBP_Settings_Page_Sound, CallFunc_Create_ReturnValue) == 0x000028, "Member 'WBP_Settings_Page_Sound_C_ExecuteUbergraph_WBP_Settings_Page_Sound::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Sound_C_ExecuteUbergraph_WBP_Settings_Page_Sound, Temp_text_Variable) == 0x000030, "Member 'WBP_Settings_Page_Sound_C_ExecuteUbergraph_WBP_Settings_Page_Sound::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Sound_C_ExecuteUbergraph_WBP_Settings_Page_Sound, K2Node_ComponentBoundEvent_KeyEvent) == 0x000040, "Member 'WBP_Settings_Page_Sound_C_ExecuteUbergraph_WBP_Settings_Page_Sound::K2Node_ComponentBoundEvent_KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Sound_C_ExecuteUbergraph_WBP_Settings_Page_Sound, Temp_int_Loop_Counter_Variable) == 0x000080, "Member 'WBP_Settings_Page_Sound_C_ExecuteUbergraph_WBP_Settings_Page_Sound::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Sound_C_ExecuteUbergraph_WBP_Settings_Page_Sound, K2Node_MakeArray_Array) == 0x000088, "Member 'WBP_Settings_Page_Sound_C_ExecuteUbergraph_WBP_Settings_Page_Sound::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Sound_C_ExecuteUbergraph_WBP_Settings_Page_Sound, CallFunc_Add_IntInt_ReturnValue) == 0x000098, "Member 'WBP_Settings_Page_Sound_C_ExecuteUbergraph_WBP_Settings_Page_Sound::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Sound_C_ExecuteUbergraph_WBP_Settings_Page_Sound, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'WBP_Settings_Page_Sound_C_ExecuteUbergraph_WBP_Settings_Page_Sound::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Sound_C_ExecuteUbergraph_WBP_Settings_Page_Sound, CallFunc_Array_Length_ReturnValue) == 0x0000A8, "Member 'WBP_Settings_Page_Sound_C_ExecuteUbergraph_WBP_Settings_Page_Sound::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Sound_C_ExecuteUbergraph_WBP_Settings_Page_Sound, CallFunc_Less_IntInt_ReturnValue) == 0x0000AC, "Member 'WBP_Settings_Page_Sound_C_ExecuteUbergraph_WBP_Settings_Page_Sound::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Settings_Page_Sound.WBP_Settings_Page_Sound_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Settings_Page_Sound_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Settings_Page_Sound_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Settings_Page_Sound_C_OnFocusReceived");
static_assert(sizeof(WBP_Settings_Page_Sound_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_Settings_Page_Sound_C_OnFocusReceived");
static_assert(offsetof(WBP_Settings_Page_Sound_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Settings_Page_Sound_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Sound_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Settings_Page_Sound_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Sound_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Settings_Page_Sound_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Sound_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Settings_Page_Sound_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

}

