#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_Page_Game

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Settings_Page_Game.WBP_Settings_Page_Game_C.BndEvt__WBP_Settings_Page_Game_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Button_Generic_RevertToDefault_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_Settings_Page_Game.WBP_Settings_Page_Game_C.BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_AutoSkipAlreadySeenEvents_K2Node_ComponentBoundEvent_13_OnToggle__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_AutoSkipAlreadySeenEvents_K2Node_ComponentBoundEvent_13_OnToggle__DelegateSignature final
{
public:
	bool                                          ToggleValue;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_AutoSkipAlreadySeenEvents_K2Node_ComponentBoundEvent_13_OnToggle__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_AutoSkipAlreadySeenEvents_K2Node_ComponentBoundEvent_13_OnToggle__DelegateSignature");
static_assert(sizeof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_AutoSkipAlreadySeenEvents_K2Node_ComponentBoundEvent_13_OnToggle__DelegateSignature) == 0x000001, "Wrong size on WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_AutoSkipAlreadySeenEvents_K2Node_ComponentBoundEvent_13_OnToggle__DelegateSignature");
static_assert(offsetof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_AutoSkipAlreadySeenEvents_K2Node_ComponentBoundEvent_13_OnToggle__DelegateSignature, ToggleValue) == 0x000000, "Member 'WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_AutoSkipAlreadySeenEvents_K2Node_ComponentBoundEvent_13_OnToggle__DelegateSignature::ToggleValue' has a wrong offset!");

// Function WBP_Settings_Page_Game.WBP_Settings_Page_Game_C.BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_AutoUploadCrash_K2Node_ComponentBoundEvent_11_OnToggle__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_AutoUploadCrash_K2Node_ComponentBoundEvent_11_OnToggle__DelegateSignature final
{
public:
	bool                                          ToggleValue;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_AutoUploadCrash_K2Node_ComponentBoundEvent_11_OnToggle__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_AutoUploadCrash_K2Node_ComponentBoundEvent_11_OnToggle__DelegateSignature");
static_assert(sizeof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_AutoUploadCrash_K2Node_ComponentBoundEvent_11_OnToggle__DelegateSignature) == 0x000001, "Wrong size on WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_AutoUploadCrash_K2Node_ComponentBoundEvent_11_OnToggle__DelegateSignature");
static_assert(offsetof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_AutoUploadCrash_K2Node_ComponentBoundEvent_11_OnToggle__DelegateSignature, ToggleValue) == 0x000000, "Member 'WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_AutoUploadCrash_K2Node_ComponentBoundEvent_11_OnToggle__DelegateSignature::ToggleValue' has a wrong offset!");

// Function WBP_Settings_Page_Game.WBP_Settings_Page_Game_C.BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_CameraOscillation_K2Node_ComponentBoundEvent_9_OnToggle__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_CameraOscillation_K2Node_ComponentBoundEvent_9_OnToggle__DelegateSignature final
{
public:
	bool                                          ToggleValue;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_CameraOscillation_K2Node_ComponentBoundEvent_9_OnToggle__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_CameraOscillation_K2Node_ComponentBoundEvent_9_OnToggle__DelegateSignature");
static_assert(sizeof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_CameraOscillation_K2Node_ComponentBoundEvent_9_OnToggle__DelegateSignature) == 0x000001, "Wrong size on WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_CameraOscillation_K2Node_ComponentBoundEvent_9_OnToggle__DelegateSignature");
static_assert(offsetof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_CameraOscillation_K2Node_ComponentBoundEvent_9_OnToggle__DelegateSignature, ToggleValue) == 0x000000, "Member 'WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_CameraOscillation_K2Node_ComponentBoundEvent_9_OnToggle__DelegateSignature::ToggleValue' has a wrong offset!");

// Function WBP_Settings_Page_Game.WBP_Settings_Page_Game_C.BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayAchievementNotifications_K2Node_ComponentBoundEvent_12_OnToggle__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayAchievementNotifications_K2Node_ComponentBoundEvent_12_OnToggle__DelegateSignature final
{
public:
	bool                                          ToggleValue;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayAchievementNotifications_K2Node_ComponentBoundEvent_12_OnToggle__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayAchievementNotifications_K2Node_ComponentBoundEvent_12_OnToggle__DelegateSignature");
static_assert(sizeof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayAchievementNotifications_K2Node_ComponentBoundEvent_12_OnToggle__DelegateSignature) == 0x000001, "Wrong size on WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayAchievementNotifications_K2Node_ComponentBoundEvent_12_OnToggle__DelegateSignature");
static_assert(offsetof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayAchievementNotifications_K2Node_ComponentBoundEvent_12_OnToggle__DelegateSignature, ToggleValue) == 0x000000, "Member 'WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayAchievementNotifications_K2Node_ComponentBoundEvent_12_OnToggle__DelegateSignature::ToggleValue' has a wrong offset!");

// Function WBP_Settings_Page_Game.WBP_Settings_Page_Game_C.BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayDamageValues_K2Node_ComponentBoundEvent_3_OnToggle__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayDamageValues_K2Node_ComponentBoundEvent_3_OnToggle__DelegateSignature final
{
public:
	bool                                          ToggleValue;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayDamageValues_K2Node_ComponentBoundEvent_3_OnToggle__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayDamageValues_K2Node_ComponentBoundEvent_3_OnToggle__DelegateSignature");
static_assert(sizeof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayDamageValues_K2Node_ComponentBoundEvent_3_OnToggle__DelegateSignature) == 0x000001, "Wrong size on WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayDamageValues_K2Node_ComponentBoundEvent_3_OnToggle__DelegateSignature");
static_assert(offsetof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayDamageValues_K2Node_ComponentBoundEvent_3_OnToggle__DelegateSignature, ToggleValue) == 0x000000, "Member 'WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayDamageValues_K2Node_ComponentBoundEvent_3_OnToggle__DelegateSignature::ToggleValue' has a wrong offset!");

// Function WBP_Settings_Page_Game.WBP_Settings_Page_Game_C.BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayEnemyGauges_K2Node_ComponentBoundEvent_10_OnToggle__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayEnemyGauges_K2Node_ComponentBoundEvent_10_OnToggle__DelegateSignature final
{
public:
	bool                                          ToggleValue;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayEnemyGauges_K2Node_ComponentBoundEvent_10_OnToggle__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayEnemyGauges_K2Node_ComponentBoundEvent_10_OnToggle__DelegateSignature");
static_assert(sizeof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayEnemyGauges_K2Node_ComponentBoundEvent_10_OnToggle__DelegateSignature) == 0x000001, "Wrong size on WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayEnemyGauges_K2Node_ComponentBoundEvent_10_OnToggle__DelegateSignature");
static_assert(offsetof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayEnemyGauges_K2Node_ComponentBoundEvent_10_OnToggle__DelegateSignature, ToggleValue) == 0x000000, "Member 'WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayEnemyGauges_K2Node_ComponentBoundEvent_10_OnToggle__DelegateSignature::ToggleValue' has a wrong offset!");

// Function WBP_Settings_Page_Game.WBP_Settings_Page_Game_C.BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayHealValues_K2Node_ComponentBoundEvent_4_OnToggle__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayHealValues_K2Node_ComponentBoundEvent_4_OnToggle__DelegateSignature final
{
public:
	bool                                          ToggleValue;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayHealValues_K2Node_ComponentBoundEvent_4_OnToggle__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayHealValues_K2Node_ComponentBoundEvent_4_OnToggle__DelegateSignature");
static_assert(sizeof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayHealValues_K2Node_ComponentBoundEvent_4_OnToggle__DelegateSignature) == 0x000001, "Wrong size on WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayHealValues_K2Node_ComponentBoundEvent_4_OnToggle__DelegateSignature");
static_assert(offsetof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayHealValues_K2Node_ComponentBoundEvent_4_OnToggle__DelegateSignature, ToggleValue) == 0x000000, "Member 'WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayHealValues_K2Node_ComponentBoundEvent_4_OnToggle__DelegateSignature::ToggleValue' has a wrong offset!");

// Function WBP_Settings_Page_Game.WBP_Settings_Page_Game_C.BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayHPAboveGauge_K2Node_ComponentBoundEvent_5_OnToggle__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayHPAboveGauge_K2Node_ComponentBoundEvent_5_OnToggle__DelegateSignature final
{
public:
	bool                                          ToggleValue;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayHPAboveGauge_K2Node_ComponentBoundEvent_5_OnToggle__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayHPAboveGauge_K2Node_ComponentBoundEvent_5_OnToggle__DelegateSignature");
static_assert(sizeof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayHPAboveGauge_K2Node_ComponentBoundEvent_5_OnToggle__DelegateSignature) == 0x000001, "Wrong size on WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayHPAboveGauge_K2Node_ComponentBoundEvent_5_OnToggle__DelegateSignature");
static_assert(offsetof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayHPAboveGauge_K2Node_ComponentBoundEvent_5_OnToggle__DelegateSignature, ToggleValue) == 0x000000, "Member 'WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayHPAboveGauge_K2Node_ComponentBoundEvent_5_OnToggle__DelegateSignature::ToggleValue' has a wrong offset!");

// Function WBP_Settings_Page_Game.WBP_Settings_Page_Game_C.BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayPlayerUI_K2Node_ComponentBoundEvent_8_OnToggle__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayPlayerUI_K2Node_ComponentBoundEvent_8_OnToggle__DelegateSignature final
{
public:
	bool                                          ToggleValue;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayPlayerUI_K2Node_ComponentBoundEvent_8_OnToggle__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayPlayerUI_K2Node_ComponentBoundEvent_8_OnToggle__DelegateSignature");
static_assert(sizeof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayPlayerUI_K2Node_ComponentBoundEvent_8_OnToggle__DelegateSignature) == 0x000001, "Wrong size on WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayPlayerUI_K2Node_ComponentBoundEvent_8_OnToggle__DelegateSignature");
static_assert(offsetof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayPlayerUI_K2Node_ComponentBoundEvent_8_OnToggle__DelegateSignature, ToggleValue) == 0x000000, "Member 'WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayPlayerUI_K2Node_ComponentBoundEvent_8_OnToggle__DelegateSignature::ToggleValue' has a wrong offset!");

// Function WBP_Settings_Page_Game.WBP_Settings_Page_Game_C.BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayTutorial_K2Node_ComponentBoundEvent_0_OnToggle__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayTutorial_K2Node_ComponentBoundEvent_0_OnToggle__DelegateSignature final
{
public:
	bool                                          ToggleValue;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayTutorial_K2Node_ComponentBoundEvent_0_OnToggle__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayTutorial_K2Node_ComponentBoundEvent_0_OnToggle__DelegateSignature");
static_assert(sizeof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayTutorial_K2Node_ComponentBoundEvent_0_OnToggle__DelegateSignature) == 0x000001, "Wrong size on WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayTutorial_K2Node_ComponentBoundEvent_0_OnToggle__DelegateSignature");
static_assert(offsetof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayTutorial_K2Node_ComponentBoundEvent_0_OnToggle__DelegateSignature, ToggleValue) == 0x000000, "Member 'WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DisplayTutorial_K2Node_ComponentBoundEvent_0_OnToggle__DelegateSignature::ToggleValue' has a wrong offset!");

// Function WBP_Settings_Page_Game.WBP_Settings_Page_Game_C.BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DodgeStillHoldDown_K2Node_ComponentBoundEvent_2_OnToggle__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DodgeStillHoldDown_K2Node_ComponentBoundEvent_2_OnToggle__DelegateSignature final
{
public:
	bool                                          ToggleValue;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DodgeStillHoldDown_K2Node_ComponentBoundEvent_2_OnToggle__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DodgeStillHoldDown_K2Node_ComponentBoundEvent_2_OnToggle__DelegateSignature");
static_assert(sizeof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DodgeStillHoldDown_K2Node_ComponentBoundEvent_2_OnToggle__DelegateSignature) == 0x000001, "Wrong size on WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DodgeStillHoldDown_K2Node_ComponentBoundEvent_2_OnToggle__DelegateSignature");
static_assert(offsetof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DodgeStillHoldDown_K2Node_ComponentBoundEvent_2_OnToggle__DelegateSignature, ToggleValue) == 0x000000, "Member 'WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Choice_Toggle_DodgeStillHoldDown_K2Node_ComponentBoundEvent_2_OnToggle__DelegateSignature::ToggleValue' has a wrong offset!");

// Function WBP_Settings_Page_Game.WBP_Settings_Page_Game_C.BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Slider_CameraShake_K2Node_ComponentBoundEvent_7_OnSliderValueChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Slider_CameraShake_K2Node_ComponentBoundEvent_7_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Slider_CameraShake_K2Node_ComponentBoundEvent_7_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Slider_CameraShake_K2Node_ComponentBoundEvent_7_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Slider_CameraShake_K2Node_ComponentBoundEvent_7_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong size on WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Slider_CameraShake_K2Node_ComponentBoundEvent_7_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Slider_CameraShake_K2Node_ComponentBoundEvent_7_OnSliderValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Slider_CameraShake_K2Node_ComponentBoundEvent_7_OnSliderValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function WBP_Settings_Page_Game.WBP_Settings_Page_Game_C.BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Slider_LowHPFeedbackOpacity_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Slider_LowHPFeedbackOpacity_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Slider_LowHPFeedbackOpacity_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Slider_LowHPFeedbackOpacity_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Slider_LowHPFeedbackOpacity_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong size on WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Slider_LowHPFeedbackOpacity_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Slider_LowHPFeedbackOpacity_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_Page_Game_C_BndEvt__WBP_Settings_Page_Game_WBP_Settings_Entry_Slider_LowHPFeedbackOpacity_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function WBP_Settings_Page_Game.WBP_Settings_Page_Game_C.ExecuteUbergraph_WBP_Settings_Page_Game
// 0x0190 (0x0190 - 0x0000)
struct WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Dialog_YesNo_C*                    CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSwitchBuild_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaystationBuild_ReturnValue;           // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_SelectText_ReturnValue;                   // 0x0028(0x0010)()
	class FText                                   CallFunc_SelectText_ReturnValue_1;                 // 0x0038(0x0010)()
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent;               // 0x0050(0x0040)()
	bool                                          K2Node_ComponentBoundEvent_ToggleValue_10;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_ToggleValue_9;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_ToggleValue_8;          // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_ToggleValue_7;          // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_ToggleValue_6;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_ToggleValue_5;          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_ToggleValue_4;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_6;   // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_ToggleValue_3;          // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDisplayEnemyGauges_ReturnValue;        // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_7;   // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_Value_1;                // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDisplayPlayerUI_ReturnValue;           // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_8;   // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCameraShake_ReturnValue;               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCameraOscillation_ReturnValue;         // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_ToggleValue_2;          // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_116[0x2];                                      // 0x0116(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_9;   // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDisplayTutorials_ReturnValue;          // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDisplayHPAboveGauge_ReturnValue;       // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0128(0x0010)(ConstParm)
	bool                                          K2Node_ComponentBoundEvent_ToggleValue_1;          // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDisplayAchievementNotifications_ReturnValue; // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_10;  // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_ToggleValue;            // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDisplayHealValues_ReturnValue;         // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetAutoSkipAlreadySeenEvents_ReturnValue; // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14B[0x5];                                      // 0x014B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_11;  // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDisplayDamageValues_ReturnValue;       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x015C(0x0008)(NoDestructor)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_Value;                  // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_12;  // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetHoldDownToDodgeStill_ReturnValue;      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetLowHPFeedbackOpacity_ReturnValue;      // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCameraShake_NewCameraShake_ImplicitCast; // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetLowHPFeedbackOpacity_NewLowHPFeedbackOpacity_ImplicitCast; // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game) == 0x000008, "Wrong alignment on WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game");
static_assert(sizeof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game) == 0x000190, "Wrong size on WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, EntryPoint) == 0x000000, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000010, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_Create_ReturnValue) == 0x000018, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_IsSwitchBuild_ReturnValue) == 0x000020, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_IsSwitchBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_IsPlaystationBuild_ReturnValue) == 0x000021, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_IsPlaystationBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_SelectText_ReturnValue) == 0x000028, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_SelectText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_SelectText_ReturnValue_1) == 0x000038, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_SelectText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000048, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, K2Node_ComponentBoundEvent_KeyEvent) == 0x000050, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::K2Node_ComponentBoundEvent_KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, K2Node_ComponentBoundEvent_ToggleValue_10) == 0x000090, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::K2Node_ComponentBoundEvent_ToggleValue_10' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000098, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, K2Node_ComponentBoundEvent_ToggleValue_9) == 0x0000A0, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::K2Node_ComponentBoundEvent_ToggleValue_9' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, K2Node_ComponentBoundEvent_ToggleValue_8) == 0x0000A1, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::K2Node_ComponentBoundEvent_ToggleValue_8' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, K2Node_CreateDelegate_OutputDelegate) == 0x0000A4, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, K2Node_ComponentBoundEvent_ToggleValue_7) == 0x0000B4, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::K2Node_ComponentBoundEvent_ToggleValue_7' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x0000B8, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, K2Node_ComponentBoundEvent_ToggleValue_6) == 0x0000C0, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::K2Node_ComponentBoundEvent_ToggleValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, K2Node_ComponentBoundEvent_ToggleValue_5) == 0x0000C1, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::K2Node_ComponentBoundEvent_ToggleValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_GetGameInstanceSubsystem_ReturnValue_5) == 0x0000C8, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_GetGameInstanceSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, K2Node_ComponentBoundEvent_ToggleValue_4) == 0x0000D0, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::K2Node_ComponentBoundEvent_ToggleValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_GetGameInstanceSubsystem_ReturnValue_6) == 0x0000D8, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_GetGameInstanceSubsystem_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, K2Node_ComponentBoundEvent_ToggleValue_3) == 0x0000E0, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::K2Node_ComponentBoundEvent_ToggleValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_SetDisplayEnemyGauges_ReturnValue) == 0x0000E1, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_SetDisplayEnemyGauges_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_GetGameInstanceSubsystem_ReturnValue_7) == 0x0000E8, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_GetGameInstanceSubsystem_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, K2Node_ComponentBoundEvent_Value_1) == 0x0000F0, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::K2Node_ComponentBoundEvent_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_SetDisplayPlayerUI_ReturnValue) == 0x0000F8, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_SetDisplayPlayerUI_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000100, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_GetGameInstanceSubsystem_ReturnValue_8) == 0x000108, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_GetGameInstanceSubsystem_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_SetCameraShake_ReturnValue) == 0x000110, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_SetCameraShake_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_SetCameraOscillation_ReturnValue) == 0x000114, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_SetCameraOscillation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, K2Node_ComponentBoundEvent_ToggleValue_2) == 0x000115, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::K2Node_ComponentBoundEvent_ToggleValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_GetGameInstanceSubsystem_ReturnValue_9) == 0x000118, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_GetGameInstanceSubsystem_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_SetDisplayTutorials_ReturnValue) == 0x000120, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_SetDisplayTutorials_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_SetDisplayHPAboveGauge_ReturnValue) == 0x000121, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_SetDisplayHPAboveGauge_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, Temp_text_Variable) == 0x000128, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, K2Node_ComponentBoundEvent_ToggleValue_1) == 0x000138, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::K2Node_ComponentBoundEvent_ToggleValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_SetDisplayAchievementNotifications_ReturnValue) == 0x000139, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_SetDisplayAchievementNotifications_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_GetGameInstanceSubsystem_ReturnValue_10) == 0x000140, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_GetGameInstanceSubsystem_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, K2Node_ComponentBoundEvent_ToggleValue) == 0x000148, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::K2Node_ComponentBoundEvent_ToggleValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_SetDisplayHealValues_ReturnValue) == 0x000149, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_SetDisplayHealValues_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_SetAutoSkipAlreadySeenEvents_ReturnValue) == 0x00014A, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_SetAutoSkipAlreadySeenEvents_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_GetGameInstanceSubsystem_ReturnValue_11) == 0x000150, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_GetGameInstanceSubsystem_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_SetDisplayDamageValues_ReturnValue) == 0x000158, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_SetDisplayDamageValues_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, K2Node_Event_InFocusEvent) == 0x00015C, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, K2Node_ComponentBoundEvent_Value) == 0x000168, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_GetGameInstanceSubsystem_ReturnValue_12) == 0x000170, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_GetGameInstanceSubsystem_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000178, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_SetHoldDownToDodgeStill_ReturnValue) == 0x000180, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_SetHoldDownToDodgeStill_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_SetLowHPFeedbackOpacity_ReturnValue) == 0x000184, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_SetLowHPFeedbackOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_SetCameraShake_NewCameraShake_ImplicitCast) == 0x000188, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_SetCameraShake_NewCameraShake_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game, CallFunc_SetLowHPFeedbackOpacity_NewLowHPFeedbackOpacity_ImplicitCast) == 0x00018C, "Member 'WBP_Settings_Page_Game_C_ExecuteUbergraph_WBP_Settings_Page_Game::CallFunc_SetLowHPFeedbackOpacity_NewLowHPFeedbackOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_Settings_Page_Game.WBP_Settings_Page_Game_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_Settings_Page_Game_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Settings_Page_Game_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on WBP_Settings_Page_Game_C_OnAddedToFocusPath");
static_assert(sizeof(WBP_Settings_Page_Game_C_OnAddedToFocusPath) == 0x000008, "Wrong size on WBP_Settings_Page_Game_C_OnAddedToFocusPath");
static_assert(offsetof(WBP_Settings_Page_Game_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_Settings_Page_Game_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_Settings_Page_Game.WBP_Settings_Page_Game_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Settings_Page_Game_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Settings_Page_Game_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Settings_Page_Game_C_OnFocusReceived");
static_assert(sizeof(WBP_Settings_Page_Game_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_Settings_Page_Game_C_OnFocusReceived");
static_assert(offsetof(WBP_Settings_Page_Game_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Settings_Page_Game_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Settings_Page_Game_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Settings_Page_Game_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Page_Game_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Settings_Page_Game_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Settings_Page_Game.WBP_Settings_Page_Game_C.ResetToDefault
// 0x0008 (0x0008 - 0x0000)
struct WBP_Settings_Page_Game_C_ResetToDefault final
{
public:
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Page_Game_C_ResetToDefault) == 0x000008, "Wrong alignment on WBP_Settings_Page_Game_C_ResetToDefault");
static_assert(sizeof(WBP_Settings_Page_Game_C_ResetToDefault) == 0x000008, "Wrong size on WBP_Settings_Page_Game_C_ResetToDefault");
static_assert(offsetof(WBP_Settings_Page_Game_C_ResetToDefault, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'WBP_Settings_Page_Game_C_ResetToDefault::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function WBP_Settings_Page_Game.WBP_Settings_Page_Game_C.SetupPage
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_Settings_Page_Game_C_SetupPage final
{
public:
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDisplayHPAboveGauge_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDisplayHealValues_ReturnValue;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDisplayDamageValues_ReturnValue;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetHoldDownToDodgeStill_ReturnValue;      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCameraShake_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCameraOscillation_ReturnValue;         // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_6;   // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDisplayPlayerUI_ReturnValue;           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
