#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MapTransition_Area

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_MapTransition_Area.WBP_MapTransition_Area_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_MapTransition_Area_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapTransition_Area_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_MapTransition_Area_C_PreConstruct");
static_assert(sizeof(WBP_MapTransition_Area_C_PreConstruct) == 0x000001, "Wrong size on WBP_MapTransition_Area_C_PreConstruct");
static_assert(offsetof(WBP_MapTransition_Area_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_MapTransition_Area_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_MapTransition_Area.WBP_MapTransition_Area_C.OnSetScale
// 0x0004 (0x0004 - 0x0000)
struct WBP_MapTransition_Area_C_OnSetScale final
{
public:
	float                                         NewScale;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapTransition_Area_C_OnSetScale) == 0x000004, "Wrong alignment on WBP_MapTransition_Area_C_OnSetScale");
static_assert(sizeof(WBP_MapTransition_Area_C_OnSetScale) == 0x000004, "Wrong size on WBP_MapTransition_Area_C_OnSetScale");
static_assert(offsetof(WBP_MapTransition_Area_C_OnSetScale, NewScale) == 0x000000, "Member 'WBP_MapTransition_Area_C_OnSetScale::NewScale' has a wrong offset!");

// Function WBP_MapTransition_Area.WBP_MapTransition_Area_C.OnSetIconsVisibility
// 0x0001 (0x0001 - 0x0000)
struct WBP_MapTransition_Area_C_OnSetIconsVisibility final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapTransition_Area_C_OnSetIconsVisibility) == 0x000001, "Wrong alignment on WBP_MapTransition_Area_C_OnSetIconsVisibility");
static_assert(sizeof(WBP_MapTransition_Area_C_OnSetIconsVisibility) == 0x000001, "Wrong size on WBP_MapTransition_Area_C_OnSetIconsVisibility");
static_assert(offsetof(WBP_MapTransition_Area_C_OnSetIconsVisibility, bVisible) == 0x000000, "Member 'WBP_MapTransition_Area_C_OnSetIconsVisibility::bVisible' has a wrong offset!");

// Function WBP_MapTransition_Area.WBP_MapTransition_Area_C.ExecuteUbergraph_WBP_MapTransition_Area
// 0x0080 (0x0080 - 0x0000)
struct WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bVisible;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewScale;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_X_ImplicitCast;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_Y_ImplicitCast;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast_1;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area) == 0x000008, "Wrong alignment on WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area");
static_assert(sizeof(WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area) == 0x000080, "Wrong size on WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area");
static_assert(offsetof(WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area, EntryPoint) == 0x000000, "Member 'WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area, Temp_byte_Variable) == 0x000004, "Member 'WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area, K2Node_Event_IsDesignTime) == 0x000006, "Member 'WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area, K2Node_Event_bVisible) == 0x000007, "Member 'WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area::K2Node_Event_bVisible' has a wrong offset!");
static_assert(offsetof(WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area, K2Node_Event_NewScale) == 0x000008, "Member 'WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area::K2Node_Event_NewScale' has a wrong offset!");
static_assert(offsetof(WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area, CallFunc_MakeVector2D_ReturnValue) == 0x000010, "Member 'WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area, CallFunc_MakeVector2D_ReturnValue_1) == 0x000028, "Member 'WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area, CallFunc_BooleanAND_ReturnValue) == 0x000038, "Member 'WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area, Temp_bool_Variable) == 0x000039, "Member 'WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area, CallFunc_BooleanAND_ReturnValue_1) == 0x00003A, "Member 'WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area, K2Node_Select_Default) == 0x00003B, "Member 'WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area, Temp_byte_Variable_2) == 0x000048, "Member 'WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area, Temp_byte_Variable_3) == 0x000049, "Member 'WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area, Temp_bool_Variable_1) == 0x00004A, "Member 'WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area, K2Node_Select_Default_1) == 0x00004B, "Member 'WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000050, "Member 'WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area, CallFunc_MakeVector2D_X_ImplicitCast) == 0x000058, "Member 'WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area::CallFunc_MakeVector2D_X_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area, CallFunc_MakeVector2D_Y_ImplicitCast) == 0x000060, "Member 'WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area::CallFunc_MakeVector2D_Y_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area, CallFunc_Divide_DoubleDouble_B_ImplicitCast_1) == 0x000068, "Member 'WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area::CallFunc_Divide_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000070, "Member 'WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x000078, "Member 'WBP_MapTransition_Area_C_ExecuteUbergraph_WBP_MapTransition_Area::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");

}

