#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RestPointList

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function WBP_RestPointList.WBP_RestPointList_C.ExecuteUbergraph_WBP_RestPointList
// 0x0078 (0x0078 - 0x0000)
struct WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInstant_1;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInstant;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRestPointListData>             K2Node_Event_ListData;                             // 0x0018(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         K2Node_Event_MapAreaIndex;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidgetMapIcon_RestPoint*           K2Node_Event_NearestRestPointIcon;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidgetRestPointListMapArea*        CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_RestPointList_MapArea_C*           K2Node_DynamicCast_AsWBP_Rest_Point_List_Map_Area; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GoToMapArea_WidgetFocused;                // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanBeOpened_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList) == 0x000008, "Wrong alignment on WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList");
static_assert(sizeof(WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList) == 0x000078, "Wrong size on WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList");
static_assert(offsetof(WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList, EntryPoint) == 0x000000, "Member 'WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList, K2Node_Event_bInstant_1) == 0x000004, "Member 'WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList::K2Node_Event_bInstant_1' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList, K2Node_Event_bInstant) == 0x000005, "Member 'WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList::K2Node_Event_bInstant' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList, CallFunc_Not_PreBool_ReturnValue) == 0x000006, "Member 'WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList, CallFunc_Not_PreBool_ReturnValue_1) == 0x000007, "Member 'WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000010, "Member 'WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList, K2Node_Event_ListData) == 0x000018, "Member 'WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList::K2Node_Event_ListData' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList, K2Node_Event_MapAreaIndex) == 0x000028, "Member 'WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList::K2Node_Event_MapAreaIndex' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList, K2Node_Event_NearestRestPointIcon) == 0x000030, "Member 'WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList::K2Node_Event_NearestRestPointIcon' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000038, "Member 'WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList, CallFunc_BooleanAND_ReturnValue) == 0x000041, "Member 'WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList, K2Node_DynamicCast_AsWBP_Rest_Point_List_Map_Area) == 0x000050, "Member 'WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList::K2Node_DynamicCast_AsWBP_Rest_Point_List_Map_Area' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList, CallFunc_GoToMapArea_WidgetFocused) == 0x000060, "Member 'WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList::CallFunc_GoToMapArea_WidgetFocused' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList, CallFunc_CanBeOpened_ReturnValue) == 0x000068, "Member 'WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList::CallFunc_CanBeOpened_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList, Temp_bool_Variable) == 0x000069, "Member 'WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList, K2Node_Select_Default) == 0x000070, "Member 'WBP_RestPointList_C_ExecuteUbergraph_WBP_RestPointList::K2Node_Select_Default' has a wrong offset!");

// Function WBP_RestPointList.WBP_RestPointList_C.GoToMapAreaFromIndex
// 0x0010 (0x0010 - 0x0000)
struct WBP_RestPointList_C_GoToMapAreaFromIndex final
{
public:
	int32                                         MapAreaIndex;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidgetMapIcon_RestPoint*           NearestRestPointIcon;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RestPointList_C_GoToMapAreaFromIndex) == 0x000008, "Wrong alignment on WBP_RestPointList_C_GoToMapAreaFromIndex");
static_assert(sizeof(WBP_RestPointList_C_GoToMapAreaFromIndex) == 0x000010, "Wrong size on WBP_RestPointList_C_GoToMapAreaFromIndex");
static_assert(offsetof(WBP_RestPointList_C_GoToMapAreaFromIndex, MapAreaIndex) == 0x000000, "Member 'WBP_RestPointList_C_GoToMapAreaFromIndex::MapAreaIndex' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_C_GoToMapAreaFromIndex, NearestRestPointIcon) == 0x000008, "Member 'WBP_RestPointList_C_GoToMapAreaFromIndex::NearestRestPointIcon' has a wrong offset!");

// Function WBP_RestPointList.WBP_RestPointList_C.InstantiateRestPointList
// 0x0010 (0x0010 - 0x0000)
struct WBP_RestPointList_C_InstantiateRestPointList final
{
public:
	TArray<struct FRestPointListData>             ListData;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_RestPointList_C_InstantiateRestPointList) == 0x000008, "Wrong alignment on WBP_RestPointList_C_InstantiateRestPointList");
static_assert(sizeof(WBP_RestPointList_C_InstantiateRestPointList) == 0x000010, "Wrong size on WBP_RestPointList_C_InstantiateRestPointList");
static_assert(offsetof(WBP_RestPointList_C_InstantiateRestPointList, ListData) == 0x000000, "Member 'WBP_RestPointList_C_InstantiateRestPointList::ListData' has a wrong offset!");

// Function WBP_RestPointList.WBP_RestPointList_C.OnClosed
// 0x0001 (0x0001 - 0x0000)
struct WBP_RestPointList_C_OnClosed final
{
public:
	bool                                          bInstant;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RestPointList_C_OnClosed) == 0x000001, "Wrong alignment on WBP_RestPointList_C_OnClosed");
static_assert(sizeof(WBP_RestPointList_C_OnClosed) == 0x000001, "Wrong size on WBP_RestPointList_C_OnClosed");
static_assert(offsetof(WBP_RestPointList_C_OnClosed, bInstant) == 0x000000, "Member 'WBP_RestPointList_C_OnClosed::bInstant' has a wrong offset!");

// Function WBP_RestPointList.WBP_RestPointList_C.OnOpened
// 0x0001 (0x0001 - 0x0000)
struct WBP_RestPointList_C_OnOpened final
{
public:
	bool                                          bInstant;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RestPointList_C_OnOpened) == 0x000001, "Wrong alignment on WBP_RestPointList_C_OnOpened");
static_assert(sizeof(WBP_RestPointList_C_OnOpened) == 0x000001, "Wrong size on WBP_RestPointList_C_OnOpened");
static_assert(offsetof(WBP_RestPointList_C_OnOpened, bInstant) == 0x000000, "Member 'WBP_RestPointList_C_OnOpened::bInstant' has a wrong offset!");

// Function WBP_RestPointList.WBP_RestPointList_C.OnPressNextAlt
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_RestPointList_C_OnPressNextAlt final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_CanChangeMapArea_ReturnValue;             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0100(0x00B8)()
};
static_assert(alignof(WBP_RestPointList_C_OnPressNextAlt) == 0x000008, "Wrong alignment on WBP_RestPointList_C_OnPressNextAlt");
static_assert(sizeof(WBP_RestPointList_C_OnPressNextAlt) == 0x0001B8, "Wrong size on WBP_RestPointList_C_OnPressNextAlt");
static_assert(offsetof(WBP_RestPointList_C_OnPressNextAlt, KeyEvent) == 0x000000, "Member 'WBP_RestPointList_C_OnPressNextAlt::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_C_OnPressNextAlt, ReturnValue) == 0x000040, "Member 'WBP_RestPointList_C_OnPressNextAlt::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_C_OnPressNextAlt, CallFunc_CanChangeMapArea_ReturnValue) == 0x0000F8, "Member 'WBP_RestPointList_C_OnPressNextAlt::CallFunc_CanChangeMapArea_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_C_OnPressNextAlt, CallFunc_Handled_ReturnValue) == 0x000100, "Member 'WBP_RestPointList_C_OnPressNextAlt::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_RestPointList.WBP_RestPointList_C.OnPressPreviousAlt
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_RestPointList_C_OnPressPreviousAlt final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_CanChangeMapArea_ReturnValue;             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0100(0x00B8)()
};
static_assert(alignof(WBP_RestPointList_C_OnPressPreviousAlt) == 0x000008, "Wrong alignment on WBP_RestPointList_C_OnPressPreviousAlt");
static_assert(sizeof(WBP_RestPointList_C_OnPressPreviousAlt) == 0x0001B8, "Wrong size on WBP_RestPointList_C_OnPressPreviousAlt");
static_assert(offsetof(WBP_RestPointList_C_OnPressPreviousAlt, KeyEvent) == 0x000000, "Member 'WBP_RestPointList_C_OnPressPreviousAlt::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_C_OnPressPreviousAlt, ReturnValue) == 0x000040, "Member 'WBP_RestPointList_C_OnPressPreviousAlt::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_C_OnPressPreviousAlt, CallFunc_CanChangeMapArea_ReturnValue) == 0x0000F8, "Member 'WBP_RestPointList_C_OnPressPreviousAlt::CallFunc_CanChangeMapArea_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RestPointList_C_OnPressPreviousAlt, CallFunc_Handled_ReturnValue) == 0x000100, "Member 'WBP_RestPointList_C_OnPressPreviousAlt::CallFunc_Handled_ReturnValue' has a wrong offset!");

}

