#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugWidget

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DebugWidget.WBP_DebugWidget_C
// 0x01A8 (0x0488 - 0x02E0)
class UWBP_DebugWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHelpTextEntry_C*                       CameraHelp;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         DebugHelp;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDM_Camera_C*                           DM_Camera;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDM_DebugMenu_C*                        DM_DebugMenu;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDM_Fly_C*                              DM_Fly;                                            // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDM_Freeze_C*                           DM_Freeze;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDM_GuardBack_C*                        DM_GuardBack;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDM_GuardFront_C*                       DM_GuardFront;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDM_Hide_C*                             DM_Hide;                                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDM_InEvent_C*                          DM_InEvent;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDM_Invincible_C*                       DM_Invincible;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDM_Jump_C*                             DM_Jump;                                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDM_NoGravity_C*                        DM_NoGravity;                                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDM_OneHitKO_C*                         DM_OneHitKO;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDM_Physics_C*                          DM_Physics;                                        // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDM_Restore_C*                          DM_Restore;                                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDM_SelfGuardBack_C*                    DM_SelfGuardBack;                                  // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDM_SelfGuardFront_C*                   DM_SelfGuardFront;                                 // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDM_ShowHitbox_C*                       DM_ShowHitbox;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDM_ShowTrigger_C*                      DM_ShowTrigger;                                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDM_Skill_C*                            DM_Skill;                                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDM_Time_C*                             DM_Time;                                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDM_Twist_C*                            DM_Twist;                                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDM_Walk_C*                             DM_Walk;                                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        HelpPanel;                                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHelpTextEntry_C*                       PhysicsHelp;                                       // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHelpTextEntry_C*                       TimeHelp;                                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_CharacterZion_C*                    Player;                                            // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<struct FKey, class UDM_Base_C*>          PureModules;                                       // 0x03C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<struct FKey, class UDM_Base_C*>          ShiftModules;                                      // 0x0418(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UDM_Base_C*>                     ServiceModules;                                    // 0x0468(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UDM_Base_C*>                     AllModules;                                        // 0x0478(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void Construct();
	void ExecuteUbergraph_WBP_DebugWidget(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void TryToggleModules(const TMap<struct FKey, class UDM_Base_C*>& Modules);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DebugWidget_C">();
	}
	static class UWBP_DebugWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DebugWidget_C>();
	}
};
static_assert(alignof(UWBP_DebugWidget_C) == 0x000008, "Wrong alignment on UWBP_DebugWidget_C");
static_assert(sizeof(UWBP_DebugWidget_C) == 0x000488, "Wrong size on UWBP_DebugWidget_C");
static_assert(offsetof(UWBP_DebugWidget_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_DebugWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, CameraHelp) == 0x0002E8, "Member 'UWBP_DebugWidget_C::CameraHelp' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, DebugHelp) == 0x0002F0, "Member 'UWBP_DebugWidget_C::DebugHelp' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, DM_Camera) == 0x0002F8, "Member 'UWBP_DebugWidget_C::DM_Camera' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, DM_DebugMenu) == 0x000300, "Member 'UWBP_DebugWidget_C::DM_DebugMenu' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, DM_Fly) == 0x000308, "Member 'UWBP_DebugWidget_C::DM_Fly' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, DM_Freeze) == 0x000310, "Member 'UWBP_DebugWidget_C::DM_Freeze' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, DM_GuardBack) == 0x000318, "Member 'UWBP_DebugWidget_C::DM_GuardBack' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, DM_GuardFront) == 0x000320, "Member 'UWBP_DebugWidget_C::DM_GuardFront' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, DM_Hide) == 0x000328, "Member 'UWBP_DebugWidget_C::DM_Hide' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, DM_InEvent) == 0x000330, "Member 'UWBP_DebugWidget_C::DM_InEvent' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, DM_Invincible) == 0x000338, "Member 'UWBP_DebugWidget_C::DM_Invincible' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, DM_Jump) == 0x000340, "Member 'UWBP_DebugWidget_C::DM_Jump' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, DM_NoGravity) == 0x000348, "Member 'UWBP_DebugWidget_C::DM_NoGravity' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, DM_OneHitKO) == 0x000350, "Member 'UWBP_DebugWidget_C::DM_OneHitKO' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, DM_Physics) == 0x000358, "Member 'UWBP_DebugWidget_C::DM_Physics' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, DM_Restore) == 0x000360, "Member 'UWBP_DebugWidget_C::DM_Restore' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, DM_SelfGuardBack) == 0x000368, "Member 'UWBP_DebugWidget_C::DM_SelfGuardBack' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, DM_SelfGuardFront) == 0x000370, "Member 'UWBP_DebugWidget_C::DM_SelfGuardFront' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, DM_ShowHitbox) == 0x000378, "Member 'UWBP_DebugWidget_C::DM_ShowHitbox' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, DM_ShowTrigger) == 0x000380, "Member 'UWBP_DebugWidget_C::DM_ShowTrigger' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, DM_Skill) == 0x000388, "Member 'UWBP_DebugWidget_C::DM_Skill' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, DM_Time) == 0x000390, "Member 'UWBP_DebugWidget_C::DM_Time' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, DM_Twist) == 0x000398, "Member 'UWBP_DebugWidget_C::DM_Twist' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, DM_Walk) == 0x0003A0, "Member 'UWBP_DebugWidget_C::DM_Walk' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, HelpPanel) == 0x0003A8, "Member 'UWBP_DebugWidget_C::HelpPanel' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, PhysicsHelp) == 0x0003B0, "Member 'UWBP_DebugWidget_C::PhysicsHelp' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, TimeHelp) == 0x0003B8, "Member 'UWBP_DebugWidget_C::TimeHelp' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, Player) == 0x0003C0, "Member 'UWBP_DebugWidget_C::Player' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, PureModules) == 0x0003C8, "Member 'UWBP_DebugWidget_C::PureModules' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, ShiftModules) == 0x000418, "Member 'UWBP_DebugWidget_C::ShiftModules' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, ServiceModules) == 0x000468, "Member 'UWBP_DebugWidget_C::ServiceModules' has a wrong offset!");
static_assert(offsetof(UWBP_DebugWidget_C, AllModules) == 0x000478, "Member 'UWBP_DebugWidget_C::AllModules' has a wrong offset!");

}

