#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SPGauge

#include "Basic.hpp"

#include "Zion_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_SPGauge.WBP_SPGauge_C.SetRatio
// 0x0050 (0x0050 - 0x0000)
struct WBP_SPGauge_C_SetRatio final
{
public:
	float                                         InPercent;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PrevValue;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IncrementSP;                                       // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPlaySounds_ReturnValue;                // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundSubsystem*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlaySoundEvent_ReturnValue;               // 0x0028(0x0008)(NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_CurrValue_ImplicitCast;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SPGauge_C_SetRatio) == 0x000008, "Wrong alignment on WBP_SPGauge_C_SetRatio");
static_assert(sizeof(WBP_SPGauge_C_SetRatio) == 0x000050, "Wrong size on WBP_SPGauge_C_SetRatio");
static_assert(offsetof(WBP_SPGauge_C_SetRatio, InPercent) == 0x000000, "Member 'WBP_SPGauge_C_SetRatio::InPercent' has a wrong offset!");
static_assert(offsetof(WBP_SPGauge_C_SetRatio, PrevValue) == 0x000008, "Member 'WBP_SPGauge_C_SetRatio::PrevValue' has a wrong offset!");
static_assert(offsetof(WBP_SPGauge_C_SetRatio, IncrementSP) == 0x000010, "Member 'WBP_SPGauge_C_SetRatio::IncrementSP' has a wrong offset!");
static_assert(offsetof(WBP_SPGauge_C_SetRatio, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000011, "Member 'WBP_SPGauge_C_SetRatio::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SPGauge_C_SetRatio, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000012, "Member 'WBP_SPGauge_C_SetRatio::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SPGauge_C_SetRatio, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000013, "Member 'WBP_SPGauge_C_SetRatio::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SPGauge_C_SetRatio, CallFunc_BooleanAND_ReturnValue) == 0x000014, "Member 'WBP_SPGauge_C_SetRatio::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SPGauge_C_SetRatio, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000015, "Member 'WBP_SPGauge_C_SetRatio::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SPGauge_C_SetRatio, CallFunc_CanPlaySounds_ReturnValue) == 0x000016, "Member 'WBP_SPGauge_C_SetRatio::CallFunc_CanPlaySounds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SPGauge_C_SetRatio, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'WBP_SPGauge_C_SetRatio::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SPGauge_C_SetRatio, CallFunc_IsVisible_ReturnValue) == 0x000020, "Member 'WBP_SPGauge_C_SetRatio::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SPGauge_C_SetRatio, CallFunc_PlaySoundEvent_ReturnValue) == 0x000028, "Member 'WBP_SPGauge_C_SetRatio::CallFunc_PlaySoundEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SPGauge_C_SetRatio, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'WBP_SPGauge_C_SetRatio::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SPGauge_C_SetRatio, CallFunc_PlayAnimation_ReturnValue_1) == 0x000038, "Member 'WBP_SPGauge_C_SetRatio::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SPGauge_C_SetRatio, K2Node_VariableSet_CurrValue_ImplicitCast) == 0x000040, "Member 'WBP_SPGauge_C_SetRatio::K2Node_VariableSet_CurrValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_SPGauge_C_SetRatio, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000048, "Member 'WBP_SPGauge_C_SetRatio::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_SPGauge_C_SetRatio, CallFunc_SetValue_InValue_ImplicitCast) == 0x00004C, "Member 'WBP_SPGauge_C_SetRatio::CallFunc_SetValue_InValue_ImplicitCast' has a wrong offset!");

// Function WBP_SPGauge.WBP_SPGauge_C.CanPlaySounds
// 0x0018 (0x0018 - 0x0000)
struct WBP_SPGauge_C_CanPlaySounds final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFadeSubsystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EFadeState                                    CallFunc_GetFadeState_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SPGauge_C_CanPlaySounds) == 0x000008, "Wrong alignment on WBP_SPGauge_C_CanPlaySounds");
static_assert(sizeof(WBP_SPGauge_C_CanPlaySounds) == 0x000018, "Wrong size on WBP_SPGauge_C_CanPlaySounds");
static_assert(offsetof(WBP_SPGauge_C_CanPlaySounds, ReturnValue) == 0x000000, "Member 'WBP_SPGauge_C_CanPlaySounds::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SPGauge_C_CanPlaySounds, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_SPGauge_C_CanPlaySounds::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SPGauge_C_CanPlaySounds, CallFunc_GetFadeState_ReturnValue) == 0x000010, "Member 'WBP_SPGauge_C_CanPlaySounds::CallFunc_GetFadeState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SPGauge_C_CanPlaySounds, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000011, "Member 'WBP_SPGauge_C_CanPlaySounds::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

}

