#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RestPointList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RestPointList.WBP_RestPointList_C
// 0x0050 (0x0528 - 0x04D8)
class UWBP_RestPointList_C final : public UUserWidgetRestPointList
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideAnim;                                          // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               Overlay_NoRestPointData;                           // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             StoryGoal;                                         // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Scrollbox_C*                       WBP_Scrollbox;                                     // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnRestPointListClosed;                             // 0x0510(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          CachedFirstEntry;                                  // 0x0520(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CachedLastEntry;                                   // 0x0521(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_RestPointList(int32 EntryPoint);
	void GoToMapAreaFromIndex(int32 MapAreaIndex, class UUserWidgetMapIcon_RestPoint* NearestRestPointIcon);
	void InstantiateRestPointList(const TArray<struct FRestPointListData>& ListData);
	void OnClosed(bool bInstant);
	void OnOpened(bool bInstant);
	struct FEventReply OnPressNextAlt(const struct FKeyEvent& KeyEvent);
	struct FEventReply OnPressPreviousAlt(const struct FKeyEvent& KeyEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RestPointList_C">();
	}
	static class UWBP_RestPointList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RestPointList_C>();
	}
};
static_assert(alignof(UWBP_RestPointList_C) == 0x000008, "Wrong alignment on UWBP_RestPointList_C");
static_assert(sizeof(UWBP_RestPointList_C) == 0x000528, "Wrong size on UWBP_RestPointList_C");
static_assert(offsetof(UWBP_RestPointList_C, UberGraphFrame) == 0x0004D8, "Member 'UWBP_RestPointList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RestPointList_C, HideAnim) == 0x0004E0, "Member 'UWBP_RestPointList_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UWBP_RestPointList_C, ShowAnim) == 0x0004E8, "Member 'UWBP_RestPointList_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UWBP_RestPointList_C, Overlay_NoRestPointData) == 0x0004F0, "Member 'UWBP_RestPointList_C::Overlay_NoRestPointData' has a wrong offset!");
static_assert(offsetof(UWBP_RestPointList_C, StoryGoal) == 0x0004F8, "Member 'UWBP_RestPointList_C::StoryGoal' has a wrong offset!");
static_assert(offsetof(UWBP_RestPointList_C, WBP_Scrollbox) == 0x000500, "Member 'UWBP_RestPointList_C::WBP_Scrollbox' has a wrong offset!");
static_assert(offsetof(UWBP_RestPointList_C, WidgetSwitcher) == 0x000508, "Member 'UWBP_RestPointList_C::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_RestPointList_C, OnRestPointListClosed) == 0x000510, "Member 'UWBP_RestPointList_C::OnRestPointListClosed' has a wrong offset!");
static_assert(offsetof(UWBP_RestPointList_C, CachedFirstEntry) == 0x000520, "Member 'UWBP_RestPointList_C::CachedFirstEntry' has a wrong offset!");
static_assert(offsetof(UWBP_RestPointList_C, CachedLastEntry) == 0x000521, "Member 'UWBP_RestPointList_C::CachedLastEntry' has a wrong offset!");

}

