#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_Entry_FPS

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Settings_Entry_FPS.WBP_Settings_Entry_FPS_C.BndEvt__WBP_Settings_Entry_FPS_WBP_Settings_Entry_Choice_FPSLimit_K2Node_ComponentBoundEvent_1_OnToggle__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_Entry_FPS_C_BndEvt__WBP_Settings_Entry_FPS_WBP_Settings_Entry_Choice_FPSLimit_K2Node_ComponentBoundEvent_1_OnToggle__DelegateSignature final
{
public:
	bool                                          ToggleValue;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_FPS_C_BndEvt__WBP_Settings_Entry_FPS_WBP_Settings_Entry_Choice_FPSLimit_K2Node_ComponentBoundEvent_1_OnToggle__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Settings_Entry_FPS_C_BndEvt__WBP_Settings_Entry_FPS_WBP_Settings_Entry_Choice_FPSLimit_K2Node_ComponentBoundEvent_1_OnToggle__DelegateSignature");
static_assert(sizeof(WBP_Settings_Entry_FPS_C_BndEvt__WBP_Settings_Entry_FPS_WBP_Settings_Entry_Choice_FPSLimit_K2Node_ComponentBoundEvent_1_OnToggle__DelegateSignature) == 0x000001, "Wrong size on WBP_Settings_Entry_FPS_C_BndEvt__WBP_Settings_Entry_FPS_WBP_Settings_Entry_Choice_FPSLimit_K2Node_ComponentBoundEvent_1_OnToggle__DelegateSignature");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_BndEvt__WBP_Settings_Entry_FPS_WBP_Settings_Entry_Choice_FPSLimit_K2Node_ComponentBoundEvent_1_OnToggle__DelegateSignature, ToggleValue) == 0x000000, "Member 'WBP_Settings_Entry_FPS_C_BndEvt__WBP_Settings_Entry_FPS_WBP_Settings_Entry_Choice_FPSLimit_K2Node_ComponentBoundEvent_1_OnToggle__DelegateSignature::ToggleValue' has a wrong offset!");

// Function WBP_Settings_Entry_FPS.WBP_Settings_Entry_FPS_C.BndEvt__WBP_Settings_Entry_FPS_WBP_Settings_Entry_Slider_FPS_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Settings_Entry_FPS_C_BndEvt__WBP_Settings_Entry_FPS_WBP_Settings_Entry_Slider_FPS_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_FPS_C_BndEvt__WBP_Settings_Entry_FPS_WBP_Settings_Entry_Slider_FPS_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_Entry_FPS_C_BndEvt__WBP_Settings_Entry_FPS_WBP_Settings_Entry_Slider_FPS_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_Entry_FPS_C_BndEvt__WBP_Settings_Entry_FPS_WBP_Settings_Entry_Slider_FPS_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong size on WBP_Settings_Entry_FPS_C_BndEvt__WBP_Settings_Entry_FPS_WBP_Settings_Entry_Slider_FPS_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_BndEvt__WBP_Settings_Entry_FPS_WBP_Settings_Entry_Slider_FPS_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_Entry_FPS_C_BndEvt__WBP_Settings_Entry_FPS_WBP_Settings_Entry_Slider_FPS_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function WBP_Settings_Entry_FPS.WBP_Settings_Entry_FPS_C.ExecuteUbergraph_WBP_Settings_Entry_FPS
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_Entry_FPS_C_ExecuteUbergraph_WBP_Settings_Entry_FPS final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_ToggleValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_Value;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsEnabled;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_FPS_C_ExecuteUbergraph_WBP_Settings_Entry_FPS) == 0x000008, "Wrong alignment on WBP_Settings_Entry_FPS_C_ExecuteUbergraph_WBP_Settings_Entry_FPS");
static_assert(sizeof(WBP_Settings_Entry_FPS_C_ExecuteUbergraph_WBP_Settings_Entry_FPS) == 0x000020, "Wrong size on WBP_Settings_Entry_FPS_C_ExecuteUbergraph_WBP_Settings_Entry_FPS");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_ExecuteUbergraph_WBP_Settings_Entry_FPS, EntryPoint) == 0x000000, "Member 'WBP_Settings_Entry_FPS_C_ExecuteUbergraph_WBP_Settings_Entry_FPS::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_ExecuteUbergraph_WBP_Settings_Entry_FPS, K2Node_ComponentBoundEvent_ToggleValue) == 0x000004, "Member 'WBP_Settings_Entry_FPS_C_ExecuteUbergraph_WBP_Settings_Entry_FPS::K2Node_ComponentBoundEvent_ToggleValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_ExecuteUbergraph_WBP_Settings_Entry_FPS, K2Node_ComponentBoundEvent_Value) == 0x000008, "Member 'WBP_Settings_Entry_FPS_C_ExecuteUbergraph_WBP_Settings_Entry_FPS::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_ExecuteUbergraph_WBP_Settings_Entry_FPS, K2Node_Event_bInIsEnabled) == 0x000010, "Member 'WBP_Settings_Entry_FPS_C_ExecuteUbergraph_WBP_Settings_Entry_FPS::K2Node_Event_bInIsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_ExecuteUbergraph_WBP_Settings_Entry_FPS, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000011, "Member 'WBP_Settings_Entry_FPS_C_ExecuteUbergraph_WBP_Settings_Entry_FPS::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_ExecuteUbergraph_WBP_Settings_Entry_FPS, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'WBP_Settings_Entry_FPS_C_ExecuteUbergraph_WBP_Settings_Entry_FPS::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");

// Function WBP_Settings_Entry_FPS.WBP_Settings_Entry_FPS_C.IsSliderEnabled
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_Entry_FPS_C_IsSliderEnabled final
{
public:
	bool                                          IsSliderEnabled_0;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFrameRateLimit_ReturnValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVSyncEnabled_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_FPS_C_IsSliderEnabled) == 0x000008, "Wrong alignment on WBP_Settings_Entry_FPS_C_IsSliderEnabled");
static_assert(sizeof(WBP_Settings_Entry_FPS_C_IsSliderEnabled) == 0x000020, "Wrong size on WBP_Settings_Entry_FPS_C_IsSliderEnabled");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_IsSliderEnabled, IsSliderEnabled_0) == 0x000000, "Member 'WBP_Settings_Entry_FPS_C_IsSliderEnabled::IsSliderEnabled_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_IsSliderEnabled, CallFunc_GetGameUserSettings_ReturnValue) == 0x000008, "Member 'WBP_Settings_Entry_FPS_C_IsSliderEnabled::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_IsSliderEnabled, CallFunc_GetFrameRateLimit_ReturnValue) == 0x000010, "Member 'WBP_Settings_Entry_FPS_C_IsSliderEnabled::CallFunc_GetFrameRateLimit_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_IsSliderEnabled, CallFunc_IsVSyncEnabled_ReturnValue) == 0x000014, "Member 'WBP_Settings_Entry_FPS_C_IsSliderEnabled::CallFunc_IsVSyncEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_IsSliderEnabled, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000015, "Member 'WBP_Settings_Entry_FPS_C_IsSliderEnabled::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_IsSliderEnabled, CallFunc_Not_PreBool_ReturnValue) == 0x000016, "Member 'WBP_Settings_Entry_FPS_C_IsSliderEnabled::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_IsSliderEnabled, CallFunc_BooleanAND_ReturnValue) == 0x000017, "Member 'WBP_Settings_Entry_FPS_C_IsSliderEnabled::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_IsSliderEnabled, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000018, "Member 'WBP_Settings_Entry_FPS_C_IsSliderEnabled::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_Settings_Entry_FPS.WBP_Settings_Entry_FPS_C.OnSetIsEnabled
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_Entry_FPS_C_OnSetIsEnabled final
{
public:
	bool                                          bInIsEnabled;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_FPS_C_OnSetIsEnabled) == 0x000001, "Wrong alignment on WBP_Settings_Entry_FPS_C_OnSetIsEnabled");
static_assert(sizeof(WBP_Settings_Entry_FPS_C_OnSetIsEnabled) == 0x000001, "Wrong size on WBP_Settings_Entry_FPS_C_OnSetIsEnabled");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_OnSetIsEnabled, bInIsEnabled) == 0x000000, "Member 'WBP_Settings_Entry_FPS_C_OnSetIsEnabled::bInIsEnabled' has a wrong offset!");

// Function WBP_Settings_Entry_FPS.WBP_Settings_Entry_FPS_C.Refresh
// 0x0030 (0x0030 - 0x0000)
struct WBP_Settings_Entry_FPS_C_Refresh final
{
public:
	float                                         SavedFPS_old;                                      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVSyncEnabled_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVSyncEnabled_ReturnValue_1;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_FPS_C_Refresh) == 0x000008, "Wrong alignment on WBP_Settings_Entry_FPS_C_Refresh");
static_assert(sizeof(WBP_Settings_Entry_FPS_C_Refresh) == 0x000030, "Wrong size on WBP_Settings_Entry_FPS_C_Refresh");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_Refresh, SavedFPS_old) == 0x000000, "Member 'WBP_Settings_Entry_FPS_C_Refresh::SavedFPS_old' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_Refresh, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000004, "Member 'WBP_Settings_Entry_FPS_C_Refresh::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_Refresh, CallFunc_GetGameUserSettings_ReturnValue) == 0x000008, "Member 'WBP_Settings_Entry_FPS_C_Refresh::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_Refresh, CallFunc_SelectFloat_ReturnValue) == 0x000010, "Member 'WBP_Settings_Entry_FPS_C_Refresh::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_Refresh, CallFunc_IsVSyncEnabled_ReturnValue) == 0x000018, "Member 'WBP_Settings_Entry_FPS_C_Refresh::CallFunc_IsVSyncEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_Refresh, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'WBP_Settings_Entry_FPS_C_Refresh::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_Refresh, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x00001A, "Member 'WBP_Settings_Entry_FPS_C_Refresh::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_Refresh, CallFunc_GetGameUserSettings_ReturnValue_1) == 0x000020, "Member 'WBP_Settings_Entry_FPS_C_Refresh::CallFunc_GetGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_Refresh, CallFunc_IsVSyncEnabled_ReturnValue_1) == 0x000028, "Member 'WBP_Settings_Entry_FPS_C_Refresh::CallFunc_IsVSyncEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_Refresh, CallFunc_Not_PreBool_ReturnValue_1) == 0x000029, "Member 'WBP_Settings_Entry_FPS_C_Refresh::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_Refresh, CallFunc_BooleanAND_ReturnValue) == 0x00002A, "Member 'WBP_Settings_Entry_FPS_C_Refresh::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_Settings_Entry_FPS.WBP_Settings_Entry_FPS_C.Reset
// 0x0018 (0x0018 - 0x0000)
struct WBP_Settings_Entry_FPS_C_Reset final
{
public:
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFrameRateLimit_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_SavedFPS_ImplicitCast;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_FPS_C_Reset) == 0x000008, "Wrong alignment on WBP_Settings_Entry_FPS_C_Reset");
static_assert(sizeof(WBP_Settings_Entry_FPS_C_Reset) == 0x000018, "Wrong size on WBP_Settings_Entry_FPS_C_Reset");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_Reset, CallFunc_GetGameUserSettings_ReturnValue) == 0x000000, "Member 'WBP_Settings_Entry_FPS_C_Reset::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_Reset, CallFunc_GetFrameRateLimit_ReturnValue) == 0x000008, "Member 'WBP_Settings_Entry_FPS_C_Reset::CallFunc_GetFrameRateLimit_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_Reset, K2Node_VariableSet_SavedFPS_ImplicitCast) == 0x000010, "Member 'WBP_Settings_Entry_FPS_C_Reset::K2Node_VariableSet_SavedFPS_ImplicitCast' has a wrong offset!");

// Function WBP_Settings_Entry_FPS.WBP_Settings_Entry_FPS_C.SetFPS
// 0x0018 (0x0018 - 0x0000)
struct WBP_Settings_Entry_FPS_C_SetFPS final
{
public:
	double                                        FPS;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetFrameRateLimit_NewLimit_ImplicitCast;  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_FPS_C_SetFPS) == 0x000008, "Wrong alignment on WBP_Settings_Entry_FPS_C_SetFPS");
static_assert(sizeof(WBP_Settings_Entry_FPS_C_SetFPS) == 0x000018, "Wrong size on WBP_Settings_Entry_FPS_C_SetFPS");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_SetFPS, FPS) == 0x000000, "Member 'WBP_Settings_Entry_FPS_C_SetFPS::FPS' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_SetFPS, CallFunc_GetGameUserSettings_ReturnValue) == 0x000008, "Member 'WBP_Settings_Entry_FPS_C_SetFPS::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_SetFPS, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_Settings_Entry_FPS_C_SetFPS::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_SetFPS, CallFunc_SetFrameRateLimit_NewLimit_ImplicitCast) == 0x000014, "Member 'WBP_Settings_Entry_FPS_C_SetFPS::CallFunc_SetFrameRateLimit_NewLimit_ImplicitCast' has a wrong offset!");

// Function WBP_Settings_Entry_FPS.WBP_Settings_Entry_FPS_C.SetSliderEnabled
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_Entry_FPS_C_SetSliderEnabled final
{
public:
	bool                                          CallFunc_IsSliderEnabled_IsSliderEnabled;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_FPS_C_SetSliderEnabled) == 0x000001, "Wrong alignment on WBP_Settings_Entry_FPS_C_SetSliderEnabled");
static_assert(sizeof(WBP_Settings_Entry_FPS_C_SetSliderEnabled) == 0x000001, "Wrong size on WBP_Settings_Entry_FPS_C_SetSliderEnabled");
static_assert(offsetof(WBP_Settings_Entry_FPS_C_SetSliderEnabled, CallFunc_IsSliderEnabled_IsSliderEnabled) == 0x000000, "Member 'WBP_Settings_Entry_FPS_C_SetSliderEnabled::CallFunc_IsSliderEnabled_IsSliderEnabled' has a wrong offset!");

}

