#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GameMenu_Tab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GameMenu_Tab.WBP_GameMenu_Tab_C
// 0x0078 (0x04D8 - 0x0460)
class UWBP_GameMenu_Tab_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hovered;                                           // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       cursor_out;                                        // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       cursor_in;                                         // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             ButtonText;                                        // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_New;                                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_116;                                         // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NiagaraSystemWidget_165;                           // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Overlay_HoveredContainer;                          // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Icon;                               // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const struct FKeyEvent& KeyEvent, class UWBP_GameMenu_Tab_C* PressedButtonTab)> OnPressed; // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   Text;                                              // 0x04C0(0x0010)(Edit, BlueprintVisible)
	bool                                          bSelected;                                         // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_GameMenu_Tab(int32 EntryPoint);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	struct FEventReply OnPressConfirm(const struct FKeyEvent& KeyEvent);
	void OnSetIsEnabled(bool bInIsEnabled);
	void PreConstruct(bool IsDesignTime);
	void SetHoveredState(bool bHovered);
	void SetLocked(bool bLocked);
	void SetSelected(bool Selected);
	void SetText(const class FText& Text_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GameMenu_Tab_C">();
	}
	static class UWBP_GameMenu_Tab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GameMenu_Tab_C>();
	}
};
static_assert(alignof(UWBP_GameMenu_Tab_C) == 0x000008, "Wrong alignment on UWBP_GameMenu_Tab_C");
static_assert(sizeof(UWBP_GameMenu_Tab_C) == 0x0004D8, "Wrong size on UWBP_GameMenu_Tab_C");
static_assert(offsetof(UWBP_GameMenu_Tab_C, UberGraphFrame) == 0x000460, "Member 'UWBP_GameMenu_Tab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Tab_C, Hovered) == 0x000468, "Member 'UWBP_GameMenu_Tab_C::Hovered' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Tab_C, cursor_out) == 0x000470, "Member 'UWBP_GameMenu_Tab_C::cursor_out' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Tab_C, cursor_in) == 0x000478, "Member 'UWBP_GameMenu_Tab_C::cursor_in' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Tab_C, ButtonText) == 0x000480, "Member 'UWBP_GameMenu_Tab_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Tab_C, Icon_New) == 0x000488, "Member 'UWBP_GameMenu_Tab_C::Icon_New' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Tab_C, Image_116) == 0x000490, "Member 'UWBP_GameMenu_Tab_C::Image_116' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Tab_C, NiagaraSystemWidget_165) == 0x000498, "Member 'UWBP_GameMenu_Tab_C::NiagaraSystemWidget_165' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Tab_C, Overlay_HoveredContainer) == 0x0004A0, "Member 'UWBP_GameMenu_Tab_C::Overlay_HoveredContainer' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Tab_C, WidgetSwitcher_Icon) == 0x0004A8, "Member 'UWBP_GameMenu_Tab_C::WidgetSwitcher_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Tab_C, OnPressed) == 0x0004B0, "Member 'UWBP_GameMenu_Tab_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Tab_C, Text) == 0x0004C0, "Member 'UWBP_GameMenu_Tab_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_GameMenu_Tab_C, bSelected) == 0x0004D0, "Member 'UWBP_GameMenu_Tab_C::bSelected' has a wrong offset!");

}

