#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Recollection_BossRush_Result

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Recollection_BossRush_Result.WBP_Recollection_BossRush_Result_C.BndEvt__WBP_Recollection_BossRush_Result_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_Recollection_BossRush_Result_C_BndEvt__WBP_Recollection_BossRush_Result_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Recollection_BossRush_Result_C_BndEvt__WBP_Recollection_BossRush_Result_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Recollection_BossRush_Result_C_BndEvt__WBP_Recollection_BossRush_Result_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Recollection_BossRush_Result_C_BndEvt__WBP_Recollection_BossRush_Result_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_Recollection_BossRush_Result_C_BndEvt__WBP_Recollection_BossRush_Result_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Recollection_BossRush_Result_C_BndEvt__WBP_Recollection_BossRush_Result_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_Recollection_BossRush_Result_C_BndEvt__WBP_Recollection_BossRush_Result_WBP_Button_Generic_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_Recollection_BossRush_Result.WBP_Recollection_BossRush_Result_C.BndEvt__WBP_Recollection_BossRush_Result_WBP_Button_Generic_Quit_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct WBP_Recollection_BossRush_Result_C_BndEvt__WBP_Recollection_BossRush_Result_WBP_Button_Generic_Quit_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Recollection_BossRush_Result_C_BndEvt__WBP_Recollection_BossRush_Result_WBP_Button_Generic_Quit_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Recollection_BossRush_Result_C_BndEvt__WBP_Recollection_BossRush_Result_WBP_Button_Generic_Quit_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Recollection_BossRush_Result_C_BndEvt__WBP_Recollection_BossRush_Result_WBP_Button_Generic_Quit_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature) == 0x000040, "Wrong size on WBP_Recollection_BossRush_Result_C_BndEvt__WBP_Recollection_BossRush_Result_WBP_Button_Generic_Quit_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Recollection_BossRush_Result_C_BndEvt__WBP_Recollection_BossRush_Result_WBP_Button_Generic_Quit_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_Recollection_BossRush_Result_C_BndEvt__WBP_Recollection_BossRush_Result_WBP_Button_Generic_Quit_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");

// Function WBP_Recollection_BossRush_Result.WBP_Recollection_BossRush_Result_C.ExecuteUbergraph_WBP_Recollection_BossRush_Result
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_1;             // 0x0038(0x0040)()
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue;             // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue_1;              // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83[0x5];                                       // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent;               // 0x0088(0x0040)()
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue_1;           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue_2;           // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue_2;              // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result) == 0x000008, "Wrong alignment on WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result");
static_assert(sizeof(WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result) == 0x0000E0, "Wrong size on WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result");
static_assert(offsetof(WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result, EntryPoint) == 0x000000, "Member 'WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result, K2Node_ComponentBoundEvent_KeyEvent_1) == 0x000038, "Member 'WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result::K2Node_ComponentBoundEvent_KeyEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result, CallFunc_PlayUMGAnimation_ReturnValue) == 0x000078, "Member 'WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result::CallFunc_PlayUMGAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result, CallFunc_SetGamePaused_ReturnValue) == 0x000080, "Member 'WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result, CallFunc_IsValid_ReturnValue) == 0x000081, "Member 'WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result, CallFunc_SetGamePaused_ReturnValue_1) == 0x000082, "Member 'WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result::CallFunc_SetGamePaused_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result, K2Node_ComponentBoundEvent_KeyEvent) == 0x000088, "Member 'WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result::K2Node_ComponentBoundEvent_KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result, CallFunc_PlayUMGAnimation_ReturnValue_1) == 0x0000C8, "Member 'WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result::CallFunc_PlayUMGAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result, CallFunc_PlayUMGAnimation_ReturnValue_2) == 0x0000D0, "Member 'WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result::CallFunc_PlayUMGAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result, CallFunc_IsValid_ReturnValue_1) == 0x0000D8, "Member 'WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result, CallFunc_IsValid_ReturnValue_2) == 0x0000D9, "Member 'WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result, CallFunc_SetGamePaused_ReturnValue_2) == 0x0000DA, "Member 'WBP_Recollection_BossRush_Result_C_ExecuteUbergraph_WBP_Recollection_BossRush_Result::CallFunc_SetGamePaused_ReturnValue_2' has a wrong offset!");

}

