#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MapIconDetails_Default

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function WBP_MapIconDetails_Default.WBP_MapIconDetails_Default_C.ExecuteUbergraph_WBP_MapIconDetails_Default
// 0x0060 (0x0060 - 0x0000)
struct WBP_MapIconDetails_Default_C_ExecuteUbergraph_WBP_MapIconDetails_Default final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetWidgetIconDisplayName_ReturnValue;     // 0x0028(0x0010)()
	bool                                          K2Node_Event_bInstant;                             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue_1;           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapIconDetails_Default_C_ExecuteUbergraph_WBP_MapIconDetails_Default) == 0x000008, "Wrong alignment on WBP_MapIconDetails_Default_C_ExecuteUbergraph_WBP_MapIconDetails_Default");
static_assert(sizeof(WBP_MapIconDetails_Default_C_ExecuteUbergraph_WBP_MapIconDetails_Default) == 0x000060, "Wrong size on WBP_MapIconDetails_Default_C_ExecuteUbergraph_WBP_MapIconDetails_Default");
static_assert(offsetof(WBP_MapIconDetails_Default_C_ExecuteUbergraph_WBP_MapIconDetails_Default, EntryPoint) == 0x000000, "Member 'WBP_MapIconDetails_Default_C_ExecuteUbergraph_WBP_MapIconDetails_Default::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_ExecuteUbergraph_WBP_MapIconDetails_Default, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_MapIconDetails_Default_C_ExecuteUbergraph_WBP_MapIconDetails_Default::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_ExecuteUbergraph_WBP_MapIconDetails_Default, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_MapIconDetails_Default_C_ExecuteUbergraph_WBP_MapIconDetails_Default::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_ExecuteUbergraph_WBP_MapIconDetails_Default, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'WBP_MapIconDetails_Default_C_ExecuteUbergraph_WBP_MapIconDetails_Default::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_ExecuteUbergraph_WBP_MapIconDetails_Default, CallFunc_GetWidgetIconDisplayName_ReturnValue) == 0x000028, "Member 'WBP_MapIconDetails_Default_C_ExecuteUbergraph_WBP_MapIconDetails_Default::CallFunc_GetWidgetIconDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_ExecuteUbergraph_WBP_MapIconDetails_Default, K2Node_Event_bInstant) == 0x000038, "Member 'WBP_MapIconDetails_Default_C_ExecuteUbergraph_WBP_MapIconDetails_Default::K2Node_Event_bInstant' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_ExecuteUbergraph_WBP_MapIconDetails_Default, CallFunc_PlayUMGAnimation_ReturnValue) == 0x000040, "Member 'WBP_MapIconDetails_Default_C_ExecuteUbergraph_WBP_MapIconDetails_Default::CallFunc_PlayUMGAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_ExecuteUbergraph_WBP_MapIconDetails_Default, CallFunc_Not_PreBool_ReturnValue) == 0x000048, "Member 'WBP_MapIconDetails_Default_C_ExecuteUbergraph_WBP_MapIconDetails_Default::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_ExecuteUbergraph_WBP_MapIconDetails_Default, CallFunc_IsValid_ReturnValue_1) == 0x000049, "Member 'WBP_MapIconDetails_Default_C_ExecuteUbergraph_WBP_MapIconDetails_Default::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_ExecuteUbergraph_WBP_MapIconDetails_Default, CallFunc_PlayUMGAnimation_ReturnValue_1) == 0x000050, "Member 'WBP_MapIconDetails_Default_C_ExecuteUbergraph_WBP_MapIconDetails_Default::CallFunc_PlayUMGAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_ExecuteUbergraph_WBP_MapIconDetails_Default, CallFunc_IsValid_ReturnValue_2) == 0x000058, "Member 'WBP_MapIconDetails_Default_C_ExecuteUbergraph_WBP_MapIconDetails_Default::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function WBP_MapIconDetails_Default.WBP_MapIconDetails_Default_C.OnRemoveIconDetails
// 0x0001 (0x0001 - 0x0000)
struct WBP_MapIconDetails_Default_C_OnRemoveIconDetails final
{
public:
	bool                                          bInstant;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapIconDetails_Default_C_OnRemoveIconDetails) == 0x000001, "Wrong alignment on WBP_MapIconDetails_Default_C_OnRemoveIconDetails");
static_assert(sizeof(WBP_MapIconDetails_Default_C_OnRemoveIconDetails) == 0x000001, "Wrong size on WBP_MapIconDetails_Default_C_OnRemoveIconDetails");
static_assert(offsetof(WBP_MapIconDetails_Default_C_OnRemoveIconDetails, bInstant) == 0x000000, "Member 'WBP_MapIconDetails_Default_C_OnRemoveIconDetails::bInstant' has a wrong offset!");

// Function WBP_MapIconDetails_Default.WBP_MapIconDetails_Default_C.UpdateAptitudeOverlay
// 0x0198 (0x0198 - 0x0000)
struct WBP_MapIconDetails_Default_C_UpdateAptitudeOverlay final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAptitudeType                                 CallFunc_GetAptitudeRequired_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInventoryItemAptitudeData             CallFunc_GetItemAptitudeDataFromType_out_AptitudeData; // 0x0008(0x0178)()
	bool                                          CallFunc_GetItemAptitudeDataFromType_ReturnValue;  // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_183[0x5];                                      // 0x0183(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAptitude_ReturnValue;                  // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapIconDetails_Default_C_UpdateAptitudeOverlay) == 0x000008, "Wrong alignment on WBP_MapIconDetails_Default_C_UpdateAptitudeOverlay");
static_assert(sizeof(WBP_MapIconDetails_Default_C_UpdateAptitudeOverlay) == 0x000198, "Wrong size on WBP_MapIconDetails_Default_C_UpdateAptitudeOverlay");
static_assert(offsetof(WBP_MapIconDetails_Default_C_UpdateAptitudeOverlay, Temp_byte_Variable) == 0x000000, "Member 'WBP_MapIconDetails_Default_C_UpdateAptitudeOverlay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_UpdateAptitudeOverlay, Temp_byte_Variable_1) == 0x000001, "Member 'WBP_MapIconDetails_Default_C_UpdateAptitudeOverlay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_UpdateAptitudeOverlay, Temp_bool_Variable) == 0x000002, "Member 'WBP_MapIconDetails_Default_C_UpdateAptitudeOverlay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_UpdateAptitudeOverlay, CallFunc_IsValid_ReturnValue) == 0x000003, "Member 'WBP_MapIconDetails_Default_C_UpdateAptitudeOverlay::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_UpdateAptitudeOverlay, CallFunc_GetAptitudeRequired_ReturnValue) == 0x000004, "Member 'WBP_MapIconDetails_Default_C_UpdateAptitudeOverlay::CallFunc_GetAptitudeRequired_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_UpdateAptitudeOverlay, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000005, "Member 'WBP_MapIconDetails_Default_C_UpdateAptitudeOverlay::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_UpdateAptitudeOverlay, CallFunc_GetItemAptitudeDataFromType_out_AptitudeData) == 0x000008, "Member 'WBP_MapIconDetails_Default_C_UpdateAptitudeOverlay::CallFunc_GetItemAptitudeDataFromType_out_AptitudeData' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_UpdateAptitudeOverlay, CallFunc_GetItemAptitudeDataFromType_ReturnValue) == 0x000180, "Member 'WBP_MapIconDetails_Default_C_UpdateAptitudeOverlay::CallFunc_GetItemAptitudeDataFromType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_UpdateAptitudeOverlay, K2Node_Select_Default) == 0x000181, "Member 'WBP_MapIconDetails_Default_C_UpdateAptitudeOverlay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_UpdateAptitudeOverlay, CallFunc_Not_PreBool_ReturnValue) == 0x000182, "Member 'WBP_MapIconDetails_Default_C_UpdateAptitudeOverlay::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_UpdateAptitudeOverlay, CallFunc_Get_ReturnValue) == 0x000188, "Member 'WBP_MapIconDetails_Default_C_UpdateAptitudeOverlay::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_UpdateAptitudeOverlay, CallFunc_IsValid_ReturnValue_1) == 0x000190, "Member 'WBP_MapIconDetails_Default_C_UpdateAptitudeOverlay::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_UpdateAptitudeOverlay, CallFunc_HasAptitude_ReturnValue) == 0x000191, "Member 'WBP_MapIconDetails_Default_C_UpdateAptitudeOverlay::CallFunc_HasAptitude_ReturnValue' has a wrong offset!");

// Function WBP_MapIconDetails_Default.WBP_MapIconDetails_Default_C.UpdateItemOverlay
// 0x0080 (0x0080 - 0x0000)
struct WBP_MapIconDetails_Default_C_UpdateItemOverlay final
{
public:
	TArray<struct FDataTableRowHandle>            ItemRequiredHandles;                               // 0x0000(0x0010)(Edit, BlueprintVisible)
	struct FDataTableRowHandle                    ItemHandleRequired;                                // 0x0010(0x0010)(Edit, BlueprintVisible, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDataTableRowHandle>            CallFunc_GetItemsRequired_ReturnValue;             // 0x0028(0x0010)(ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    CallFunc_Array_Get_Item;                           // 0x0048(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MapIconDetails_ItemEntry_C*        CallFunc_Create_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapIconDetails_Default_C_UpdateItemOverlay) == 0x000008, "Wrong alignment on WBP_MapIconDetails_Default_C_UpdateItemOverlay");
static_assert(sizeof(WBP_MapIconDetails_Default_C_UpdateItemOverlay) == 0x000080, "Wrong size on WBP_MapIconDetails_Default_C_UpdateItemOverlay");
static_assert(offsetof(WBP_MapIconDetails_Default_C_UpdateItemOverlay, ItemRequiredHandles) == 0x000000, "Member 'WBP_MapIconDetails_Default_C_UpdateItemOverlay::ItemRequiredHandles' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_UpdateItemOverlay, ItemHandleRequired) == 0x000010, "Member 'WBP_MapIconDetails_Default_C_UpdateItemOverlay::ItemHandleRequired' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_UpdateItemOverlay, Temp_bool_Variable) == 0x000020, "Member 'WBP_MapIconDetails_Default_C_UpdateItemOverlay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_UpdateItemOverlay, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'WBP_MapIconDetails_Default_C_UpdateItemOverlay::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_UpdateItemOverlay, CallFunc_GetItemsRequired_ReturnValue) == 0x000028, "Member 'WBP_MapIconDetails_Default_C_UpdateItemOverlay::CallFunc_GetItemsRequired_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_UpdateItemOverlay, Temp_byte_Variable) == 0x000038, "Member 'WBP_MapIconDetails_Default_C_UpdateItemOverlay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_UpdateItemOverlay, Temp_byte_Variable_1) == 0x000039, "Member 'WBP_MapIconDetails_Default_C_UpdateItemOverlay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_UpdateItemOverlay, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'WBP_MapIconDetails_Default_C_UpdateItemOverlay::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_UpdateItemOverlay, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'WBP_MapIconDetails_Default_C_UpdateItemOverlay::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_UpdateItemOverlay, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'WBP_MapIconDetails_Default_C_UpdateItemOverlay::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_UpdateItemOverlay, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_MapIconDetails_Default_C_UpdateItemOverlay::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_UpdateItemOverlay, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'WBP_MapIconDetails_Default_C_UpdateItemOverlay::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_UpdateItemOverlay, CallFunc_Array_Length_ReturnValue_1) == 0x00005C, "Member 'WBP_MapIconDetails_Default_C_UpdateItemOverlay::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_UpdateItemOverlay, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'WBP_MapIconDetails_Default_C_UpdateItemOverlay::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_UpdateItemOverlay, CallFunc_Greater_IntInt_ReturnValue) == 0x000061, "Member 'WBP_MapIconDetails_Default_C_UpdateItemOverlay::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_UpdateItemOverlay, CallFunc_Create_ReturnValue) == 0x000068, "Member 'WBP_MapIconDetails_Default_C_UpdateItemOverlay::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_UpdateItemOverlay, K2Node_Select_Default) == 0x000070, "Member 'WBP_MapIconDetails_Default_C_UpdateItemOverlay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_MapIconDetails_Default_C_UpdateItemOverlay, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000078, "Member 'WBP_MapIconDetails_Default_C_UpdateItemOverlay::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

}

