#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Pause

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "Zion_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Pause.WBP_Pause_C
// 0x0160 (0x05C0 - 0x0460)
class UWBP_Pause_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideAllUI;                                         // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hide;                                              // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Show;                                              // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur_383;                                // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Base;                                           // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Effect;                                         // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_LeftGradation;                                  // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_RightGradation;                                 // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_TopGradation;                                   // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NiagaraSystemWidget_272;                           // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Achievements;                          // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_PCOnly;                                // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Generic_C*                  WBP_Button_Generic_Achievements;                   // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Generic_C*                  WBP_Button_Generic_BackToRestpoint;                // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Generic_C*                  WBP_Button_Generic_BackToTitle;                    // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Generic_C*                  WBP_Button_Generic_Continue;                       // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Generic_C*                  WBP_Button_Generic_Exit;                           // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Generic_C*                  WBP_Button_Generic_QuitBossRush;                   // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Generic_C*                  WBP_Button_Generic_QuitRecollectionBoss;           // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Generic_C*                  WBP_Button_Generic_RetryBossRush;                  // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Generic_C*                  WBP_Button_Generic_RetryRecollectionBoss;          // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Generic_C*                  WBP_Button_Generic_Settings;                       // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Footer_C*                          WBP_Footer;                                        // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_BackToRestpoint;                    // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnClosed;                                          // 0x0528(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsUIVisible;                                       // 0x0538(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UUserWidget*, ESlateVisibility>    Cached_Widget_Visibilities;                        // 0x0540(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FFadeDescriptionData                   BackToRestpointFade;                               // 0x0590(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor)
	class UFMODEvent*                             SE_OpenPause;                                      // 0x05B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             SE_ToggleUIVisibility;                             // 0x05B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Pause_WBP_Button_Generic_Achievements_K2Node_ComponentBoundEvent_9_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void BndEvt__WBP_Pause_WBP_Button_Generic_BackToRestpoint_K2Node_ComponentBoundEvent_4_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void BndEvt__WBP_Pause_WBP_Button_Generic_BackToTitle_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void BndEvt__WBP_Pause_WBP_Button_Generic_Continue_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void BndEvt__WBP_Pause_WBP_Button_Generic_Exit_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void BndEvt__WBP_Pause_WBP_Button_Generic_QuitBossRush_K2Node_ComponentBoundEvent_8_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void BndEvt__WBP_Pause_WBP_Button_Generic_QuitRecollectionBoss_K2Node_ComponentBoundEvent_6_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void BndEvt__WBP_Pause_WBP_Button_Generic_RecollectionRetry_K2Node_ComponentBoundEvent_5_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void BndEvt__WBP_Pause_WBP_Button_Generic_RetryBossRush_K2Node_ComponentBoundEvent_7_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void BndEvt__WBP_Pause_WBP_Button_Generic_Settings_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature(const struct FKeyEvent& KeyEvent);
	void CanLeaveRecollectionBoss(bool* bResult);
	void CloseMenu(bool bSkipAnimation);
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_Pause(int32 EntryPoint);
	void IsInRecollectionBoss(bool* bResult);
	void OnBackToRestpoint();
	void OnBackToTitleConfirm();
	void OnExitBossRush();
	void OnExitConfirm();
	void OnExitRecollectionBoss();
	void OnFadeFinished();
	void OnFinish_357EBEED4B15A162F5F2E78319A9B311();
	void OnFinish_37F219354C5A72239241B2ABFDC72F69();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnHideAllUIAnimEvaluate();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnPressCancel(const struct FKeyEvent& KeyEvent);
	struct FEventReply OnPressContextAlt(const struct FKeyEvent& KeyEvent);
	struct FEventReply OnPreviewKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnPreviewMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void RefreshBackToRestpointButton();
	void SequenceEvent__ENTRYPOINTWBP_Pause();
	void SetupMenuButtons();
	void ToggleUIVisibility();
	void WidgetAnimationEvt_HideAllUI_K2Node_WidgetAnimationEvent_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Pause_C">();
	}
	static class UWBP_Pause_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Pause_C>();
	}
};
static_assert(alignof(UWBP_Pause_C) == 0x000008, "Wrong alignment on UWBP_Pause_C");
static_assert(sizeof(UWBP_Pause_C) == 0x0005C0, "Wrong size on UWBP_Pause_C");
static_assert(offsetof(UWBP_Pause_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Pause_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_C, HideAllUI) == 0x000468, "Member 'UWBP_Pause_C::HideAllUI' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_C, Hide) == 0x000470, "Member 'UWBP_Pause_C::Hide' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_C, Show) == 0x000478, "Member 'UWBP_Pause_C::Show' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_C, BackgroundBlur_383) == 0x000480, "Member 'UWBP_Pause_C::BackgroundBlur_383' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_C, BG_Base) == 0x000488, "Member 'UWBP_Pause_C::BG_Base' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_C, BG_Effect) == 0x000490, "Member 'UWBP_Pause_C::BG_Effect' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_C, BG_LeftGradation) == 0x000498, "Member 'UWBP_Pause_C::BG_LeftGradation' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_C, BG_RightGradation) == 0x0004A0, "Member 'UWBP_Pause_C::BG_RightGradation' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_C, BG_TopGradation) == 0x0004A8, "Member 'UWBP_Pause_C::BG_TopGradation' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_C, NiagaraSystemWidget_272) == 0x0004B0, "Member 'UWBP_Pause_C::NiagaraSystemWidget_272' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_C, VerticalBox_Achievements) == 0x0004B8, "Member 'UWBP_Pause_C::VerticalBox_Achievements' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_C, VerticalBox_PCOnly) == 0x0004C0, "Member 'UWBP_Pause_C::VerticalBox_PCOnly' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_C, WBP_Button_Generic_Achievements) == 0x0004C8, "Member 'UWBP_Pause_C::WBP_Button_Generic_Achievements' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_C, WBP_Button_Generic_BackToRestpoint) == 0x0004D0, "Member 'UWBP_Pause_C::WBP_Button_Generic_BackToRestpoint' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_C, WBP_Button_Generic_BackToTitle) == 0x0004D8, "Member 'UWBP_Pause_C::WBP_Button_Generic_BackToTitle' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_C, WBP_Button_Generic_Continue) == 0x0004E0, "Member 'UWBP_Pause_C::WBP_Button_Generic_Continue' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_C, WBP_Button_Generic_Exit) == 0x0004E8, "Member 'UWBP_Pause_C::WBP_Button_Generic_Exit' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_C, WBP_Button_Generic_QuitBossRush) == 0x0004F0, "Member 'UWBP_Pause_C::WBP_Button_Generic_QuitBossRush' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_C, WBP_Button_Generic_QuitRecollectionBoss) == 0x0004F8, "Member 'UWBP_Pause_C::WBP_Button_Generic_QuitRecollectionBoss' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_C, WBP_Button_Generic_RetryBossRush) == 0x000500, "Member 'UWBP_Pause_C::WBP_Button_Generic_RetryBossRush' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_C, WBP_Button_Generic_RetryRecollectionBoss) == 0x000508, "Member 'UWBP_Pause_C::WBP_Button_Generic_RetryRecollectionBoss' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_C, WBP_Button_Generic_Settings) == 0x000510, "Member 'UWBP_Pause_C::WBP_Button_Generic_Settings' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_C, WBP_Footer) == 0x000518, "Member 'UWBP_Pause_C::WBP_Footer' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_C, WidgetSwitcher_BackToRestpoint) == 0x000520, "Member 'UWBP_Pause_C::WidgetSwitcher_BackToRestpoint' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_C, OnClosed) == 0x000528, "Member 'UWBP_Pause_C::OnClosed' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_C, IsUIVisible) == 0x000538, "Member 'UWBP_Pause_C::IsUIVisible' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_C, Cached_Widget_Visibilities) == 0x000540, "Member 'UWBP_Pause_C::Cached_Widget_Visibilities' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_C, BackToRestpointFade) == 0x000590, "Member 'UWBP_Pause_C::BackToRestpointFade' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_C, SE_OpenPause) == 0x0005B0, "Member 'UWBP_Pause_C::SE_OpenPause' has a wrong offset!");
static_assert(offsetof(UWBP_Pause_C, SE_ToggleUIVisibility) == 0x0005B8, "Member 'UWBP_Pause_C::SE_ToggleUIVisibility' has a wrong offset!");

}

