#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_Entry_Choice_AutoClimbMode

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Zion_structs.hpp"


namespace SDK::Params
{

// Function WBP_Settings_Entry_Choice_AutoClimbMode.WBP_Settings_Entry_Choice_AutoClimbMode_C.ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode
// 0x0030 (0x0030 - 0x0000)
struct WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAutoClimbDirectionMode                       Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAutoClimbDirectionMode                       CallFunc_GetAutoClimbDirectionMode_ReturnValue;    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAutoClimbDirectionMode                       Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAutoClimbDirectionMode                       Temp_byte_Variable_2;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAutoClimbDirectionMode                       Temp_byte_Variable_3;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAutoClimbDirectionMode                       CallFunc_GetAutoClimbDirectionMode_ReturnValue_1;  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAutoClimbDirectionMode                       Temp_byte_Variable_4;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAutoClimbDirectionMode                       Temp_byte_Variable_5;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAutoClimbDirectionMode                       Temp_byte_Variable_6;                              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAutoClimbDirectionMode                       Temp_byte_Variable_7;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAutoClimbDirectionMode                       Temp_byte_Variable_8;                              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAutoClimbDirectionMode                       K2Node_Select_Default;                             // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAutoClimbDirectionMode                       CallFunc_SetAutoClimbDirectionMode_ReturnValue;    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAutoClimbDirectionMode                       Temp_byte_Variable_9;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAutoClimbDirectionMode                       K2Node_Select_Default_1;                           // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAutoClimbDirectionMode                       CallFunc_SetAutoClimbDirectionMode_ReturnValue_1;  // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode");
static_assert(sizeof(WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode) == 0x000030, "Wrong size on WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode, EntryPoint) == 0x000000, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode, Temp_byte_Variable) == 0x000010, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode, CallFunc_GetAutoClimbDirectionMode_ReturnValue) == 0x000011, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode::CallFunc_GetAutoClimbDirectionMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode, Temp_byte_Variable_1) == 0x000012, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode, Temp_byte_Variable_2) == 0x000013, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode, Temp_byte_Variable_3) == 0x000014, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000018, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode, CallFunc_GetAutoClimbDirectionMode_ReturnValue_1) == 0x000020, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode::CallFunc_GetAutoClimbDirectionMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode, Temp_byte_Variable_4) == 0x000021, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode, Temp_byte_Variable_5) == 0x000022, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode, Temp_byte_Variable_6) == 0x000023, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode, Temp_byte_Variable_7) == 0x000024, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode, Temp_byte_Variable_8) == 0x000025, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode, K2Node_Event_IsDesignTime) == 0x000026, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode, K2Node_Select_Default) == 0x000027, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode, CallFunc_SetAutoClimbDirectionMode_ReturnValue) == 0x000028, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode::CallFunc_SetAutoClimbDirectionMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode, Temp_byte_Variable_9) == 0x000029, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode, K2Node_Select_Default_1) == 0x00002A, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode, CallFunc_SetAutoClimbDirectionMode_ReturnValue_1) == 0x00002B, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AutoClimbMode::CallFunc_SetAutoClimbDirectionMode_ReturnValue_1' has a wrong offset!");

// Function WBP_Settings_Entry_Choice_AutoClimbMode.WBP_Settings_Entry_Choice_AutoClimbMode_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Settings_Entry_Choice_AutoClimbMode_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Settings_Entry_Choice_AutoClimbMode_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Choice_AutoClimbMode_C_OnFocusReceived");
static_assert(sizeof(WBP_Settings_Entry_Choice_AutoClimbMode_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_Settings_Entry_Choice_AutoClimbMode_C_OnFocusReceived");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Settings_Entry_Choice_AutoClimbMode.WBP_Settings_Entry_Choice_AutoClimbMode_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_Entry_Choice_AutoClimbMode_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Choice_AutoClimbMode_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Settings_Entry_Choice_AutoClimbMode_C_PreConstruct");
static_assert(sizeof(WBP_Settings_Entry_Choice_AutoClimbMode_C_PreConstruct) == 0x000001, "Wrong size on WBP_Settings_Entry_Choice_AutoClimbMode_C_PreConstruct");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Settings_Entry_Choice_AutoClimbMode.WBP_Settings_Entry_Choice_AutoClimbMode_C.RefreshText
// 0x0080 (0x0080 - 0x0000)
struct WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText final
{
public:
	EAutoClimbDirectionMode                       Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAutoClimbDirectionMode                       Temp_byte_Variable_1;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0028(0x0010)()
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0010)()
	class FText                                   Temp_text_Variable_3;                              // 0x0048(0x0010)()
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAutoClimbDirectionMode                       CallFunc_GetAutoClimbDirectionMode_ReturnValue;    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0068(0x0010)()
	int32                                         K2Node_Select_Default_1;                           // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText");
static_assert(sizeof(WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText) == 0x000080, "Wrong size on WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText, Temp_byte_Variable) == 0x000000, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText, Temp_int_Variable) == 0x000004, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText, Temp_int_Variable_1) == 0x000008, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText, Temp_int_Variable_2) == 0x00000C, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText, Temp_int_Variable_3) == 0x000010, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText, Temp_byte_Variable_1) == 0x000014, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText, Temp_text_Variable) == 0x000018, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText, Temp_text_Variable_1) == 0x000028, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText, Temp_text_Variable_2) == 0x000038, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText, Temp_text_Variable_3) == 0x000048, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000058, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText, CallFunc_GetAutoClimbDirectionMode_ReturnValue) == 0x000060, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText::CallFunc_GetAutoClimbDirectionMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText, K2Node_Select_Default) == 0x000068, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText, K2Node_Select_Default_1) == 0x000078, "Member 'WBP_Settings_Entry_Choice_AutoClimbMode_C_RefreshText::K2Node_Select_Default_1' has a wrong offset!");

}

