#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugMenu_Element_ItemButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DebugMenu_Element_ItemButton.WBP_DebugMenu_Element_ItemButton_C
// 0x0048 (0x04A8 - 0x0460)
class UWBP_DebugMenu_Element_ItemButton_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_DebugMenu_Element_Button_C*        WBP_DebugMenu_Element_Button;                      // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Label;                                             // 0x0470(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)
	TMulticastInlineDelegate<void(class UWBP_DebugMenu_Element_ItemButton_C* ItemButton)> OnPressed; // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FDataTableRowHandle                    ItemHandle;                                        // 0x0490(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, ExposeOnSpawn)
	int32                                         ItemCount;                                         // 0x04A0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void ExecuteUbergraph_WBP_DebugMenu_Element_ItemButton(int32 EntryPoint);
	void BndEvt__WBP_DebugMenu_Element_ItemButton_WBP_DebugMenu_Element_Button_K2Node_ComponentBoundEvent_0_OnConfirm__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DebugMenu_Element_ItemButton_C">();
	}
	static class UWBP_DebugMenu_Element_ItemButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DebugMenu_Element_ItemButton_C>();
	}
};
static_assert(alignof(UWBP_DebugMenu_Element_ItemButton_C) == 0x000008, "Wrong alignment on UWBP_DebugMenu_Element_ItemButton_C");
static_assert(sizeof(UWBP_DebugMenu_Element_ItemButton_C) == 0x0004A8, "Wrong size on UWBP_DebugMenu_Element_ItemButton_C");
static_assert(offsetof(UWBP_DebugMenu_Element_ItemButton_C, UberGraphFrame) == 0x000460, "Member 'UWBP_DebugMenu_Element_ItemButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_ItemButton_C, WBP_DebugMenu_Element_Button) == 0x000468, "Member 'UWBP_DebugMenu_Element_ItemButton_C::WBP_DebugMenu_Element_Button' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_ItemButton_C, Label) == 0x000470, "Member 'UWBP_DebugMenu_Element_ItemButton_C::Label' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_ItemButton_C, OnPressed) == 0x000480, "Member 'UWBP_DebugMenu_Element_ItemButton_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_ItemButton_C, ItemHandle) == 0x000490, "Member 'UWBP_DebugMenu_Element_ItemButton_C::ItemHandle' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_ItemButton_C, ItemCount) == 0x0004A0, "Member 'UWBP_DebugMenu_Element_ItemButton_C::ItemCount' has a wrong offset!");

}

