#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_Entry_Choice_Resolution

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Settings_Entry_Choice_Resolution.WBP_Settings_Entry_Choice_Resolution_C.ComputeCurrentResolutionIndex
// 0x0038 (0x0038 - 0x0000)
struct WBP_Settings_Entry_Choice_Resolution_C_ComputeCurrentResolutionIndex final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_Array_Get_Item;                           // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              CallFunc_GetScreenResolution_ReturnValue;          // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Equal_IntPointIntPoint_ReturnValue;       // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Choice_Resolution_C_ComputeCurrentResolutionIndex) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Choice_Resolution_C_ComputeCurrentResolutionIndex");
static_assert(sizeof(WBP_Settings_Entry_Choice_Resolution_C_ComputeCurrentResolutionIndex) == 0x000038, "Wrong size on WBP_Settings_Entry_Choice_Resolution_C_ComputeCurrentResolutionIndex");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_ComputeCurrentResolutionIndex, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_Settings_Entry_Choice_Resolution_C_ComputeCurrentResolutionIndex::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_ComputeCurrentResolutionIndex, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Settings_Entry_Choice_Resolution_C_ComputeCurrentResolutionIndex::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_ComputeCurrentResolutionIndex, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Settings_Entry_Choice_Resolution_C_ComputeCurrentResolutionIndex::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_ComputeCurrentResolutionIndex, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'WBP_Settings_Entry_Choice_Resolution_C_ComputeCurrentResolutionIndex::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_ComputeCurrentResolutionIndex, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'WBP_Settings_Entry_Choice_Resolution_C_ComputeCurrentResolutionIndex::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_ComputeCurrentResolutionIndex, CallFunc_Array_Get_Item) == 0x000014, "Member 'WBP_Settings_Entry_Choice_Resolution_C_ComputeCurrentResolutionIndex::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_ComputeCurrentResolutionIndex, CallFunc_Array_Length_ReturnValue_1) == 0x00001C, "Member 'WBP_Settings_Entry_Choice_Resolution_C_ComputeCurrentResolutionIndex::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_ComputeCurrentResolutionIndex, CallFunc_GetGameUserSettings_ReturnValue) == 0x000020, "Member 'WBP_Settings_Entry_Choice_Resolution_C_ComputeCurrentResolutionIndex::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_ComputeCurrentResolutionIndex, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'WBP_Settings_Entry_Choice_Resolution_C_ComputeCurrentResolutionIndex::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_ComputeCurrentResolutionIndex, CallFunc_GetScreenResolution_ReturnValue) == 0x00002C, "Member 'WBP_Settings_Entry_Choice_Resolution_C_ComputeCurrentResolutionIndex::CallFunc_GetScreenResolution_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_ComputeCurrentResolutionIndex, CallFunc_Equal_IntPointIntPoint_ReturnValue) == 0x000034, "Member 'WBP_Settings_Entry_Choice_Resolution_C_ComputeCurrentResolutionIndex::CallFunc_Equal_IntPointIntPoint_ReturnValue' has a wrong offset!");

// Function WBP_Settings_Entry_Choice_Resolution.WBP_Settings_Entry_Choice_Resolution_C.ExecuteUbergraph_WBP_Settings_Entry_Choice_Resolution
// 0x002C (0x002C - 0x0000)
struct WBP_Settings_Entry_Choice_Resolution_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_Resolution final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPCBuild_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsEnabled;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_LoopAround_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_LoopAround_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Choice_Resolution_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_Resolution) == 0x000004, "Wrong alignment on WBP_Settings_Entry_Choice_Resolution_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_Resolution");
static_assert(sizeof(WBP_Settings_Entry_Choice_Resolution_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_Resolution) == 0x00002C, "Wrong size on WBP_Settings_Entry_Choice_Resolution_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_Resolution");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_Resolution, EntryPoint) == 0x000000, "Member 'WBP_Settings_Entry_Choice_Resolution_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_Resolution::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_Resolution, CallFunc_IsPCBuild_ReturnValue) == 0x000004, "Member 'WBP_Settings_Entry_Choice_Resolution_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_Resolution::CallFunc_IsPCBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_Resolution, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Settings_Entry_Choice_Resolution_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_Resolution::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_Resolution, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_Settings_Entry_Choice_Resolution_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_Resolution::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_Resolution, K2Node_Event_bInIsEnabled) == 0x000010, "Member 'WBP_Settings_Entry_Choice_Resolution_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_Resolution::K2Node_Event_bInIsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_Resolution, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'WBP_Settings_Entry_Choice_Resolution_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_Resolution::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_Resolution, CallFunc_Array_Length_ReturnValue_1) == 0x000018, "Member 'WBP_Settings_Entry_Choice_Resolution_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_Resolution::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_Resolution, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00001C, "Member 'WBP_Settings_Entry_Choice_Resolution_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_Resolution::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_Resolution, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000020, "Member 'WBP_Settings_Entry_Choice_Resolution_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_Resolution::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_Resolution, CallFunc_LoopAround_ReturnValue) == 0x000024, "Member 'WBP_Settings_Entry_Choice_Resolution_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_Resolution::CallFunc_LoopAround_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_Resolution, CallFunc_LoopAround_ReturnValue_1) == 0x000028, "Member 'WBP_Settings_Entry_Choice_Resolution_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_Resolution::CallFunc_LoopAround_ReturnValue_1' has a wrong offset!");

// Function WBP_Settings_Entry_Choice_Resolution.WBP_Settings_Entry_Choice_Resolution_C.GenerateResolutions
// 0x0060 (0x0060 - 0x0000)
struct WBP_Settings_Entry_Choice_Resolution_C_GenerateResolutions final
{
public:
	TArray<struct FIntPoint>                      CallFunc_GetWindowedResolutions_OutResolutions;    // 0x0000(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetWindowedResolutions_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_GetDesktopResolution_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWindowMode                                   CallFunc_GetFullscreenMode_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FIntPoint>                      K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FIntPoint>                      CallFunc_GetSupportedFullscreenResolutions_Resolutions; // 0x0048(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetSupportedFullscreenResolutions_ReturnValue; // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Choice_Resolution_C_GenerateResolutions) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Choice_Resolution_C_GenerateResolutions");
static_assert(sizeof(WBP_Settings_Entry_Choice_Resolution_C_GenerateResolutions) == 0x000060, "Wrong size on WBP_Settings_Entry_Choice_Resolution_C_GenerateResolutions");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_GenerateResolutions, CallFunc_GetWindowedResolutions_OutResolutions) == 0x000000, "Member 'WBP_Settings_Entry_Choice_Resolution_C_GenerateResolutions::CallFunc_GetWindowedResolutions_OutResolutions' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_GenerateResolutions, CallFunc_GetWindowedResolutions_ReturnValue) == 0x000010, "Member 'WBP_Settings_Entry_Choice_Resolution_C_GenerateResolutions::CallFunc_GetWindowedResolutions_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_GenerateResolutions, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'WBP_Settings_Entry_Choice_Resolution_C_GenerateResolutions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_GenerateResolutions, CallFunc_GetGameUserSettings_ReturnValue) == 0x000018, "Member 'WBP_Settings_Entry_Choice_Resolution_C_GenerateResolutions::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_GenerateResolutions, CallFunc_GetDesktopResolution_ReturnValue) == 0x000020, "Member 'WBP_Settings_Entry_Choice_Resolution_C_GenerateResolutions::CallFunc_GetDesktopResolution_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_GenerateResolutions, CallFunc_GetFullscreenMode_ReturnValue) == 0x000028, "Member 'WBP_Settings_Entry_Choice_Resolution_C_GenerateResolutions::CallFunc_GetFullscreenMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_GenerateResolutions, K2Node_MakeArray_Array) == 0x000030, "Member 'WBP_Settings_Entry_Choice_Resolution_C_GenerateResolutions::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_GenerateResolutions, K2Node_SwitchEnum_CmpSuccess) == 0x000040, "Member 'WBP_Settings_Entry_Choice_Resolution_C_GenerateResolutions::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_GenerateResolutions, CallFunc_GetSupportedFullscreenResolutions_Resolutions) == 0x000048, "Member 'WBP_Settings_Entry_Choice_Resolution_C_GenerateResolutions::CallFunc_GetSupportedFullscreenResolutions_Resolutions' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_GenerateResolutions, CallFunc_GetSupportedFullscreenResolutions_ReturnValue) == 0x000058, "Member 'WBP_Settings_Entry_Choice_Resolution_C_GenerateResolutions::CallFunc_GetSupportedFullscreenResolutions_ReturnValue' has a wrong offset!");

// Function WBP_Settings_Entry_Choice_Resolution.WBP_Settings_Entry_Choice_Resolution_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Settings_Entry_Choice_Resolution_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Settings_Entry_Choice_Resolution_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Choice_Resolution_C_OnFocusReceived");
static_assert(sizeof(WBP_Settings_Entry_Choice_Resolution_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_Settings_Entry_Choice_Resolution_C_OnFocusReceived");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Settings_Entry_Choice_Resolution_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Settings_Entry_Choice_Resolution_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Settings_Entry_Choice_Resolution_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Settings_Entry_Choice_Resolution_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Settings_Entry_Choice_Resolution.WBP_Settings_Entry_Choice_Resolution_C.OnSetIsEnabled
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_Entry_Choice_Resolution_C_OnSetIsEnabled final
{
public:
	bool                                          bInIsEnabled;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Choice_Resolution_C_OnSetIsEnabled) == 0x000001, "Wrong alignment on WBP_Settings_Entry_Choice_Resolution_C_OnSetIsEnabled");
static_assert(sizeof(WBP_Settings_Entry_Choice_Resolution_C_OnSetIsEnabled) == 0x000001, "Wrong size on WBP_Settings_Entry_Choice_Resolution_C_OnSetIsEnabled");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_OnSetIsEnabled, bInIsEnabled) == 0x000000, "Member 'WBP_Settings_Entry_Choice_Resolution_C_OnSetIsEnabled::bInIsEnabled' has a wrong offset!");

// Function WBP_Settings_Entry_Choice_Resolution.WBP_Settings_Entry_Choice_Resolution_C.RefreshResolutionChoices
// 0x0010 (0x0010 - 0x0000)
struct WBP_Settings_Entry_Choice_Resolution_C_RefreshResolutionChoices final
{
public:
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EWindowMode                                   CallFunc_GetFullscreenMode_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Choice_Resolution_C_RefreshResolutionChoices) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Choice_Resolution_C_RefreshResolutionChoices");
static_assert(sizeof(WBP_Settings_Entry_Choice_Resolution_C_RefreshResolutionChoices) == 0x000010, "Wrong size on WBP_Settings_Entry_Choice_Resolution_C_RefreshResolutionChoices");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_RefreshResolutionChoices, CallFunc_GetGameUserSettings_ReturnValue) == 0x000000, "Member 'WBP_Settings_Entry_Choice_Resolution_C_RefreshResolutionChoices::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_RefreshResolutionChoices, CallFunc_GetFullscreenMode_ReturnValue) == 0x000008, "Member 'WBP_Settings_Entry_Choice_Resolution_C_RefreshResolutionChoices::CallFunc_GetFullscreenMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_RefreshResolutionChoices, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000009, "Member 'WBP_Settings_Entry_Choice_Resolution_C_RefreshResolutionChoices::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_RefreshResolutionChoices, CallFunc_Not_PreBool_ReturnValue) == 0x00000A, "Member 'WBP_Settings_Entry_Choice_Resolution_C_RefreshResolutionChoices::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_Settings_Entry_Choice_Resolution.WBP_Settings_Entry_Choice_Resolution_C.RefreshText
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_Settings_Entry_Choice_Resolution_C_RefreshText final
{
public:
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0048)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0060(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B8(0x0010)()
};
static_assert(alignof(WBP_Settings_Entry_Choice_Resolution_C_RefreshText) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Choice_Resolution_C_RefreshText");
static_assert(sizeof(WBP_Settings_Entry_Choice_Resolution_C_RefreshText) == 0x0000C8, "Wrong size on WBP_Settings_Entry_Choice_Resolution_C_RefreshText");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_RefreshText, CallFunc_Array_Length_ReturnValue) == 0x000000, "Member 'WBP_Settings_Entry_Choice_Resolution_C_RefreshText::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_RefreshText, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'WBP_Settings_Entry_Choice_Resolution_C_RefreshText::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_RefreshText, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000008, "Member 'WBP_Settings_Entry_Choice_Resolution_C_RefreshText::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_RefreshText, K2Node_MakeStruct_FormatArgumentData) == 0x000010, "Member 'WBP_Settings_Entry_Choice_Resolution_C_RefreshText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_RefreshText, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000058, "Member 'WBP_Settings_Entry_Choice_Resolution_C_RefreshText::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_RefreshText, K2Node_MakeStruct_FormatArgumentData_1) == 0x000060, "Member 'WBP_Settings_Entry_Choice_Resolution_C_RefreshText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_RefreshText, K2Node_MakeArray_Array) == 0x0000A8, "Member 'WBP_Settings_Entry_Choice_Resolution_C_RefreshText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_RefreshText, CallFunc_Format_ReturnValue) == 0x0000B8, "Member 'WBP_Settings_Entry_Choice_Resolution_C_RefreshText::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_Settings_Entry_Choice_Resolution.WBP_Settings_Entry_Choice_Resolution_C.SetResolution
// 0x0018 (0x0018 - 0x0000)
struct WBP_Settings_Entry_Choice_Resolution_C_SetResolution final
{
public:
	int32                                         ResolutionIndex;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Choice_Resolution_C_SetResolution) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Choice_Resolution_C_SetResolution");
static_assert(sizeof(WBP_Settings_Entry_Choice_Resolution_C_SetResolution) == 0x000018, "Wrong size on WBP_Settings_Entry_Choice_Resolution_C_SetResolution");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_SetResolution, ResolutionIndex) == 0x000000, "Member 'WBP_Settings_Entry_Choice_Resolution_C_SetResolution::ResolutionIndex' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_Resolution_C_SetResolution, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'WBP_Settings_Entry_Choice_Resolution_C_SetResolution::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
