#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_Entry_Choice_AntiAliasingType

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Settings_Entry_Choice_AntiAliasingType.WBP_Settings_Entry_Choice_AntiAliasingType_C.ComputeCurrIndex
// 0x0018 (0x0018 - 0x0000)
struct WBP_Settings_Entry_Choice_AntiAliasingType_C_ComputeCurrIndex final
{
public:
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAntiAliasingMethod                           CallFunc_GetAntiAliasingMethod_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Choice_AntiAliasingType_C_ComputeCurrIndex) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Choice_AntiAliasingType_C_ComputeCurrIndex");
static_assert(sizeof(WBP_Settings_Entry_Choice_AntiAliasingType_C_ComputeCurrIndex) == 0x000018, "Wrong size on WBP_Settings_Entry_Choice_AntiAliasingType_C_ComputeCurrIndex");
static_assert(offsetof(WBP_Settings_Entry_Choice_AntiAliasingType_C_ComputeCurrIndex, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000000, "Member 'WBP_Settings_Entry_Choice_AntiAliasingType_C_ComputeCurrIndex::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AntiAliasingType_C_ComputeCurrIndex, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000004, "Member 'WBP_Settings_Entry_Choice_AntiAliasingType_C_ComputeCurrIndex::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AntiAliasingType_C_ComputeCurrIndex, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_Settings_Entry_Choice_AntiAliasingType_C_ComputeCurrIndex::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AntiAliasingType_C_ComputeCurrIndex, CallFunc_GetAntiAliasingMethod_ReturnValue) == 0x000010, "Member 'WBP_Settings_Entry_Choice_AntiAliasingType_C_ComputeCurrIndex::CallFunc_GetAntiAliasingMethod_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AntiAliasingType_C_ComputeCurrIndex, CallFunc_Array_Find_ReturnValue) == 0x000014, "Member 'WBP_Settings_Entry_Choice_AntiAliasingType_C_ComputeCurrIndex::CallFunc_Array_Find_ReturnValue' has a wrong offset!");

// Function WBP_Settings_Entry_Choice_AntiAliasingType.WBP_Settings_Entry_Choice_AntiAliasingType_C.ExecuteUbergraph_WBP_Settings_Entry_Choice_AntiAliasingType
// 0x0028 (0x0028 - 0x0000)
struct WBP_Settings_Entry_Choice_AntiAliasingType_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AntiAliasingType final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_LoopAround_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Choice_AntiAliasingType_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AntiAliasingType) == 0x000004, "Wrong alignment on WBP_Settings_Entry_Choice_AntiAliasingType_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AntiAliasingType");
static_assert(sizeof(WBP_Settings_Entry_Choice_AntiAliasingType_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AntiAliasingType) == 0x000028, "Wrong size on WBP_Settings_Entry_Choice_AntiAliasingType_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AntiAliasingType");
static_assert(offsetof(WBP_Settings_Entry_Choice_AntiAliasingType_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AntiAliasingType, EntryPoint) == 0x000000, "Member 'WBP_Settings_Entry_Choice_AntiAliasingType_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AntiAliasingType::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AntiAliasingType_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AntiAliasingType, Temp_int_Variable) == 0x000004, "Member 'WBP_Settings_Entry_Choice_AntiAliasingType_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AntiAliasingType::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AntiAliasingType_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AntiAliasingType, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'WBP_Settings_Entry_Choice_AntiAliasingType_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AntiAliasingType::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AntiAliasingType_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AntiAliasingType, Temp_int_Variable_1) == 0x00000C, "Member 'WBP_Settings_Entry_Choice_AntiAliasingType_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AntiAliasingType::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AntiAliasingType_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AntiAliasingType, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_Settings_Entry_Choice_AntiAliasingType_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AntiAliasingType::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AntiAliasingType_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AntiAliasingType, CallFunc_Array_Length_ReturnValue_1) == 0x000014, "Member 'WBP_Settings_Entry_Choice_AntiAliasingType_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AntiAliasingType::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AntiAliasingType_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AntiAliasingType, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Settings_Entry_Choice_AntiAliasingType_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AntiAliasingType::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AntiAliasingType_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AntiAliasingType, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00001C, "Member 'WBP_Settings_Entry_Choice_AntiAliasingType_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AntiAliasingType::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AntiAliasingType_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AntiAliasingType, CallFunc_LoopAround_ReturnValue) == 0x000020, "Member 'WBP_Settings_Entry_Choice_AntiAliasingType_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AntiAliasingType::CallFunc_LoopAround_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AntiAliasingType_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AntiAliasingType, K2Node_Event_IsDesignTime) == 0x000024, "Member 'WBP_Settings_Entry_Choice_AntiAliasingType_C_ExecuteUbergraph_WBP_Settings_Entry_Choice_AntiAliasingType::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_Settings_Entry_Choice_AntiAliasingType.WBP_Settings_Entry_Choice_AntiAliasingType_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Settings_Entry_Choice_AntiAliasingType_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Settings_Entry_Choice_AntiAliasingType_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Choice_AntiAliasingType_C_OnFocusReceived");
static_assert(sizeof(WBP_Settings_Entry_Choice_AntiAliasingType_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_Settings_Entry_Choice_AntiAliasingType_C_OnFocusReceived");
static_assert(offsetof(WBP_Settings_Entry_Choice_AntiAliasingType_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Settings_Entry_Choice_AntiAliasingType_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AntiAliasingType_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Settings_Entry_Choice_AntiAliasingType_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AntiAliasingType_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Settings_Entry_Choice_AntiAliasingType_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AntiAliasingType_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Settings_Entry_Choice_AntiAliasingType_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Settings_Entry_Choice_AntiAliasingType.WBP_Settings_Entry_Choice_AntiAliasingType_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_Entry_Choice_AntiAliasingType_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Choice_AntiAliasingType_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Settings_Entry_Choice_AntiAliasingType_C_PreConstruct");
static_assert(sizeof(WBP_Settings_Entry_Choice_AntiAliasingType_C_PreConstruct) == 0x000001, "Wrong size on WBP_Settings_Entry_Choice_AntiAliasingType_C_PreConstruct");
static_assert(offsetof(WBP_Settings_Entry_Choice_AntiAliasingType_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Settings_Entry_Choice_AntiAliasingType_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Settings_Entry_Choice_AntiAliasingType.WBP_Settings_Entry_Choice_AntiAliasingType_C.RefreshText
// 0x0028 (0x0028 - 0x0000)
struct WBP_Settings_Entry_Choice_AntiAliasingType_C_RefreshText final
{
public:
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAntiAliasingMethod                           CallFunc_GetAntiAliasingMethod_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0010(0x0010)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Choice_AntiAliasingType_C_RefreshText) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Choice_AntiAliasingType_C_RefreshText");
static_assert(sizeof(WBP_Settings_Entry_Choice_AntiAliasingType_C_RefreshText) == 0x000028, "Wrong size on WBP_Settings_Entry_Choice_AntiAliasingType_C_RefreshText");
static_assert(offsetof(WBP_Settings_Entry_Choice_AntiAliasingType_C_RefreshText, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'WBP_Settings_Entry_Choice_AntiAliasingType_C_RefreshText::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AntiAliasingType_C_RefreshText, CallFunc_GetAntiAliasingMethod_ReturnValue) == 0x000008, "Member 'WBP_Settings_Entry_Choice_AntiAliasingType_C_RefreshText::CallFunc_GetAntiAliasingMethod_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AntiAliasingType_C_RefreshText, CallFunc_Map_Find_Value) == 0x000010, "Member 'WBP_Settings_Entry_Choice_AntiAliasingType_C_RefreshText::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AntiAliasingType_C_RefreshText, CallFunc_Map_Find_ReturnValue) == 0x000020, "Member 'WBP_Settings_Entry_Choice_AntiAliasingType_C_RefreshText::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WBP_Settings_Entry_Choice_AntiAliasingType.WBP_Settings_Entry_Choice_AntiAliasingType_C.SetAATypeFromIndex
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_Entry_Choice_AntiAliasingType_C_SetAATypeFromIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAntiAliasingMethod                           CallFunc_SetAntiAliasingMethod_ReturnValue;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Choice_AntiAliasingType_C_SetAATypeFromIndex) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Choice_AntiAliasingType_C_SetAATypeFromIndex");
static_assert(sizeof(WBP_Settings_Entry_Choice_AntiAliasingType_C_SetAATypeFromIndex) == 0x000020, "Wrong size on WBP_Settings_Entry_Choice_AntiAliasingType_C_SetAATypeFromIndex");
static_assert(offsetof(WBP_Settings_Entry_Choice_AntiAliasingType_C_SetAATypeFromIndex, Index_0) == 0x000000, "Member 'WBP_Settings_Entry_Choice_AntiAliasingType_C_SetAATypeFromIndex::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AntiAliasingType_C_SetAATypeFromIndex, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_Settings_Entry_Choice_AntiAliasingType_C_SetAATypeFromIndex::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AntiAliasingType_C_SetAATypeFromIndex, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_Settings_Entry_Choice_AntiAliasingType_C_SetAATypeFromIndex::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AntiAliasingType_C_SetAATypeFromIndex, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'WBP_Settings_Entry_Choice_AntiAliasingType_C_SetAATypeFromIndex::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AntiAliasingType_C_SetAATypeFromIndex, CallFunc_SetAntiAliasingMethod_ReturnValue) == 0x000018, "Member 'WBP_Settings_Entry_Choice_AntiAliasingType_C_SetAATypeFromIndex::CallFunc_SetAntiAliasingMethod_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_AntiAliasingType_C_SetAATypeFromIndex, CallFunc_Clamp_ReturnValue) == 0x00001C, "Member 'WBP_Settings_Entry_Choice_AntiAliasingType_C_SetAATypeFromIndex::CallFunc_Clamp_ReturnValue' has a wrong offset!");

}

