#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StatusEffects

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_StatusEffects.WBP_StatusEffects_C.OnStatusEffectLaunched
// 0x0008 (0x0008 - 0x0000)
struct WBP_StatusEffects_C_OnStatusEffectLaunched final
{
public:
	class UStatusEffect*                          StatusEffect;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusEffects_C_OnStatusEffectLaunched) == 0x000008, "Wrong alignment on WBP_StatusEffects_C_OnStatusEffectLaunched");
static_assert(sizeof(WBP_StatusEffects_C_OnStatusEffectLaunched) == 0x000008, "Wrong size on WBP_StatusEffects_C_OnStatusEffectLaunched");
static_assert(offsetof(WBP_StatusEffects_C_OnStatusEffectLaunched, StatusEffect) == 0x000000, "Member 'WBP_StatusEffects_C_OnStatusEffectLaunched::StatusEffect' has a wrong offset!");

// Function WBP_StatusEffects.WBP_StatusEffects_C.Initialize
// 0x0008 (0x0008 - 0x0000)
struct WBP_StatusEffects_C_Initialize final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusEffects_C_Initialize) == 0x000008, "Wrong alignment on WBP_StatusEffects_C_Initialize");
static_assert(sizeof(WBP_StatusEffects_C_Initialize) == 0x000008, "Wrong size on WBP_StatusEffects_C_Initialize");
static_assert(offsetof(WBP_StatusEffects_C_Initialize, Pawn) == 0x000000, "Member 'WBP_StatusEffects_C_Initialize::Pawn' has a wrong offset!");

// Function WBP_StatusEffects.WBP_StatusEffects_C.ExecuteUbergraph_WBP_StatusEffects
// 0x0048 (0x0048 - 0x0000)
struct WBP_StatusEffects_C_ExecuteUbergraph_WBP_StatusEffects final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_StatusEffectIcon_C*                CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_Pawn;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UStatusEffect* StatusEffect)> K2Node_CreateDelegate_OutputDelegate;         // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStatusEffectComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStatusEffect*                          K2Node_CustomEvent_StatusEffect;                   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_StatusEffects_C_ExecuteUbergraph_WBP_StatusEffects) == 0x000008, "Wrong alignment on WBP_StatusEffects_C_ExecuteUbergraph_WBP_StatusEffects");
static_assert(sizeof(WBP_StatusEffects_C_ExecuteUbergraph_WBP_StatusEffects) == 0x000048, "Wrong size on WBP_StatusEffects_C_ExecuteUbergraph_WBP_StatusEffects");
static_assert(offsetof(WBP_StatusEffects_C_ExecuteUbergraph_WBP_StatusEffects, EntryPoint) == 0x000000, "Member 'WBP_StatusEffects_C_ExecuteUbergraph_WBP_StatusEffects::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffects_C_ExecuteUbergraph_WBP_StatusEffects, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_StatusEffects_C_ExecuteUbergraph_WBP_StatusEffects::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffects_C_ExecuteUbergraph_WBP_StatusEffects, K2Node_CustomEvent_Pawn) == 0x000010, "Member 'WBP_StatusEffects_C_ExecuteUbergraph_WBP_StatusEffects::K2Node_CustomEvent_Pawn' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffects_C_ExecuteUbergraph_WBP_StatusEffects, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_StatusEffects_C_ExecuteUbergraph_WBP_StatusEffects::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffects_C_ExecuteUbergraph_WBP_StatusEffects, CallFunc_GetComponentByClass_ReturnValue) == 0x000028, "Member 'WBP_StatusEffects_C_ExecuteUbergraph_WBP_StatusEffects::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffects_C_ExecuteUbergraph_WBP_StatusEffects, K2Node_CustomEvent_StatusEffect) == 0x000030, "Member 'WBP_StatusEffects_C_ExecuteUbergraph_WBP_StatusEffects::K2Node_CustomEvent_StatusEffect' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffects_C_ExecuteUbergraph_WBP_StatusEffects, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_StatusEffects_C_ExecuteUbergraph_WBP_StatusEffects::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_StatusEffects_C_ExecuteUbergraph_WBP_StatusEffects, CallFunc_AddChild_ReturnValue) == 0x000040, "Member 'WBP_StatusEffects_C_ExecuteUbergraph_WBP_StatusEffects::CallFunc_AddChild_ReturnValue' has a wrong offset!");

}

