#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InventoryViewer

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Zion_structs.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK::Params
{

// Function WBP_InventoryViewer.WBP_InventoryViewer_C.CreateInventoryPage
// 0x0050 (0x0050 - 0x0000)
struct WBP_InventoryViewer_C_CreateInventoryPage final
{
public:
	EInventoryItemType                            ItemType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UWBP_InventoryViewer_Category_C* InvetoryCategory, bool bEscapeFromBottom, int32 IndexInRow)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_InventoryEntry_C* Item)> K2Node_CreateDelegate_OutputDelegate_1;       // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventory*                             CallFunc_GetInventoryFromItemType_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemCount_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_InventoryViewer_Category_C*        CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventoryViewer_C_CreateInventoryPage) == 0x000008, "Wrong alignment on WBP_InventoryViewer_C_CreateInventoryPage");
static_assert(sizeof(WBP_InventoryViewer_C_CreateInventoryPage) == 0x000050, "Wrong size on WBP_InventoryViewer_C_CreateInventoryPage");
static_assert(offsetof(WBP_InventoryViewer_C_CreateInventoryPage, ItemType) == 0x000000, "Member 'WBP_InventoryViewer_C_CreateInventoryPage::ItemType' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_CreateInventoryPage, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_InventoryViewer_C_CreateInventoryPage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_CreateInventoryPage, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_InventoryViewer_C_CreateInventoryPage::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_CreateInventoryPage, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'WBP_InventoryViewer_C_CreateInventoryPage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_CreateInventoryPage, CallFunc_GetInventoryFromItemType_ReturnValue) == 0x000028, "Member 'WBP_InventoryViewer_C_CreateInventoryPage::CallFunc_GetInventoryFromItemType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_CreateInventoryPage, CallFunc_GetItemCount_ReturnValue) == 0x000030, "Member 'WBP_InventoryViewer_C_CreateInventoryPage::CallFunc_GetItemCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_CreateInventoryPage, CallFunc_Greater_IntInt_ReturnValue) == 0x000034, "Member 'WBP_InventoryViewer_C_CreateInventoryPage::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_CreateInventoryPage, CallFunc_Create_ReturnValue) == 0x000038, "Member 'WBP_InventoryViewer_C_CreateInventoryPage::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_CreateInventoryPage, CallFunc_AddChild_ReturnValue) == 0x000040, "Member 'WBP_InventoryViewer_C_CreateInventoryPage::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_CreateInventoryPage, CallFunc_Array_Add_ReturnValue) == 0x000048, "Member 'WBP_InventoryViewer_C_CreateInventoryPage::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WBP_InventoryViewer.WBP_InventoryViewer_C.ExecuteUbergraph_WBP_InventoryViewer
// 0x0078 (0x0078 - 0x0000)
struct WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFMODEventInstance                     CallFunc_PlayEvent2D_ReturnValue;                  // 0x0008(0x0008)(NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInventoryItemType                            CallFunc_Array_Get_Item;                           // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_InventoryEntry_C*                  K2Node_CustomEvent_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFocusedFromMouse_ReturnValue;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_InventoryViewer_Category_C*        K2Node_CustomEvent_InvetoryCategory;               // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bEscapeFromBottom;              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_IndexInRow;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_LoopAround_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventoryViewer_Category_C*        CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer) == 0x000008, "Wrong alignment on WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer");
static_assert(sizeof(WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer) == 0x000078, "Wrong size on WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer");
static_assert(offsetof(WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer, EntryPoint) == 0x000000, "Member 'WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer, CallFunc_PlayEvent2D_ReturnValue) == 0x000008, "Member 'WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer::CallFunc_PlayEvent2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer, CallFunc_Get_ReturnValue) == 0x000020, "Member 'WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer, K2Node_Event_IsDesignTime) == 0x000028, "Member 'WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer, CallFunc_Array_Get_Item) == 0x000029, "Member 'WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer, K2Node_CustomEvent_Item) == 0x000038, "Member 'WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer::K2Node_CustomEvent_Item' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer, CallFunc_IsFocusedFromMouse_ReturnValue) == 0x000040, "Member 'WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer::CallFunc_IsFocusedFromMouse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer, CallFunc_Not_PreBool_ReturnValue) == 0x000041, "Member 'WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer, K2Node_CustomEvent_InvetoryCategory) == 0x000048, "Member 'WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer::K2Node_CustomEvent_InvetoryCategory' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer, K2Node_CustomEvent_bEscapeFromBottom) == 0x000050, "Member 'WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer::K2Node_CustomEvent_bEscapeFromBottom' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer, K2Node_CustomEvent_IndexInRow) == 0x000054, "Member 'WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer::K2Node_CustomEvent_IndexInRow' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer, CallFunc_SelectInt_ReturnValue) == 0x000058, "Member 'WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer, CallFunc_Array_Length_ReturnValue_1) == 0x00005C, "Member 'WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer, CallFunc_Subtract_IntInt_ReturnValue) == 0x000060, "Member 'WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer, CallFunc_Array_Find_ReturnValue) == 0x000064, "Member 'WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer, CallFunc_Add_IntInt_ReturnValue_1) == 0x000068, "Member 'WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer, CallFunc_LoopAround_ReturnValue) == 0x00006C, "Member 'WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer::CallFunc_LoopAround_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'WBP_InventoryViewer_C_ExecuteUbergraph_WBP_InventoryViewer::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function WBP_InventoryViewer.WBP_InventoryViewer_C.OnEscapeInventoryCategory
// 0x0010 (0x0010 - 0x0000)
struct WBP_InventoryViewer_C_OnEscapeInventoryCategory final
{
public:
	class UWBP_InventoryViewer_Category_C*        InvetoryCategory;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bEscapeFromBottom;                                 // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IndexInRow;                                        // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventoryViewer_C_OnEscapeInventoryCategory) == 0x000008, "Wrong alignment on WBP_InventoryViewer_C_OnEscapeInventoryCategory");
static_assert(sizeof(WBP_InventoryViewer_C_OnEscapeInventoryCategory) == 0x000010, "Wrong size on WBP_InventoryViewer_C_OnEscapeInventoryCategory");
static_assert(offsetof(WBP_InventoryViewer_C_OnEscapeInventoryCategory, InvetoryCategory) == 0x000000, "Member 'WBP_InventoryViewer_C_OnEscapeInventoryCategory::InvetoryCategory' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_OnEscapeInventoryCategory, bEscapeFromBottom) == 0x000008, "Member 'WBP_InventoryViewer_C_OnEscapeInventoryCategory::bEscapeFromBottom' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_OnEscapeInventoryCategory, IndexInRow) == 0x00000C, "Member 'WBP_InventoryViewer_C_OnEscapeInventoryCategory::IndexInRow' has a wrong offset!");

// Function WBP_InventoryViewer.WBP_InventoryViewer_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_InventoryViewer_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	class UWBP_InventoryViewer_Category_C*        CallFunc_Array_Get_Item;                           // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventoryViewer_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_InventoryViewer_C_OnFocusReceived");
static_assert(sizeof(WBP_InventoryViewer_C_OnFocusReceived) == 0x0001B8, "Wrong size on WBP_InventoryViewer_C_OnFocusReceived");
static_assert(offsetof(WBP_InventoryViewer_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_InventoryViewer_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_InventoryViewer_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_InventoryViewer_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_InventoryViewer_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_InventoryViewer_C_OnFocusReceived, CallFunc_Array_Get_Item) == 0x0001B0, "Member 'WBP_InventoryViewer_C_OnFocusReceived::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_InventoryViewer.WBP_InventoryViewer_C.OnInventoryItemFocused
// 0x0008 (0x0008 - 0x0000)
struct WBP_InventoryViewer_C_OnInventoryItemFocused final
{
public:
	class UWBP_InventoryEntry_C*                  Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventoryViewer_C_OnInventoryItemFocused) == 0x000008, "Wrong alignment on WBP_InventoryViewer_C_OnInventoryItemFocused");
static_assert(sizeof(WBP_InventoryViewer_C_OnInventoryItemFocused) == 0x000008, "Wrong size on WBP_InventoryViewer_C_OnInventoryItemFocused");
static_assert(offsetof(WBP_InventoryViewer_C_OnInventoryItemFocused, Item) == 0x000000, "Member 'WBP_InventoryViewer_C_OnInventoryItemFocused::Item' has a wrong offset!");

// Function WBP_InventoryViewer.WBP_InventoryViewer_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_InventoryViewer_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_InventoryViewer_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_InventoryViewer_C_PreConstruct");
static_assert(sizeof(WBP_InventoryViewer_C_PreConstruct) == 0x000001, "Wrong size on WBP_InventoryViewer_C_PreConstruct");
static_assert(offsetof(WBP_InventoryViewer_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_InventoryViewer_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

