#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugMenu_SpawnList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_DebugMenu_SpawnList.WBP_DebugMenu_SpawnList_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_DebugMenu_SpawnList_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_SpawnList_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_DebugMenu_SpawnList_C_OnFocusReceived");
static_assert(sizeof(WBP_DebugMenu_SpawnList_C_OnFocusReceived) == 0x0001B8, "Wrong size on WBP_DebugMenu_SpawnList_C_OnFocusReceived");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_DebugMenu_SpawnList_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_DebugMenu_SpawnList_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_DebugMenu_SpawnList_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_DebugMenu_SpawnList_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_OnFocusReceived, CallFunc_GetChildAt_ReturnValue) == 0x0001B0, "Member 'WBP_DebugMenu_SpawnList_C_OnFocusReceived::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");

// Function WBP_DebugMenu_SpawnList.WBP_DebugMenu_SpawnList_C.OnButtonPressed
// 0x0008 (0x0008 - 0x0000)
struct WBP_DebugMenu_SpawnList_C_OnButtonPressed final
{
public:
	class UWBP_DebugMenu_Element_ItemButton_C*    ItemButton;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_SpawnList_C_OnButtonPressed) == 0x000008, "Wrong alignment on WBP_DebugMenu_SpawnList_C_OnButtonPressed");
static_assert(sizeof(WBP_DebugMenu_SpawnList_C_OnButtonPressed) == 0x000008, "Wrong size on WBP_DebugMenu_SpawnList_C_OnButtonPressed");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_OnButtonPressed, ItemButton) == 0x000000, "Member 'WBP_DebugMenu_SpawnList_C_OnButtonPressed::ItemButton' has a wrong offset!");

// Function WBP_DebugMenu_SpawnList.WBP_DebugMenu_SpawnList_C.GenerateLabel
// 0x0180 (0x0180 - 0x0000)
struct WBP_DebugMenu_SpawnList_C_GenerateLabel final
{
public:
	struct FDataTableRowHandle                    RowHandle;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	class FText                                   Result;                                            // 0x0010(0x0010)(Parm, OutParm)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0028(0x0010)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00B0(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x00F8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0108(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0150(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0160(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x0170(0x0010)()
};
static_assert(alignof(WBP_DebugMenu_SpawnList_C_GenerateLabel) == 0x000008, "Wrong alignment on WBP_DebugMenu_SpawnList_C_GenerateLabel");
static_assert(sizeof(WBP_DebugMenu_SpawnList_C_GenerateLabel) == 0x000180, "Wrong size on WBP_DebugMenu_SpawnList_C_GenerateLabel");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_GenerateLabel, RowHandle) == 0x000000, "Member 'WBP_DebugMenu_SpawnList_C_GenerateLabel::RowHandle' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_GenerateLabel, Result) == 0x000010, "Member 'WBP_DebugMenu_SpawnList_C_GenerateLabel::Result' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_GenerateLabel, Temp_bool_Variable) == 0x000020, "Member 'WBP_DebugMenu_SpawnList_C_GenerateLabel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_GenerateLabel, CallFunc_Conv_NameToText_ReturnValue) == 0x000028, "Member 'WBP_DebugMenu_SpawnList_C_GenerateLabel::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_GenerateLabel, CallFunc_Greater_IntInt_ReturnValue) == 0x000038, "Member 'WBP_DebugMenu_SpawnList_C_GenerateLabel::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_GenerateLabel, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'WBP_DebugMenu_SpawnList_C_GenerateLabel::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_GenerateLabel, K2Node_MakeArray_Array) == 0x000088, "Member 'WBP_DebugMenu_SpawnList_C_GenerateLabel::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_GenerateLabel, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000098, "Member 'WBP_DebugMenu_SpawnList_C_GenerateLabel::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_GenerateLabel, CallFunc_Format_ReturnValue) == 0x0000A0, "Member 'WBP_DebugMenu_SpawnList_C_GenerateLabel::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_GenerateLabel, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000B0, "Member 'WBP_DebugMenu_SpawnList_C_GenerateLabel::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_GenerateLabel, CallFunc_Conv_NameToText_ReturnValue_1) == 0x0000F8, "Member 'WBP_DebugMenu_SpawnList_C_GenerateLabel::CallFunc_Conv_NameToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_GenerateLabel, K2Node_MakeStruct_FormatArgumentData_2) == 0x000108, "Member 'WBP_DebugMenu_SpawnList_C_GenerateLabel::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_GenerateLabel, K2Node_MakeArray_Array_1) == 0x000150, "Member 'WBP_DebugMenu_SpawnList_C_GenerateLabel::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_GenerateLabel, CallFunc_Format_ReturnValue_1) == 0x000160, "Member 'WBP_DebugMenu_SpawnList_C_GenerateLabel::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_GenerateLabel, K2Node_Select_Default) == 0x000170, "Member 'WBP_DebugMenu_SpawnList_C_GenerateLabel::K2Node_Select_Default' has a wrong offset!");

// Function WBP_DebugMenu_SpawnList.WBP_DebugMenu_SpawnList_C.ExecuteUbergraph_WBP_DebugMenu_SpawnList
// 0x0090 (0x0090 - 0x0000)
struct WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_DebugMenu_Element_ItemButton_C* ItemButton)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0028(0x0010)(ReferenceParm)
	TArray<class FName>                           CallFunc_SortNames_ReturnValue;                    // 0x0038(0x0010)(ReferenceParm)
	class UWBP_DebugMenu_Element_ItemButton_C*    CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0058(0x0010)(NoDestructor)
	class FText                                   CallFunc_GenerateLabel_Result;                     // 0x0068(0x0010)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_DebugMenu_Element_ItemButton_C*    K2Node_CustomEvent_ItemButton;                     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList) == 0x000008, "Wrong alignment on WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList");
static_assert(sizeof(WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList) == 0x000090, "Wrong size on WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList, EntryPoint) == 0x000000, "Member 'WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000028, "Member 'WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList, CallFunc_SortNames_ReturnValue) == 0x000038, "Member 'WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList::CallFunc_SortNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList, CallFunc_Create_ReturnValue) == 0x000048, "Member 'WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList, CallFunc_Array_Get_Item) == 0x000050, "Member 'WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList, K2Node_MakeStruct_DataTableRowHandle) == 0x000058, "Member 'WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList, CallFunc_GenerateLabel_Result) == 0x000068, "Member 'WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList::CallFunc_GenerateLabel_Result' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList, K2Node_CustomEvent_ItemButton) == 0x000080, "Member 'WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList::K2Node_CustomEvent_ItemButton' has a wrong offset!");
static_assert(offsetof(WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'WBP_DebugMenu_SpawnList_C_ExecuteUbergraph_WBP_DebugMenu_SpawnList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

