#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlayerUI.WBP_PlayerUI_C
// 0x0078 (0x0508 - 0x0490)
class UWBP_PlayerUI_C final : public UUserWidgetPlayerUI
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hide;                                              // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Show;                                              // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           Canvas_Anchor;                                     // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LowHPFeedbackOverlay;                              // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CurrencyCounter_C*                 WBP_CurrencyCounter_Default;                       // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CurrencyCounter_C*                 WBP_CurrencyCounter_Rare;                          // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EXPGauge_C*                        WBP_EXPGauge;                                      // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HealingItems_C*                    WBP_HealingItems;                                  // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LowHPFeedback_C*                   WBP_LowHPFeedback;                                 // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerHPGauge_C*                   WBP_PlayerHPGauge;                                 // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerSPGauge_C*                   WBP_PlayerSPGauge;                                 // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SkillSet_C*                        WBP_SkillSet;                                      // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatusEffects_C*                   WBP_StatusEffects;                                 // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ACharacterZion*                         Character;                                         // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_PlayerUI(int32 EntryPoint);
	void HideUI(bool bInstant);
	void Initialize();
	void InpActEvt_IA_Minimap_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void OnConstraintHUDAspectRatioChanged();
	void OnEvaluate_Show();
	void OnPlayerInputLocked();
	void OnRefreshLowHPFeedbackOpacity(float Opacity);
	void OnRefreshPlayerUIVisibility(bool bVisible);
	void RefreshHealVisibility();
	void RefreshSPVisibility();
	void SequenceEvent__ENTRYPOINTWBP_PlayerUI();
	void ShowUI();
	void TriggerAnimation_HealFailure_FullHP();
	void TriggerAnimation_HealFailure_NoHeal();
	void UpdateAnchors();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PlayerUI_C">();
	}
	static class UWBP_PlayerUI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlayerUI_C>();
	}
};
static_assert(alignof(UWBP_PlayerUI_C) == 0x000008, "Wrong alignment on UWBP_PlayerUI_C");
static_assert(sizeof(UWBP_PlayerUI_C) == 0x000508, "Wrong size on UWBP_PlayerUI_C");
static_assert(offsetof(UWBP_PlayerUI_C, UberGraphFrame) == 0x000490, "Member 'UWBP_PlayerUI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerUI_C, Hide) == 0x000498, "Member 'UWBP_PlayerUI_C::Hide' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerUI_C, Show) == 0x0004A0, "Member 'UWBP_PlayerUI_C::Show' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerUI_C, Canvas_Anchor) == 0x0004A8, "Member 'UWBP_PlayerUI_C::Canvas_Anchor' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerUI_C, LowHPFeedbackOverlay) == 0x0004B0, "Member 'UWBP_PlayerUI_C::LowHPFeedbackOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerUI_C, WBP_CurrencyCounter_Default) == 0x0004B8, "Member 'UWBP_PlayerUI_C::WBP_CurrencyCounter_Default' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerUI_C, WBP_CurrencyCounter_Rare) == 0x0004C0, "Member 'UWBP_PlayerUI_C::WBP_CurrencyCounter_Rare' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerUI_C, WBP_EXPGauge) == 0x0004C8, "Member 'UWBP_PlayerUI_C::WBP_EXPGauge' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerUI_C, WBP_HealingItems) == 0x0004D0, "Member 'UWBP_PlayerUI_C::WBP_HealingItems' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerUI_C, WBP_LowHPFeedback) == 0x0004D8, "Member 'UWBP_PlayerUI_C::WBP_LowHPFeedback' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerUI_C, WBP_PlayerHPGauge) == 0x0004E0, "Member 'UWBP_PlayerUI_C::WBP_PlayerHPGauge' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerUI_C, WBP_PlayerSPGauge) == 0x0004E8, "Member 'UWBP_PlayerUI_C::WBP_PlayerSPGauge' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerUI_C, WBP_SkillSet) == 0x0004F0, "Member 'UWBP_PlayerUI_C::WBP_SkillSet' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerUI_C, WBP_StatusEffects) == 0x0004F8, "Member 'UWBP_PlayerUI_C::WBP_StatusEffects' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerUI_C, Character) == 0x000500, "Member 'UWBP_PlayerUI_C::Character' has a wrong offset!");

}

