#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WorldSpace_Gauge

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_WorldSpace_Gauge.WBP_WorldSpace_Gauge_C.BindBurnEvents
// 0x0038 (0x0038 - 0x0000)
struct WBP_WorldSpace_Gauge_C_BindBurnEvents final
{
public:
	class AActor*                                 Target_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStatBurnComponent*                     CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrRatio_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldSpace_Gauge_C_BindBurnEvents) == 0x000008, "Wrong alignment on WBP_WorldSpace_Gauge_C_BindBurnEvents");
static_assert(sizeof(WBP_WorldSpace_Gauge_C_BindBurnEvents) == 0x000038, "Wrong size on WBP_WorldSpace_Gauge_C_BindBurnEvents");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindBurnEvents, Target_0) == 0x000000, "Member 'WBP_WorldSpace_Gauge_C_BindBurnEvents::Target_0' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindBurnEvents, Temp_bool_Variable) == 0x000008, "Member 'WBP_WorldSpace_Gauge_C_BindBurnEvents::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindBurnEvents, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'WBP_WorldSpace_Gauge_C_BindBurnEvents::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindBurnEvents, Temp_byte_Variable) == 0x000018, "Member 'WBP_WorldSpace_Gauge_C_BindBurnEvents::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindBurnEvents, Temp_byte_Variable_1) == 0x000019, "Member 'WBP_WorldSpace_Gauge_C_BindBurnEvents::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindBurnEvents, CallFunc_GetCurrRatio_ReturnValue) == 0x00001C, "Member 'WBP_WorldSpace_Gauge_C_BindBurnEvents::CallFunc_GetCurrRatio_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindBurnEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WBP_WorldSpace_Gauge_C_BindBurnEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindBurnEvents, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_WorldSpace_Gauge_C_BindBurnEvents::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindBurnEvents, K2Node_Select_Default) == 0x000031, "Member 'WBP_WorldSpace_Gauge_C_BindBurnEvents::K2Node_Select_Default' has a wrong offset!");

// Function WBP_WorldSpace_Gauge.WBP_WorldSpace_Gauge_C.BindFreezeEvents
// 0x0038 (0x0038 - 0x0000)
struct WBP_WorldSpace_Gauge_C_BindFreezeEvents final
{
public:
	class AActor*                                 Target_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStatFreezeComponent*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrRatio_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldSpace_Gauge_C_BindFreezeEvents) == 0x000008, "Wrong alignment on WBP_WorldSpace_Gauge_C_BindFreezeEvents");
static_assert(sizeof(WBP_WorldSpace_Gauge_C_BindFreezeEvents) == 0x000038, "Wrong size on WBP_WorldSpace_Gauge_C_BindFreezeEvents");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindFreezeEvents, Target_0) == 0x000000, "Member 'WBP_WorldSpace_Gauge_C_BindFreezeEvents::Target_0' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindFreezeEvents, Temp_bool_Variable) == 0x000008, "Member 'WBP_WorldSpace_Gauge_C_BindFreezeEvents::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindFreezeEvents, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'WBP_WorldSpace_Gauge_C_BindFreezeEvents::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindFreezeEvents, Temp_byte_Variable) == 0x000018, "Member 'WBP_WorldSpace_Gauge_C_BindFreezeEvents::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindFreezeEvents, Temp_byte_Variable_1) == 0x000019, "Member 'WBP_WorldSpace_Gauge_C_BindFreezeEvents::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindFreezeEvents, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'WBP_WorldSpace_Gauge_C_BindFreezeEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindFreezeEvents, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'WBP_WorldSpace_Gauge_C_BindFreezeEvents::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindFreezeEvents, CallFunc_GetCurrRatio_ReturnValue) == 0x000030, "Member 'WBP_WorldSpace_Gauge_C_BindFreezeEvents::CallFunc_GetCurrRatio_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindFreezeEvents, K2Node_Select_Default) == 0x000034, "Member 'WBP_WorldSpace_Gauge_C_BindFreezeEvents::K2Node_Select_Default' has a wrong offset!");

// Function WBP_WorldSpace_Gauge.WBP_WorldSpace_Gauge_C.BindHPEvents
// 0x0028 (0x0028 - 0x0000)
struct WBP_WorldSpace_Gauge_C_BindHPEvents final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStatHPComponent*                       CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrRatio_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldSpace_Gauge_C_BindHPEvents) == 0x000008, "Wrong alignment on WBP_WorldSpace_Gauge_C_BindHPEvents");
static_assert(sizeof(WBP_WorldSpace_Gauge_C_BindHPEvents) == 0x000028, "Wrong size on WBP_WorldSpace_Gauge_C_BindHPEvents");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindHPEvents, Actor) == 0x000000, "Member 'WBP_WorldSpace_Gauge_C_BindHPEvents::Actor' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindHPEvents, CallFunc_GetComponentByClass_ReturnValue) == 0x000008, "Member 'WBP_WorldSpace_Gauge_C_BindHPEvents::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindHPEvents, CallFunc_GetCurrRatio_ReturnValue) == 0x000010, "Member 'WBP_WorldSpace_Gauge_C_BindHPEvents::CallFunc_GetCurrRatio_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindHPEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'WBP_WorldSpace_Gauge_C_BindHPEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindHPEvents, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'WBP_WorldSpace_Gauge_C_BindHPEvents::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_WorldSpace_Gauge.WBP_WorldSpace_Gauge_C.BindShockEvents
// 0x0038 (0x0038 - 0x0000)
struct WBP_WorldSpace_Gauge_C_BindShockEvents final
{
public:
	class AActor*                                 Target_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStatShockComponent*                    CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrRatio_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldSpace_Gauge_C_BindShockEvents) == 0x000008, "Wrong alignment on WBP_WorldSpace_Gauge_C_BindShockEvents");
static_assert(sizeof(WBP_WorldSpace_Gauge_C_BindShockEvents) == 0x000038, "Wrong size on WBP_WorldSpace_Gauge_C_BindShockEvents");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindShockEvents, Target_0) == 0x000000, "Member 'WBP_WorldSpace_Gauge_C_BindShockEvents::Target_0' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindShockEvents, Temp_bool_Variable) == 0x000008, "Member 'WBP_WorldSpace_Gauge_C_BindShockEvents::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindShockEvents, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'WBP_WorldSpace_Gauge_C_BindShockEvents::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindShockEvents, Temp_byte_Variable) == 0x000018, "Member 'WBP_WorldSpace_Gauge_C_BindShockEvents::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindShockEvents, Temp_byte_Variable_1) == 0x000019, "Member 'WBP_WorldSpace_Gauge_C_BindShockEvents::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindShockEvents, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'WBP_WorldSpace_Gauge_C_BindShockEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindShockEvents, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'WBP_WorldSpace_Gauge_C_BindShockEvents::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindShockEvents, CallFunc_GetCurrRatio_ReturnValue) == 0x000030, "Member 'WBP_WorldSpace_Gauge_C_BindShockEvents::CallFunc_GetCurrRatio_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindShockEvents, K2Node_Select_Default) == 0x000034, "Member 'WBP_WorldSpace_Gauge_C_BindShockEvents::K2Node_Select_Default' has a wrong offset!");

// Function WBP_WorldSpace_Gauge.WBP_WorldSpace_Gauge_C.BindStaminaEvents
// 0x0060 (0x0060 - 0x0000)
struct WBP_WorldSpace_Gauge_C_BindStaminaEvents final
{
public:
	class AActor*                                 Target_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStatStaminaComponent*                  CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInvincible_ReturnValue;                 // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrRatio_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldSpace_Gauge_C_BindStaminaEvents) == 0x000008, "Wrong alignment on WBP_WorldSpace_Gauge_C_BindStaminaEvents");
static_assert(sizeof(WBP_WorldSpace_Gauge_C_BindStaminaEvents) == 0x000060, "Wrong size on WBP_WorldSpace_Gauge_C_BindStaminaEvents");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindStaminaEvents, Target_0) == 0x000000, "Member 'WBP_WorldSpace_Gauge_C_BindStaminaEvents::Target_0' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindStaminaEvents, CallFunc_GetComponentByClass_ReturnValue) == 0x000008, "Member 'WBP_WorldSpace_Gauge_C_BindStaminaEvents::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindStaminaEvents, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_WorldSpace_Gauge_C_BindStaminaEvents::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindStaminaEvents, CallFunc_IsEnabled_ReturnValue) == 0x000011, "Member 'WBP_WorldSpace_Gauge_C_BindStaminaEvents::CallFunc_IsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindStaminaEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'WBP_WorldSpace_Gauge_C_BindStaminaEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindStaminaEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'WBP_WorldSpace_Gauge_C_BindStaminaEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindStaminaEvents, CallFunc_IsInvincible_ReturnValue) == 0x000034, "Member 'WBP_WorldSpace_Gauge_C_BindStaminaEvents::CallFunc_IsInvincible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindStaminaEvents, K2Node_CreateDelegate_OutputDelegate_2) == 0x000038, "Member 'WBP_WorldSpace_Gauge_C_BindStaminaEvents::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindStaminaEvents, CallFunc_GetCurrRatio_ReturnValue) == 0x000048, "Member 'WBP_WorldSpace_Gauge_C_BindStaminaEvents::CallFunc_GetCurrRatio_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_BindStaminaEvents, K2Node_CreateDelegate_OutputDelegate_3) == 0x00004C, "Member 'WBP_WorldSpace_Gauge_C_BindStaminaEvents::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");

// Function WBP_WorldSpace_Gauge.WBP_WorldSpace_Gauge_C.CanShow
// 0x0004 (0x0004 - 0x0000)
struct WBP_WorldSpace_Gauge_C_CanShow final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldSpace_Gauge_C_CanShow) == 0x000001, "Wrong alignment on WBP_WorldSpace_Gauge_C_CanShow");
static_assert(sizeof(WBP_WorldSpace_Gauge_C_CanShow) == 0x000004, "Wrong size on WBP_WorldSpace_Gauge_C_CanShow");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_CanShow, ReturnValue) == 0x000000, "Member 'WBP_WorldSpace_Gauge_C_CanShow::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_CanShow, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'WBP_WorldSpace_Gauge_C_CanShow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_CanShow, CallFunc_IsDead_ReturnValue) == 0x000002, "Member 'WBP_WorldSpace_Gauge_C_CanShow::CallFunc_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_CanShow, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'WBP_WorldSpace_Gauge_C_CanShow::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_WorldSpace_Gauge.WBP_WorldSpace_Gauge_C.ExecuteUbergraph_WBP_WorldSpace_Gauge
// 0x0110 (0x0110 - 0x0000)
struct WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrRatio_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Actor, EEndPlayReason EndPlayReason)> K2Node_CreateDelegate_OutputDelegate; // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_CustomEvent_EndPlayReason;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* Actor, EEndPlayReason EndPlayReason)> K2Node_CreateDelegate_OutputDelegate_1; // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Actor;                                // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDeathComponent*                        CallFunc_GetComponentByClass_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrRatio_ReturnValue_1;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrRatio_ReturnValue_2;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrRatio_ReturnValue_3;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrRatio_ReturnValue_4;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrRatio_ReturnValue_5;               // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrRatio_ReturnValue_6;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SetStaminaDecreaseEffect_NewStaminaRatio_ImplicitCast; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_PrevStaminaRatio_ImplicitCast;  // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_PrevHPRatio_ImplicitCast;       // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast_1;    // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_PrevStaminaRatio_ImplicitCast_1; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_PrevHPRatio_ImplicitCast_1;     // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge) == 0x000008, "Wrong alignment on WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge");
static_assert(sizeof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge) == 0x000110, "Wrong size on WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, EntryPoint) == 0x000000, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, CallFunc_GetCurrRatio_ReturnValue) == 0x000008, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::CallFunc_GetCurrRatio_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, K2Node_CustomEvent_Actor) == 0x000020, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, K2Node_CustomEvent_EndPlayReason) == 0x000028, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::K2Node_CustomEvent_EndPlayReason' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000040, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, K2Node_Event_Actor) == 0x000048, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, CallFunc_GetComponentByClass_ReturnValue) == 0x000050, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, CallFunc_IsValid_ReturnValue_2) == 0x000059, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, CallFunc_GetCurrRatio_ReturnValue_1) == 0x00005C, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::CallFunc_GetCurrRatio_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000060, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, CallFunc_PlayAnimation_ReturnValue) == 0x000068, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, CallFunc_IsValid_ReturnValue_3) == 0x000070, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, CallFunc_GetCurrRatio_ReturnValue_2) == 0x000074, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::CallFunc_GetCurrRatio_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, CallFunc_PlayAnimation_ReturnValue_1) == 0x000078, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000080, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, CallFunc_IsValid_ReturnValue_4) == 0x000081, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, CallFunc_GetCurrRatio_ReturnValue_3) == 0x000084, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::CallFunc_GetCurrRatio_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000088, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, CallFunc_IsValid_ReturnValue_5) == 0x000089, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, CallFunc_GetCurrRatio_ReturnValue_4) == 0x00008C, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::CallFunc_GetCurrRatio_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, CallFunc_IsValid_ReturnValue_6) == 0x000090, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, CallFunc_GetCurrRatio_ReturnValue_5) == 0x000094, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::CallFunc_GetCurrRatio_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, CallFunc_PlayAnimation_ReturnValue_2) == 0x000098, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, CallFunc_PlayAnimation_ReturnValue_3) == 0x0000A0, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000A8, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000B8, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, CallFunc_GetCurrRatio_ReturnValue_6) == 0x0000C8, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::CallFunc_GetCurrRatio_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, CallFunc_IsValid_ReturnValue_7) == 0x0000CC, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, CallFunc_SetStaminaDecreaseEffect_NewStaminaRatio_ImplicitCast) == 0x0000D0, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::CallFunc_SetStaminaDecreaseEffect_NewStaminaRatio_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, K2Node_VariableSet_PrevStaminaRatio_ImplicitCast) == 0x0000D8, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::K2Node_VariableSet_PrevStaminaRatio_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x0000E0, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, K2Node_VariableSet_PrevHPRatio_ImplicitCast) == 0x0000E8, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::K2Node_VariableSet_PrevHPRatio_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, CallFunc_Greater_DoubleDouble_B_ImplicitCast_1) == 0x0000F0, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::CallFunc_Greater_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x0000F8, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, K2Node_VariableSet_PrevStaminaRatio_ImplicitCast_1) == 0x000100, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::K2Node_VariableSet_PrevStaminaRatio_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge, K2Node_VariableSet_PrevHPRatio_ImplicitCast_1) == 0x000108, "Member 'WBP_WorldSpace_Gauge_C_ExecuteUbergraph_WBP_WorldSpace_Gauge::K2Node_VariableSet_PrevHPRatio_ImplicitCast_1' has a wrong offset!");

// Function WBP_WorldSpace_Gauge.WBP_WorldSpace_Gauge_C.OnEndPlay
// 0x0010 (0x0010 - 0x0000)
struct WBP_WorldSpace_Gauge_C_OnEndPlay final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                EndPlayReason;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldSpace_Gauge_C_OnEndPlay) == 0x000008, "Wrong alignment on WBP_WorldSpace_Gauge_C_OnEndPlay");
static_assert(sizeof(WBP_WorldSpace_Gauge_C_OnEndPlay) == 0x000010, "Wrong size on WBP_WorldSpace_Gauge_C_OnEndPlay");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_OnEndPlay, Actor) == 0x000000, "Member 'WBP_WorldSpace_Gauge_C_OnEndPlay::Actor' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_OnEndPlay, EndPlayReason) == 0x000008, "Member 'WBP_WorldSpace_Gauge_C_OnEndPlay::EndPlayReason' has a wrong offset!");

// Function WBP_WorldSpace_Gauge.WBP_WorldSpace_Gauge_C.RefreshSettingsVisibility
// 0x0018 (0x0018 - 0x0000)
struct WBP_WorldSpace_Gauge_C_RefreshSettingsVisibility final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingsSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDisplayEnemyGauges_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldSpace_Gauge_C_RefreshSettingsVisibility) == 0x000008, "Wrong alignment on WBP_WorldSpace_Gauge_C_RefreshSettingsVisibility");
static_assert(sizeof(WBP_WorldSpace_Gauge_C_RefreshSettingsVisibility) == 0x000018, "Wrong size on WBP_WorldSpace_Gauge_C_RefreshSettingsVisibility");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_RefreshSettingsVisibility, Temp_bool_Variable) == 0x000000, "Member 'WBP_WorldSpace_Gauge_C_RefreshSettingsVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_RefreshSettingsVisibility, Temp_byte_Variable) == 0x000001, "Member 'WBP_WorldSpace_Gauge_C_RefreshSettingsVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_RefreshSettingsVisibility, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_WorldSpace_Gauge_C_RefreshSettingsVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_RefreshSettingsVisibility, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_WorldSpace_Gauge_C_RefreshSettingsVisibility::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_RefreshSettingsVisibility, CallFunc_GetDisplayEnemyGauges_ReturnValue) == 0x000010, "Member 'WBP_WorldSpace_Gauge_C_RefreshSettingsVisibility::CallFunc_GetDisplayEnemyGauges_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_RefreshSettingsVisibility, K2Node_Select_Default) == 0x000011, "Member 'WBP_WorldSpace_Gauge_C_RefreshSettingsVisibility::K2Node_Select_Default' has a wrong offset!");

// Function WBP_WorldSpace_Gauge.WBP_WorldSpace_Gauge_C.SetStaminaDecreaseEffect
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect final
{
public:
	double                                        NewStaminaRatio;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       Slot_0;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_B_ImplicitCast;                      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_B_ImplicitCast_1;                    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect) == 0x000008, "Wrong alignment on WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect");
static_assert(sizeof(WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect) == 0x0000A0, "Wrong size on WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect, NewStaminaRatio) == 0x000000, "Member 'WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect::NewStaminaRatio' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect, Slot_0) == 0x000008, "Member 'WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect::Slot_0' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect, CallFunc_Lerp_ReturnValue) == 0x000010, "Member 'WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect, CallFunc_GetSize_ReturnValue) == 0x000018, "Member 'WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect, CallFunc_BreakVector2D_X) == 0x000028, "Member 'WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect, CallFunc_BreakVector2D_Y) == 0x000030, "Member 'WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect, CallFunc_GetPosition_ReturnValue) == 0x000038, "Member 'WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect, CallFunc_BreakVector2D_X_1) == 0x000048, "Member 'WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect, CallFunc_BreakVector2D_Y_1) == 0x000050, "Member 'WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect, CallFunc_MakeVector2D_ReturnValue) == 0x000058, "Member 'WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000068, "Member 'WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect, CallFunc_Lerp_ReturnValue_1) == 0x000070, "Member 'WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000078, "Member 'WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect, CallFunc_MakeVector2D_ReturnValue_1) == 0x000080, "Member 'WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect, CallFunc_Lerp_B_ImplicitCast) == 0x000090, "Member 'WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect::CallFunc_Lerp_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect, CallFunc_Lerp_B_ImplicitCast_1) == 0x000098, "Member 'WBP_WorldSpace_Gauge_C_SetStaminaDecreaseEffect::CallFunc_Lerp_B_ImplicitCast_1' has a wrong offset!");

// Function WBP_WorldSpace_Gauge.WBP_WorldSpace_Gauge_C.SetTargetActor
// 0x0008 (0x0008 - 0x0000)
struct WBP_WorldSpace_Gauge_C_SetTargetActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldSpace_Gauge_C_SetTargetActor) == 0x000008, "Wrong alignment on WBP_WorldSpace_Gauge_C_SetTargetActor");
static_assert(sizeof(WBP_WorldSpace_Gauge_C_SetTargetActor) == 0x000008, "Wrong size on WBP_WorldSpace_Gauge_C_SetTargetActor");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_SetTargetActor, Actor) == 0x000000, "Member 'WBP_WorldSpace_Gauge_C_SetTargetActor::Actor' has a wrong offset!");

// Function WBP_WorldSpace_Gauge.WBP_WorldSpace_Gauge_C.TryShow
// 0x0010 (0x0010 - 0x0000)
struct WBP_WorldSpace_Gauge_C_TryShow final
{
public:
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanShow_ReturnValue;                      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldSpace_Gauge_C_TryShow) == 0x000008, "Wrong alignment on WBP_WorldSpace_Gauge_C_TryShow");
static_assert(sizeof(WBP_WorldSpace_Gauge_C_TryShow) == 0x000010, "Wrong size on WBP_WorldSpace_Gauge_C_TryShow");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_TryShow, CallFunc_GetConsoleVariableBoolValue_ReturnValue) == 0x000000, "Member 'WBP_WorldSpace_Gauge_C_TryShow::CallFunc_GetConsoleVariableBoolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_TryShow, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'WBP_WorldSpace_Gauge_C_TryShow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_TryShow, CallFunc_IsVisible_ReturnValue) == 0x000002, "Member 'WBP_WorldSpace_Gauge_C_TryShow::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_TryShow, CallFunc_CanShow_ReturnValue) == 0x000003, "Member 'WBP_WorldSpace_Gauge_C_TryShow::CallFunc_CanShow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_TryShow, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'WBP_WorldSpace_Gauge_C_TryShow::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_TryShow, CallFunc_BooleanAND_ReturnValue) == 0x000005, "Member 'WBP_WorldSpace_Gauge_C_TryShow::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_TryShow, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'WBP_WorldSpace_Gauge_C_TryShow::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_WorldSpace_Gauge.WBP_WorldSpace_Gauge_C.UnbindBurnEvents
// 0x0014 (0x0014 - 0x0000)
struct WBP_WorldSpace_Gauge_C_UnbindBurnEvents final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldSpace_Gauge_C_UnbindBurnEvents) == 0x000004, "Wrong alignment on WBP_WorldSpace_Gauge_C_UnbindBurnEvents");
static_assert(sizeof(WBP_WorldSpace_Gauge_C_UnbindBurnEvents) == 0x000014, "Wrong size on WBP_WorldSpace_Gauge_C_UnbindBurnEvents");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_UnbindBurnEvents, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_WorldSpace_Gauge_C_UnbindBurnEvents::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WorldSpace_Gauge_C_UnbindBurnEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_WorldSpace_Gauge_C_UnbindBurnEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_WorldSpace_Gauge.WBP_WorldSpace_Gauge_C.UnbindFreezeEvents
// 0x0014 (0x0014 - 0x0000)
struct WBP_WorldSpace_Gauge_C_UnbindFreezeEvents final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
