#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HealingItems

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_HealingItems.WBP_HealingItems_C.RefreshButtonState
// 0x0020 (0x0020 - 0x0000)
struct WBP_HealingItems_C_RefreshButtonState final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrRatio_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRemainingHealCount_ReturnValue;        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HealingItems_C_RefreshButtonState) == 0x000008, "Wrong alignment on WBP_HealingItems_C_RefreshButtonState");
static_assert(sizeof(WBP_HealingItems_C_RefreshButtonState) == 0x000020, "Wrong size on WBP_HealingItems_C_RefreshButtonState");
static_assert(offsetof(WBP_HealingItems_C_RefreshButtonState, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'WBP_HealingItems_C_RefreshButtonState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HealingItems_C_RefreshButtonState, CallFunc_GetCurrRatio_ReturnValue) == 0x000004, "Member 'WBP_HealingItems_C_RefreshButtonState::CallFunc_GetCurrRatio_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HealingItems_C_RefreshButtonState, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_HealingItems_C_RefreshButtonState::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HealingItems_C_RefreshButtonState, CallFunc_GetRemainingHealCount_ReturnValue) == 0x00000C, "Member 'WBP_HealingItems_C_RefreshButtonState::CallFunc_GetRemainingHealCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HealingItems_C_RefreshButtonState, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'WBP_HealingItems_C_RefreshButtonState::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HealingItems_C_RefreshButtonState, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'WBP_HealingItems_C_RefreshButtonState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HealingItems_C_RefreshButtonState, CallFunc_BooleanAND_ReturnValue) == 0x000012, "Member 'WBP_HealingItems_C_RefreshButtonState::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HealingItems_C_RefreshButtonState, CallFunc_IsValid_ReturnValue_1) == 0x000013, "Member 'WBP_HealingItems_C_RefreshButtonState::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HealingItems_C_RefreshButtonState, CallFunc_BooleanAND_ReturnValue_1) == 0x000014, "Member 'WBP_HealingItems_C_RefreshButtonState::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HealingItems_C_RefreshButtonState, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000018, "Member 'WBP_HealingItems_C_RefreshButtonState::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_HealingItems.WBP_HealingItems_C.OnRestoreHealingItems
// 0x0004 (0x0004 - 0x0000)
struct WBP_HealingItems_C_OnRestoreHealingItems final
{
public:
	int32                                         RestoreCount;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HealingItems_C_OnRestoreHealingItems) == 0x000004, "Wrong alignment on WBP_HealingItems_C_OnRestoreHealingItems");
static_assert(sizeof(WBP_HealingItems_C_OnRestoreHealingItems) == 0x000004, "Wrong size on WBP_HealingItems_C_OnRestoreHealingItems");
static_assert(offsetof(WBP_HealingItems_C_OnRestoreHealingItems, RestoreCount) == 0x000000, "Member 'WBP_HealingItems_C_OnRestoreHealingItems::RestoreCount' has a wrong offset!");

// Function WBP_HealingItems.WBP_HealingItems_C.RefreshButtonVisibility
// 0x000C (0x000C - 0x0000)
struct WBP_HealingItems_C_RefreshButtonVisibility final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMaxHealCount_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HealingItems_C_RefreshButtonVisibility) == 0x000004, "Wrong alignment on WBP_HealingItems_C_RefreshButtonVisibility");
static_assert(sizeof(WBP_HealingItems_C_RefreshButtonVisibility) == 0x00000C, "Wrong size on WBP_HealingItems_C_RefreshButtonVisibility");
static_assert(offsetof(WBP_HealingItems_C_RefreshButtonVisibility, Temp_bool_Variable) == 0x000000, "Member 'WBP_HealingItems_C_RefreshButtonVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HealingItems_C_RefreshButtonVisibility, Temp_byte_Variable) == 0x000001, "Member 'WBP_HealingItems_C_RefreshButtonVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HealingItems_C_RefreshButtonVisibility, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_HealingItems_C_RefreshButtonVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HealingItems_C_RefreshButtonVisibility, CallFunc_GetMaxHealCount_ReturnValue) == 0x000004, "Member 'WBP_HealingItems_C_RefreshButtonVisibility::CallFunc_GetMaxHealCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HealingItems_C_RefreshButtonVisibility, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_HealingItems_C_RefreshButtonVisibility::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HealingItems_C_RefreshButtonVisibility, K2Node_Select_Default) == 0x000009, "Member 'WBP_HealingItems_C_RefreshButtonVisibility::K2Node_Select_Default' has a wrong offset!");

// Function WBP_HealingItems.WBP_HealingItems_C.BuildItem
// 0x0001 (0x0001 - 0x0000)
struct WBP_HealingItems_C_BuildItem final
{
public:
	bool                                          IsUsed;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HealingItems_C_BuildItem) == 0x000001, "Wrong alignment on WBP_HealingItems_C_BuildItem");
static_assert(sizeof(WBP_HealingItems_C_BuildItem) == 0x000001, "Wrong size on WBP_HealingItems_C_BuildItem");
static_assert(offsetof(WBP_HealingItems_C_BuildItem, IsUsed) == 0x000000, "Member 'WBP_HealingItems_C_BuildItem::IsUsed' has a wrong offset!");

// Function WBP_HealingItems.WBP_HealingItems_C.Initialize
// 0x0008 (0x0008 - 0x0000)
struct WBP_HealingItems_C_Initialize final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HealingItems_C_Initialize) == 0x000008, "Wrong alignment on WBP_HealingItems_C_Initialize");
static_assert(sizeof(WBP_HealingItems_C_Initialize) == 0x000008, "Wrong size on WBP_HealingItems_C_Initialize");
static_assert(offsetof(WBP_HealingItems_C_Initialize, Pawn) == 0x000000, "Member 'WBP_HealingItems_C_Initialize::Pawn' has a wrong offset!");

// Function WBP_HealingItems.WBP_HealingItems_C.BindEvents
// 0x0050 (0x0050 - 0x0000)
struct WBP_HealingItems_C_BindEvents final
{
public:
	TDelegate<void(int32 RestoredHealCount)>      K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HealingItems_C_BindEvents) == 0x000004, "Wrong alignment on WBP_HealingItems_C_BindEvents");
static_assert(sizeof(WBP_HealingItems_C_BindEvents) == 0x000050, "Wrong size on WBP_HealingItems_C_BindEvents");
static_assert(offsetof(WBP_HealingItems_C_BindEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_HealingItems_C_BindEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_HealingItems_C_BindEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'WBP_HealingItems_C_BindEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_HealingItems_C_BindEvents, K2Node_CreateDelegate_OutputDelegate_2) == 0x000020, "Member 'WBP_HealingItems_C_BindEvents::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_HealingItems_C_BindEvents, K2Node_CreateDelegate_OutputDelegate_3) == 0x000030, "Member 'WBP_HealingItems_C_BindEvents::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_HealingItems_C_BindEvents, K2Node_CreateDelegate_OutputDelegate_4) == 0x000040, "Member 'WBP_HealingItems_C_BindEvents::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");

// Function WBP_HealingItems.WBP_HealingItems_C.ExecuteUbergraph_WBP_HealingItems
// 0x0108 (0x0108 - 0x0000)
struct WBP_HealingItems_C_ExecuteUbergraph_WBP_HealingItems final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_HealingItemIcon_C*                 CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_Pawn;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStatHPComponent*                       CallFunc_GetComponentByClass_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsUsed;                         // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRemainingHealCount_ReturnValue;        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxHealCount_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_HealingItemIcon_C*                 CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_HealingItemIcon_C*                 CallFunc_Array_Get_Item_1;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_HealingItemIcon_C*                 CallFunc_Array_Get_Item_2;                         // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue;                          // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHealComponent*                         CallFunc_GetComponentByClass_ReturnValue_1;        // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_HealingItemIcon_C*                 CallFunc_Array_Get_Item_3;                         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_RestoreCount;                   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x2];                                       // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HealingItems_C_ExecuteUbergraph_WBP_HealingItems) == 0x000008, "Wrong alignment on WBP_HealingItems_C_ExecuteUbergraph_WBP_HealingItems");
static_assert(sizeof(WBP_HealingItems_C_ExecuteUbergraph_WBP_HealingItems) == 0x000108, "Wrong size on WBP_HealingItems_C_ExecuteUbergraph_WBP_HealingItems");
static_assert(offsetof(WBP_HealingItems_C_ExecuteUbergraph_WBP_HealingItems, EntryPoint) == 0x000000, "Member 'WBP_HealingItems_C_ExecuteUbergraph_WBP_HealingItems::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HealingItems_C_ExecuteUbergraph_WBP_HealingItems, Temp_int_Variable) == 0x000004, "Member 'WBP_HealingItems_C_ExecuteUbergraph_WBP_HealingItems::Temp_int_Variable' has a wrong offset!");
