#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Extra_Page_NPCs

#include "Basic.hpp"

#include "Zion_structs.hpp"
#include "Zion_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Extra_Page_NPCs.WBP_Extra_Page_NPCs_C
// 0x02B0 (0x0710 - 0x0460)
class UWBP_Extra_Page_NPCs_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             CharacterName;                                     // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanelZion*                  EntryContainer;                                    // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Completion_C*                      WBP_Completion;                                    // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Currency_C*                        WBP_Currency;                                      // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Scrollbox_C*                       WBP_Scrollbox;                                     // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_Extra_Character_Entry_C*>   Entries;                                           // 0x0490(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay)
	struct FInventoryItemGenericInfoData          CachedCharacterItemData;                           // 0x04A0(0x0238)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, AdvancedDisplay)
	class UWBP_Extra_Character_Entry_C*           CachedCharacterEntry;                              // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UWBP_Extra_Dialog_SpineViewer_C*        CachedSpineViewerDialog;                           // 0x06E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	TArray<struct FFooterData>                    BuyAllRemainingFooterEntries;                      // 0x06E8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	class UFMODEvent*                             SE_BuyConfirm;                                     // 0x06F8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             SE_BuySuccess;                                     // 0x0700(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                             SE_BuyFailure;                                     // 0x0708(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void BuyAllRemainingItems();
	void BuyCharacterData();
	void Construct();
	void ExecuteUbergraph_WBP_Extra_Page_NPCs(int32 EntryPoint);
	void GenerateEntries();
	void GetAllBoughtEntries(TArray<class UWBP_Extra_Character_Entry_C*>* BoughtEntries);
	void GetAllRemainingItemsCountAndCost(int32* OutBuyCount, int32* OutCost);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnConfirmBuyAllRemainingItems();
	void OnConfirmSpendCurrency();
	void OnDialogClosed();
	void OnEntryFocused(class UWBP_Extra_Character_Entry_C* CharacterEntry);
	void OnEntryPressed(class UWBP_Extra_Character_Entry_C* CharacterEntry);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnPressContext(const struct FKeyEvent& KeyEvent);
	void OnRequestNextCharacter();
	void OnRequestPreviousCharacter();
	void RefreshCharacterInformation();
	void RefreshCompletionPercentage();
	void RefreshCurrency();
	void RefreshDialogSpineViewer(int32 IndexOffset);
	void RefreshEntriesPrice();
	void RefreshFooter();
	void SpendCurrency(const class FText& ItemName, int32 Cost);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Extra_Page_NPCs_C">();
	}
	static class UWBP_Extra_Page_NPCs_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Extra_Page_NPCs_C>();
	}
};
static_assert(alignof(UWBP_Extra_Page_NPCs_C) == 0x000008, "Wrong alignment on UWBP_Extra_Page_NPCs_C");
static_assert(sizeof(UWBP_Extra_Page_NPCs_C) == 0x000710, "Wrong size on UWBP_Extra_Page_NPCs_C");
static_assert(offsetof(UWBP_Extra_Page_NPCs_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Extra_Page_NPCs_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Page_NPCs_C, CharacterName) == 0x000468, "Member 'UWBP_Extra_Page_NPCs_C::CharacterName' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Page_NPCs_C, EntryContainer) == 0x000470, "Member 'UWBP_Extra_Page_NPCs_C::EntryContainer' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Page_NPCs_C, WBP_Completion) == 0x000478, "Member 'UWBP_Extra_Page_NPCs_C::WBP_Completion' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Page_NPCs_C, WBP_Currency) == 0x000480, "Member 'UWBP_Extra_Page_NPCs_C::WBP_Currency' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Page_NPCs_C, WBP_Scrollbox) == 0x000488, "Member 'UWBP_Extra_Page_NPCs_C::WBP_Scrollbox' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Page_NPCs_C, Entries) == 0x000490, "Member 'UWBP_Extra_Page_NPCs_C::Entries' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Page_NPCs_C, CachedCharacterItemData) == 0x0004A0, "Member 'UWBP_Extra_Page_NPCs_C::CachedCharacterItemData' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Page_NPCs_C, CachedCharacterEntry) == 0x0006D8, "Member 'UWBP_Extra_Page_NPCs_C::CachedCharacterEntry' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Page_NPCs_C, CachedSpineViewerDialog) == 0x0006E0, "Member 'UWBP_Extra_Page_NPCs_C::CachedSpineViewerDialog' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Page_NPCs_C, BuyAllRemainingFooterEntries) == 0x0006E8, "Member 'UWBP_Extra_Page_NPCs_C::BuyAllRemainingFooterEntries' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Page_NPCs_C, SE_BuyConfirm) == 0x0006F8, "Member 'UWBP_Extra_Page_NPCs_C::SE_BuyConfirm' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Page_NPCs_C, SE_BuySuccess) == 0x000700, "Member 'UWBP_Extra_Page_NPCs_C::SE_BuySuccess' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_Page_NPCs_C, SE_BuyFailure) == 0x000708, "Member 'UWBP_Extra_Page_NPCs_C::SE_BuyFailure' has a wrong offset!");

}

