#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RestMenu_Button

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RestMenu_Button.WBP_RestMenu_Button_C
// 0x0068 (0x04C8 - 0x0460)
class UWBP_RestMenu_Button_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       UnFocusedAnim;                                     // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FocusedAnim;                                       // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             ButtonText;                                        // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NiagaraSystemWidget_61;                            // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_ContainerNew;                              // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_FocusedContainer;                          // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0498(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	TMulticastInlineDelegate<void(const struct FKeyEvent& KeyEvent)> OnPressed;                      // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnFocused;                                         // 0x04B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Construct();
	void ExecuteUbergraph_WBP_RestMenu_Button(int32 EntryPoint);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnPressConfirm(const struct FKeyEvent& KeyEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void PreConstruct(bool IsDesignTime);
	void SequenceEvent();
	void SetFocusedState(bool Focus);
	void SetNewVisibility(bool bVisible);
	void SetText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RestMenu_Button_C">();
	}
	static class UWBP_RestMenu_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RestMenu_Button_C>();
	}
};
static_assert(alignof(UWBP_RestMenu_Button_C) == 0x000008, "Wrong alignment on UWBP_RestMenu_Button_C");
static_assert(sizeof(UWBP_RestMenu_Button_C) == 0x0004C8, "Wrong size on UWBP_RestMenu_Button_C");
static_assert(offsetof(UWBP_RestMenu_Button_C, UberGraphFrame) == 0x000460, "Member 'UWBP_RestMenu_Button_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_Button_C, UnFocusedAnim) == 0x000468, "Member 'UWBP_RestMenu_Button_C::UnFocusedAnim' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_Button_C, FocusedAnim) == 0x000470, "Member 'UWBP_RestMenu_Button_C::FocusedAnim' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_Button_C, ButtonText) == 0x000478, "Member 'UWBP_RestMenu_Button_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_Button_C, NiagaraSystemWidget_61) == 0x000480, "Member 'UWBP_RestMenu_Button_C::NiagaraSystemWidget_61' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_Button_C, Overlay_ContainerNew) == 0x000488, "Member 'UWBP_RestMenu_Button_C::Overlay_ContainerNew' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_Button_C, Overlay_FocusedContainer) == 0x000490, "Member 'UWBP_RestMenu_Button_C::Overlay_FocusedContainer' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_Button_C, Text) == 0x000498, "Member 'UWBP_RestMenu_Button_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_Button_C, OnPressed) == 0x0004A8, "Member 'UWBP_RestMenu_Button_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UWBP_RestMenu_Button_C, OnFocused) == 0x0004B8, "Member 'UWBP_RestMenu_Button_C::OnFocused' has a wrong offset!");

}

