#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DebugMenu_Element_Choice_Text

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DebugMenu_Element_Choice_Text.WBP_DebugMenu_Element_Choice_Text_C
// 0x0050 (0x04B0 - 0x0460)
class UWBP_DebugMenu_Element_Choice_Text_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             OptionLabel;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DebugMenu_Element_Choice_C*        WBP_DebugMenu_Element_Choice;                      // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Label;                                             // 0x0478(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	TMulticastInlineDelegate<void()>              OnLeft;                                            // 0x0488(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnRight;                                           // 0x0498(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          HandleLeftRight;                                   // 0x04A8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetOptionText(const class FText& InText);
	void SetLabel(const class FText& InText);
	void SetHandleLeftRight(bool HandleLeftRight_0);
	void PreConstruct(bool IsDesignTime);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void ExecuteUbergraph_WBP_DebugMenu_Element_Choice_Text(int32 EntryPoint);
	void BndEvt__WBP_DebugMenu_Element_Choice_Text_WBP_DebugMenu_Element_Choice_K2Node_ComponentBoundEvent_1_OnRight__DelegateSignature();
	void BndEvt__WBP_DebugMenu_Element_Choice_Text_WBP_DebugMenu_Element_Choice_K2Node_ComponentBoundEvent_0_OnLeft__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DebugMenu_Element_Choice_Text_C">();
	}
	static class UWBP_DebugMenu_Element_Choice_Text_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DebugMenu_Element_Choice_Text_C>();
	}
};
static_assert(alignof(UWBP_DebugMenu_Element_Choice_Text_C) == 0x000008, "Wrong alignment on UWBP_DebugMenu_Element_Choice_Text_C");
static_assert(sizeof(UWBP_DebugMenu_Element_Choice_Text_C) == 0x0004B0, "Wrong size on UWBP_DebugMenu_Element_Choice_Text_C");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Text_C, UberGraphFrame) == 0x000460, "Member 'UWBP_DebugMenu_Element_Choice_Text_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Text_C, OptionLabel) == 0x000468, "Member 'UWBP_DebugMenu_Element_Choice_Text_C::OptionLabel' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Text_C, WBP_DebugMenu_Element_Choice) == 0x000470, "Member 'UWBP_DebugMenu_Element_Choice_Text_C::WBP_DebugMenu_Element_Choice' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Text_C, Label) == 0x000478, "Member 'UWBP_DebugMenu_Element_Choice_Text_C::Label' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Text_C, OnLeft) == 0x000488, "Member 'UWBP_DebugMenu_Element_Choice_Text_C::OnLeft' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Text_C, OnRight) == 0x000498, "Member 'UWBP_DebugMenu_Element_Choice_Text_C::OnRight' has a wrong offset!");
static_assert(offsetof(UWBP_DebugMenu_Element_Choice_Text_C, HandleLeftRight) == 0x0004A8, "Member 'UWBP_DebugMenu_Element_Choice_Text_C::HandleLeftRight' has a wrong offset!");

}

