#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Recollection

#include "Basic.hpp"

#include "Zion_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Recollection.WBP_Recollection_C.BndEvt__WBP_Extra_WBP_GameMenu_Tab_Bosses_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature
// 0x0048 (0x0048 - 0x0000)
struct WBP_Recollection_C_BndEvt__WBP_Extra_WBP_GameMenu_Tab_Bosses_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UWBP_GameMenu_Tab_C*                    PressedButtonTab;                                  // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_C_BndEvt__WBP_Extra_WBP_GameMenu_Tab_Bosses_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Recollection_C_BndEvt__WBP_Extra_WBP_GameMenu_Tab_Bosses_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Recollection_C_BndEvt__WBP_Extra_WBP_GameMenu_Tab_Bosses_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature) == 0x000048, "Wrong size on WBP_Recollection_C_BndEvt__WBP_Extra_WBP_GameMenu_Tab_Bosses_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Recollection_C_BndEvt__WBP_Extra_WBP_GameMenu_Tab_Bosses_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_Recollection_C_BndEvt__WBP_Extra_WBP_GameMenu_Tab_Bosses_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_BndEvt__WBP_Extra_WBP_GameMenu_Tab_Bosses_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature, PressedButtonTab) == 0x000040, "Member 'WBP_Recollection_C_BndEvt__WBP_Extra_WBP_GameMenu_Tab_Bosses_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature::PressedButtonTab' has a wrong offset!");

// Function WBP_Recollection.WBP_Recollection_C.BndEvt__WBP_Extra_WBP_GameMenu_Tab_BossRush_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature
// 0x0048 (0x0048 - 0x0000)
struct WBP_Recollection_C_BndEvt__WBP_Extra_WBP_GameMenu_Tab_BossRush_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UWBP_GameMenu_Tab_C*                    PressedButtonTab;                                  // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_C_BndEvt__WBP_Extra_WBP_GameMenu_Tab_BossRush_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Recollection_C_BndEvt__WBP_Extra_WBP_GameMenu_Tab_BossRush_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Recollection_C_BndEvt__WBP_Extra_WBP_GameMenu_Tab_BossRush_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature) == 0x000048, "Wrong size on WBP_Recollection_C_BndEvt__WBP_Extra_WBP_GameMenu_Tab_BossRush_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Recollection_C_BndEvt__WBP_Extra_WBP_GameMenu_Tab_BossRush_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_Recollection_C_BndEvt__WBP_Extra_WBP_GameMenu_Tab_BossRush_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_BndEvt__WBP_Extra_WBP_GameMenu_Tab_BossRush_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature, PressedButtonTab) == 0x000040, "Member 'WBP_Recollection_C_BndEvt__WBP_Extra_WBP_GameMenu_Tab_BossRush_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature::PressedButtonTab' has a wrong offset!");

// Function WBP_Recollection.WBP_Recollection_C.BndEvt__WBP_Recollection_WBP_Extra_Page_Bosses_K2Node_ComponentBoundEvent_3_OnRequestStartRecollectionBoss__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_Recollection_C_BndEvt__WBP_Recollection_WBP_Extra_Page_Bosses_K2Node_ComponentBoundEvent_3_OnRequestStartRecollectionBoss__DelegateSignature final
{
public:
	struct FDataTableRowHandle                    RecollectionBossData;                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Recollection_C_BndEvt__WBP_Recollection_WBP_Extra_Page_Bosses_K2Node_ComponentBoundEvent_3_OnRequestStartRecollectionBoss__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Recollection_C_BndEvt__WBP_Recollection_WBP_Extra_Page_Bosses_K2Node_ComponentBoundEvent_3_OnRequestStartRecollectionBoss__DelegateSignature");
static_assert(sizeof(WBP_Recollection_C_BndEvt__WBP_Recollection_WBP_Extra_Page_Bosses_K2Node_ComponentBoundEvent_3_OnRequestStartRecollectionBoss__DelegateSignature) == 0x000010, "Wrong size on WBP_Recollection_C_BndEvt__WBP_Recollection_WBP_Extra_Page_Bosses_K2Node_ComponentBoundEvent_3_OnRequestStartRecollectionBoss__DelegateSignature");
static_assert(offsetof(WBP_Recollection_C_BndEvt__WBP_Recollection_WBP_Extra_Page_Bosses_K2Node_ComponentBoundEvent_3_OnRequestStartRecollectionBoss__DelegateSignature, RecollectionBossData) == 0x000000, "Member 'WBP_Recollection_C_BndEvt__WBP_Recollection_WBP_Extra_Page_Bosses_K2Node_ComponentBoundEvent_3_OnRequestStartRecollectionBoss__DelegateSignature::RecollectionBossData' has a wrong offset!");

// Function WBP_Recollection.WBP_Recollection_C.BndEvt__WBP_Recollection_WBP_GameMenu_Tab_Movies_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature
// 0x0048 (0x0048 - 0x0000)
struct WBP_Recollection_C_BndEvt__WBP_Recollection_WBP_GameMenu_Tab_Movies_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UWBP_GameMenu_Tab_C*                    PressedButtonTab;                                  // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_C_BndEvt__WBP_Recollection_WBP_GameMenu_Tab_Movies_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Recollection_C_BndEvt__WBP_Recollection_WBP_GameMenu_Tab_Movies_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Recollection_C_BndEvt__WBP_Recollection_WBP_GameMenu_Tab_Movies_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000048, "Wrong size on WBP_Recollection_C_BndEvt__WBP_Recollection_WBP_GameMenu_Tab_Movies_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Recollection_C_BndEvt__WBP_Recollection_WBP_GameMenu_Tab_Movies_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature, KeyEvent) == 0x000000, "Member 'WBP_Recollection_C_BndEvt__WBP_Recollection_WBP_GameMenu_Tab_Movies_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_BndEvt__WBP_Recollection_WBP_GameMenu_Tab_Movies_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature, PressedButtonTab) == 0x000040, "Member 'WBP_Recollection_C_BndEvt__WBP_Recollection_WBP_GameMenu_Tab_Movies_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature::PressedButtonTab' has a wrong offset!");

// Function WBP_Recollection.WBP_Recollection_C.ExecuteUbergraph_WBP_Recollection
// 0x01F8 (0x01F8 - 0x0000)
struct WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDelayFrameAsyncAction*                 CallFunc_DelayFrame_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSubsystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDelayFrameAsyncAction*                 CallFunc_DelayFrame_ReturnValue_1;                 // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_2;             // 0x0058(0x0040)()
	class UWBP_GameMenu_Tab_C*                    K2Node_ComponentBoundEvent_PressedButtonTab_2;     // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent_1;             // 0x00A8(0x0040)()
	class UWBP_GameMenu_Tab_C*                    K2Node_ComponentBoundEvent_PressedButtonTab_1;     // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue;             // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayUMGAnimationAsyncAction*           CallFunc_PlayUMGAnimation_ReturnValue_1;           // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyEvent                              K2Node_CustomEvent_KeyEvent;                       // 0x0120(0x0040)()
	class UWBP_GameMenu_Tab_C*                    K2Node_CustomEvent_PressedButtonTab;               // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_ComponentBoundEvent_RecollectionBossData;   // 0x0170(0x0010)(NoDestructor)
	class AGameModeZion*                          CallFunc_Get_ReturnValue;                          // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameModeZion*                          CallFunc_Get_ReturnValue_1;                        // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue_1;              // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_192[0x2];                                      // 0x0192(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PageTypeToPageIndex_ReturnValue;          // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PageTypeToPageIndex_ReturnValue_1;        // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PageTypeToPageIndex_ReturnValue_2;        // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKeyEvent                              K2Node_ComponentBoundEvent_KeyEvent;               // 0x01A0(0x0040)()
	class UWBP_GameMenu_Tab_C*                    K2Node_ComponentBoundEvent_PressedButtonTab;       // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PageTypeToPageIndex_ReturnValue_3;        // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EE[0x2];                                      // 0x01EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UDifficultySystemComponent*             CallFunc_Get_ReturnValue_2;                        // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection) == 0x000008, "Wrong alignment on WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection");
static_assert(sizeof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection) == 0x0001F8, "Wrong size on WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, EntryPoint) == 0x000000, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, CallFunc_DelayFrame_ReturnValue) == 0x000028, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::CallFunc_DelayFrame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000030, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, K2Node_CreateDelegate_OutputDelegate_2) == 0x00003C, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, CallFunc_DelayFrame_ReturnValue_1) == 0x000050, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::CallFunc_DelayFrame_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, K2Node_ComponentBoundEvent_KeyEvent_2) == 0x000058, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::K2Node_ComponentBoundEvent_KeyEvent_2' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, K2Node_ComponentBoundEvent_PressedButtonTab_2) == 0x000098, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::K2Node_ComponentBoundEvent_PressedButtonTab_2' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, CallFunc_IsValid_ReturnValue_1) == 0x0000A0, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, K2Node_ComponentBoundEvent_KeyEvent_1) == 0x0000A8, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::K2Node_ComponentBoundEvent_KeyEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, K2Node_ComponentBoundEvent_PressedButtonTab_1) == 0x0000E8, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::K2Node_ComponentBoundEvent_PressedButtonTab_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, CallFunc_PlayUMGAnimation_ReturnValue) == 0x0000F0, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::CallFunc_PlayUMGAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000F8, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, CallFunc_IsValid_ReturnValue_2) == 0x000108, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, CallFunc_PlayUMGAnimation_ReturnValue_1) == 0x000110, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::CallFunc_PlayUMGAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, CallFunc_IsValid_ReturnValue_3) == 0x000118, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, K2Node_CustomEvent_KeyEvent) == 0x000120, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::K2Node_CustomEvent_KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, K2Node_CustomEvent_PressedButtonTab) == 0x000160, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::K2Node_CustomEvent_PressedButtonTab' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, CallFunc_Array_Find_ReturnValue) == 0x000168, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, K2Node_ComponentBoundEvent_RecollectionBossData) == 0x000170, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::K2Node_ComponentBoundEvent_RecollectionBossData' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, CallFunc_Get_ReturnValue) == 0x000180, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, CallFunc_Get_ReturnValue_1) == 0x000188, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, CallFunc_SetGamePaused_ReturnValue) == 0x000190, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, CallFunc_SetGamePaused_ReturnValue_1) == 0x000191, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::CallFunc_SetGamePaused_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, CallFunc_PageTypeToPageIndex_ReturnValue) == 0x000194, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::CallFunc_PageTypeToPageIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, CallFunc_PageTypeToPageIndex_ReturnValue_1) == 0x000198, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::CallFunc_PageTypeToPageIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, CallFunc_PageTypeToPageIndex_ReturnValue_2) == 0x00019C, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::CallFunc_PageTypeToPageIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, K2Node_ComponentBoundEvent_KeyEvent) == 0x0001A0, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::K2Node_ComponentBoundEvent_KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, K2Node_ComponentBoundEvent_PressedButtonTab) == 0x0001E0, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::K2Node_ComponentBoundEvent_PressedButtonTab' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, CallFunc_PageTypeToPageIndex_ReturnValue_3) == 0x0001E8, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::CallFunc_PageTypeToPageIndex_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, K2Node_SwitchEnum_CmpSuccess) == 0x0001EC, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, CallFunc_Not_PreBool_ReturnValue) == 0x0001ED, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection, CallFunc_Get_ReturnValue_2) == 0x0001F0, "Member 'WBP_Recollection_C_ExecuteUbergraph_WBP_Recollection::CallFunc_Get_ReturnValue_2' has a wrong offset!");

// Function WBP_Recollection.WBP_Recollection_C.GoToPage
// 0x0050 (0x0050 - 0x0000)
struct WBP_Recollection_C_GoToPage final
{
public:
	int32                                         PageIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDifficultyMode                               Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDifficultyMode                               Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDifficultyMode                               Temp_byte_Variable_2;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDifficultySystemComponent*             CallFunc_Get_ReturnValue;                          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EDifficultyMode                               K2Node_Select_Default;                             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_GameMenu_Tab_C*                    CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_C_GoToPage) == 0x000008, "Wrong alignment on WBP_Recollection_C_GoToPage");
static_assert(sizeof(WBP_Recollection_C_GoToPage) == 0x000050, "Wrong size on WBP_Recollection_C_GoToPage");
static_assert(offsetof(WBP_Recollection_C_GoToPage, PageIndex) == 0x000000, "Member 'WBP_Recollection_C_GoToPage::PageIndex' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_GoToPage, Temp_byte_Variable) == 0x000004, "Member 'WBP_Recollection_C_GoToPage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_GoToPage, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_Recollection_C_GoToPage::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_GoToPage, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_Recollection_C_GoToPage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_GoToPage, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_Recollection_C_GoToPage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_GoToPage, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000010, "Member 'WBP_Recollection_C_GoToPage::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_GoToPage, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_Recollection_C_GoToPage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_GoToPage, Temp_byte_Variable_2) == 0x000018, "Member 'WBP_Recollection_C_GoToPage::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_GoToPage, CallFunc_Get_ReturnValue) == 0x000020, "Member 'WBP_Recollection_C_GoToPage::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_GoToPage, Temp_int_Variable) == 0x000028, "Member 'WBP_Recollection_C_GoToPage::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_GoToPage, CallFunc_GetActiveWidget_ReturnValue) == 0x000030, "Member 'WBP_Recollection_C_GoToPage::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_GoToPage, K2Node_Select_Default) == 0x000038, "Member 'WBP_Recollection_C_GoToPage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_GoToPage, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'WBP_Recollection_C_GoToPage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_GoToPage, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_Recollection_C_GoToPage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_GoToPage, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'WBP_Recollection_C_GoToPage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Recollection.WBP_Recollection_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_Recollection_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Recollection_C_OnFocusReceived");
static_assert(sizeof(WBP_Recollection_C_OnFocusReceived) == 0x0001B8, "Wrong size on WBP_Recollection_C_OnFocusReceived");
static_assert(offsetof(WBP_Recollection_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Recollection_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Recollection_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Recollection_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Recollection_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_OnFocusReceived, CallFunc_GetActiveWidget_ReturnValue) == 0x0001B0, "Member 'WBP_Recollection_C_OnFocusReceived::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");

// Function WBP_Recollection.WBP_Recollection_C.OnPressCancel
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Recollection_C_OnPressCancel final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Recollection_C_OnPressCancel) == 0x000008, "Wrong alignment on WBP_Recollection_C_OnPressCancel");
static_assert(sizeof(WBP_Recollection_C_OnPressCancel) == 0x0001B0, "Wrong size on WBP_Recollection_C_OnPressCancel");
static_assert(offsetof(WBP_Recollection_C_OnPressCancel, KeyEvent) == 0x000000, "Member 'WBP_Recollection_C_OnPressCancel::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_OnPressCancel, ReturnValue) == 0x000040, "Member 'WBP_Recollection_C_OnPressCancel::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_OnPressCancel, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Recollection_C_OnPressCancel::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Recollection.WBP_Recollection_C.OnPressNext
// 0x0288 (0x0288 - 0x0000)
struct WBP_Recollection_C_OnPressNext final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue_1;                    // 0x01C8(0x00B8)()
	int32                                         CallFunc_LoopAround_ReturnValue;                   // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_C_OnPressNext) == 0x000008, "Wrong alignment on WBP_Recollection_C_OnPressNext");
static_assert(sizeof(WBP_Recollection_C_OnPressNext) == 0x000288, "Wrong size on WBP_Recollection_C_OnPressNext");
static_assert(offsetof(WBP_Recollection_C_OnPressNext, KeyEvent) == 0x000000, "Member 'WBP_Recollection_C_OnPressNext::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_OnPressNext, ReturnValue) == 0x000040, "Member 'WBP_Recollection_C_OnPressNext::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_OnPressNext, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Recollection_C_OnPressNext::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_OnPressNext, CallFunc_Array_Length_ReturnValue) == 0x0001B0, "Member 'WBP_Recollection_C_OnPressNext::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_OnPressNext, CallFunc_Greater_IntInt_ReturnValue) == 0x0001B4, "Member 'WBP_Recollection_C_OnPressNext::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_OnPressNext, CallFunc_Array_Length_ReturnValue_1) == 0x0001B8, "Member 'WBP_Recollection_C_OnPressNext::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_OnPressNext, CallFunc_Add_IntInt_ReturnValue) == 0x0001BC, "Member 'WBP_Recollection_C_OnPressNext::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_OnPressNext, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001C0, "Member 'WBP_Recollection_C_OnPressNext::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_OnPressNext, CallFunc_Handled_ReturnValue_1) == 0x0001C8, "Member 'WBP_Recollection_C_OnPressNext::CallFunc_Handled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_OnPressNext, CallFunc_LoopAround_ReturnValue) == 0x000280, "Member 'WBP_Recollection_C_OnPressNext::CallFunc_LoopAround_ReturnValue' has a wrong offset!");

// Function WBP_Recollection.WBP_Recollection_C.OnPressPrevious
// 0x0288 (0x0288 - 0x0000)
struct WBP_Recollection_C_OnPressPrevious final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue_1;                    // 0x01C8(0x00B8)()
	int32                                         CallFunc_LoopAround_ReturnValue;                   // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_C_OnPressPrevious) == 0x000008, "Wrong alignment on WBP_Recollection_C_OnPressPrevious");
static_assert(sizeof(WBP_Recollection_C_OnPressPrevious) == 0x000288, "Wrong size on WBP_Recollection_C_OnPressPrevious");
static_assert(offsetof(WBP_Recollection_C_OnPressPrevious, KeyEvent) == 0x000000, "Member 'WBP_Recollection_C_OnPressPrevious::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_OnPressPrevious, ReturnValue) == 0x000040, "Member 'WBP_Recollection_C_OnPressPrevious::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_OnPressPrevious, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Recollection_C_OnPressPrevious::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_OnPressPrevious, CallFunc_Array_Length_ReturnValue) == 0x0001B0, "Member 'WBP_Recollection_C_OnPressPrevious::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_OnPressPrevious, CallFunc_Greater_IntInt_ReturnValue) == 0x0001B4, "Member 'WBP_Recollection_C_OnPressPrevious::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_OnPressPrevious, CallFunc_Array_Length_ReturnValue_1) == 0x0001B8, "Member 'WBP_Recollection_C_OnPressPrevious::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_OnPressPrevious, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001BC, "Member 'WBP_Recollection_C_OnPressPrevious::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_OnPressPrevious, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0001C0, "Member 'WBP_Recollection_C_OnPressPrevious::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_OnPressPrevious, CallFunc_Handled_ReturnValue_1) == 0x0001C8, "Member 'WBP_Recollection_C_OnPressPrevious::CallFunc_Handled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_OnPressPrevious, CallFunc_LoopAround_ReturnValue) == 0x000280, "Member 'WBP_Recollection_C_OnPressPrevious::CallFunc_LoopAround_ReturnValue' has a wrong offset!");

// Function WBP_Recollection.WBP_Recollection_C.OnTabPressed
// 0x0048 (0x0048 - 0x0000)
struct WBP_Recollection_C_OnTabPressed final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UWBP_GameMenu_Tab_C*                    PressedButtonTab;                                  // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_C_OnTabPressed) == 0x000008, "Wrong alignment on WBP_Recollection_C_OnTabPressed");
static_assert(sizeof(WBP_Recollection_C_OnTabPressed) == 0x000048, "Wrong size on WBP_Recollection_C_OnTabPressed");
static_assert(offsetof(WBP_Recollection_C_OnTabPressed, KeyEvent) == 0x000000, "Member 'WBP_Recollection_C_OnTabPressed::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_OnTabPressed, PressedButtonTab) == 0x000040, "Member 'WBP_Recollection_C_OnTabPressed::PressedButtonTab' has a wrong offset!");

// Function WBP_Recollection.WBP_Recollection_C.PageTypeToPageIndex
// 0x001C (0x001C - 0x0000)
struct WBP_Recollection_C_PageTypeToPageIndex final
{
public:
	ERecollectionPageType                         Index_0;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERecollectionPageType                         Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_C_PageTypeToPageIndex) == 0x000004, "Wrong alignment on WBP_Recollection_C_PageTypeToPageIndex");
static_assert(sizeof(WBP_Recollection_C_PageTypeToPageIndex) == 0x00001C, "Wrong size on WBP_Recollection_C_PageTypeToPageIndex");
static_assert(offsetof(WBP_Recollection_C_PageTypeToPageIndex, Index_0) == 0x000000, "Member 'WBP_Recollection_C_PageTypeToPageIndex::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_PageTypeToPageIndex, ReturnValue) == 0x000004, "Member 'WBP_Recollection_C_PageTypeToPageIndex::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_PageTypeToPageIndex, Temp_byte_Variable) == 0x000008, "Member 'WBP_Recollection_C_PageTypeToPageIndex::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_PageTypeToPageIndex, Temp_int_Variable) == 0x00000C, "Member 'WBP_Recollection_C_PageTypeToPageIndex::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_PageTypeToPageIndex, Temp_int_Variable_1) == 0x000010, "Member 'WBP_Recollection_C_PageTypeToPageIndex::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_PageTypeToPageIndex, Temp_int_Variable_2) == 0x000014, "Member 'WBP_Recollection_C_PageTypeToPageIndex::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_PageTypeToPageIndex, K2Node_Select_Default) == 0x000018, "Member 'WBP_Recollection_C_PageTypeToPageIndex::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Recollection.WBP_Recollection_C.SetupTabsAndPages
// 0x0068 (0x0068 - 0x0000)
struct WBP_Recollection_C_SetupTabsAndPages final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldDisplayBossRush_ReturnValue;        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldDisplayBosses_ReturnValue;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GameMenu_Tab_C*                    CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldDisplayBossRush_ReturnValue_1;      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldDisplayBosses_ReturnValue_1;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UWBP_GameMenu_Tab_C*>            K2Node_MakeArray_Array_1;                          // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void(const struct FKeyEvent& KeyEvent, class UWBP_GameMenu_Tab_C* PressedButtonTab)> K2Node_CreateDelegate_OutputDelegate; // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_C_SetupTabsAndPages) == 0x000008, "Wrong alignment on WBP_Recollection_C_SetupTabsAndPages");
static_assert(sizeof(WBP_Recollection_C_SetupTabsAndPages) == 0x000068, "Wrong size on WBP_Recollection_C_SetupTabsAndPages");
static_assert(offsetof(WBP_Recollection_C_SetupTabsAndPages, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'WBP_Recollection_C_SetupTabsAndPages::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_SetupTabsAndPages, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WBP_Recollection_C_SetupTabsAndPages::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_SetupTabsAndPages, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_Recollection_C_SetupTabsAndPages::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_SetupTabsAndPages, CallFunc_ShouldDisplayBossRush_ReturnValue) == 0x00000C, "Member 'WBP_Recollection_C_SetupTabsAndPages::CallFunc_ShouldDisplayBossRush_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_SetupTabsAndPages, CallFunc_ShouldDisplayBosses_ReturnValue) == 0x00000D, "Member 'WBP_Recollection_C_SetupTabsAndPages::CallFunc_ShouldDisplayBosses_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_SetupTabsAndPages, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_Recollection_C_SetupTabsAndPages::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_SetupTabsAndPages, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_Recollection_C_SetupTabsAndPages::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_SetupTabsAndPages, CallFunc_Array_Add_ReturnValue) == 0x00001C, "Member 'WBP_Recollection_C_SetupTabsAndPages::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_SetupTabsAndPages, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'WBP_Recollection_C_SetupTabsAndPages::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_SetupTabsAndPages, CallFunc_ShouldDisplayBossRush_ReturnValue_1) == 0x000021, "Member 'WBP_Recollection_C_SetupTabsAndPages::CallFunc_ShouldDisplayBossRush_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_SetupTabsAndPages, CallFunc_Array_Add_ReturnValue_1) == 0x000024, "Member 'WBP_Recollection_C_SetupTabsAndPages::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_SetupTabsAndPages, CallFunc_ShouldDisplayBosses_ReturnValue_1) == 0x000028, "Member 'WBP_Recollection_C_SetupTabsAndPages::CallFunc_ShouldDisplayBosses_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_SetupTabsAndPages, CallFunc_Array_Add_ReturnValue_2) == 0x00002C, "Member 'WBP_Recollection_C_SetupTabsAndPages::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_SetupTabsAndPages, CallFunc_Array_Add_ReturnValue_3) == 0x000030, "Member 'WBP_Recollection_C_SetupTabsAndPages::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_SetupTabsAndPages, K2Node_MakeArray_Array) == 0x000038, "Member 'WBP_Recollection_C_SetupTabsAndPages::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_SetupTabsAndPages, K2Node_MakeArray_Array_1) == 0x000048, "Member 'WBP_Recollection_C_SetupTabsAndPages::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_SetupTabsAndPages, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'WBP_Recollection_C_SetupTabsAndPages::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_Recollection.WBP_Recollection_C.ShouldDisplayBosses
// 0x0030 (0x0030 - 0x0000)
struct WBP_Recollection_C_ShouldDisplayBosses final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBossRecollectionEnabled_ReturnValue;    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeZion*                          CallFunc_Get_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerControllerZion*                  CallFunc_Get_ReturnValue_1;                        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             CallFunc_GetDataTableRecollectionBosses_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyRecollectionItemVisible_ReturnValue; // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Recollection_C_ShouldDisplayBosses) == 0x000008, "Wrong alignment on WBP_Recollection_C_ShouldDisplayBosses");
static_assert(sizeof(WBP_Recollection_C_ShouldDisplayBosses) == 0x000030, "Wrong size on WBP_Recollection_C_ShouldDisplayBosses");
static_assert(offsetof(WBP_Recollection_C_ShouldDisplayBosses, ReturnValue) == 0x000000, "Member 'WBP_Recollection_C_ShouldDisplayBosses::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ShouldDisplayBosses, CallFunc_IsBossRecollectionEnabled_ReturnValue) == 0x000001, "Member 'WBP_Recollection_C_ShouldDisplayBosses::CallFunc_IsBossRecollectionEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ShouldDisplayBosses, CallFunc_Get_ReturnValue) == 0x000008, "Member 'WBP_Recollection_C_ShouldDisplayBosses::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ShouldDisplayBosses, CallFunc_Get_ReturnValue_1) == 0x000010, "Member 'WBP_Recollection_C_ShouldDisplayBosses::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ShouldDisplayBosses, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_Recollection_C_ShouldDisplayBosses::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ShouldDisplayBosses, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'WBP_Recollection_C_ShouldDisplayBosses::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Recollection_C_ShouldDisplayBosses, CallFunc_GetDataTableRecollectionBosses_ReturnValue) == 0x000020, "Member 'WBP_Recollection_C_ShouldDisplayBosses::CallFunc_GetDataTableRecollectionBosses_ReturnValue' has a wrong offset!");
