#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Extra

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Extra.WBP_Extra_C
// 0x00E0 (0x0540 - 0x0460)
class UWBP_Extra_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hide;                                              // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Show;                                              // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG_Base;                                           // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Effect;                                         // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_LeftGradation;                                  // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_RightGradation;                                 // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_TopGradation;                                   // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NiagaraSystemWidget_272;                           // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        PageSwitcher;                                      // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URefreshableRichTextBlock*              RefreshableRichTextBlock_NextPage;                 // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URefreshableRichTextBlock*              RefreshableRichTextBlock_PrevPage;                 // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TabLine;                                           // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Extra_Costume_C*                   WBP_Extra_Costumes;                                // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Extra_Page_NPCs_C*                 WBP_Extra_Page_NPCs;                               // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Footer_C*                          WBP_Footer;                                        // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GameMenu_Tab_C*                    WBP_GameMenu_Tab_Costumes;                         // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GameMenu_Tab_C*                    WBP_GameMenu_Tab_Enemies;                          // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GameMenu_Tab_C*                    WBP_GameMenu_Tab_Gallery;                          // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GameMenu_Tab_C*                    WBP_GameMenu_Tab_NPCs;                             // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Extra_Page_Enemies_C*              WBP_Recollection_Page_Enemies;                     // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Extra_Page_Gallery_C*              WBP_Recollection_Page_Gallery;                     // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_GameMenu_Tab_C*>            Tabs;                                              // 0x0510(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay)
	TArray<class UUserWidget*>                    Pages;                                             // 0x0520(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay)
	int32                                         CurrentPageIndex;                                  // 0x0530(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_534[0x4];                                      // 0x0534(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFMODEvent*                             SE_Tab;                                            // 0x0538(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void Close();
	void Construct();
	void ExecuteUbergraph_WBP_Extra(int32 EntryPoint);
	void GoToPage(int32 PageIndex);
	void OnFinish_158F7C044FDCAD9B5C67FF8320246C81();
	void OnFinish_C3CB1EDB497DD828DCDA479ED3201257();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnPressCancel(const struct FKeyEvent& KeyEvent);
	struct FEventReply OnPressNext(const struct FKeyEvent& KeyEvent);
	struct FEventReply OnPressPrevious(const struct FKeyEvent& KeyEvent);
	void OnTabPressed(const struct FKeyEvent& KeyEvent, class UWBP_GameMenu_Tab_C* PressedButtonTab);
	void SetupTabsAndPages();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Extra_C">();
	}
	static class UWBP_Extra_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Extra_C>();
	}
};
static_assert(alignof(UWBP_Extra_C) == 0x000008, "Wrong alignment on UWBP_Extra_C");
static_assert(sizeof(UWBP_Extra_C) == 0x000540, "Wrong size on UWBP_Extra_C");
static_assert(offsetof(UWBP_Extra_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Extra_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_C, Hide) == 0x000468, "Member 'UWBP_Extra_C::Hide' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_C, Show) == 0x000470, "Member 'UWBP_Extra_C::Show' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_C, BG_Base) == 0x000478, "Member 'UWBP_Extra_C::BG_Base' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_C, BG_Effect) == 0x000480, "Member 'UWBP_Extra_C::BG_Effect' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_C, BG_LeftGradation) == 0x000488, "Member 'UWBP_Extra_C::BG_LeftGradation' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_C, BG_RightGradation) == 0x000490, "Member 'UWBP_Extra_C::BG_RightGradation' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_C, BG_TopGradation) == 0x000498, "Member 'UWBP_Extra_C::BG_TopGradation' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_C, NiagaraSystemWidget_272) == 0x0004A0, "Member 'UWBP_Extra_C::NiagaraSystemWidget_272' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_C, PageSwitcher) == 0x0004A8, "Member 'UWBP_Extra_C::PageSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_C, RefreshableRichTextBlock_NextPage) == 0x0004B0, "Member 'UWBP_Extra_C::RefreshableRichTextBlock_NextPage' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_C, RefreshableRichTextBlock_PrevPage) == 0x0004B8, "Member 'UWBP_Extra_C::RefreshableRichTextBlock_PrevPage' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_C, TabLine) == 0x0004C0, "Member 'UWBP_Extra_C::TabLine' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_C, WBP_Extra_Costumes) == 0x0004C8, "Member 'UWBP_Extra_C::WBP_Extra_Costumes' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_C, WBP_Extra_Page_NPCs) == 0x0004D0, "Member 'UWBP_Extra_C::WBP_Extra_Page_NPCs' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_C, WBP_Footer) == 0x0004D8, "Member 'UWBP_Extra_C::WBP_Footer' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_C, WBP_GameMenu_Tab_Costumes) == 0x0004E0, "Member 'UWBP_Extra_C::WBP_GameMenu_Tab_Costumes' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_C, WBP_GameMenu_Tab_Enemies) == 0x0004E8, "Member 'UWBP_Extra_C::WBP_GameMenu_Tab_Enemies' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_C, WBP_GameMenu_Tab_Gallery) == 0x0004F0, "Member 'UWBP_Extra_C::WBP_GameMenu_Tab_Gallery' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_C, WBP_GameMenu_Tab_NPCs) == 0x0004F8, "Member 'UWBP_Extra_C::WBP_GameMenu_Tab_NPCs' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_C, WBP_Recollection_Page_Enemies) == 0x000500, "Member 'UWBP_Extra_C::WBP_Recollection_Page_Enemies' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_C, WBP_Recollection_Page_Gallery) == 0x000508, "Member 'UWBP_Extra_C::WBP_Recollection_Page_Gallery' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_C, Tabs) == 0x000510, "Member 'UWBP_Extra_C::Tabs' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_C, Pages) == 0x000520, "Member 'UWBP_Extra_C::Pages' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_C, CurrentPageIndex) == 0x000530, "Member 'UWBP_Extra_C::CurrentPageIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Extra_C, SE_Tab) == 0x000538, "Member 'UWBP_Extra_C::SE_Tab' has a wrong offset!");

}

