#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Recollection_BossRush_RecordEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Recollection_BossRush_RecordEntry.WBP_Recollection_BossRush_RecordEntry_C
// 0x0050 (0x04B0 - 0x0460)
class UWBP_Recollection_BossRush_RecordEntry_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewRecordAnim;                                     // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG_1;                                              // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NewRecordText;                                     // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_NewContainer;                              // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RankLabelText;                                     // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Recollection_BossRush_RecordEntry_Text_C* WBP_Recollection_BossRush_RecordEntry_Text; // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   RankLabel;                                         // 0x0498(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                          ShowNewFlag;                                       // 0x04A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void SetRecordText(const struct FRecollectionBossRushRecordData& RecordData);
	void SetNewFlag(bool ShowNewFlag_0);
	void PreConstruct(bool IsDesignTime);
	bool IsRecordDataValid(const struct FRecollectionBossRushRecordData& RecordData);
	void ExecuteUbergraph_WBP_Recollection_BossRush_RecordEntry(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Recollection_BossRush_RecordEntry_C">();
	}
	static class UWBP_Recollection_BossRush_RecordEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Recollection_BossRush_RecordEntry_C>();
	}
};
static_assert(alignof(UWBP_Recollection_BossRush_RecordEntry_C) == 0x000008, "Wrong alignment on UWBP_Recollection_BossRush_RecordEntry_C");
static_assert(sizeof(UWBP_Recollection_BossRush_RecordEntry_C) == 0x0004B0, "Wrong size on UWBP_Recollection_BossRush_RecordEntry_C");
static_assert(offsetof(UWBP_Recollection_BossRush_RecordEntry_C, UberGraphFrame) == 0x000460, "Member 'UWBP_Recollection_BossRush_RecordEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_RecordEntry_C, NewRecordAnim) == 0x000468, "Member 'UWBP_Recollection_BossRush_RecordEntry_C::NewRecordAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_RecordEntry_C, BG_1) == 0x000470, "Member 'UWBP_Recollection_BossRush_RecordEntry_C::BG_1' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_RecordEntry_C, NewRecordText) == 0x000478, "Member 'UWBP_Recollection_BossRush_RecordEntry_C::NewRecordText' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_RecordEntry_C, Overlay_NewContainer) == 0x000480, "Member 'UWBP_Recollection_BossRush_RecordEntry_C::Overlay_NewContainer' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_RecordEntry_C, RankLabelText) == 0x000488, "Member 'UWBP_Recollection_BossRush_RecordEntry_C::RankLabelText' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_RecordEntry_C, WBP_Recollection_BossRush_RecordEntry_Text) == 0x000490, "Member 'UWBP_Recollection_BossRush_RecordEntry_C::WBP_Recollection_BossRush_RecordEntry_Text' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_RecordEntry_C, RankLabel) == 0x000498, "Member 'UWBP_Recollection_BossRush_RecordEntry_C::RankLabel' has a wrong offset!");
static_assert(offsetof(UWBP_Recollection_BossRush_RecordEntry_C, ShowNewFlag) == 0x0004A8, "Member 'UWBP_Recollection_BossRush_RecordEntry_C::ShowNewFlag' has a wrong offset!");

}

