#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_Entry_Choice

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Settings_Entry_Choice.WBP_Settings_Entry_Choice_C.ExecuteUbergraph_WBP_Settings_Entry_Choice
// 0x001C (0x001C - 0x0000)
struct WBP_Settings_Entry_Choice_C_ExecuteUbergraph_WBP_Settings_Entry_Choice final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0008(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0010(0x0008)(NoDestructor)
	bool                                          K2Node_Event_bInIsEnabled;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Choice_C_ExecuteUbergraph_WBP_Settings_Entry_Choice) == 0x000004, "Wrong alignment on WBP_Settings_Entry_Choice_C_ExecuteUbergraph_WBP_Settings_Entry_Choice");
static_assert(sizeof(WBP_Settings_Entry_Choice_C_ExecuteUbergraph_WBP_Settings_Entry_Choice) == 0x00001C, "Wrong size on WBP_Settings_Entry_Choice_C_ExecuteUbergraph_WBP_Settings_Entry_Choice");
static_assert(offsetof(WBP_Settings_Entry_Choice_C_ExecuteUbergraph_WBP_Settings_Entry_Choice, EntryPoint) == 0x000000, "Member 'WBP_Settings_Entry_Choice_C_ExecuteUbergraph_WBP_Settings_Entry_Choice::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_C_ExecuteUbergraph_WBP_Settings_Entry_Choice, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_Settings_Entry_Choice_C_ExecuteUbergraph_WBP_Settings_Entry_Choice::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_C_ExecuteUbergraph_WBP_Settings_Entry_Choice, K2Node_Event_InFocusEvent_1) == 0x000008, "Member 'WBP_Settings_Entry_Choice_C_ExecuteUbergraph_WBP_Settings_Entry_Choice::K2Node_Event_InFocusEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_C_ExecuteUbergraph_WBP_Settings_Entry_Choice, K2Node_Event_InFocusEvent) == 0x000010, "Member 'WBP_Settings_Entry_Choice_C_ExecuteUbergraph_WBP_Settings_Entry_Choice::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_C_ExecuteUbergraph_WBP_Settings_Entry_Choice, K2Node_Event_bInIsEnabled) == 0x000018, "Member 'WBP_Settings_Entry_Choice_C_ExecuteUbergraph_WBP_Settings_Entry_Choice::K2Node_Event_bInIsEnabled' has a wrong offset!");

// Function WBP_Settings_Entry_Choice.WBP_Settings_Entry_Choice_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_Settings_Entry_Choice_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Settings_Entry_Choice_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on WBP_Settings_Entry_Choice_C_OnAddedToFocusPath");
static_assert(sizeof(WBP_Settings_Entry_Choice_C_OnAddedToFocusPath) == 0x000008, "Wrong size on WBP_Settings_Entry_Choice_C_OnAddedToFocusPath");
static_assert(offsetof(WBP_Settings_Entry_Choice_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_Settings_Entry_Choice_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_Settings_Entry_Choice.WBP_Settings_Entry_Choice_C.OnPressConfirm
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Settings_Entry_Choice_C_OnPressConfirm final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Settings_Entry_Choice_C_OnPressConfirm) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Choice_C_OnPressConfirm");
static_assert(sizeof(WBP_Settings_Entry_Choice_C_OnPressConfirm) == 0x0001B0, "Wrong size on WBP_Settings_Entry_Choice_C_OnPressConfirm");
static_assert(offsetof(WBP_Settings_Entry_Choice_C_OnPressConfirm, KeyEvent) == 0x000000, "Member 'WBP_Settings_Entry_Choice_C_OnPressConfirm::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_C_OnPressConfirm, ReturnValue) == 0x000040, "Member 'WBP_Settings_Entry_Choice_C_OnPressConfirm::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_C_OnPressConfirm, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Settings_Entry_Choice_C_OnPressConfirm::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Settings_Entry_Choice.WBP_Settings_Entry_Choice_C.OnPressLeft
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Settings_Entry_Choice_C_OnPressLeft final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Settings_Entry_Choice_C_OnPressLeft) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Choice_C_OnPressLeft");
static_assert(sizeof(WBP_Settings_Entry_Choice_C_OnPressLeft) == 0x0001B0, "Wrong size on WBP_Settings_Entry_Choice_C_OnPressLeft");
static_assert(offsetof(WBP_Settings_Entry_Choice_C_OnPressLeft, KeyEvent) == 0x000000, "Member 'WBP_Settings_Entry_Choice_C_OnPressLeft::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_C_OnPressLeft, ReturnValue) == 0x000040, "Member 'WBP_Settings_Entry_Choice_C_OnPressLeft::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_C_OnPressLeft, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Settings_Entry_Choice_C_OnPressLeft::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Settings_Entry_Choice.WBP_Settings_Entry_Choice_C.OnPressRight
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Settings_Entry_Choice_C_OnPressRight final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_Settings_Entry_Choice_C_OnPressRight) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Choice_C_OnPressRight");
static_assert(sizeof(WBP_Settings_Entry_Choice_C_OnPressRight) == 0x0001B0, "Wrong size on WBP_Settings_Entry_Choice_C_OnPressRight");
static_assert(offsetof(WBP_Settings_Entry_Choice_C_OnPressRight, KeyEvent) == 0x000000, "Member 'WBP_Settings_Entry_Choice_C_OnPressRight::KeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_C_OnPressRight, ReturnValue) == 0x000040, "Member 'WBP_Settings_Entry_Choice_C_OnPressRight::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_Entry_Choice_C_OnPressRight, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_Settings_Entry_Choice_C_OnPressRight::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_Settings_Entry_Choice.WBP_Settings_Entry_Choice_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_Settings_Entry_Choice_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_Settings_Entry_Choice_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on WBP_Settings_Entry_Choice_C_OnRemovedFromFocusPath");
static_assert(sizeof(WBP_Settings_Entry_Choice_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on WBP_Settings_Entry_Choice_C_OnRemovedFromFocusPath");
static_assert(offsetof(WBP_Settings_Entry_Choice_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_Settings_Entry_Choice_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_Settings_Entry_Choice.WBP_Settings_Entry_Choice_C.OnSetIsEnabled
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_Entry_Choice_C_OnSetIsEnabled final
{
public:
	bool                                          bInIsEnabled;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Choice_C_OnSetIsEnabled) == 0x000001, "Wrong alignment on WBP_Settings_Entry_Choice_C_OnSetIsEnabled");
static_assert(sizeof(WBP_Settings_Entry_Choice_C_OnSetIsEnabled) == 0x000001, "Wrong size on WBP_Settings_Entry_Choice_C_OnSetIsEnabled");
static_assert(offsetof(WBP_Settings_Entry_Choice_C_OnSetIsEnabled, bInIsEnabled) == 0x000000, "Member 'WBP_Settings_Entry_Choice_C_OnSetIsEnabled::bInIsEnabled' has a wrong offset!");

// Function WBP_Settings_Entry_Choice.WBP_Settings_Entry_Choice_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_Entry_Choice_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Choice_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Settings_Entry_Choice_C_PreConstruct");
static_assert(sizeof(WBP_Settings_Entry_Choice_C_PreConstruct) == 0x000001, "Wrong size on WBP_Settings_Entry_Choice_C_PreConstruct");
static_assert(offsetof(WBP_Settings_Entry_Choice_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Settings_Entry_Choice_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Settings_Entry_Choice.WBP_Settings_Entry_Choice_C.SetLabel
// 0x0010 (0x0010 - 0x0000)
struct WBP_Settings_Entry_Choice_C_SetLabel final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Settings_Entry_Choice_C_SetLabel) == 0x000008, "Wrong alignment on WBP_Settings_Entry_Choice_C_SetLabel");
static_assert(sizeof(WBP_Settings_Entry_Choice_C_SetLabel) == 0x000010, "Wrong size on WBP_Settings_Entry_Choice_C_SetLabel");
static_assert(offsetof(WBP_Settings_Entry_Choice_C_SetLabel, InText) == 0x000000, "Member 'WBP_Settings_Entry_Choice_C_SetLabel::InText' has a wrong offset!");

// Function WBP_Settings_Entry_Choice.WBP_Settings_Entry_Choice_C.SetLabelScaleBoxStretch
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_Entry_Choice_C_SetLabelScaleBoxStretch final
{
public:
	EStretch                                      InStretch;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_Entry_Choice_C_SetLabelScaleBoxStretch) == 0x000001, "Wrong alignment on WBP_Settings_Entry_Choice_C_SetLabelScaleBoxStretch");
static_assert(sizeof(WBP_Settings_Entry_Choice_C_SetLabelScaleBoxStretch) == 0x000001, "Wrong size on WBP_Settings_Entry_Choice_C_SetLabelScaleBoxStretch");
static_assert(offsetof(WBP_Settings_Entry_Choice_C_SetLabelScaleBoxStretch, InStretch) == 0x000000, "Member 'WBP_Settings_Entry_Choice_C_SetLabelScaleBoxStretch::InStretch' has a wrong offset!");

}

