#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HealingItemIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Zion_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HealingItemIcon.WBP_HealingItemIcon_C
// 0x0018 (0x0478 - 0x0460)
class UWBP_HealingItemIcon_C final : public UUserWidgetZion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 HealingItemImg;                                    // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsUsed;                                            // 0x0470(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void RestoreItem();
	void MarkUsed(bool SkipAnimation);
	void ExecuteUbergraph_WBP_HealingItemIcon(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HealingItemIcon_C">();
	}
	static class UWBP_HealingItemIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HealingItemIcon_C>();
	}
};
static_assert(alignof(UWBP_HealingItemIcon_C) == 0x000008, "Wrong alignment on UWBP_HealingItemIcon_C");
static_assert(sizeof(UWBP_HealingItemIcon_C) == 0x000478, "Wrong size on UWBP_HealingItemIcon_C");
static_assert(offsetof(UWBP_HealingItemIcon_C, UberGraphFrame) == 0x000460, "Member 'UWBP_HealingItemIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HealingItemIcon_C, HealingItemImg) == 0x000468, "Member 'UWBP_HealingItemIcon_C::HealingItemImg' has a wrong offset!");
static_assert(offsetof(UWBP_HealingItemIcon_C, IsUsed) == 0x000470, "Member 'UWBP_HealingItemIcon_C::IsUsed' has a wrong offset!");

}

