#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Zion

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Zion_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "EventSystem_structs.hpp"
#include "EventSystem_classes.hpp"
#include "SpineExtension_structs.hpp"
#include "SpineExtension_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "UMG_classes.hpp"
#include "RenderLayer_structs.hpp"
#include "Slate_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CableComponent_classes.hpp"
#include "MovieScene_structs.hpp"
#include "ProceduralMeshComponent_classes.hpp"
#include "GameplayCameras_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "EnhancedInput_classes.hpp"
#include "SlateCore_structs.hpp"
#include "AdvancedWidgets_classes.hpp"
#include "FMODStudio_structs.hpp"


namespace SDK
{

// Class Zion.AbilityEffect
// 0x0028 (0x0050 - 0x0028)
class UAbilityEffect : public UObject
{
public:
	bool                                          bEnabled;                                          // 0x0028(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bExecuteWhenDodged;                                // 0x0029(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bExecuteWhenGuarded;                               // 0x002A(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bExecuteWhenParried;                               // 0x002B(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class UState>>             TargetInvalidStates;                               // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnInitialize_BP();

	struct FVector GetAbilityForward() const;
	struct FVector GetAbilityLocation() const;
	class AActor* GetSource() const;
	struct FVector GetSourceLocation() const;
	class AActor* GetTarget() const;
	struct FVector GetTargetForward() const;
	struct FVector GetTargetLocation() const;
	struct FVector GetToTargetDirection(EDirectionSource DirectionSource, const struct FVector& Axis) const;
	bool IsFrontalAbility() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityEffect">();
	}
	static class UAbilityEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityEffect>();
	}
};
static_assert(alignof(UAbilityEffect) == 0x000008, "Wrong alignment on UAbilityEffect");
static_assert(sizeof(UAbilityEffect) == 0x000050, "Wrong size on UAbilityEffect");
static_assert(offsetof(UAbilityEffect, bEnabled) == 0x000028, "Member 'UAbilityEffect::bEnabled' has a wrong offset!");
static_assert(offsetof(UAbilityEffect, bExecuteWhenDodged) == 0x000029, "Member 'UAbilityEffect::bExecuteWhenDodged' has a wrong offset!");
static_assert(offsetof(UAbilityEffect, bExecuteWhenGuarded) == 0x00002A, "Member 'UAbilityEffect::bExecuteWhenGuarded' has a wrong offset!");
static_assert(offsetof(UAbilityEffect, bExecuteWhenParried) == 0x00002B, "Member 'UAbilityEffect::bExecuteWhenParried' has a wrong offset!");
static_assert(offsetof(UAbilityEffect, TargetInvalidStates) == 0x000030, "Member 'UAbilityEffect::TargetInvalidStates' has a wrong offset!");

// Class Zion.AbilityEffectInstant
// 0x0000 (0x0050 - 0x0050)
class UAbilityEffectInstant : public UAbilityEffect
{
public:
	void OnApplyEffect();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityEffectInstant">();
	}
	static class UAbilityEffectInstant* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityEffectInstant>();
	}
};
static_assert(alignof(UAbilityEffectInstant) == 0x000008, "Wrong alignment on UAbilityEffectInstant");
static_assert(sizeof(UAbilityEffectInstant) == 0x000050, "Wrong size on UAbilityEffectInstant");

// Class Zion.AbilityEffectInstant_RestoreSP
// 0x0058 (0x00A8 - 0x0050)
class UAbilityEffectInstant_RestoreSP final : public UAbilityEffectInstant
{
public:
	int32                                         AbsoluteValue;                                     // 0x0050(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<EFaction>                                ValidTargetFactions;                               // 0x0058(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityEffectInstant_RestoreSP">();
	}
	static class UAbilityEffectInstant_RestoreSP* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityEffectInstant_RestoreSP>();
	}
};
static_assert(alignof(UAbilityEffectInstant_RestoreSP) == 0x000008, "Wrong alignment on UAbilityEffectInstant_RestoreSP");
static_assert(sizeof(UAbilityEffectInstant_RestoreSP) == 0x0000A8, "Wrong size on UAbilityEffectInstant_RestoreSP");
static_assert(offsetof(UAbilityEffectInstant_RestoreSP, AbsoluteValue) == 0x000050, "Member 'UAbilityEffectInstant_RestoreSP::AbsoluteValue' has a wrong offset!");
static_assert(offsetof(UAbilityEffectInstant_RestoreSP, ValidTargetFactions) == 0x000058, "Member 'UAbilityEffectInstant_RestoreSP::ValidTargetFactions' has a wrong offset!");

// Class Zion.BTDecoratorZion
// 0x0000 (0x0068 - 0x0068)
class UBTDecoratorZion : public UBTDecorator
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BTDecoratorZion">();
	}
	static class UBTDecoratorZion* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTDecoratorZion>();
	}
};
static_assert(alignof(UBTDecoratorZion) == 0x000008, "Wrong alignment on UBTDecoratorZion");
static_assert(sizeof(UBTDecoratorZion) == 0x000068, "Wrong size on UBTDecoratorZion");

// Class Zion.BTDecorator_Comparator
// 0x0008 (0x0070 - 0x0068)
class UBTDecorator_Comparator : public UBTDecoratorZion
{
public:
	EConditionType                                ConditionType;                                     // 0x0068(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BTDecorator_Comparator">();
	}
	static class UBTDecorator_Comparator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTDecorator_Comparator>();
	}
};
static_assert(alignof(UBTDecorator_Comparator) == 0x000008, "Wrong alignment on UBTDecorator_Comparator");
static_assert(sizeof(UBTDecorator_Comparator) == 0x000070, "Wrong size on UBTDecorator_Comparator");
static_assert(offsetof(UBTDecorator_Comparator, ConditionType) == 0x000068, "Member 'UBTDecorator_Comparator::ConditionType' has a wrong offset!");

// Class Zion.BTDecorator_Comparator_PhaseLevel
// 0x0008 (0x0078 - 0x0070)
class UBTDecorator_Comparator_PhaseLevel final : public UBTDecorator_Comparator
{
public:
	int32                                         Level;                                             // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BTDecorator_Comparator_PhaseLevel">();
	}
	static class UBTDecorator_Comparator_PhaseLevel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTDecorator_Comparator_PhaseLevel>();
	}
};
static_assert(alignof(UBTDecorator_Comparator_PhaseLevel) == 0x000008, "Wrong alignment on UBTDecorator_Comparator_PhaseLevel");
static_assert(sizeof(UBTDecorator_Comparator_PhaseLevel) == 0x000078, "Wrong size on UBTDecorator_Comparator_PhaseLevel");
static_assert(offsetof(UBTDecorator_Comparator_PhaseLevel, Level) == 0x000070, "Member 'UBTDecorator_Comparator_PhaseLevel::Level' has a wrong offset!");

// Class Zion.State
// 0x0000 (0x0028 - 0x0028)
class UState : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"State">();
	}
	static class UState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UState>();
	}
};
static_assert(alignof(UState) == 0x000008, "Wrong alignment on UState");
static_assert(sizeof(UState) == 0x000028, "Wrong size on UState");

// Class Zion.EventAction_MoveTo_TalkDistance
// 0x00F0 (0x0148 - 0x0058)
class UEventAction_MoveTo_TalkDistance final : public UEventAction_SubjectBinding
{
public:
	struct FActorBindingKey                       TalkTargetBinding;                                 // 0x0058(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EMoveToTalkDistanceMovementType               MovementType;                                      // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DistanceToTalkTarget;                              // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bUpdateFacingWhileMoving;                          // 0x0068(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bSweepOnTeleport;                                  // 0x0069(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6A[0x1E];                                      // 0x006A(0x001E)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bPlaySubjectTurnAnimation;                         // 0x0088(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSpineAnimationDefinition>      SubjectTurnAnimationDefinitions;                   // 0x0090(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	EMoveToTalkDistanceTargetFacingType           TalkTargetFacingType;                              // 0x00A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSpineAnimationDefinition>      TalkTargetTurnAnimationDefinitions;                // 0x00A8(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B8[0x60];                                      // 0x00B8(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bUseEventCamera;                                   // 0x0118(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ZoomDistanceOverride;                              // 0x011C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                WorldSpaceOffset;                                  // 0x0120(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FViewTargetBlendSettings               BlendSettings;                                     // 0x0138(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnMoveCompleted(const struct FAIRequestID& RequestID, EPathFollowingResult Result);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EventAction_MoveTo_TalkDistance">();
	}
	static class UEventAction_MoveTo_TalkDistance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventAction_MoveTo_TalkDistance>();
	}
};
static_assert(alignof(UEventAction_MoveTo_TalkDistance) == 0x000008, "Wrong alignment on UEventAction_MoveTo_TalkDistance");
static_assert(sizeof(UEventAction_MoveTo_TalkDistance) == 0x000148, "Wrong size on UEventAction_MoveTo_TalkDistance");
static_assert(offsetof(UEventAction_MoveTo_TalkDistance, TalkTargetBinding) == 0x000058, "Member 'UEventAction_MoveTo_TalkDistance::TalkTargetBinding' has a wrong offset!");
static_assert(offsetof(UEventAction_MoveTo_TalkDistance, MovementType) == 0x000060, "Member 'UEventAction_MoveTo_TalkDistance::MovementType' has a wrong offset!");
static_assert(offsetof(UEventAction_MoveTo_TalkDistance, DistanceToTalkTarget) == 0x000064, "Member 'UEventAction_MoveTo_TalkDistance::DistanceToTalkTarget' has a wrong offset!");
static_assert(offsetof(UEventAction_MoveTo_TalkDistance, bUpdateFacingWhileMoving) == 0x000068, "Member 'UEventAction_MoveTo_TalkDistance::bUpdateFacingWhileMoving' has a wrong offset!");
static_assert(offsetof(UEventAction_MoveTo_TalkDistance, bSweepOnTeleport) == 0x000069, "Member 'UEventAction_MoveTo_TalkDistance::bSweepOnTeleport' has a wrong offset!");
static_assert(offsetof(UEventAction_MoveTo_TalkDistance, bPlaySubjectTurnAnimation) == 0x000088, "Member 'UEventAction_MoveTo_TalkDistance::bPlaySubjectTurnAnimation' has a wrong offset!");
static_assert(offsetof(UEventAction_MoveTo_TalkDistance, SubjectTurnAnimationDefinitions) == 0x000090, "Member 'UEventAction_MoveTo_TalkDistance::SubjectTurnAnimationDefinitions' has a wrong offset!");
static_assert(offsetof(UEventAction_MoveTo_TalkDistance, TalkTargetFacingType) == 0x0000A0, "Member 'UEventAction_MoveTo_TalkDistance::TalkTargetFacingType' has a wrong offset!");
static_assert(offsetof(UEventAction_MoveTo_TalkDistance, TalkTargetTurnAnimationDefinitions) == 0x0000A8, "Member 'UEventAction_MoveTo_TalkDistance::TalkTargetTurnAnimationDefinitions' has a wrong offset!");
static_assert(offsetof(UEventAction_MoveTo_TalkDistance, bUseEventCamera) == 0x000118, "Member 'UEventAction_MoveTo_TalkDistance::bUseEventCamera' has a wrong offset!");
static_assert(offsetof(UEventAction_MoveTo_TalkDistance, ZoomDistanceOverride) == 0x00011C, "Member 'UEventAction_MoveTo_TalkDistance::ZoomDistanceOverride' has a wrong offset!");
static_assert(offsetof(UEventAction_MoveTo_TalkDistance, WorldSpaceOffset) == 0x000120, "Member 'UEventAction_MoveTo_TalkDistance::WorldSpaceOffset' has a wrong offset!");
static_assert(offsetof(UEventAction_MoveTo_TalkDistance, BlendSettings) == 0x000138, "Member 'UEventAction_MoveTo_TalkDistance::BlendSettings' has a wrong offset!");

// Class Zion.AbilityEffectTimed
// 0x0008 (0x0058 - 0x0050)
class UAbilityEffectTimed : public UAbilityEffect
{
public:
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnStart();
	bool OnUpdate(float DeltaTime, float* out_ConsumedDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityEffectTimed">();
	}
	static class UAbilityEffectTimed* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityEffectTimed>();
	}
};
static_assert(alignof(UAbilityEffectTimed) == 0x000008, "Wrong alignment on UAbilityEffectTimed");
static_assert(sizeof(UAbilityEffectTimed) == 0x000058, "Wrong size on UAbilityEffectTimed");

// Class Zion.RecollectionBossBaseComponent
// 0x00B0 (0x0150 - 0x00A0)
class URecollectionBossBaseComponent : public UActorComponent
{
public:
	ERespawnReason                                ExitRespawnReason;                                 // 0x00A0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ERespawnReason                                RetryRespawnReason;                                // 0x00A1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DialogMessage;                                     // 0x00A8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	bool                                          bAutoActivateBoss;                                 // 0x00B8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AutoActivationTimer;                               // 0x00BC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   DialogYesNoClass;                                  // 0x00C0(0x0028)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFadeDescriptionData                   FadeDescription;                                   // 0x00E8(0x0020)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_108[0x48];                                     // 0x0108(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BossActivation(class AEnemySpawner* EnemySpawner);
	void BossDeathEnd(class AEnemySpawner* EnemySpawner);
	void BossDeathEndPostDelay();
	void BossDeathStart(class AEnemySpawner* EnemySpawner);
	void ExitRecollectionMode();
	void ExitRecollectionMode_PostFadeOut();
	void Finish();
	void GameMapChange();
	bool InstantiateRetryDialog();
	void OnDialogClosed();
	void OnRetryDialogNo();
	void OnRetryDialogYes();
	void RetryRecollectionMode();
	void RetryRecollectionMode_PostFadeOut();
	void SetNewGameGenerationOverride(int32 GenerationOverride);
	void Start();

	bool CanLeaveRecollectionBoss() const;
	class AEnemySpawner* GetCachedEnemySpawner() const;
	int32 GetNewGameGenerationOverride() const;
	bool IsStarted() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RecollectionBossBaseComponent">();
	}
	static class URecollectionBossBaseComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<URecollectionBossBaseComponent>();
	}
};
static_assert(alignof(URecollectionBossBaseComponent) == 0x000008, "Wrong alignment on URecollectionBossBaseComponent");
static_assert(sizeof(URecollectionBossBaseComponent) == 0x000150, "Wrong size on URecollectionBossBaseComponent");
static_assert(offsetof(URecollectionBossBaseComponent, ExitRespawnReason) == 0x0000A0, "Member 'URecollectionBossBaseComponent::ExitRespawnReason' has a wrong offset!");
static_assert(offsetof(URecollectionBossBaseComponent, RetryRespawnReason) == 0x0000A1, "Member 'URecollectionBossBaseComponent::RetryRespawnReason' has a wrong offset!");
static_assert(offsetof(URecollectionBossBaseComponent, DialogMessage) == 0x0000A8, "Member 'URecollectionBossBaseComponent::DialogMessage' has a wrong offset!");
static_assert(offsetof(URecollectionBossBaseComponent, bAutoActivateBoss) == 0x0000B8, "Member 'URecollectionBossBaseComponent::bAutoActivateBoss' has a wrong offset!");
static_assert(offsetof(URecollectionBossBaseComponent, AutoActivationTimer) == 0x0000BC, "Member 'URecollectionBossBaseComponent::AutoActivationTimer' has a wrong offset!");
static_assert(offsetof(URecollectionBossBaseComponent, DialogYesNoClass) == 0x0000C0, "Member 'URecollectionBossBaseComponent::DialogYesNoClass' has a wrong offset!");
static_assert(offsetof(URecollectionBossBaseComponent, FadeDescription) == 0x0000E8, "Member 'URecollectionBossBaseComponent::FadeDescription' has a wrong offset!");

// Class Zion.RecollectionBossComponent
// 0x0018 (0x0168 - 0x0150)
class URecollectionBossComponent final : public URecollectionBossBaseComponent
{
public:
	float                                         BossDeathEndDelay;                                 // 0x0150(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_154[0x14];                                     // 0x0154(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RecollectionBossComponent">();
	}
	static class URecollectionBossComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<URecollectionBossComponent>();
	}
};
static_assert(alignof(URecollectionBossComponent) == 0x000008, "Wrong alignment on URecollectionBossComponent");
static_assert(sizeof(URecollectionBossComponent) == 0x000168, "Wrong size on URecollectionBossComponent");
static_assert(offsetof(URecollectionBossComponent, BossDeathEndDelay) == 0x000150, "Member 'URecollectionBossComponent::BossDeathEndDelay' has a wrong offset!");

// Class Zion.StateLockMovement
// 0x0000 (0x0028 - 0x0028)
class UStateLockMovement final : public UState
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateLockMovement">();
	}
	static class UStateLockMovement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateLockMovement>();
	}
};
static_assert(alignof(UStateLockMovement) == 0x000008, "Wrong alignment on UStateLockMovement");
static_assert(sizeof(UStateLockMovement) == 0x000028, "Wrong size on UStateLockMovement");

// Class Zion.StateLockMovementAndFacing
// 0x0000 (0x0028 - 0x0028)
class UStateLockMovementAndFacing final : public UState
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateLockMovementAndFacing">();
	}
	static class UStateLockMovementAndFacing* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateLockMovementAndFacing>();
	}
};
static_assert(alignof(UStateLockMovementAndFacing) == 0x000008, "Wrong alignment on UStateLockMovementAndFacing");
static_assert(sizeof(UStateLockMovementAndFacing) == 0x000028, "Wrong size on UStateLockMovementAndFacing");

// Class Zion.AbilityEffectInstant_ForceFeedback
// 0x0008 (0x0058 - 0x0050)
class UAbilityEffectInstant_ForceFeedback final : public UAbilityEffectInstant
{
public:
	class UForceFeedbackEffect*                   ForceFeedbackEffect;                               // 0x0050(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityEffectInstant_ForceFeedback">();
	}
	static class UAbilityEffectInstant_ForceFeedback* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityEffectInstant_ForceFeedback>();
	}
};
static_assert(alignof(UAbilityEffectInstant_ForceFeedback) == 0x000008, "Wrong alignment on UAbilityEffectInstant_ForceFeedback");
static_assert(sizeof(UAbilityEffectInstant_ForceFeedback) == 0x000058, "Wrong size on UAbilityEffectInstant_ForceFeedback");
static_assert(offsetof(UAbilityEffectInstant_ForceFeedback, ForceFeedbackEffect) == 0x000050, "Member 'UAbilityEffectInstant_ForceFeedback::ForceFeedbackEffect' has a wrong offset!");

// Class Zion.EventAction_SetRenderLayer
// 0x0008 (0x0060 - 0x0058)
class UEventAction_SetRenderLayer final : public UEventAction_SubjectBinding
{
public:
	ERenderLayerTypes                             RenderLayer;                                       // 0x0058(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EventAction_SetRenderLayer">();
	}
	static class UEventAction_SetRenderLayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventAction_SetRenderLayer>();
	}
};
static_assert(alignof(UEventAction_SetRenderLayer) == 0x000008, "Wrong alignment on UEventAction_SetRenderLayer");
static_assert(sizeof(UEventAction_SetRenderLayer) == 0x000060, "Wrong size on UEventAction_SetRenderLayer");
static_assert(offsetof(UEventAction_SetRenderLayer, RenderLayer) == 0x000058, "Member 'UEventAction_SetRenderLayer::RenderLayer' has a wrong offset!");

// Class Zion.CommandModule
// 0x0010 (0x0038 - 0x0028)
class UCommandModule : public UObject
{
public:
	bool                                          bEnabled;                                          // 0x0028(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWaitForModuleToComplete;                          // 0x0029(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A[0xE];                                       // 0x002A(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnFinish();
	void OnInitialize();
	void OnReset();
	void OnStart();

	class ACharacter* GetCharacter() const;
	class UCommand* GetCommand() const;
	float GetExecutionTime() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommandModule">();
	}
	static class UCommandModule* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommandModule>();
	}
};
static_assert(alignof(UCommandModule) == 0x000008, "Wrong alignment on UCommandModule");
static_assert(sizeof(UCommandModule) == 0x000038, "Wrong size on UCommandModule");
static_assert(offsetof(UCommandModule, bEnabled) == 0x000028, "Member 'UCommandModule::bEnabled' has a wrong offset!");
static_assert(offsetof(UCommandModule, bWaitForModuleToComplete) == 0x000029, "Member 'UCommandModule::bWaitForModuleToComplete' has a wrong offset!");

// Class Zion.CommandModule_GravityScale
// 0x0020 (0x0058 - 0x0038)
class UCommandModule_GravityScale final : public UCommandModule
{
public:
	float                                         GravityScale;                                      // 0x0038(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            GravityScaleFactorCurve;                           // 0x0040(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommandModule_GravityScale">();
	}
	static class UCommandModule_GravityScale* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommandModule_GravityScale>();
	}
};
static_assert(alignof(UCommandModule_GravityScale) == 0x000008, "Wrong alignment on UCommandModule_GravityScale");
static_assert(sizeof(UCommandModule_GravityScale) == 0x000058, "Wrong size on UCommandModule_GravityScale");
static_assert(offsetof(UCommandModule_GravityScale, GravityScale) == 0x000038, "Member 'UCommandModule_GravityScale::GravityScale' has a wrong offset!");
static_assert(offsetof(UCommandModule_GravityScale, GravityScaleFactorCurve) == 0x000040, "Member 'UCommandModule_GravityScale::GravityScaleFactorCurve' has a wrong offset!");

// Class Zion.StateIgnoreGroundFriction
// 0x0000 (0x0028 - 0x0028)
class UStateIgnoreGroundFriction final : public UState
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateIgnoreGroundFriction">();
	}
	static class UStateIgnoreGroundFriction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateIgnoreGroundFriction>();
	}
};
static_assert(alignof(UStateIgnoreGroundFriction) == 0x000008, "Wrong alignment on UStateIgnoreGroundFriction");
static_assert(sizeof(UStateIgnoreGroundFriction) == 0x000028, "Wrong size on UStateIgnoreGroundFriction");

// Class Zion.StateLockFacing
// 0x0000 (0x0028 - 0x0028)
class UStateLockFacing final : public UState
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateLockFacing">();
	}
	static class UStateLockFacing* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateLockFacing>();
	}
};
static_assert(alignof(UStateLockFacing) == 0x000008, "Wrong alignment on UStateLockFacing");
static_assert(sizeof(UStateLockFacing) == 0x000028, "Wrong size on UStateLockFacing");

// Class Zion.CommandModule_Timeline
// 0x0000 (0x0038 - 0x0038)
class UCommandModule_Timeline : public UCommandModule
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommandModule_Timeline">();
	}
	static class UCommandModule_Timeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommandModule_Timeline>();
	}
};
static_assert(alignof(UCommandModule_Timeline) == 0x000008, "Wrong alignment on UCommandModule_Timeline");
static_assert(sizeof(UCommandModule_Timeline) == 0x000038, "Wrong size on UCommandModule_Timeline");

// Class Zion.CommandModule_Timeline_SE
// 0x0028 (0x0060 - 0x0038)
class UCommandModule_Timeline_SE final : public UCommandModule_Timeline
{
public:
	struct FTimelineSE                            TimelineSE;                                        // 0x0038(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommandModule_Timeline_SE">();
	}
	static class UCommandModule_Timeline_SE* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommandModule_Timeline_SE>();
	}
};
static_assert(alignof(UCommandModule_Timeline_SE) == 0x000008, "Wrong alignment on UCommandModule_Timeline_SE");
static_assert(sizeof(UCommandModule_Timeline_SE) == 0x000060, "Wrong size on UCommandModule_Timeline_SE");
static_assert(offsetof(UCommandModule_Timeline_SE, TimelineSE) == 0x000038, "Member 'UCommandModule_Timeline_SE::TimelineSE' has a wrong offset!");

// Class Zion.StateStun
// 0x0000 (0x0028 - 0x0028)
class UStateStun final : public UState
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateStun">();
	}
	static class UStateStun* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateStun>();
	}
};
static_assert(alignof(UStateStun) == 0x000008, "Wrong alignment on UStateStun");
static_assert(sizeof(UStateStun) == 0x000028, "Wrong size on UStateStun");

// Class Zion.Spawner
// 0x0000 (0x0290 - 0x0290)
class ASpawner : public AActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Spawner">();
	}
	static class ASpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASpawner>();
	}
};
static_assert(alignof(ASpawner) == 0x000008, "Wrong alignment on ASpawner");
static_assert(sizeof(ASpawner) == 0x000290, "Wrong size on ASpawner");

// Class Zion.NPCSpawner
// 0x0058 (0x02E8 - 0x0290)
class ANPCSpawner final : public ASpawner
{
public:
	class USceneComponent*                        RootSceneComponent;                                // 0x0290(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameplayConditionRefreshComponent*     ConditionRefreshComponent;                         // 0x0298(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   NPCClass;                                          // 0x02A0(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FSpawnerNPCData>                NPCDataList;                                       // 0x02C8(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2D8[0x8];                                      // 0x02D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 SpawnedNPC;                                        // 0x02E0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NPCSpawner">();
	}
	static class ANPCSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANPCSpawner>();
	}
};
static_assert(alignof(ANPCSpawner) == 0x000008, "Wrong alignment on ANPCSpawner");
static_assert(sizeof(ANPCSpawner) == 0x0002E8, "Wrong size on ANPCSpawner");
static_assert(offsetof(ANPCSpawner, RootSceneComponent) == 0x000290, "Member 'ANPCSpawner::RootSceneComponent' has a wrong offset!");
static_assert(offsetof(ANPCSpawner, ConditionRefreshComponent) == 0x000298, "Member 'ANPCSpawner::ConditionRefreshComponent' has a wrong offset!");
static_assert(offsetof(ANPCSpawner, NPCClass) == 0x0002A0, "Member 'ANPCSpawner::NPCClass' has a wrong offset!");
static_assert(offsetof(ANPCSpawner, NPCDataList) == 0x0002C8, "Member 'ANPCSpawner::NPCDataList' has a wrong offset!");
static_assert(offsetof(ANPCSpawner, SpawnedNPC) == 0x0002E0, "Member 'ANPCSpawner::SpawnedNPC' has a wrong offset!");

// Class Zion.Ability
// 0x04F0 (0x0780 - 0x0290)
class AAbility : public AActor
{
public:
	uint8                                         Pad_290[0x18];                                     // 0x0290(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bAutoStopByTime;                                   // 0x02A8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AutoStopTime;                                      // 0x02AC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAutoStopByTriggerCount;                           // 0x02B0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AutoStopTriggerCount;                              // 0x02B4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAutoAbortOnSourceDeath;                           // 0x02B8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAutoRefreshStatsSnapshot;                         // 0x02B9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCanBeDodged;                                      // 0x02BA(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCanBeParried;                                     // 0x02BB(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCanBeGuarded;                                     // 0x02BC(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EAbilityDirectionMode                         DirectionMode;                                     // 0x02C0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C4[0xC];                                      // 0x02C4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimelineAbility                       TimelineAbility;                                   // 0x02D0(0x01D0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FTimelineSE                            TimelineSE;                                        // 0x04A0(0x0028)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                          bExecuteAbilitiesOnStop;                           // 0x04C8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAbilityData>                   OnStopAbilityDataList;                             // 0x04D0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<struct FSpineFXData>                   FXDataList;                                        // 0x04E0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<struct FSpineFXData>                   OnStopFXDataList;                                  // 0x04F0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	EAbilityWeightCategory                        WeightCategory;                                    // 0x0500(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponent*                      AbilityComponent;                                  // 0x0508(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UAbilityEffectProcess>      AbilityEffectProcessClass;                         // 0x0510(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<TSubclassOf<class UAbilityEffectProcess>, struct FAbilityEffectProcessCollection> AbilityEffectProcessCache; // 0x0518(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TArray<class UNiagaraComponent*>              RuntimeFXInstances;                                // 0x0568(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_578[0x208];                                    // 0x0578(0x0208)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnInitialize_BP();
	void OnLaunch_BP();
	void OnReset_BP();
	void OnSourceDeath();
	void OnStop_BP();
	void RequestAbort();
	void RequestStop();

	float GetExecutionTime() const;
	class AActor* GetSource() const;
	EAbilityWeightCategory GetWeightCategory() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Ability">();
	}
	static class AAbility* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAbility>();
	}
};
static_assert(alignof(AAbility) == 0x000010, "Wrong alignment on AAbility");
static_assert(sizeof(AAbility) == 0x000780, "Wrong size on AAbility");
static_assert(offsetof(AAbility, bAutoStopByTime) == 0x0002A8, "Member 'AAbility::bAutoStopByTime' has a wrong offset!");
static_assert(offsetof(AAbility, AutoStopTime) == 0x0002AC, "Member 'AAbility::AutoStopTime' has a wrong offset!");
static_assert(offsetof(AAbility, bAutoStopByTriggerCount) == 0x0002B0, "Member 'AAbility::bAutoStopByTriggerCount' has a wrong offset!");
static_assert(offsetof(AAbility, AutoStopTriggerCount) == 0x0002B4, "Member 'AAbility::AutoStopTriggerCount' has a wrong offset!");
static_assert(offsetof(AAbility, bAutoAbortOnSourceDeath) == 0x0002B8, "Member 'AAbility::bAutoAbortOnSourceDeath' has a wrong offset!");
static_assert(offsetof(AAbility, bAutoRefreshStatsSnapshot) == 0x0002B9, "Member 'AAbility::bAutoRefreshStatsSnapshot' has a wrong offset!");
static_assert(offsetof(AAbility, bCanBeDodged) == 0x0002BA, "Member 'AAbility::bCanBeDodged' has a wrong offset!");
static_assert(offsetof(AAbility, bCanBeParried) == 0x0002BB, "Member 'AAbility::bCanBeParried' has a wrong offset!");
static_assert(offsetof(AAbility, bCanBeGuarded) == 0x0002BC, "Member 'AAbility::bCanBeGuarded' has a wrong offset!");
static_assert(offsetof(AAbility, DirectionMode) == 0x0002C0, "Member 'AAbility::DirectionMode' has a wrong offset!");
static_assert(offsetof(AAbility, TimelineAbility) == 0x0002D0, "Member 'AAbility::TimelineAbility' has a wrong offset!");
static_assert(offsetof(AAbility, TimelineSE) == 0x0004A0, "Member 'AAbility::TimelineSE' has a wrong offset!");
static_assert(offsetof(AAbility, bExecuteAbilitiesOnStop) == 0x0004C8, "Member 'AAbility::bExecuteAbilitiesOnStop' has a wrong offset!");
static_assert(offsetof(AAbility, OnStopAbilityDataList) == 0x0004D0, "Member 'AAbility::OnStopAbilityDataList' has a wrong offset!");
static_assert(offsetof(AAbility, FXDataList) == 0x0004E0, "Member 'AAbility::FXDataList' has a wrong offset!");
static_assert(offsetof(AAbility, OnStopFXDataList) == 0x0004F0, "Member 'AAbility::OnStopFXDataList' has a wrong offset!");
static_assert(offsetof(AAbility, WeightCategory) == 0x000500, "Member 'AAbility::WeightCategory' has a wrong offset!");
static_assert(offsetof(AAbility, AbilityComponent) == 0x000508, "Member 'AAbility::AbilityComponent' has a wrong offset!");
static_assert(offsetof(AAbility, AbilityEffectProcessClass) == 0x000510, "Member 'AAbility::AbilityEffectProcessClass' has a wrong offset!");
static_assert(offsetof(AAbility, AbilityEffectProcessCache) == 0x000518, "Member 'AAbility::AbilityEffectProcessCache' has a wrong offset!");
static_assert(offsetof(AAbility, RuntimeFXInstances) == 0x000568, "Member 'AAbility::RuntimeFXInstances' has a wrong offset!");

// Class Zion.AbilityHitbox
// 0x0340 (0x0AC0 - 0x0780)
#pragma pack(push, 0x1)
class alignas(0x10) AAbilityHitbox : public AAbility
{
public:
	uint8                                         Pad_780[0x18];                                     // 0x0780(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DelayBeforeCollision;                              // 0x0798(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DelayBeforeProcessing;                             // 0x079C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<TSubclassOf<class UState>>             IgnoreIfTargetHasAnyState;                         // 0x07A0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	EHitBoxTargetType                             TargetType;                                        // 0x07B0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7B1[0x7];                                      // 0x07B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ECollisionProfile>                     CustomTargetCollisionProfiles;                     // 0x07B8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<EFaction>                              CustomTargetFactions;                              // 0x07C8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                          bTriggerOnReEntry;                                 // 0x07D8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEnableReTrigger;                                  // 0x07D9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7DA[0x2];                                      // 0x07DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DelayBeforeReTrigger;                              // 0x07DC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bBlockOnOneWayPlatforms;                           // 0x07E0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7E1[0xF];                                      // 0x07E1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpineFXData                           OnContactFXData;                                   // 0x07F0(0x0100)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<struct FAbilityData>                   OnContactAbilityDataList;                          // 0x08F0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                          bStopOnBlockerOverlap;                             // 0x0900(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_901[0xF];                                      // 0x0901(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpineFXData                           OnBlockerFXData;                                   // 0x0910(0x0100)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<struct FAbilityData>                   OnBlockerAbilityDataList;                          // 0x0A10(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class USceneComponent*                        RootSceneComponent;                                // 0x0A20(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A28[0x90];                                     // 0x0A28(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityHitbox">();
	}
	static class AAbilityHitbox* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAbilityHitbox>();
	}
};
#pragma pack(pop)
static_assert(alignof(AAbilityHitbox) == 0x000010, "Wrong alignment on AAbilityHitbox");
static_assert(sizeof(AAbilityHitbox) == 0x000AC0, "Wrong size on AAbilityHitbox");
static_assert(offsetof(AAbilityHitbox, DelayBeforeCollision) == 0x000798, "Member 'AAbilityHitbox::DelayBeforeCollision' has a wrong offset!");
static_assert(offsetof(AAbilityHitbox, DelayBeforeProcessing) == 0x00079C, "Member 'AAbilityHitbox::DelayBeforeProcessing' has a wrong offset!");
static_assert(offsetof(AAbilityHitbox, IgnoreIfTargetHasAnyState) == 0x0007A0, "Member 'AAbilityHitbox::IgnoreIfTargetHasAnyState' has a wrong offset!");
static_assert(offsetof(AAbilityHitbox, TargetType) == 0x0007B0, "Member 'AAbilityHitbox::TargetType' has a wrong offset!");
static_assert(offsetof(AAbilityHitbox, CustomTargetCollisionProfiles) == 0x0007B8, "Member 'AAbilityHitbox::CustomTargetCollisionProfiles' has a wrong offset!");
static_assert(offsetof(AAbilityHitbox, CustomTargetFactions) == 0x0007C8, "Member 'AAbilityHitbox::CustomTargetFactions' has a wrong offset!");
static_assert(offsetof(AAbilityHitbox, bTriggerOnReEntry) == 0x0007D8, "Member 'AAbilityHitbox::bTriggerOnReEntry' has a wrong offset!");
static_assert(offsetof(AAbilityHitbox, bEnableReTrigger) == 0x0007D9, "Member 'AAbilityHitbox::bEnableReTrigger' has a wrong offset!");
static_assert(offsetof(AAbilityHitbox, DelayBeforeReTrigger) == 0x0007DC, "Member 'AAbilityHitbox::DelayBeforeReTrigger' has a wrong offset!");
static_assert(offsetof(AAbilityHitbox, bBlockOnOneWayPlatforms) == 0x0007E0, "Member 'AAbilityHitbox::bBlockOnOneWayPlatforms' has a wrong offset!");
static_assert(offsetof(AAbilityHitbox, OnContactFXData) == 0x0007F0, "Member 'AAbilityHitbox::OnContactFXData' has a wrong offset!");
static_assert(offsetof(AAbilityHitbox, OnContactAbilityDataList) == 0x0008F0, "Member 'AAbilityHitbox::OnContactAbilityDataList' has a wrong offset!");
static_assert(offsetof(AAbilityHitbox, bStopOnBlockerOverlap) == 0x000900, "Member 'AAbilityHitbox::bStopOnBlockerOverlap' has a wrong offset!");
static_assert(offsetof(AAbilityHitbox, OnBlockerFXData) == 0x000910, "Member 'AAbilityHitbox::OnBlockerFXData' has a wrong offset!");
static_assert(offsetof(AAbilityHitbox, OnBlockerAbilityDataList) == 0x000A10, "Member 'AAbilityHitbox::OnBlockerAbilityDataList' has a wrong offset!");
static_assert(offsetof(AAbilityHitbox, RootSceneComponent) == 0x000A20, "Member 'AAbilityHitbox::RootSceneComponent' has a wrong offset!");

// Class Zion.Command
// 0x0080 (0x00A8 - 0x0028)
class UCommand : public UObject
{
public:
	TArray<class UCommandCondition*>              Conditions;                                        // 0x0028(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UCommandModule*>                 Modules;                                           // 0x0038(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UCommandCondition*>              FinishConditions;                                  // 0x0048(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_58[0x50];                                      // 0x0058(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool OnCanBeStarted();
	void OnFinish(ECommandFinishType FinishType);
	void OnInitialize(class APawn* PawnOwner);
	void OnPreStart();
	void OnReset();
	void OnStart();

	class ACharacter* GetCharacter() const;
	ECommandCategory GetCommandCategory() const;
	ECommandLayerType GetCommandLayer() const;
	float GetExecutionTime() const;
	const struct FInputSnapshot GetInputSnapshot() const;
	const class UInputAction* GetInvokedInputAction() const;
	class UCommandModule* GetModule(TSubclassOf<class UCommandModule> CommandModuleClass, bool bEnsureIfMissing) const;
	class UMovementComponent* GetMovementComponent() const;
	class APawn* GetPawn() const;
	const class UCommandSet* GetSourceCommandSet() const;
	bool IsInvokedInputPressed() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Command">();
	}
	static class UCommand* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommand>();
	}
};
static_assert(alignof(UCommand) == 0x000008, "Wrong alignment on UCommand");
static_assert(sizeof(UCommand) == 0x0000A8, "Wrong size on UCommand");
static_assert(offsetof(UCommand, Conditions) == 0x000028, "Member 'UCommand::Conditions' has a wrong offset!");
static_assert(offsetof(UCommand, Modules) == 0x000038, "Member 'UCommand::Modules' has a wrong offset!");
static_assert(offsetof(UCommand, FinishConditions) == 0x000048, "Member 'UCommand::FinishConditions' has a wrong offset!");

// Class Zion.Command_PileAttack
// 0x0080 (0x0128 - 0x00A8)
class UCommand_PileAttack : public UCommand
{
public:
	float                                         ChargePhaseTime;                                   // 0x00A8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class UState>>             ChargePhaseStates;                                 // 0x00B0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<struct FPileAttackChargeLevel>         DiveChargeLevels;                                  // 0x00C0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	float                                         DiveLaunchVelocity;                                // 0x00D0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D4[0xC];                                       // 0x00D4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class UState>>             CurrentDiveChargeLevelStates;                      // 0x00E0(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UNiagaraComponent*                      CurrentDiveLoopFXInstance;                         // 0x00F0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AAbility*                               CurrentDiveAbility;                                // 0x00F8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_100[0x28];                                     // 0x0100(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Command_PileAttack">();
	}
	static class UCommand_PileAttack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommand_PileAttack>();
	}
};
static_assert(alignof(UCommand_PileAttack) == 0x000008, "Wrong alignment on UCommand_PileAttack");
static_assert(sizeof(UCommand_PileAttack) == 0x000128, "Wrong size on UCommand_PileAttack");
static_assert(offsetof(UCommand_PileAttack, ChargePhaseTime) == 0x0000A8, "Member 'UCommand_PileAttack::ChargePhaseTime' has a wrong offset!");
static_assert(offsetof(UCommand_PileAttack, ChargePhaseStates) == 0x0000B0, "Member 'UCommand_PileAttack::ChargePhaseStates' has a wrong offset!");
static_assert(offsetof(UCommand_PileAttack, DiveChargeLevels) == 0x0000C0, "Member 'UCommand_PileAttack::DiveChargeLevels' has a wrong offset!");
static_assert(offsetof(UCommand_PileAttack, DiveLaunchVelocity) == 0x0000D0, "Member 'UCommand_PileAttack::DiveLaunchVelocity' has a wrong offset!");
static_assert(offsetof(UCommand_PileAttack, CurrentDiveChargeLevelStates) == 0x0000E0, "Member 'UCommand_PileAttack::CurrentDiveChargeLevelStates' has a wrong offset!");
static_assert(offsetof(UCommand_PileAttack, CurrentDiveLoopFXInstance) == 0x0000F0, "Member 'UCommand_PileAttack::CurrentDiveLoopFXInstance' has a wrong offset!");
static_assert(offsetof(UCommand_PileAttack, CurrentDiveAbility) == 0x0000F8, "Member 'UCommand_PileAttack::CurrentDiveAbility' has a wrong offset!");

// Class Zion.StatusEffectComponent
// 0x00D8 (0x0178 - 0x00A0)
class UStatusEffectComponent final : public UActorComponent
{
public:
	TMulticastInlineDelegate<void(class UStatusEffect* StatusEffect)> OnStatusEffectLaunchedDelegate; // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UStatusEffect* StatusEffect)> OnStatusEffectStoppedDelegate; // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_C0[0x30];                                      // 0x00C0(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UStatusEffect>              StatusEffectBurn;                                  // 0x00F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UStatusEffect>              StatusEffectFreeze;                                // 0x00F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
