#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Zion

#include "Basic.hpp"

#include "Zion_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "EventSystem_structs.hpp"
#include "SpineExtension_structs.hpp"
#include "AIModule_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"
#include "FMODStudio_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function Zion.AbilityEffect.GetAbilityForward
// 0x0018 (0x0018 - 0x0000)
struct AbilityEffect_GetAbilityForward final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityEffect_GetAbilityForward) == 0x000008, "Wrong alignment on AbilityEffect_GetAbilityForward");
static_assert(sizeof(AbilityEffect_GetAbilityForward) == 0x000018, "Wrong size on AbilityEffect_GetAbilityForward");
static_assert(offsetof(AbilityEffect_GetAbilityForward, ReturnValue) == 0x000000, "Member 'AbilityEffect_GetAbilityForward::ReturnValue' has a wrong offset!");

// Function Zion.AbilityEffect.GetAbilityLocation
// 0x0018 (0x0018 - 0x0000)
struct AbilityEffect_GetAbilityLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityEffect_GetAbilityLocation) == 0x000008, "Wrong alignment on AbilityEffect_GetAbilityLocation");
static_assert(sizeof(AbilityEffect_GetAbilityLocation) == 0x000018, "Wrong size on AbilityEffect_GetAbilityLocation");
static_assert(offsetof(AbilityEffect_GetAbilityLocation, ReturnValue) == 0x000000, "Member 'AbilityEffect_GetAbilityLocation::ReturnValue' has a wrong offset!");

// Function Zion.AbilityEffect.GetSource
// 0x0008 (0x0008 - 0x0000)
struct AbilityEffect_GetSource final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityEffect_GetSource) == 0x000008, "Wrong alignment on AbilityEffect_GetSource");
static_assert(sizeof(AbilityEffect_GetSource) == 0x000008, "Wrong size on AbilityEffect_GetSource");
static_assert(offsetof(AbilityEffect_GetSource, ReturnValue) == 0x000000, "Member 'AbilityEffect_GetSource::ReturnValue' has a wrong offset!");

// Function Zion.AbilityEffect.GetSourceLocation
// 0x0018 (0x0018 - 0x0000)
struct AbilityEffect_GetSourceLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityEffect_GetSourceLocation) == 0x000008, "Wrong alignment on AbilityEffect_GetSourceLocation");
static_assert(sizeof(AbilityEffect_GetSourceLocation) == 0x000018, "Wrong size on AbilityEffect_GetSourceLocation");
static_assert(offsetof(AbilityEffect_GetSourceLocation, ReturnValue) == 0x000000, "Member 'AbilityEffect_GetSourceLocation::ReturnValue' has a wrong offset!");

// Function Zion.AbilityEffect.GetTarget
// 0x0008 (0x0008 - 0x0000)
struct AbilityEffect_GetTarget final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityEffect_GetTarget) == 0x000008, "Wrong alignment on AbilityEffect_GetTarget");
static_assert(sizeof(AbilityEffect_GetTarget) == 0x000008, "Wrong size on AbilityEffect_GetTarget");
static_assert(offsetof(AbilityEffect_GetTarget, ReturnValue) == 0x000000, "Member 'AbilityEffect_GetTarget::ReturnValue' has a wrong offset!");

// Function Zion.AbilityEffect.GetTargetForward
// 0x0018 (0x0018 - 0x0000)
struct AbilityEffect_GetTargetForward final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityEffect_GetTargetForward) == 0x000008, "Wrong alignment on AbilityEffect_GetTargetForward");
static_assert(sizeof(AbilityEffect_GetTargetForward) == 0x000018, "Wrong size on AbilityEffect_GetTargetForward");
static_assert(offsetof(AbilityEffect_GetTargetForward, ReturnValue) == 0x000000, "Member 'AbilityEffect_GetTargetForward::ReturnValue' has a wrong offset!");

// Function Zion.AbilityEffect.GetTargetLocation
// 0x0018 (0x0018 - 0x0000)
struct AbilityEffect_GetTargetLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityEffect_GetTargetLocation) == 0x000008, "Wrong alignment on AbilityEffect_GetTargetLocation");
static_assert(sizeof(AbilityEffect_GetTargetLocation) == 0x000018, "Wrong size on AbilityEffect_GetTargetLocation");
static_assert(offsetof(AbilityEffect_GetTargetLocation, ReturnValue) == 0x000000, "Member 'AbilityEffect_GetTargetLocation::ReturnValue' has a wrong offset!");

// Function Zion.AbilityEffect.GetToTargetDirection
// 0x0038 (0x0038 - 0x0000)
struct AbilityEffect_GetToTargetDirection final
{
public:
	EDirectionSource                              DirectionSource;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Axis;                                              // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityEffect_GetToTargetDirection) == 0x000008, "Wrong alignment on AbilityEffect_GetToTargetDirection");
static_assert(sizeof(AbilityEffect_GetToTargetDirection) == 0x000038, "Wrong size on AbilityEffect_GetToTargetDirection");
static_assert(offsetof(AbilityEffect_GetToTargetDirection, DirectionSource) == 0x000000, "Member 'AbilityEffect_GetToTargetDirection::DirectionSource' has a wrong offset!");
static_assert(offsetof(AbilityEffect_GetToTargetDirection, Axis) == 0x000008, "Member 'AbilityEffect_GetToTargetDirection::Axis' has a wrong offset!");
static_assert(offsetof(AbilityEffect_GetToTargetDirection, ReturnValue) == 0x000020, "Member 'AbilityEffect_GetToTargetDirection::ReturnValue' has a wrong offset!");

// Function Zion.AbilityEffect.IsFrontalAbility
// 0x0001 (0x0001 - 0x0000)
struct AbilityEffect_IsFrontalAbility final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityEffect_IsFrontalAbility) == 0x000001, "Wrong alignment on AbilityEffect_IsFrontalAbility");
static_assert(sizeof(AbilityEffect_IsFrontalAbility) == 0x000001, "Wrong size on AbilityEffect_IsFrontalAbility");
static_assert(offsetof(AbilityEffect_IsFrontalAbility, ReturnValue) == 0x000000, "Member 'AbilityEffect_IsFrontalAbility::ReturnValue' has a wrong offset!");

// Function Zion.EventAction_MoveTo_TalkDistance.OnMoveCompleted
// 0x0008 (0x0008 - 0x0000)
struct EventAction_MoveTo_TalkDistance_OnMoveCompleted final
{
public:
	struct FAIRequestID                           RequestID;                                         // 0x0000(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	EPathFollowingResult                          Result;                                            // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EventAction_MoveTo_TalkDistance_OnMoveCompleted) == 0x000004, "Wrong alignment on EventAction_MoveTo_TalkDistance_OnMoveCompleted");
static_assert(sizeof(EventAction_MoveTo_TalkDistance_OnMoveCompleted) == 0x000008, "Wrong size on EventAction_MoveTo_TalkDistance_OnMoveCompleted");
static_assert(offsetof(EventAction_MoveTo_TalkDistance_OnMoveCompleted, RequestID) == 0x000000, "Member 'EventAction_MoveTo_TalkDistance_OnMoveCompleted::RequestID' has a wrong offset!");
static_assert(offsetof(EventAction_MoveTo_TalkDistance_OnMoveCompleted, Result) == 0x000004, "Member 'EventAction_MoveTo_TalkDistance_OnMoveCompleted::Result' has a wrong offset!");

// Function Zion.AbilityEffectTimed.OnUpdate
// 0x000C (0x000C - 0x0000)
struct AbilityEffectTimed_OnUpdate final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         out_ConsumedDeltaTime;                             // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AbilityEffectTimed_OnUpdate) == 0x000004, "Wrong alignment on AbilityEffectTimed_OnUpdate");
static_assert(sizeof(AbilityEffectTimed_OnUpdate) == 0x00000C, "Wrong size on AbilityEffectTimed_OnUpdate");
static_assert(offsetof(AbilityEffectTimed_OnUpdate, DeltaTime) == 0x000000, "Member 'AbilityEffectTimed_OnUpdate::DeltaTime' has a wrong offset!");
static_assert(offsetof(AbilityEffectTimed_OnUpdate, out_ConsumedDeltaTime) == 0x000004, "Member 'AbilityEffectTimed_OnUpdate::out_ConsumedDeltaTime' has a wrong offset!");
static_assert(offsetof(AbilityEffectTimed_OnUpdate, ReturnValue) == 0x000008, "Member 'AbilityEffectTimed_OnUpdate::ReturnValue' has a wrong offset!");

// Function Zion.RecollectionBossBaseComponent.BossActivation
// 0x0008 (0x0008 - 0x0000)
struct RecollectionBossBaseComponent_BossActivation final
{
public:
	class AEnemySpawner*                          EnemySpawner;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RecollectionBossBaseComponent_BossActivation) == 0x000008, "Wrong alignment on RecollectionBossBaseComponent_BossActivation");
static_assert(sizeof(RecollectionBossBaseComponent_BossActivation) == 0x000008, "Wrong size on RecollectionBossBaseComponent_BossActivation");
static_assert(offsetof(RecollectionBossBaseComponent_BossActivation, EnemySpawner) == 0x000000, "Member 'RecollectionBossBaseComponent_BossActivation::EnemySpawner' has a wrong offset!");

// Function Zion.RecollectionBossBaseComponent.BossDeathEnd
// 0x0008 (0x0008 - 0x0000)
struct RecollectionBossBaseComponent_BossDeathEnd final
{
public:
	class AEnemySpawner*                          EnemySpawner;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RecollectionBossBaseComponent_BossDeathEnd) == 0x000008, "Wrong alignment on RecollectionBossBaseComponent_BossDeathEnd");
static_assert(sizeof(RecollectionBossBaseComponent_BossDeathEnd) == 0x000008, "Wrong size on RecollectionBossBaseComponent_BossDeathEnd");
static_assert(offsetof(RecollectionBossBaseComponent_BossDeathEnd, EnemySpawner) == 0x000000, "Member 'RecollectionBossBaseComponent_BossDeathEnd::EnemySpawner' has a wrong offset!");

// Function Zion.RecollectionBossBaseComponent.BossDeathStart
// 0x0008 (0x0008 - 0x0000)
struct RecollectionBossBaseComponent_BossDeathStart final
{
public:
	class AEnemySpawner*                          EnemySpawner;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RecollectionBossBaseComponent_BossDeathStart) == 0x000008, "Wrong alignment on RecollectionBossBaseComponent_BossDeathStart");
static_assert(sizeof(RecollectionBossBaseComponent_BossDeathStart) == 0x000008, "Wrong size on RecollectionBossBaseComponent_BossDeathStart");
static_assert(offsetof(RecollectionBossBaseComponent_BossDeathStart, EnemySpawner) == 0x000000, "Member 'RecollectionBossBaseComponent_BossDeathStart::EnemySpawner' has a wrong offset!");

// Function Zion.RecollectionBossBaseComponent.InstantiateRetryDialog
// 0x0001 (0x0001 - 0x0000)
struct RecollectionBossBaseComponent_InstantiateRetryDialog final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RecollectionBossBaseComponent_InstantiateRetryDialog) == 0x000001, "Wrong alignment on RecollectionBossBaseComponent_InstantiateRetryDialog");
static_assert(sizeof(RecollectionBossBaseComponent_InstantiateRetryDialog) == 0x000001, "Wrong size on RecollectionBossBaseComponent_InstantiateRetryDialog");
static_assert(offsetof(RecollectionBossBaseComponent_InstantiateRetryDialog, ReturnValue) == 0x000000, "Member 'RecollectionBossBaseComponent_InstantiateRetryDialog::ReturnValue' has a wrong offset!");

// Function Zion.RecollectionBossBaseComponent.SetNewGameGenerationOverride
// 0x0004 (0x0004 - 0x0000)
struct RecollectionBossBaseComponent_SetNewGameGenerationOverride final
{
public:
	int32                                         GenerationOverride;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RecollectionBossBaseComponent_SetNewGameGenerationOverride) == 0x000004, "Wrong alignment on RecollectionBossBaseComponent_SetNewGameGenerationOverride");
static_assert(sizeof(RecollectionBossBaseComponent_SetNewGameGenerationOverride) == 0x000004, "Wrong size on RecollectionBossBaseComponent_SetNewGameGenerationOverride");
static_assert(offsetof(RecollectionBossBaseComponent_SetNewGameGenerationOverride, GenerationOverride) == 0x000000, "Member 'RecollectionBossBaseComponent_SetNewGameGenerationOverride::GenerationOverride' has a wrong offset!");

// Function Zion.RecollectionBossBaseComponent.CanLeaveRecollectionBoss
// 0x0001 (0x0001 - 0x0000)
struct RecollectionBossBaseComponent_CanLeaveRecollectionBoss final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RecollectionBossBaseComponent_CanLeaveRecollectionBoss) == 0x000001, "Wrong alignment on RecollectionBossBaseComponent_CanLeaveRecollectionBoss");
static_assert(sizeof(RecollectionBossBaseComponent_CanLeaveRecollectionBoss) == 0x000001, "Wrong size on RecollectionBossBaseComponent_CanLeaveRecollectionBoss");
static_assert(offsetof(RecollectionBossBaseComponent_CanLeaveRecollectionBoss, ReturnValue) == 0x000000, "Member 'RecollectionBossBaseComponent_CanLeaveRecollectionBoss::ReturnValue' has a wrong offset!");

// Function Zion.RecollectionBossBaseComponent.GetCachedEnemySpawner
// 0x0008 (0x0008 - 0x0000)
struct RecollectionBossBaseComponent_GetCachedEnemySpawner final
{
public:
	class AEnemySpawner*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RecollectionBossBaseComponent_GetCachedEnemySpawner) == 0x000008, "Wrong alignment on RecollectionBossBaseComponent_GetCachedEnemySpawner");
static_assert(sizeof(RecollectionBossBaseComponent_GetCachedEnemySpawner) == 0x000008, "Wrong size on RecollectionBossBaseComponent_GetCachedEnemySpawner");
static_assert(offsetof(RecollectionBossBaseComponent_GetCachedEnemySpawner, ReturnValue) == 0x000000, "Member 'RecollectionBossBaseComponent_GetCachedEnemySpawner::ReturnValue' has a wrong offset!");

// Function Zion.RecollectionBossBaseComponent.GetNewGameGenerationOverride
// 0x0004 (0x0004 - 0x0000)
struct RecollectionBossBaseComponent_GetNewGameGenerationOverride final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RecollectionBossBaseComponent_GetNewGameGenerationOverride) == 0x000004, "Wrong alignment on RecollectionBossBaseComponent_GetNewGameGenerationOverride");
static_assert(sizeof(RecollectionBossBaseComponent_GetNewGameGenerationOverride) == 0x000004, "Wrong size on RecollectionBossBaseComponent_GetNewGameGenerationOverride");
static_assert(offsetof(RecollectionBossBaseComponent_GetNewGameGenerationOverride, ReturnValue) == 0x000000, "Member 'RecollectionBossBaseComponent_GetNewGameGenerationOverride::ReturnValue' has a wrong offset!");

// Function Zion.RecollectionBossBaseComponent.IsStarted
// 0x0001 (0x0001 - 0x0000)
struct RecollectionBossBaseComponent_IsStarted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RecollectionBossBaseComponent_IsStarted) == 0x000001, "Wrong alignment on RecollectionBossBaseComponent_IsStarted");
static_assert(sizeof(RecollectionBossBaseComponent_IsStarted) == 0x000001, "Wrong size on RecollectionBossBaseComponent_IsStarted");
static_assert(offsetof(RecollectionBossBaseComponent_IsStarted, ReturnValue) == 0x000000, "Member 'RecollectionBossBaseComponent_IsStarted::ReturnValue' has a wrong offset!");

// Function Zion.CommandModule.GetCharacter
// 0x0008 (0x0008 - 0x0000)
struct CommandModule_GetCharacter final
{
public:
	class ACharacter*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommandModule_GetCharacter) == 0x000008, "Wrong alignment on CommandModule_GetCharacter");
static_assert(sizeof(CommandModule_GetCharacter) == 0x000008, "Wrong size on CommandModule_GetCharacter");
static_assert(offsetof(CommandModule_GetCharacter, ReturnValue) == 0x000000, "Member 'CommandModule_GetCharacter::ReturnValue' has a wrong offset!");

// Function Zion.CommandModule.GetCommand
// 0x0008 (0x0008 - 0x0000)
struct CommandModule_GetCommand final
{
public:
	class UCommand*                               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommandModule_GetCommand) == 0x000008, "Wrong alignment on CommandModule_GetCommand");
static_assert(sizeof(CommandModule_GetCommand) == 0x000008, "Wrong size on CommandModule_GetCommand");
static_assert(offsetof(CommandModule_GetCommand, ReturnValue) == 0x000000, "Member 'CommandModule_GetCommand::ReturnValue' has a wrong offset!");

// Function Zion.CommandModule.GetExecutionTime
// 0x0004 (0x0004 - 0x0000)
struct CommandModule_GetExecutionTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommandModule_GetExecutionTime) == 0x000004, "Wrong alignment on CommandModule_GetExecutionTime");
static_assert(sizeof(CommandModule_GetExecutionTime) == 0x000004, "Wrong size on CommandModule_GetExecutionTime");
static_assert(offsetof(CommandModule_GetExecutionTime, ReturnValue) == 0x000000, "Member 'CommandModule_GetExecutionTime::ReturnValue' has a wrong offset!");

// Function Zion.Ability.GetExecutionTime
// 0x0004 (0x0004 - 0x0000)
struct Ability_GetExecutionTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Ability_GetExecutionTime) == 0x000004, "Wrong alignment on Ability_GetExecutionTime");
static_assert(sizeof(Ability_GetExecutionTime) == 0x000004, "Wrong size on Ability_GetExecutionTime");
static_assert(offsetof(Ability_GetExecutionTime, ReturnValue) == 0x000000, "Member 'Ability_GetExecutionTime::ReturnValue' has a wrong offset!");

// Function Zion.Ability.GetSource
// 0x0008 (0x0008 - 0x0000)
struct Ability_GetSource final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Ability_GetSource) == 0x000008, "Wrong alignment on Ability_GetSource");
static_assert(sizeof(Ability_GetSource) == 0x000008, "Wrong size on Ability_GetSource");
static_assert(offsetof(Ability_GetSource, ReturnValue) == 0x000000, "Member 'Ability_GetSource::ReturnValue' has a wrong offset!");

// Function Zion.Ability.GetWeightCategory
// 0x0001 (0x0001 - 0x0000)
struct Ability_GetWeightCategory final
{
public:
	EAbilityWeightCategory                        ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Ability_GetWeightCategory) == 0x000001, "Wrong alignment on Ability_GetWeightCategory");
static_assert(sizeof(Ability_GetWeightCategory) == 0x000001, "Wrong size on Ability_GetWeightCategory");
static_assert(offsetof(Ability_GetWeightCategory, ReturnValue) == 0x000000, "Member 'Ability_GetWeightCategory::ReturnValue' has a wrong offset!");

// Function Zion.Command.OnCanBeStarted
// 0x0001 (0x0001 - 0x0000)
struct Command_OnCanBeStarted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Command_OnCanBeStarted) == 0x000001, "Wrong alignment on Command_OnCanBeStarted");
static_assert(sizeof(Command_OnCanBeStarted) == 0x000001, "Wrong size on Command_OnCanBeStarted");
static_assert(offsetof(Command_OnCanBeStarted, ReturnValue) == 0x000000, "Member 'Command_OnCanBeStarted::ReturnValue' has a wrong offset!");

// Function Zion.Command.OnFinish
// 0x0001 (0x0001 - 0x0000)
struct Command_OnFinish final
{
public:
	ECommandFinishType                            FinishType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Command_OnFinish) == 0x000001, "Wrong alignment on Command_OnFinish");
static_assert(sizeof(Command_OnFinish) == 0x000001, "Wrong size on Command_OnFinish");
static_assert(offsetof(Command_OnFinish, FinishType) == 0x000000, "Member 'Command_OnFinish::FinishType' has a wrong offset!");

// Function Zion.Command.OnInitialize
// 0x0008 (0x0008 - 0x0000)
struct Command_OnInitialize final
{
public:
	class APawn*                                  PawnOwner;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Command_OnInitialize) == 0x000008, "Wrong alignment on Command_OnInitialize");
static_assert(sizeof(Command_OnInitialize) == 0x000008, "Wrong size on Command_OnInitialize");
static_assert(offsetof(Command_OnInitialize, PawnOwner) == 0x000000, "Member 'Command_OnInitialize::PawnOwner' has a wrong offset!");

// Function Zion.Command.GetCharacter
// 0x0008 (0x0008 - 0x0000)
struct Command_GetCharacter final
{
public:
	class ACharacter*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Command_GetCharacter) == 0x000008, "Wrong alignment on Command_GetCharacter");
static_assert(sizeof(Command_GetCharacter) == 0x000008, "Wrong size on Command_GetCharacter");
static_assert(offsetof(Command_GetCharacter, ReturnValue) == 0x000000, "Member 'Command_GetCharacter::ReturnValue' has a wrong offset!");

// Function Zion.Command.GetCommandCategory
// 0x0001 (0x0001 - 0x0000)
struct Command_GetCommandCategory final
{
public:
	ECommandCategory                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Command_GetCommandCategory) == 0x000001, "Wrong alignment on Command_GetCommandCategory");
static_assert(sizeof(Command_GetCommandCategory) == 0x000001, "Wrong size on Command_GetCommandCategory");
static_assert(offsetof(Command_GetCommandCategory, ReturnValue) == 0x000000, "Member 'Command_GetCommandCategory::ReturnValue' has a wrong offset!");

// Function Zion.Command.GetCommandLayer
// 0x0001 (0x0001 - 0x0000)
struct Command_GetCommandLayer final
{
public:
	ECommandLayerType                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Command_GetCommandLayer) == 0x000001, "Wrong alignment on Command_GetCommandLayer");
static_assert(sizeof(Command_GetCommandLayer) == 0x000001, "Wrong size on Command_GetCommandLayer");
static_assert(offsetof(Command_GetCommandLayer, ReturnValue) == 0x000000, "Member 'Command_GetCommandLayer::ReturnValue' has a wrong offset!");

// Function Zion.Command.GetExecutionTime
// 0x0004 (0x0004 - 0x0000)
struct Command_GetExecutionTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Command_GetExecutionTime) == 0x000004, "Wrong alignment on Command_GetExecutionTime");
static_assert(sizeof(Command_GetExecutionTime) == 0x000004, "Wrong size on Command_GetExecutionTime");
static_assert(offsetof(Command_GetExecutionTime, ReturnValue) == 0x000000, "Member 'Command_GetExecutionTime::ReturnValue' has a wrong offset!");

// Function Zion.Command.GetInputSnapshot
// 0x00B8 (0x00B8 - 0x0000)
struct Command_GetInputSnapshot final
{
public:
	struct FInputSnapshot                         ReturnValue;                                       // 0x0000(0x00B8)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(Command_GetInputSnapshot) == 0x000008, "Wrong alignment on Command_GetInputSnapshot");
static_assert(sizeof(Command_GetInputSnapshot) == 0x0000B8, "Wrong size on Command_GetInputSnapshot");
static_assert(offsetof(Command_GetInputSnapshot, ReturnValue) == 0x000000, "Member 'Command_GetInputSnapshot::ReturnValue' has a wrong offset!");

// Function Zion.Command.GetInvokedInputAction
// 0x0008 (0x0008 - 0x0000)
struct Command_GetInvokedInputAction final
{
public:
	const class UInputAction*                     ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Command_GetInvokedInputAction) == 0x000008, "Wrong alignment on Command_GetInvokedInputAction");
static_assert(sizeof(Command_GetInvokedInputAction) == 0x000008, "Wrong size on Command_GetInvokedInputAction");
static_assert(offsetof(Command_GetInvokedInputAction, ReturnValue) == 0x000000, "Member 'Command_GetInvokedInputAction::ReturnValue' has a wrong offset!");

// Function Zion.Command.GetModule
// 0x0018 (0x0018 - 0x0000)
struct Command_GetModule final
{
public:
	TSubclassOf<class UCommandModule>             CommandModuleClass;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnsureIfMissing;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommandModule*                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Command_GetModule) == 0x000008, "Wrong alignment on Command_GetModule");
static_assert(sizeof(Command_GetModule) == 0x000018, "Wrong size on Command_GetModule");
static_assert(offsetof(Command_GetModule, CommandModuleClass) == 0x000000, "Member 'Command_GetModule::CommandModuleClass' has a wrong offset!");
static_assert(offsetof(Command_GetModule, bEnsureIfMissing) == 0x000008, "Member 'Command_GetModule::bEnsureIfMissing' has a wrong offset!");
static_assert(offsetof(Command_GetModule, ReturnValue) == 0x000010, "Member 'Command_GetModule::ReturnValue' has a wrong offset!");

// Function Zion.Command.GetMovementComponent
// 0x0008 (0x0008 - 0x0000)
struct Command_GetMovementComponent final
{
public:
	class UMovementComponent*                     ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Command_GetMovementComponent) == 0x000008, "Wrong alignment on Command_GetMovementComponent");
static_assert(sizeof(Command_GetMovementComponent) == 0x000008, "Wrong size on Command_GetMovementComponent");
static_assert(offsetof(Command_GetMovementComponent, ReturnValue) == 0x000000, "Member 'Command_GetMovementComponent::ReturnValue' has a wrong offset!");

// Function Zion.Command.GetPawn
// 0x0008 (0x0008 - 0x0000)
struct Command_GetPawn final
{
public:
	class APawn*                                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Command_GetPawn) == 0x000008, "Wrong alignment on Command_GetPawn");
static_assert(sizeof(Command_GetPawn) == 0x000008, "Wrong size on Command_GetPawn");
static_assert(offsetof(Command_GetPawn, ReturnValue) == 0x000000, "Member 'Command_GetPawn::ReturnValue' has a wrong offset!");

// Function Zion.Command.GetSourceCommandSet
// 0x0008 (0x0008 - 0x0000)
struct Command_GetSourceCommandSet final
{
public:
	const class UCommandSet*                      ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Command_GetSourceCommandSet) == 0x000008, "Wrong alignment on Command_GetSourceCommandSet");
static_assert(sizeof(Command_GetSourceCommandSet) == 0x000008, "Wrong size on Command_GetSourceCommandSet");
static_assert(offsetof(Command_GetSourceCommandSet, ReturnValue) == 0x000000, "Member 'Command_GetSourceCommandSet::ReturnValue' has a wrong offset!");

// Function Zion.Command.IsInvokedInputPressed
// 0x0001 (0x0001 - 0x0000)
struct Command_IsInvokedInputPressed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Command_IsInvokedInputPressed) == 0x000001, "Wrong alignment on Command_IsInvokedInputPressed");
static_assert(sizeof(Command_IsInvokedInputPressed) == 0x000001, "Wrong size on Command_IsInvokedInputPressed");
static_assert(offsetof(Command_IsInvokedInputPressed, ReturnValue) == 0x000000, "Member 'Command_IsInvokedInputPressed::ReturnValue' has a wrong offset!");

// Function Zion.StatusEffectComponent.LaunchStatusEffect
// 0x0001 (0x0001 - 0x0000)
struct StatusEffectComponent_LaunchStatusEffect final
{
public:
	EStatusEffectType                             StatusEffectType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StatusEffectComponent_LaunchStatusEffect) == 0x000001, "Wrong alignment on StatusEffectComponent_LaunchStatusEffect");
static_assert(sizeof(StatusEffectComponent_LaunchStatusEffect) == 0x000001, "Wrong size on StatusEffectComponent_LaunchStatusEffect");
static_assert(offsetof(StatusEffectComponent_LaunchStatusEffect, StatusEffectType) == 0x000000, "Member 'StatusEffectComponent_LaunchStatusEffect::StatusEffectType' has a wrong offset!");

// Function Zion.StatusEffectComponent.LaunchStatusEffectFromClass
// 0x0008 (0x0008 - 0x0000)
struct StatusEffectComponent_LaunchStatusEffectFromClass final
{
public:
	TSubclassOf<class UStatusEffect>              StatusEffectClass;                                 // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StatusEffectComponent_LaunchStatusEffectFromClass) == 0x000008, "Wrong alignment on StatusEffectComponent_LaunchStatusEffectFromClass");
static_assert(sizeof(StatusEffectComponent_LaunchStatusEffectFromClass) == 0x000008, "Wrong size on StatusEffectComponent_LaunchStatusEffectFromClass");
static_assert(offsetof(StatusEffectComponent_LaunchStatusEffectFromClass, StatusEffectClass) == 0x000000, "Member 'StatusEffectComponent_LaunchStatusEffectFromClass::StatusEffectClass' has a wrong offset!");

// Function Zion.AbilityHitboxTarget.GetTarget
// 0x0008 (0x0008 - 0x0000)
struct AbilityHitboxTarget_GetTarget final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AbilityHitboxTarget_GetTarget) == 0x000008, "Wrong alignment on AbilityHitboxTarget_GetTarget");
static_assert(sizeof(AbilityHitboxTarget_GetTarget) == 0x000008, "Wrong size on AbilityHitboxTarget_GetTarget");
static_assert(offsetof(AbilityHitboxTarget_GetTarget, ReturnValue) == 0x000000, "Member 'AbilityHitboxTarget_GetTarget::ReturnValue' has a wrong offset!");

// Function Zion.GameSettingsSubsystem.GetMaxResolutionScale
// 0x0004 (0x0004 - 0x0000)
struct GameSettingsSubsystem_GetMaxResolutionScale final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameSettingsSubsystem_GetMaxResolutionScale) == 0x000004, "Wrong alignment on GameSettingsSubsystem_GetMaxResolutionScale");
static_assert(sizeof(GameSettingsSubsystem_GetMaxResolutionScale) == 0x000004, "Wrong size on GameSettingsSubsystem_GetMaxResolutionScale");
static_assert(offsetof(GameSettingsSubsystem_GetMaxResolutionScale, ReturnValue) == 0x000000, "Member 'GameSettingsSubsystem_GetMaxResolutionScale::ReturnValue' has a wrong offset!");

// Function Zion.GameSettingsSubsystem.GetMinResolutionScale
// 0x0004 (0x0004 - 0x0000)
struct GameSettingsSubsystem_GetMinResolutionScale final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameSettingsSubsystem_GetMinResolutionScale) == 0x000004, "Wrong alignment on GameSettingsSubsystem_GetMinResolutionScale");
static_assert(sizeof(GameSettingsSubsystem_GetMinResolutionScale) == 0x000004, "Wrong size on GameSettingsSubsystem_GetMinResolutionScale");
static_assert(offsetof(GameSettingsSubsystem_GetMinResolutionScale, ReturnValue) == 0x000000, "Member 'GameSettingsSubsystem_GetMinResolutionScale::ReturnValue' has a wrong offset!");

// Function Zion.GameSettingsSubsystem.ResetAutoClimbDirectionMode
// 0x0001 (0x0001 - 0x0000)
struct GameSettingsSubsystem_ResetAutoClimbDirectionMode final
{
public:
	EAutoClimbDirectionMode                       ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameSettingsSubsystem_ResetAutoClimbDirectionMode) == 0x000001, "Wrong alignment on GameSettingsSubsystem_ResetAutoClimbDirectionMode");
static_assert(sizeof(GameSettingsSubsystem_ResetAutoClimbDirectionMode) == 0x000001, "Wrong size on GameSettingsSubsystem_ResetAutoClimbDirectionMode");
static_assert(offsetof(GameSettingsSubsystem_ResetAutoClimbDirectionMode, ReturnValue) == 0x000000, "Member 'GameSettingsSubsystem_ResetAutoClimbDirectionMode::ReturnValue' has a wrong offset!");

// Function Zion.GameSettingsSubsystem.ResetAutoSkipAlreadySeenEvents
// 0x0001 (0x0001 - 0x0000)
struct GameSettingsSubsystem_ResetAutoSkipAlreadySeenEvents final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameSettingsSubsystem_ResetAutoSkipAlreadySeenEvents) == 0x000001, "Wrong alignment on GameSettingsSubsystem_ResetAutoSkipAlreadySeenEvents");
static_assert(sizeof(GameSettingsSubsystem_ResetAutoSkipAlreadySeenEvents) == 0x000001, "Wrong size on GameSettingsSubsystem_ResetAutoSkipAlreadySeenEvents");
static_assert(offsetof(GameSettingsSubsystem_ResetAutoSkipAlreadySeenEvents, ReturnValue) == 0x000000, "Member 'GameSettingsSubsystem_ResetAutoSkipAlreadySeenEvents::ReturnValue' has a wrong offset!");

// Function Zion.GameSettingsSubsystem.ResetCameraOscillation
// 0x0001 (0x0001 - 0x0000)
struct GameSettingsSubsystem_ResetCameraOscillation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameSettingsSubsystem_ResetCameraOscillation) == 0x000001, "Wrong alignment on GameSettingsSubsystem_ResetCameraOscillation");
static_assert(sizeof(GameSettingsSubsystem_ResetCameraOscillation) == 0x000001, "Wrong size on GameSettingsSubsystem_ResetCameraOscillation");
static_assert(offsetof(GameSettingsSubsystem_ResetCameraOscillation, ReturnValue) == 0x000000, "Member 'GameSettingsSubsystem_ResetCameraOscillation::ReturnValue' has a wrong offset!");

// Function Zion.GameSettingsSubsystem.ResetCameraShake
// 0x0004 (0x0004 - 0x0000)
struct GameSettingsSubsystem_ResetCameraShake final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameSettingsSubsystem_ResetCameraShake) == 0x000004, "Wrong alignment on GameSettingsSubsystem_ResetCameraShake");
static_assert(sizeof(GameSettingsSubsystem_ResetCameraShake) == 0x000004, "Wrong size on GameSettingsSubsystem_ResetCameraShake");
static_assert(offsetof(GameSettingsSubsystem_ResetCameraShake, ReturnValue) == 0x000000, "Member 'GameSettingsSubsystem_ResetCameraShake::ReturnValue' has a wrong offset!");

// Function Zion.GameSettingsSubsystem.ResetControllerVibration
// 0x0004 (0x0004 - 0x0000)
struct GameSettingsSubsystem_ResetControllerVibration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameSettingsSubsystem_ResetControllerVibration) == 0x000004, "Wrong alignment on GameSettingsSubsystem_ResetControllerVibration");
static_assert(sizeof(GameSettingsSubsystem_ResetControllerVibration) == 0x000004, "Wrong size on GameSettingsSubsystem_ResetControllerVibration");
static_assert(offsetof(GameSettingsSubsystem_ResetControllerVibration, ReturnValue) == 0x000000, "Member 'GameSettingsSubsystem_ResetControllerVibration::ReturnValue' has a wrong offset!");

// Function Zion.GameSettingsSubsystem.ResetDisplayAchievementNotifications
// 0x0001 (0x0001 - 0x0000)
struct GameSettingsSubsystem_ResetDisplayAchievementNotifications final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameSettingsSubsystem_ResetDisplayAchievementNotifications) == 0x000001, "Wrong alignment on GameSettingsSubsystem_ResetDisplayAchievementNotifications");
static_assert(sizeof(GameSettingsSubsystem_ResetDisplayAchievementNotifications) == 0x000001, "Wrong size on GameSettingsSubsystem_ResetDisplayAchievementNotifications");
static_assert(offsetof(GameSettingsSubsystem_ResetDisplayAchievementNotifications, ReturnValue) == 0x000000, "Member 'GameSettingsSubsystem_ResetDisplayAchievementNotifications::ReturnValue' has a wrong offset!");

// Function Zion.GameSettingsSubsystem.ResetDisplayDamageValues
// 0x0001 (0x0001 - 0x0000)
struct GameSettingsSubsystem_ResetDisplayDamageValues final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameSettingsSubsystem_ResetDisplayDamageValues) == 0x000001, "Wrong alignment on GameSettingsSubsystem_ResetDisplayDamageValues");
static_assert(sizeof(GameSettingsSubsystem_ResetDisplayDamageValues) == 0x000001, "Wrong size on GameSettingsSubsystem_ResetDisplayDamageValues");
static_assert(offsetof(GameSettingsSubsystem_ResetDisplayDamageValues, ReturnValue) == 0x000000, "Member 'GameSettingsSubsystem_ResetDisplayDamageValues::ReturnValue' has a wrong offset!");

// Function Zion.GameSettingsSubsystem.ResetDisplayEnemyGauges
// 0x0001 (0x0001 - 0x0000)
struct GameSettingsSubsystem_ResetDisplayEnemyGauges final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameSettingsSubsystem_ResetDisplayEnemyGauges) == 0x000001, "Wrong alignment on GameSettingsSubsystem_ResetDisplayEnemyGauges");
static_assert(sizeof(GameSettingsSubsystem_ResetDisplayEnemyGauges) == 0x000001, "Wrong size on GameSettingsSubsystem_ResetDisplayEnemyGauges");
static_assert(offsetof(GameSettingsSubsystem_ResetDisplayEnemyGauges, ReturnValue) == 0x000000, "Member 'GameSettingsSubsystem_ResetDisplayEnemyGauges::ReturnValue' has a wrong offset!");

// Function Zion.GameSettingsSubsystem.ResetDisplayHealValues
// 0x0001 (0x0001 - 0x0000)
struct GameSettingsSubsystem_ResetDisplayHealValues final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameSettingsSubsystem_ResetDisplayHealValues) == 0x000001, "Wrong alignment on GameSettingsSubsystem_ResetDisplayHealValues");
static_assert(sizeof(GameSettingsSubsystem_ResetDisplayHealValues) == 0x000001, "Wrong size on GameSettingsSubsystem_ResetDisplayHealValues");
static_assert(offsetof(GameSettingsSubsystem_ResetDisplayHealValues, ReturnValue) == 0x000000, "Member 'GameSettingsSubsystem_ResetDisplayHealValues::ReturnValue' has a wrong offset!");

// Function Zion.GameSettingsSubsystem.ResetDisplayHPAboveGauge
// 0x0001 (0x0001 - 0x0000)
struct GameSettingsSubsystem_ResetDisplayHPAboveGauge final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameSettingsSubsystem_ResetDisplayHPAboveGauge) == 0x000001, "Wrong alignment on GameSettingsSubsystem_ResetDisplayHPAboveGauge");
static_assert(sizeof(GameSettingsSubsystem_ResetDisplayHPAboveGauge) == 0x000001, "Wrong size on GameSettingsSubsystem_ResetDisplayHPAboveGauge");
static_assert(offsetof(GameSettingsSubsystem_ResetDisplayHPAboveGauge, ReturnValue) == 0x000000, "Member 'GameSettingsSubsystem_ResetDisplayHPAboveGauge::ReturnValue' has a wrong offset!");

// Function Zion.GameSettingsSubsystem.ResetDisplayPlayerUI
// 0x0001 (0x0001 - 0x0000)
struct GameSettingsSubsystem_ResetDisplayPlayerUI final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameSettingsSubsystem_ResetDisplayPlayerUI) == 0x000001, "Wrong alignment on GameSettingsSubsystem_ResetDisplayPlayerUI");
static_assert(sizeof(GameSettingsSubsystem_ResetDisplayPlayerUI) == 0x000001, "Wrong size on GameSettingsSubsystem_ResetDisplayPlayerUI");
static_assert(offsetof(GameSettingsSubsystem_ResetDisplayPlayerUI, ReturnValue) == 0x000000, "Member 'GameSettingsSubsystem_ResetDisplayPlayerUI::ReturnValue' has a wrong offset!");

// Function Zion.GameSettingsSubsystem.ResetDisplayTutorials
// 0x0001 (0x0001 - 0x0000)
struct GameSettingsSubsystem_ResetDisplayTutorials final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameSettingsSubsystem_ResetDisplayTutorials) == 0x000001, "Wrong alignment on GameSettingsSubsystem_ResetDisplayTutorials");
static_assert(sizeof(GameSettingsSubsystem_ResetDisplayTutorials) == 0x000001, "Wrong size on GameSettingsSubsystem_ResetDisplayTutorials");
static_assert(offsetof(GameSettingsSubsystem_ResetDisplayTutorials, ReturnValue) == 0x000000, "Member 'GameSettingsSubsystem_ResetDisplayTutorials::ReturnValue' has a wrong offset!");

// Function Zion.GameSettingsSubsystem.ResetHoldDownToDodgeStill
// 0x0001 (0x0001 - 0x0000)
struct GameSettingsSubsystem_ResetHoldDownToDodgeStill final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameSettingsSubsystem_ResetHoldDownToDodgeStill) == 0x000001, "Wrong alignment on GameSettingsSubsystem_ResetHoldDownToDodgeStill");
static_assert(sizeof(GameSettingsSubsystem_ResetHoldDownToDodgeStill) == 0x000001, "Wrong size on GameSettingsSubsystem_ResetHoldDownToDodgeStill");
static_assert(offsetof(GameSettingsSubsystem_ResetHoldDownToDodgeStill, ReturnValue) == 0x000000, "Member 'GameSettingsSubsystem_ResetHoldDownToDodgeStill::ReturnValue' has a wrong offset!");

// Function Zion.GameSettingsSubsystem.ResetLowHPFeedbackOpacity
// 0x0004 (0x0004 - 0x0000)
struct GameSettingsSubsystem_ResetLowHPFeedbackOpacity final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameSettingsSubsystem_ResetLowHPFeedbackOpacity) == 0x000004, "Wrong alignment on GameSettingsSubsystem_ResetLowHPFeedbackOpacity");
static_assert(sizeof(GameSettingsSubsystem_ResetLowHPFeedbackOpacity) == 0x000004, "Wrong size on GameSettingsSubsystem_ResetLowHPFeedbackOpacity");
static_assert(offsetof(GameSettingsSubsystem_ResetLowHPFeedbackOpacity, ReturnValue) == 0x000000, "Member 'GameSettingsSubsystem_ResetLowHPFeedbackOpacity::ReturnValue' has a wrong offset!");

// Function Zion.GameSettingsSubsystem.ResetResolutionScale
// 0x0004 (0x0004 - 0x0000)
struct GameSettingsSubsystem_ResetResolutionScale final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameSettingsSubsystem_ResetResolutionScale) == 0x000004, "Wrong alignment on GameSettingsSubsystem_ResetResolutionScale");
static_assert(sizeof(GameSettingsSubsystem_ResetResolutionScale) == 0x000004, "Wrong size on GameSettingsSubsystem_ResetResolutionScale");
static_assert(offsetof(GameSettingsSubsystem_ResetResolutionScale, ReturnValue) == 0x000000, "Member 'GameSettingsSubsystem_ResetResolutionScale::ReturnValue' has a wrong offset!");

// Function Zion.GameSettingsSubsystem.ResetToDefault
// 0x0001 (0x0001 - 0x0000)
struct GameSettingsSubsystem_ResetToDefault final
{
public:
	EGameSettingsType                             GameSettingsToReset;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameSettingsSubsystem_ResetToDefault) == 0x000001, "Wrong alignment on GameSettingsSubsystem_ResetToDefault");
static_assert(sizeof(GameSettingsSubsystem_ResetToDefault) == 0x000001, "Wrong size on GameSettingsSubsystem_ResetToDefault");
static_assert(offsetof(GameSettingsSubsystem_ResetToDefault, GameSettingsToReset) == 0x000000, "Member 'GameSettingsSubsystem_ResetToDefault::GameSettingsToReset' has a wrong offset!");

// Function Zion.GameSettingsSubsystem.SetAntiAliasingMethod
// 0x0002 (0x0002 - 0x0000)
struct GameSettingsSubsystem_SetAntiAliasingMethod final
{
public:
	EAntiAliasingMethod                           NewAntiAliasingMethod;                             // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAntiAliasingMethod                           ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameSettingsSubsystem_SetAntiAliasingMethod) == 0x000001, "Wrong alignment on GameSettingsSubsystem_SetAntiAliasingMethod");
static_assert(sizeof(GameSettingsSubsystem_SetAntiAliasingMethod) == 0x000002, "Wrong size on GameSettingsSubsystem_SetAntiAliasingMethod");
static_assert(offsetof(GameSettingsSubsystem_SetAntiAliasingMethod, NewAntiAliasingMethod) == 0x000000, "Member 'GameSettingsSubsystem_SetAntiAliasingMethod::NewAntiAliasingMethod' has a wrong offset!");
static_assert(offsetof(GameSettingsSubsystem_SetAntiAliasingMethod, ReturnValue) == 0x000001, "Member 'GameSettingsSubsystem_SetAntiAliasingMethod::ReturnValue' has a wrong offset!");

// Function Zion.GameSettingsSubsystem.SetAutoClimbDirectionMode
// 0x0002 (0x0002 - 0x0000)
struct GameSettingsSubsystem_SetAutoClimbDirectionMode final
{
public:
	EAutoClimbDirectionMode                       NewMode;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAutoClimbDirectionMode                       ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameSettingsSubsystem_SetAutoClimbDirectionMode) == 0x000001, "Wrong alignment on GameSettingsSubsystem_SetAutoClimbDirectionMode");
static_assert(sizeof(GameSettingsSubsystem_SetAutoClimbDirectionMode) == 0x000002, "Wrong size on GameSettingsSubsystem_SetAutoClimbDirectionMode");
static_assert(offsetof(GameSettingsSubsystem_SetAutoClimbDirectionMode, NewMode) == 0x000000, "Member 'GameSettingsSubsystem_SetAutoClimbDirectionMode::NewMode' has a wrong offset!");
static_assert(offsetof(GameSettingsSubsystem_SetAutoClimbDirectionMode, ReturnValue) == 0x000001, "Member 'GameSettingsSubsystem_SetAutoClimbDirectionMode::ReturnValue' has a wrong offset!");

// Function Zion.GameSettingsSubsystem.SetAutoSkipAlreadySeenEvents
// 0x0002 (0x0002 - 0x0000)
struct GameSettingsSubsystem_SetAutoSkipAlreadySeenEvents final
{
public:
	bool                                          bAutoSkip;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameSettingsSubsystem_SetAutoSkipAlreadySeenEvents) == 0x000001, "Wrong alignment on GameSettingsSubsystem_SetAutoSkipAlreadySeenEvents");
static_assert(sizeof(GameSettingsSubsystem_SetAutoSkipAlreadySeenEvents) == 0x000002, "Wrong size on GameSettingsSubsystem_SetAutoSkipAlreadySeenEvents");
static_assert(offsetof(GameSettingsSubsystem_SetAutoSkipAlreadySeenEvents, bAutoSkip) == 0x000000, "Member 'GameSettingsSubsystem_SetAutoSkipAlreadySeenEvents::bAutoSkip' has a wrong offset!");
static_assert(offsetof(GameSettingsSubsystem_SetAutoSkipAlreadySeenEvents, ReturnValue) == 0x000001, "Member 'GameSettingsSubsystem_SetAutoSkipAlreadySeenEvents::ReturnValue' has a wrong offset!");

// Function Zion.GameSettingsSubsystem.SetAutoUploadCrashReport
// 0x0001 (0x0001 - 0x0000)
struct GameSettingsSubsystem_SetAutoUploadCrashReport final
{
public:
	bool                                          bNewAutoUploadCrashReport;                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameSettingsSubsystem_SetAutoUploadCrashReport) == 0x000001, "Wrong alignment on GameSettingsSubsystem_SetAutoUploadCrashReport");
static_assert(sizeof(GameSettingsSubsystem_SetAutoUploadCrashReport) == 0x000001, "Wrong size on GameSettingsSubsystem_SetAutoUploadCrashReport");
static_assert(offsetof(GameSettingsSubsystem_SetAutoUploadCrashReport, bNewAutoUploadCrashReport) == 0x000000, "Member 'GameSettingsSubsystem_SetAutoUploadCrashReport::bNewAutoUploadCrashReport' has a wrong offset!");

// Function Zion.GameSettingsSubsystem.SetCameraOscillation
// 0x0002 (0x0002 - 0x0000)
struct GameSettingsSubsystem_SetCameraOscillation final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameSettingsSubsystem_SetCameraOscillation) == 0x000001, "Wrong alignment on GameSettingsSubsystem_SetCameraOscillation");
static_assert(sizeof(GameSettingsSubsystem_SetCameraOscillation) == 0x000002, "Wrong size on GameSettingsSubsystem_SetCameraOscillation");
static_assert(offsetof(GameSettingsSubsystem_SetCameraOscillation, bEnable) == 0x000000, "Member 'GameSettingsSubsystem_SetCameraOscillation::bEnable' has a wrong offset!");
static_assert(offsetof(GameSettingsSubsystem_SetCameraOscillation, ReturnValue) == 0x000001, "Member 'GameSettingsSubsystem_SetCameraOscillation::ReturnValue' has a wrong offset!");

// Function Zion.GameSettingsSubsystem.SetCameraShake
// 0x0008 (0x0008 - 0x0000)
struct GameSettingsSubsystem_SetCameraShake final
{
public:
	float                                         NewCameraShake;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameSettingsSubsystem_SetCameraShake) == 0x000004, "Wrong alignment on GameSettingsSubsystem_SetCameraShake");
